[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "With the development of social network, online marketing has become more popular and developed in an unprecedented scale. Viral marketing propagates influence through 'word-of-mouth' effect. As for development of viral marketing, it is critical to select a set of influential users in the network to propagate influence as much as possible with limited resources. In this paper, we proposed a model called Preference-based Trust Independent Cascade Model. Based on the experimental results, the Preference-based Trust Independent Cascade Model is able to obtain better results than some traditional models. Comparing with other existing methods, such as trust-only approach and random selection approach, the proposed Preference-based Trust Independent Cascade Model considers both user preference and trust connectivity."
          ],
          "paragraphNo": 0,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "n": "1",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "With the development of online social networks and e-marketplace, it is essential to understand how to propagate and maximize influence to users with limited resources, namely, influence maximization (IM) . IM has become a popular topic for researchers in both computer science and business. The solution for IM problem is NP-hard. Hence, some approximation approaches are considered as a replacement. Most of the existing approaches, such as basic diffusion models , only consider about propagation links/channels in IM (called trust connectivity (TC) in this paper). For instance, assuming there are two users following each other on Twitter. In this situation, the two users have TC between each other. By considering TC only, IM will be treated as a simplified probabilistic problem. Furthermore, influence probabilities are predefined and static, which is not suitable for dynamic environments in many real world applications. Meanwhile, in a social network, users' preferences to particular items also play an important role in IM . Unfortunately, this factor was not considered in most of the existing IM approaches.",
               "Motivated by the prosperous development of the viral marketing and in order to cover the aforementioned limitations in existing approaches, in this paper, a Preference-based Trust Independent Cascade (PTIC) Model is proposed. The PTIC Model takes into account not only TC but also user preference (UP). The influence probability in PTIC Model is computed based on UP and TC. So that, hub users in a social network, who are interested in promoted items, can be selected as influential users. Through this way, the effectiveness and efficiency of IM can be greatly improved. Experimental results also demonstrate that the PTIC Model has a better performance compared with some existing classic models.",
               "The reminder of this paper is organized as follows. In Section 2, some related work has been reviewed. Section 3 presents the problem description and formal definitions related to the PTIC Model. In Section 4, the framework of the PTIC Model is described in details. Experiments are presented in Section 5. Finally, the paper is concluded in Section 6."
          ],
          "paragraphNo": 1,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "n": "2",
               "text": "Related Work",
               "type": "relatedwork"
          },
          "paragraphs": [
               "IM is first proposed by Domingos and Richardson as a probabilistic problem. Kempe et al. are the earliest to research IM as a discrete optimization problem . They have demonstrated that the solution for IM problem is NP-hard. Finding the solution for a NP-hard problem is very difficult. Thus, instead of finding the solution for a NP-hard problem, approximation approaches are better replacement with guarantee.",
               "There are two fundamental models for influence diffusion, i.e., the Linear Threshold (LT) Model and the Independent Cascade (IC) Model . Many studies are developed based on these two models. . However, network analysis approaches, such as, community partition, are not involved in the scalable heuristic algorithm. Community partition can improve the efficiency and effectiveness of IM in a further step. As for the degree discount heuristics, it is efficient but it is sensitive when the influence probabilities are small only. In the real world, it is difficult to influence users with a small probability.",
               "UP also plays an important role in IM. However, many existing preference analysis approaches are exploited for recommender systems . By considering UP, users in a social network can be clustered into different community partitions based on their common preferences. Furthermore, hierarchical communities can be identified in a network based on hierarchical clustering (HC), also called hierarchical clustering analysis.",
               "A representative algorithm of HC is the Shrink algorithm . Shrink is an unsupervised clustering algorithm. It takes advantage of the integration of the modularity optimization approaches and the density-based clustering. The remarkable merits of the Shrink algorithm are that it can detect not only clusters, but also the structure of the network, i.e., the hubs and the outliers. Another HC algorithm is a community partition method based on node similarity proposed by Ying el al. . In the algorithm, each node is initialized as a community in the network at the beginning. Then, communities are merged iteratively based on neighbourhood similarity. Ying et al's approach has lower computational complexity and has been applied for many types of networks, indicating that this algorithm is effective and efficient for community detection.",
               "Based on reviews above, the limitations of the existing approaches have been summarized. First of all, some classic diffusion models, i.e., IC Model and LT Model only consider TC, which result in that IM is treated as a simplified probabilistic problem. In addition, the influence probabilities are predefined and static. Secondly, UP plays a critical part in IM, since users with common preferences can easier influence each other. However, this factor was not taken into consideration in most of the existing approaches.",
               "UP and TC are involved in the PTIC Model, and the influence probability is computed based on both of them. Hence, hub users who are interested in the promoted item, will be selected as influential users. In this way, effectiveness and efficiency of IM can be improved significantly."
          ],
          "paragraphNo": 2,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "n": "3.1",
               "text": "Problem Description",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Suppose an organization plans to promote a particular product (i x ) in an online social network. Due to limited resources, the organization needs to select a limited amount of influential users to experience the product and promote the product to the users connected with them. Ideally, the selected users can maximize the influence in the network. The purpose of IM is to select k initial vertices, also called seeds, in the social network. The prospective number of vertices influenced by the selected seeds is regarded as achieved influence."
          ],
          "paragraphNo": 3,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "n": "3.2",
               "text": "Formal Definitions",
               "type": "modelling"
          },
          "paragraphs": [
               "In this paper, we assume that there are m users, n edges, and x items in a social network. Here, a social network is modelled as a graph G = (V, E), where V denotes the set of users, and E denotes the set of edges among the users. There are two types of edges in G, i.e., preference edge and trust edge. They represent UP and TC among users, respectively (refer to Definition 5 and 6).",
               "Definition 1: A user is defined as a vertex v j in the network. Each user has a set of neighbours, i.e.,",
               "has a Trust Edge (refer to Definition 6) with v j .",
               "Beside users, the network also contains a set of items, i.e., I. An item i xI is a particular product which has been or will be promoted to the users in the network. User v j 's preference to item i x is presented as the result of ratings given by v j .",
               "Definition 2: Rating r jx is the preference degree of user v j for item i x . The rating set R j = (r j1 , r j2 , r j3 , ..., r jx ) is the set of all ratings v j once gave.",
               "Definition 3: Common Preference for Item (cpi ijx ) is defined as ratings that any two users in the network gave for item they both rated, where cpi ijx denotes item i x is the common preference for user v i and v j .",
               "In Equation 1, r ix is the rating to item i x given by user v i , and |r ix ? r jx | indicates the rating difference of i x give by user v i and v j . While, r x .max ? r x .min is the gap of i x 's maximum and minimum rating value.",
               "Definition 4: Common Preference Similarity (cps ij ) is defined as the similarity of ratings that users v i and v j in the network gave for all the item(s) they both rated. Users with common preference(s) will be computed for CPS and labelled CPS as weight on preference edges.",
               "Equation 2 shows the CPS calculation between v i and v j . I denotes the item set rated by both v i and v j , I.count indicates the number of items in I.",
               "Definition 5: A Preference Edge pe ij denotes the preference relationship of two users, i.e. v i and v j . Users v i and v j will have a preference edge pe ij when they have cpi ijx . The weight of pe ij can be denoted as w(pe ij ) = cps ij .",
               "Definition 6: A Trust Edge te ij denotes the trust relationship of two users, i.e. v i and v j . The weight of te ij can be represented as w(te ij ) = user distance, which is computed based on n-dimensional coordinate of information (attributes) in user profiles (n is depending on the number of the attributes). The range of user distance is from 0 to 1.",
               "Definition 7: Influence Probability p ij is defined as the likelihood of the occurrence of influence propagation from user v i to user v j . The range of p ij is from 0 to 1. p ij is computed by the product of cps ij and user distance of users v i and v j , where presented as Equation 3.",
               "Definition 8: A community C r , refers to a set of users in any scale that have common preference(s). Users in a community have a compact relationship related to common preference among each other, even for those who are not linked directly. A social network G can be partitioned into a number of communities, i.e.,",
               ".., C r . Here we assume that there are no intersections between communities.",
               "The reason why we conduct community partition is that, assuming there is a community C i and we plan to propagate influence within C i , selecting influential users from community C i to propagate influence is more efficient than selecting influential users from other communities . Each community can not only present the CPS between any two users in the network, but also the relationship related to common preference among a set of users in a community."
          ],
          "paragraphNo": 4,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "n": "4",
               "text": "The Preference-based Trust Independent Cascade (PTIC) Model",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "The framework of the PTIC Model is shown in . There are four modules in the PTIC Model, i.e., the Preference Learning Module (PLM), the Community Partition Module (CPM), the Trust Connectivity Computation Module (TCCM), and the Seed Selection Module (SSM). At the beginning of this model, CPSs (refer to Definition 4) between users will be computed and evaluated by the PLM. The computation of CPS can be regarded as the preparation of the CPM since CPS is the weight labelled on the preference edge. After the computation of CPS, the CPM will be conducted. Users will be partitioned into communities based on CPS. In addition, user distance will be computed based on user profiles as TC in the TCCM. Finally, the SSM will be conducted based on the output of CPM and the TCCM. "
          ],
          "paragraphNo": 5,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "n": "4.1",
               "text": "Preference Learning Module (PLM)",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "In this module, CPS is calculated based on the rating difference(s) of two users, e.g., v i and v j . The smaller the average of their rating difference(s) is, the higher the CPS will be. The cps i j between v i and v j can be calculated by using Equations 1 and 2."
          ],
          "paragraphNo": 6,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "n": "4.2",
               "text": "Community Partition Module (CPM)",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "In CPM, the community partition approach is derived from the community detection algorithm proposed by Ying et al. . All of the users are randomized. Each individual tries to merge with the closest neighbour. This procedure will be conducted iteratively until similarity among the communities (refer to clusters in the algorithms) reaches a certain threshold."
          ],
          "paragraphNo": 7,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "n": "4.3",
               "text": "Trust Connectivity Computation Module (TCCM)",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "The main purpose for computing TC is to ensure users with common preference(s) have influence propagation channel. Otherwise, even though users with common preference(s) are in the same community, if they do not have TC, influence cannot be propagated. TC is computed based on the information (attributes) in user profiles. Quantify the information when it is necessary and put all of them in n-dimensional coordinate (n is depending on the number of the attributes) to compute user distance as TC using Equation 4.",
               "In Equation 4, w(te ij ) indicates the weight on the TC between user v i and v j , and v i .a m ? v j .a m denotes the attribute a m distance between user v i and v j , where a m is an element of the attribute set A."
          ],
          "paragraphNo": 8,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "n": "4.4",
               "text": "Seed Selection Module (SSM)",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "With the involvement of community partition and TC computation, users have not only common preferences, but also TC in the network. Influence probability p ij is calculated based on the product of UP and TC between users v i and v j . After the computation of influence probability p ij , seed selection is conducted and hub users who are interested in the promoted item will be selected as influential users (seed set). Seeds are selected based on heuristic methods in this paper. Assuming p number of seeds is going to be selected based on budget, the ones with high influence spread will be selected. if p aiIP Ppropagation threshold then 8:"
          ],
          "paragraphNo": 9,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "text": "Algorithm 4 Influence Propagation Algorithm using IC Model",
               "type": "modelling"
          },
          "paragraphs": [
               "Generate a random decimal dr, 0d1 9:",
               "if drp aiIP P then 10:",
               "v i .activeStatus = true 11:",
               "Update IP P , input v i as variable and invoke self -Recursive 12:",
               "end if 13:",
               "end if 14: end for Algorithm 4 aims to calculate the activated users influenced by the seed set in the network by using the IC model. The input is the seed set {v a }, while the output is a set of activated users V a in the entire network. p ai denotes the influence probability between two users v i and v a (refer to Definition 7). In each iteration in Algorithm 4 ( , find the user v a 's neighbour set V n , v iV n , if v i is inactive and its Influence Propagation Probability (IPP) is larger than the threshold, then v i is activated and the neighbours(v i ) are influenced with the IP P , IP P = IP Pp ix (x(v i )). The algorithm is recursive, and it invokes itself inside the method (Line 11).",
               "For example, if v a is an element of seed set, then v a s IP P = 1, the IP P of v a s neighbour v i is 1p ai , while the IP P of v i s neighbour v j is 1p aip ij . Hence IP P keeps reducing with the increment of hops of influence propagation."
          ],
          "paragraphNo": 10,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "n": "5",
               "text": "Experiment and Analysis",
               "type": "experiment"
          },
          "paragraphs": [
               "In this paper, two experiments have been conducted to compare the performance of the PTIC model with another two approaches, i.e., the random approach and the trust-only approach. In the random approach, the seeds are randomly selected from users. In the trust-only approach, seed selection is based on weight of TC only.",
               "We estimated the total number of activated users influenced by the seed set that is generated by trust-only approach and random approach. If a user is selected into seed set, the user will intend to influence and activate the neighbours in a network. The activation probability undertaken by the neighbours is determined by the weight of the influence propagation channel.",
               "In Experiment 1, the weight of influence propagation channel is determined by both UP and TC. Whereas, in Experiment 2, only TC is considered in influence propagation."
          ],
          "paragraphNo": 11,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "text": "Movielens",
               "type": "experiment"
          },
          "paragraphs": [
               "1 dataset was used in the experiments, which is a stable benchmark dataset released on April of 1998. It contains the movie ratings of 1682 movies from 943 users. To filter noise data, users whose number of ratings are less than 50 have been removed from the dataset. Furthermore, users with ambiguous or false attributes are also eliminated from the experiments. After the data preprocessing, 441 users had been selected from the dataset."
          ],
          "paragraphNo": 12,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "n": "5.2",
               "text": "Experimental Results",
               "type": "experiment"
          },
          "paragraphs": [
               "In both Figures 2 and 3, x-axis denotes the size of seed set, i.e., the number of selected influential users, while y-axis refers to the number of activated users in the entire network. shows the performance of three approaches in Experiment 1. There are 441 users, but only approximate 280 users are capable of activating the neighbours (the remaining users can only activate themselves). In order to ensure the accuracy of the individual's influential spread, we conduct the trials for 100 times and compute the average of it. As for the seed set with multiple elements, the same method has been utilised. The seed set increases by retaining the selected users and adding new users.",
               "In , it can be seen that the PTIC model performs better than the other two approaches. By considering the cost performance, the appropriate size of the seed set is 10, the elbow point in the PTIC model. In addition, the number of activated users in the network reached 272, which is significantly better than the other two approaches. presents the performance of three approaches in Experiment 2. It can be observed from the figure that the trust-only approach has the best performance. However, the PTIC Model still performs very well, and much better than the random approach. When the size of seed set is small (range from 4 to 6), the seeds selected via the trust-only approach are capable of activating approximate 300 users, while 250 users are activated in the PTIC Model. Furthermore, the amount of activated users of the PTIC Model is very close to the trust-only approach after the seed size reached 10."
          ],
          "paragraphNo": 13,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "text": "Fig. 3 Models Comparison by Considering Trust Only",
               "type": "modelling"
          },
          "paragraphs": [
               "Based on the above discussion, we could claim that when the resources are limited, the PTIC Model has a better performance."
          ],
          "paragraphNo": 14,
          "fromPaper": "Preference Aware Influence Maximization"
     },
     {
          "head": {
               "n": "6",
               "text": "Conclusion and Future Work",
               "type": "conclusion"
          },
          "paragraphs": [
               "In this research, we intend to achieve IM on the foundation of UP and TC. In addition, compared with previous researches, we computed influence probability based on UP and TC rather than predefine it, which can improve the quality of seed selection. Based on the implementation of experiments, the results also present that the PTIC Model has a better performance. Hence, the PTIC model is able to propagate influence as much as possible based on UP and TC within limited resources efficiently. We implemented the PTIC Model based on IC Model. In the future, we are going to implement this model in other diffusion models, such as, LT Model . In addition, we will consider trust relationship between users as directed."
          ],
          "paragraphNo": 15,
          "fromPaper": "Preference Aware Influence Maximization"
     }
]