[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "The question is not whether intelligent machines can have any emotions, but whether machines can be intelligent without any emotions.-Marvin Minsky (1927-2016) E motions play an important role in successful and effective human-human communication. In fact, in many situations, emotional intelligence is more important than IQ for successful interaction. 1 There is also signifi cant evidence that rational learning in humans is dependent on emotions. 2 Affective computing and sentiment analysis, hence, are key for the advancement of AI 3 and all the research fi elds that stem from it. Moreover, they fi nd applications in various scenarios and companies, large and small, that include the analysis of emotions and sentiments as part of their mission. Sentiment-mining techniques can be exploited for the creation and automated upkeep of review and opinion aggregation websites, in which opinionated text and videos are continuously gathered from the Web and not restricted to just product reviews, but also to wider topics such as political issues and brand perception. Affective computing and sentiment analysis also have great potential as a subcomponent technology for other systems. They can enhance the capabilities of customer relationship management and recommendation systems-for example, to reveal which features customers enjoy or to exclude from the recommendations items that received negative feedback. Similarly, they can be exploited for af-fective tutoring and affective entertainment or for troll fi ltering and spam detection in online social communication. Business intelligence is also a main factor behind corporate interest in the fi elds of affective computing and sentiment analysis. Nowadays, companies invest an increasing amount of money in marketing strategies and are constantly interested in both collecting and predicting the attitudes of the general public toward their products and brands. The design of automatic tools capable of mining sentiments over the Web in real time and creating condensed versions of these represents one of the most active research and development areas. The development of such systems, moreover, is not only important for commercial purposes but also for government intelligence applications able to monitor increases in hostile communications or model cyber-issue diffusion."
          ],
          "paper_id": "dd503ee0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 0,
          "fromPaper": "AFFECTIVE COMPUTING AND SENTIMENT ANALYSIS Affective Computing and Sentiment Analysis"
     },
     {
          "head": {
               "text": "Common Tasks",
               "type": "abstract"
          },
          "paragraphs": [
               "The Web is evolving toward an era where communities will defi ne future products and services. In this context, public opinion is destined to gain Era of social relationships increasing prominence, and so are affective computing and sentiment analysis (see .",
               "The basic tasks of affective computing and sentiment analysis are emotion recognition 2,5-8 and polarity detection. Although the former focuses on extracting a set of emotion labels, the latter is usually a binary classification task with outputs such as \"positive\" versus \"negative,\" \"thumbs up\" versus \"thumbs down,\" or \"like\" versus \"dislike.\" These two tasks are highly interrelated and interdependent to the extent that some sentiment categorization models, such as the Hourglass of Emotions, 13 treat them as a unique task by inferring the polarity associated to a sentence directly from the emotions this conveys. In many cases, in fact, emotion recognition is considered a subtask of polarity detection.",
               "Polarity classification itself can also be viewed as a subtask of more advanced analyses. For example, it can be applied to identifying pro and con expressions that can be used in individual reviews to evaluate the pros and cons that influenced the judgements of a product and that make such judgements more trustworthy. Another instance of binary sentiment classification is agreement detection, that is, given a pair of affective inputs, deciding whether they should receive the same or differing sentiment-related labels.",
               "Complementary to binary sentiment classification is the assignment of degrees of positivity to the detected polarity or valence to the inferred emotions. If we waive the assumption that the input under examination is opinionated and is about a single issue or item, challenging new tasks arise, such as subjectivity detection and opinion target identification. The capability of distinguishing whether an input is subjective or objective, in particular, can be highly beneficial for a more effective sentiment classification. Moreover, a record can have a polarity without necessarily containing an opinion-for example, a news article can be classified into good or bad news without being subjective. Typically, affective computing and sentiment analysis are performed over on-topic documents (for example, on the result of a topic-based search engine). However, several studies suggested that managing these tasks jointly can be beneficial for overall performance. For example, off-topic passages of a document could contain irrelevant affective information and misleading results for the global sentiment polarity about the main topic. Also, a document can contain material on multiple topics that might interest the user. In this case, it is therefore necessary to identify the topics and separate the opinions associated with each of them.",
               "Another important task of affective computing and sentiment analysis is multimodal fusion. With increasing amounts of webcams installed in end-user devices such as smart phones, touchpads, or netbooks, an increasing amount of affective information is being posted to social online services in an audio or audiovisual format rather than a purely textual basis. For a rough impression on the extent, consider that, on average, two days of video material are uploaded to YouTube per minute. Besides speech-to-text recognition, this allows for additional exploitation of acoustic information, facial expression and body movement analysis, or even the \"mood\" of the background music or color filters.",
               "Multimodal fusion means to integrate all single modalities into a combined single representation. Two types of fusion techniques-feature level and decision level-have been used to improve reliability in emotion recognition from multimodal information. Stephan Raaijmakers and colleagues fused acoustic and linguistic information, but linguistic information is based on the transcript of the spoken content rather than on automatic speech recognition output. Louis-Philippe Morency and colleagues combined acoustic, textual, and video features to assess opinion polarity in 47 YouTube videos. They demonstrated a significant improvement in a leave-one-video-out evaluation using hidden Markov models for classification. They identified polarized words, smile, gaze, pauses, and voice pitch as relevant features. However, they based the textual analysis only on the manual transcript of spoken words.",
               "Soujanya Poria and colleagues proposed a novel methodology for multimodal sentiment analysis that comprises harvesting sentiments from Web videos by demonstrating a model that uses audio, visual, and textual modalities as sources of information. They used both feature-and decision-level fusion methods to merge affective information extracted from multiple modalities, achieving an accuracy of nearly 80 percent."
          ],
          "paper_id": "dd503ee0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 1,
          "fromPaper": "AFFECTIVE COMPUTING AND SENTIMENT ANALYSIS Affective Computing and Sentiment Analysis"
     },
     {
          "head": {
               "text": "General Categorization",
               "type": "abstract"
          },
          "paragraphs": [
               "Existing approaches to affective computing and sentiment analysis fall into three main categories: knowledgebased techniques, statistical methods, and hybrid approaches.",
               "Knowledge-based techniques are popular because of their accessibility and economy. Text is classified into affect categories on the basis of the presence of fairly unambiguous affect words, such as \"happy,\" \"sad,\" \"afraid,\" and \"bored.\" Popular sources of affect words or multiword expressions include the Affective Lexicon, linguistic annotation scheme, WordNet-Affect, SentiWordNet, SenticNet, and other probabilistic knowledge bases trained from linguistic corpora. The major weakness of knowledgebased approaches is poor recognition of affect when linguistic rules are involved. For example, although a knowledge base can correctly classify the sentence \"Today was a happy day\" as being happy, it is likely to fail on a sentence like \"Today wasn't a happy day at all.\" To this end, more sophisticated knowledge-based approaches exploit linguistics rules to distinguish how each specific knowledge base entry is used in text. The validity of knowledge-based approaches, moreover, depends heavily on the depth and breadth of the employed resources. Without a comprehensive knowledge base that encompasses human knowledge, in fact, it is not easy for a sentiment-mining system to grasp the semantics associated with natural language or human behavior.",
               "Another limitation of knowledgebased approaches lies in the typicality of their knowledge representation, which is usually strictly defined and does not allow handling different concept nuances, because the inference of semantic and affective features associated with concepts is bounded by the fixed, flat representation.",
               "Statistical methods, such as support vector machines and deep learning, have been popular for affect classification of texts, and researchers have used them on projects such as a movie review classifier 28 and many others. By feeding a machine learning algorithm a large training corpus of affectively annotated texts, it is possible for the system to not only learn the affective valence of affect keywords (as in the keyword-spotting approach) but also to consider the valence of other arbitrary keywords (like lexical affinity) and word co-occurrence frequencies.",
               "However, statistical methods are generally semantically weak-that is, lexical or co-occurrence elements in a statistical model have little predictive value individually. As a result, statistical text classifiers work with acceptable accuracy only when given a sufficiently large text input. So, although these methods might be able to affectively classify a user's text on the page or paragraph level, they do not work well on smaller text units such as sentences or clauses.",
               "Hybrid approaches to affective computing and sentiment analysis, finally, exploit both knowledge-based Sentence techniques and statistical methods to perform tasks such as emotion recognition and polarity detection from text or multimodal data. Sentic computing, for example, exploits an ensemble of knowledge-driven linguistic patterns and statistical methods to infer polarity from text (see . Yunqing Xia and colleagues used SenticNet and a Bayesian model for contextual concept polarity disambiguation. Mauro Dragoni and colleagues proposed a fuzzy framework that merges WordNet, ConceptNet, and SenticNet to extract key concepts from a sentence. iFeel is a system that lets users create their own sentiment analysis framework by combing SenticNet, Senti WordNet, and other sentiment analysis methods. Jose Chenlo and David Losada used SenticNet to extract bag-of-concepts and polarity features for subjectivity detection and other sentiment analysis tasks. 37 Jay Kuan-Chieh Chung and colleagues used SenticNet concepts as seeds and proposed a method of random walk in ConceptNet to retrieve more concepts along with polarity scores. Other works have proposed the joint use of knowledge bases and machine learning for Twitter sentiment analysis, short text message classification,  The passage from a read-only to a read-write Web made users more enthusiastic about sharing their emotions and opinions through social networks, online communities, blogs, wikis, and other online collaborative media. In recent years, this collective intelligence has spread to many different areas of the Web, in particular to fields related to everyday life, such as commerce, tourism, education, and health.",
               "Despite significant progress, affective computing and sentiment analysis are still finding their own voice as new interdisciplinary fields. Engineers and computer scientists use machine learning techniques for automatic affect classification from video, voice, text, and physiology. Psychologists use their long tradition of emotion research with their own discourse, models, and methods. Affective computing and sentiment analysis are research fields that are inextricably bound to affective sciences that attempt to understand human emotions. Simply put, the development of affect-sensitive systems cannot be divorced from the century-long psychological research on emotion.",
               "Hybrid approaches aim to better grasp the conceptual rules that govern sentiment and the clues that can convey these concepts from realization to verbalization in the human mind. In recent years, such approaches are gradually setting affective computing and sentiment analysis as interdisciplinary fields between mere natural language processing and natural language understanding by gradually shifting from syntax-based techniques to more and more semanticsaware frameworks, 42 which consider both conceptual knowledge and sentence structure (see . So far, sentiment-mining approaches from text or speech have been based mainly on the bag-ofwords model because, at first glance, the most basic unit of linguistic structure appears to be the word. Singleword expressions, however, are just a subset of concepts, multiword expressions that carry specific semantics, and sentics (that is, the denotative and connotative information commonly associated with objects, actions, events, and people). Sentics, in particular, specifies the affective information associated with real-world entities, which is key for emotion recognition and polarity detection, the basic tasks of affective computing and sentiment analysis.",
               "The best way forward for these two fields, hence, is the ensemble application of semantic knowledge and machine learning, in which different approaches can cover for each other's flaws. In particular, the combined application of linguistics and knowledge bases will allow sentiments to flow from concept to concept on the basis of the input sentence's dependency relations, while machine learning acts as backup for missing concepts and unknown linguistic patterns. Next-generationsentiment-mining systems need broader and deeper common and commonsense knowledge bases, together with more braininspired and psychologically motivated reasoning methods, to better understand natural language opinions and, hence, more efficiently bridge the gap between (unstructured) multimodal information and (structured) machine-processable data. Looking ahead, blending scientific theories of emotion with the practical engineering goals of analyzing sentiments in natural language and human behavior will pave the way for the development of more bioinspired approaches to the design of intelligent sentiment-mining systems that can handle semantic knowledge, make analogies, learn new affective knowledge, and detect, perceive, and \"feel\" emotions."
          ],
          "paper_id": "dd503ee0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 2,
          "fromPaper": "AFFECTIVE COMPUTING AND SENTIMENT ANALYSIS Affective Computing and Sentiment Analysis"
     },
     {
          "head": {
               "n": "10.",
               "text": "B. Liu, Sentiment Analysis and Opinion",
               "type": "abstract"
          },
          "paragraphs": [
               "Mining, Morgan and Claypool, 2012. 11. T. Wilson, J. Wiebe, and P. Hoffmann, \"Recognizing Contextual Polarity in Phrase-Level Sentiment Analysis,\" Proc."
          ],
          "paper_id": "dd503ee0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 3,
          "fromPaper": "AFFECTIVE COMPUTING AND SENTIMENT ANALYSIS Affective Computing and Sentiment Analysis"
     }
]