[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "One of the most important opinion mining research directions falls in the extraction of polarities referring to specific entities (aspects) contained in the analyzed texts. The detection of such aspects may be very critical especially when documents come from unknown domains. Indeed, while in some contexts it is possible to train domain-specific models for improving the effectiveness of aspects extraction algorithms, in others the most suitable solution is to apply un-supervised techniques by making such algorithms domain-independent and more efficient in a real-time environment. Moreover, an emerging need is to exploit the results of aspect-based analysis for triggering actions based on these data. This led to the necessity of providing solutions supporting both an effective analysis of user-generated content and an efficient and intuitive way of visualizing collected data. In this work, we implemented an opinion monitoring service implementing (i) a set of unsupervised strategies for aspect-based opinion mining together with (ii) a monitoring tool supporting users in visualizing analyzed data. The aspect extraction strategies are based on the use of an open information extraction strategy. The effectiveness of the platform has been tested on benchmarks provided by the SemEval campaign and have been compared with the results obtained by domain-adapted techniques."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 0,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Online services like booking platforms, shops, and social media are becoming widely used by an increasing percentage of population. Each user of the Internet can express own opinions regarding products, services, or even other people thoughts. Opinions expressed by masses can lead other consumers to different choices, give direct feedback to the producers, or underline problematics of a service. For all these reasons, in the last few years, a lot of effort has been invested in understanding and extracting valuable data from user's reviews.",
               "Opinion Mining and Sentiment Analysis are Natural Language Processing (NLP) tasks that aims to extract opinions from texts and to classify them with a value representing the overall polarity (positive, negative, or neutral) associated with a given subject ). This research field attracted a lot of interest due to the possibility of applying developed strategies to a wide set of applications in different domains like marketing, politics, and social sciences. In the beginning, built applications aimed to compute overall polarity values then associated with a document. By using this strategy was not possible to distinguish which were the subject of each opinion and how such a subject was judged by users. This issue led to focus on the extraction of all subjects, namely aspects, from texts in order to equip developed systems with the possibility of computing aspects' polarities independently .",
               "Let us consider the following example: Last weekend, I tried a new restaurant in downtown. The place was awesome, but the quality of the food was quite poor.",
               "The proposed example contains three aspects, restaurant, place, and food, and each aspect is associated with a specific opinion:",
               "? placeawesome ? foodquite poor ? restaurantno opinions. In this case, the polarity can be computed by averaging the polarities associated with the other aspects contained in the document.",
               "For obtaining the opinion-based structure of the sentence, it is necessary to address two tasks: (i) the detection of the aspects, and (ii) the computation of the associated polarities. While the latter is easily supported by using opinion-based dictionaries (Section 3), the former requires different strategies. Many approaches presented in the literature, and discussed in Section 2, proposed supervised models for extracting aspects from text. Unfortunately, the use of a supervised approach clashes with real-world requirements. Firstly, the creation of a model requires annotated datasets containing aspects annotations for all possible domains. Nowadays, these datasets are not available except for a limited number of domains. Secondly, a document can have sentences belonging to many of these domains. Hence, the use of a single model is not feasible.",
               "In light of these challenges, the development of approaches able to provide effective aspect extraction, polarity computation, and data visualization procedures is of interest for contexts where it is necessary to provide dashboards showing a real-time summary of opinion-based data-streams containing documents belonging to domains unknown a-priori. The use of an open information extraction strategy can be suitable for a real-time scenario. Indeed, here the system has to extract and to analyze information coming from all possible domains in an efficient way.",
               "This work focuses on the creation of an opinion-based support system built upon the following three pillars.",
               "? the design and the development of an open information extraction approach for supporting the detection of aspects within texts;",
               "? the design and the development of a scalable platform able to process a high volume of opinion-based documents in real-time;",
               "and,",
               "? the development of a data visualization interface supporting an easy access to the processed data.",
               "The innovative aspect of this solution focuses on the combination of these three pillars in order to position this work as a state of the art platform for the real-time management of complex opinion-based documents.",
               "One of the aim of the proposed system is to support different kind of users (managers, buyers, customers, etc.) with a multi-facet analysis of products' features. Indeed, the main issue when a product is judged with a single metric (e.g. overall document polarity) is that it does not allow users to obtain results tailored to their specific needs. For example, customers of an online shop could be interested in the battery life of a laptop rather than its overall quality. Currently, they do not have the possibility of obtaining this kind of information directly from the reviews, if users do not have the possibility of rating the specific battery life aspect.",
               "The paper is structured as follows. In Section 2, we provide an overview of the opinion mining field with a focus on aspects extraction approaches. Section 3 introduces the background knowledge bases integrated into the proposed platform. Section 4 provides an overview of platform's components, while in Sections 5 and 6 we describe the strategy used for extracting aspects and the client application we developed for supporting users in monitoring the real-time data stream, respectively. Section 7 discusses the overall performance of our platform. Section 8 concludes the paper."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 1,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "2.",
               "text": "Related work",
               "type": "relatedwork"
          },
          "paragraphs": [
               "In this Section, we briefly review the main contributions in the field of sentiment analysis and opinion mining, firstly from a general standpoint and then with a particular attention to the social media scenario. A brief overview of significant recent contributions in the open information extraction field is also provided."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 2,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "2.1.",
               "text": "Sentiment analysis and opinion mining",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The topic of sentiment analysis has extensively been studied in the literature , where several techniques have been proposed and validated.",
               "Machine learning techniques are the most common approaches used for addressing the sentiment analysis problem. For instance, in and the authors compared the performance of Naive-Bayes, Maximum Entropy, and Support Vector Machines classifiers in sentiment analysis, using different features like considering only unigrams, bigrams, combination of both, incorporating parts of speech and position information, or considering only adjectives.",
               "The recent massive growth of online product reviews paved the way for using sentiment analysis techniques in marketing activities. The issue of detecting the different opinions concerning the same product expressed in the same review emerged as a challenging problem. This task has been carried out by identifying the aspect of the product that a sentence in the opinion may refer to. In the literature, many approaches have been proposed: conditional random fields (CRF) , hidden Markov models (HMM) , sequential rule mining (Liu, ), dependency tree kernels , and clustering ( .",
               "Recently, the application of sentiment analysis approaches attracted a lot of interest also in the social networks research field . The use of social networks for expressing opinions and comments about products, political or social events, significantly increased in the last years. However, the analysis of the social network environment brought to light new challenges mainly related to (i) the different ways people express their opinions (i.e. multi-modality) and to (ii) the management of noisy data contained in social network texts .",
               "The social dimension of the Web fostered the development of multi-disciplinary approaches combining computer and social sciences to improve the interpretation, recognition, and processing of opinions and sentiments expressed in social networks. The synergy between these approaches has been called sentic computing . Sentic computing has been employed for addressing several cognitive-inspired problems like the classification of natural language text and the extraction of emotions from images .",
               "Real-world solutions have been also developed. For example the authors of SENTILO ) presented a semantic-based solution for extracting opinion frames from texts.",
               "Different level of granularities have been considered: while some approaches operate at document level ), other focus their goal on opinion classification by the means of a fine-grained analysis of the text at sentence level ). Other approaches propose the use of fuzzy logic ) or other aggregation techniques (da Costa Pereira, to compute the score of each single word. In the case of sentence-level opinion classification, two different sub-tasks have to be addressed. The first one, called subjectivity classification, consists in detecting if the sentence is subjective or objective, while the second one focuses on determining if the expressed opinion is positive, negative, or neutral. Subjectivity classification rose great interest in the community ( ). Systems implementing the capabilities of identifying opinion's holder, target, and polarity have been discussed .",
               "Recent work on text modality used Convolutional Neural Network (CNN) for sentiment related tasks such as sarcasm detection ) and aspect-based opinion mining . Several deep learning based approaches have been evaluated in Sentiment Analysis tasks. In , Recursive Neural Networks are used to handle the syntactic tree structure of a sentence: following the generated parse tree, the different distributed representations of sentence parts are recursively built. The model is trained on the Stanford Sentiment Treebank, which has annotations on the whole parse tree. Authors of Chen, Xu, He, Xia, and Wang (2016) learn a distributed representation of reviews through Convolutional Neural Networks which are subsequently feed into Recurrent Neural Networks to learn distributed representation of the viewed products and of the opinion holders. In Poria et al. (2016a) a 7-layer deep Convolutional Neural Network has been trained to identify the target of an opinion within a text fragment, in conjunction with some linguistic patterns. An Extreme Learning Machine approach implemented over the data analytics framework Apache Spark 1 has been proposed in . The approach deals with large amount of natural language text coming from the Social Web."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 3,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "2.2.",
               "text": "Opinion mining in social media",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The application of opinion mining approaches in social media became attractive by opening up new challenges due to the different ways people express their opinions . People use social networks to express their moods and opinion about recently purchased items or new products available on the marketplaces.",
               "One of the first studies on opinion mining on micro-blogging websites has been discussed in , where the authors presented a distant supervision-based approach for opinion classification on Twitter. In Thelwall, Buckley, Paltoglou, Cai, and Kappas (2010) the authors presented SentiStrength. The described algorithm focuses on the detection of emotion strength in a social context. SentiStrength implements a machine learning approach aiming to optimize opinion words weightings used for inferring the polarity of each message. Moreover, the approach implements a spelling correction method used to address the misspelling issue which often occurs on user-generated content.",
               "However, the research in social media analytics has only recently started to employ aspect-based sentiment analysis in the process of attracting users. In particular, aspects extracted from opinions are exploited to attract users to follow the links related to products which have been judged interesting by users communities. A first attempt to exploit extracted aspects for better orienting advertisements content is discussed in . While in , the authors focused on tips instead of reviews. Their objective was recommending the right tips to the right people via the Foursquare platform, by taking into consideration the timeliness of user-provided tips and the users' tastes and social connections.",
               "The increasing number of online product reviews enhanced the development of new opinion mining techniques due to their value in marketing activities. The detection of opinions regarding a specific product emerged as a real challenge. In this context, aspect extraction approaches achieved interesting results. The aspect extraction literature is divided into two distinct paths: supervised and unsupervised methodologies. The first one requires manually annotated data and it is mainly based on Conditional Random Fields , while the latter is focused on topic modeling and dependency relations ). Other approaches propose hidden Markov models (HMM) , sequential rule mining ( ), dependency tree kernels ( ), clustering ( , and genetic algorithms . With respect to these works, our approach relies on a scalable and unsupervised technique for detecting domain-specific aspects from opinion documents. This way, we are able to cope the challenge of deploying a light system into real-world general purpose scenarios.",
               "In this paper, we bridge the aspect-based opinion mining and the user engagement areas by providing a smart way to exploit the knowledge extracted from user reviews. This work has been implemented and validated in a specific context. However, the approach described in Section 5 can be easily deployed in different scenarios."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 4,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "2.3.",
               "text": "Open information extraction",
               "type": "relatedwork"
          },
          "paragraphs": [
               "In the past years, a lot of research has been dedicated to constantly improve the performance of Open Information Extraction (OpenIE) systems. In the beginning, shallow syntactical features such as part-of-speech tags were employed: TextRunner So far, the majority of the research focused on the English language, but other languages such as Spanish ), Chinese (Wang, , and German recently attract interest from the research community. The word presented in showed that OpenIE based on dependency trees is suitable for various languages besides English. They used a multilingual parser with a common output tag-set for the supported languages (English and Romance).",
               "The multilingual OpenIE system ArgOE ( tries to be more open for different dependency parsers by using the CoNLL-X format. It manages to extract tuples in several languages with the same rule set, relying on a dependency parser that uses a common tag-set for five European languages. In Zhila and Gelbukh (2014) the Spanish system ExtrHech has been described. It works with part-of-speech-tagged input and semantic constraints, demonstrating that this approach achieves similar results for Spanish and English as well.",
               "SCOERE is an OpenIE system for the Chinese language. It uses a semi-supervised approach and focused on a fixed set of entities, namely person, organization, location and time. introduced PropDE, an OpenIE system for the German language. The PropDE system transfers the available set of extraction rules (PropS ) from English to German."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 5,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "3.",
               "text": "Material",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Before presenting the system architecture and the approach designed for the specific aspect extraction task, we introduce here the resources we used for supporting the whole text analysis activity. We exploited four different resources: a stopwords list, 2 sentiment lexicons, a linguistic knowledge base, and a general-purpose natural language processing library."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 6,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "Sentiment lexicons",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Sentiment Lexicons are used for associating each term with a polarity value. Terms having such an association are called opinion words and they are used for estimating the polarity of a given sentence. Associating a polarity value to a specific word is a task that has been addressed by different perspectives. The results have been the availability of different resources that can be easily integrated within real-world systems. In our platform, we decided to aggregate polarity values coming from three resources freely available: SenticNet , the General Inquirer vocabulary 3 , and the MPQA dictionary 4 .",
               "SenticNet is a publicly available resource for opinion mining that exploits both artificial intelligence and semantic Web techniques to infer the polarities associated with common-sense concepts and to represent them in a semantic-aware format. The development of SenticNet was inspired by SentiWordNet (Baccianella, ), a lexical resource in which each WordNet synset is associated to three numerical scores describing how objective, positive, and negative the terms contained in each synset are. The differences between SenticNet and SentiWordNet are basically three: (i) in SentiWordNet, each synset is associated to a three-valued representation (the objectivity of the synset, its positiveness, and its negativeness), while in SenticNet there is only one value belonging to the ? [ 1, 1] interval for representing the polarity of the concept; (ii) SenticNet provides the sentiment model of more complex common-sense concepts, while SentiWordNet is focused on assigning polarities to WordNet synsets: for instance, in SenticNet, complex concepts like make good impression, look attractive, show appreciation , being fired, leave behind, or lose control are used for defining positive or negative situations; and (iii) completely neutral concepts are not reported. SenticNet contains almost 40,000 polarity concepts and it may be connected with any kind of opinion mining application. For example, after the de-construction of the text into concepts through a semantic parser, SenticNet can be used to associate polarity values to these and, hence, to infer the overall polarity of a clause, sentence, paragraph, or document by averaging such values.",
               "The General Inquirer is an English-language dictionary containing almost 12,000 elements associated with their polarities in different contexts. Such dictionary is the result of the integration between the Harvard and the Lasswell general-purpose dictionaries as well as a dictionary of categories defined by the dictionary creators. When necessary, for ambiguous words, specific polarity for each sense is specified. For every word, a set of tags is provided in the dictionary. Only a subset of them are relevant to the opinion mining topic and, thus, exploited in this work:",
               "? Valence categories: the two well-known positive and negative classifications.",
               "? Semantic dimensions: these tags reflect semantic differential findings regarding basic language universals. These dimensions are:",
               "hostile, strong, power, weak, submit, active, and passive. A word may be tagged with more than one dimension, if appropriate.",
               "? Words of pleasure: these tags are usually also classified positive or negative, with virtue indicating strength and vice indicating weakness. They provide more focus than the categories in the previous two bullets. Such categories are pleasure, pain, feel, arousal, emotion, virtue, vice.",
               "? Words reflecting presence or lack of emotional expressiveness: these tags indicate the presence of overstatement and understatement; trivially, such tags are overstated and understated.",
               "Other categories indicating ascriptive social tags rather than references to places have been considered out of the scope of the opinion mining topic and have not been considered in the implementation of the approach.",
               "Finally, MPQA is a sentiment lexicon built for Multi-Perspective Question Answering purposes. The lexicon contains around 8,222 terms annotated with their polarity (positive, negative, and neutral) and with their intensity level (strong and weak) and a set of 10,000 sentences manually annotated through the proposed annotation scheme. Indeed, besides the classic association ?word, polarity?, the MPQA lexicon implements a detailed annotation scheme that identifies key components and properties of opinions, emotions, sentiments, speculations, evaluations, and private states . This annotation scheme covers a broad and useful subset of the range of linguistic expressions and phenomena employed in naturally occurring text to express opinion and emotion. The proposed annotation scheme is relatively fine-grained, annotating text at the word-and phraselevel rather than at the level of the document or sentence. For every expression of a private state in each sentence, a private state frame is defined. A private state frame includes the source of the private state (i.e., that whose private state is being expressed), the target (i.e., what the private state is about), and various properties involving intensity, significance, and type of attitude. An important property of sources in the annotation scheme is that they are nested, reflecting the fact that private states and speech events are often embedded in one another. The representation scheme also includes frames representing material that is attributed to a source, but is presented objectively, without evaluation, speculation, or other type of private state by that source.",
               "The lists of terms contained in the resources presented above do not overlap completely. The strategy implemented within our platform considers words with a non-zero polarity value in at least one of the integrated resources. For example, the word third is not present neither in MPQA nor in SenticNet and has a polarity of 0 according to the General Inquirer. Consequently, it is not a valid opinion word. On the other hand, the word huge has a positive value of 0.069 in SenticNet, a negative value of ? 1 in MPQA and a value of 0 in the General Inquirer, therefore, it is evaluated as opinion word even if lexicons express contrasting values. SenticNet already implements a continuous representation of polarity values. MPQA uses a discrete scale ? [ 1, 0, 1] that has been extended to ? ? [ 1, 0.5, 0, 0.5, 1] by halving ? 1 and 1 when the weak intensity level is present. For the General Inquirer the same strategy adopted for the MPQA lexicon has been adopted by exploiting the semantic dimension of the dictionary for halving the ? 1 and 1 values. Finally, the three values are aggregated by using the arithmetic average."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 7,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "3.2.",
               "text": "WordNet",
               "type": "relatedwork"
          },
          "paragraphs": [
               "WordNet ) is a large lexical database of English nouns, verbs, adjectives, and adverbs grouped into sets of cognitive synonyms called synsets, where each synset expresses a distinct concept. In particular, each synset represents a list of synonyms, intended as words that denote the same concept and that are interchangeable in many contexts. WordNet contains around 117,000 synsets linked to each other by a small set of conceptual relations, i.e., synonymy, hypernymy, hyponymy, etc.. Additionally, a synset contains a brief definition (gloss) and, in most cases, one or more short sentences illustrating the use of the synset members. Words having several distinct meanings are represented in as many distinct synsets. Even if WordNet superficially resembles a thesaurus, there are some important distinctions with respect to it. Firstly, WordNet does not define links between words, but between specific senses of words; this way, words that are found in close proximity to one another in the network are semantically disambiguated. Secondly, WordNet labels the semantic relations among words, whereas the groupings of words in a thesaurus does not follow any explicit pattern other than the similarity of their meanings. In the implemented system, Wordnet's compound names list has been used to detect word sequences that represent a single noun. . Overview of the implemented platform."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 8,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "3.3.",
               "text": "Stanford Core NLP",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The preliminary textual analysis, consisting in converting the raw input text in an annotated and structured representation, is performed through the Stanford Core Natural Language Processing Library ( ). Stanford CoreNLP is an integrated framework providing a wide range of natural language analysis tools. Each functionality is provided by a specific module. Below, we show the four modules of the CoreNLP library adopted within our system.",
               "The Pos Tagger (Part Of Speech Tagger) is a software module aiming to assign a part of speech tag (such as noun, verb, adjective, etc.) to every word of a given sentence . The Coref Annotator (Co-reference resolution Annotator) generates co-reference Chain Annotations representing groups of words referring to the same entity . Chains are used to resolve pronoun references. The Parse Annotator (Parser Annotator) ) provides full syntactic analysis generating a tree grammar dependencies structure. Finally, the Depparse Annotator (Dependency Parser Annotator) ) provides a representation of grammatical relations between words in a sentence producing graphs like the one shown in ."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 9,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "4.",
               "text": "System architecture",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The system presented in this work implements a set of modules for supporting the gathering, the processing, and the analysis of opinion-based document stream. In particular, we focused on the Amazon website. shows an abstract overview of these modules. Reviews collected in real-time from the Amazon website are given as input to the Data Manager Module that is responsible of parsing raw documents and of enriching them with further metadata. Processed data are saved into a knowledge repository in order to make them available to a Web Service that is responsible of exposing the structured knowledge as result of client requests.",
               "The workflow works in the following way. The stream of reviews are given as input to the Data Manager Module. This module is composed by two components: the Document Analyzer Pipeline and the Document Enricher. This former is responsible of applying the open information extraction strategy, together with other natural language processing tools, for extracting tuples containing the aspects mentioned in the text and the associated polarities. Details about this module are provided in Section 5.",
               "Once a review is analyzed, the result is sent to the Document Enricher component that is responsible of linking information extracted from text to the product for which the review has been provided. The linking operation consists of retrieving the product name, the domain, the category, and the review score. This operation has been implemented on top of the Amazon Product API. Here, given the product's id contained in the review's metadata, it is possible to retrieve the product's information mentioned above.",
               "The output of the Data Manager Module is the structured representation shown in . Each object is then stored into the repository.",
               "Leaves of the tree contain the label of the opinion word and its polarity. These are associated with the respective aspects contained within the connected upper-layer. All aspects are finally associated with the product entity.",
               "The content of the repository is then exploited by final users through the Web Service integrated into the platform. The Web Service, and the client application briefly presented in Section 6, enables users to access data and to have a real-time visualization about the opinion trends associated with products' categories, items, or specific features of items. . Example of the tree structure extracted by NLP Module."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 10,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "5.",
               "text": "Document analyzer pipeline",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Here, we present the approach implemented for extracting aspects from document content. The overall aspect extraction approach relies on the NLP pipeline shown in the middle layer of .",
               "As it is shown on the bottom layer, the implemented pipeline exploits the three linguistic resources introduced in Section 3. These resources are used by the Stanford Core NLP Library ( shown in the top layer of .",
               "The pipeline is composed by the following five phases:",
               "? Aspect Extraction. This first step is the most important one and it consists of detecting the correct aspects contained in the text and the associated opinion words. Details about this step are provided below where we present the open information extraction algorithm adopted for analyzing provided text.",
               "? Compound Noun Extraction. The second step consists in detecting the presence of compound names. This step is supported by the use of the POS-Tagger module provided by the Stanford Core NLP library and by WordNet (both introduced in Section 3). When two consecutive words are tagged as nouns by the POS-Tagger, their composition is searched within the WordNet dictionary. If the compound expression is found, it is tagged as compound name and used as a unique token, otherwise not.",
               "? Co-reference Resolution. This step consists in associating pronouns with the related noun (or compound noun). This is necessary for detecting all associations between opinion words and aspects. This operation is completely supported by the Coref Annotator. Refinements of the adopted algorithm are out of scope of this paper and they are part of future work.",
               "? Stopwords Removal. Once compound names have been detected and pronouns have been replaced with the right terms, the pipeline removes all stopwords from the text by exploiting the list mentioned above.",
               "? Polarity Computation. Finally, this step is responsible for computing the polarity associated with each aspect extracted during the previous steps. The overall polarity of an aspect A is computed by aggregating the single polarities of the opinion words associated with A. Single polarity values are extracted and aggregated from the sentiment lexicons as described in Section 3. "
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 11,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "5.1.",
               "text": "The open aspect extraction strategy",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The Open Aspect Extraction component uses a generic solution for identifying possible aspects in the user's opinion. This component implements an OpenIE strategy for supporting this task. OpenIE is a NLP branch of research that tries to determine meaningful patterns over parsing structure of a sentence and morphological characteristics.",
               "The developed algorithm analyzes the structure of the grammar dependencies graph generated by the CoreNLP library for extracting the connections between aspects and opinions. Each dependency extracted by the CoreNLP library can be expressed by a triple: RelationType Governor Dependant { , , } ."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 12,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "paragraphs": [
               "The generated dependency graph is then processed by applying a set of rules for determining if the content of each node is supposed to be an aspect, an opinion, or nothing. These rules can be considered as a representation of the most common patterns that can be used for detecting pairs of the type aspect-opinion_word. The choice of these three rules allows at the same time to have a system that is efficient in processing document content and effective in covering content structure. Indeed, results of an in-vitro experiment shown the by disabling one of the rules the effectiveness of the system dramatically decreases. Hence, given a dependency node n, the algorithm checks if one of the following rules subsists:",
               "Rule 1: If the relation type is an adjectival modifier (\"amod\"), a connection between an aspect and an opinion word persists if and only if the governor is an aspect and the dependant has a polarity value in at least one of the sentiment lexicons.",
               "Rule 2: If the relation type is a nominal subject (\"nsubj\"), a connection between an aspect and an opinion word persists if and only if the governor has a polarity value in at least one of the sentiment lexicons and the dependant is an aspect.",
               "Rule 3: If the relation type is a direct object (\"dobj\"), a connection between an aspect and an opinion word persists if and only if the governor has a polarity value in at least one of the sentiment lexicons and the dependant is an aspect. shows the result obtained by applying these three rules to our running example and summarizes only the valid relationships extracted from the grammar dependencies graph. We reported with a dotted line also the relationship between I and enjoyed. Actually, this relationship is not valid because I is tagged as personal pronoun but within the sentence such a pronoun is not resolved.",
               "The color code used in the figures is the following: light red nodes are nouns that have not been detected as aspect by the system; red nodes are nouns that have been detected as aspect by the system; green nodes are verbs for which a polarity value is present in the sentiment lexicons; and, blue nodes are adjectives for which a polarity value is present in the sentiment lexicons.",
               "Finally, the extracted relationships can be summarized as follows: laptop{cheap} screenresolution (it){amazing, enjoyed} These associations allow our system to infer, for both aspects laptop and screen_resolution, a positive polarity."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "head": {
               "type": "relatedwork"
          },
          "paragraphNo": 13,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "6.",
               "text": "Client user interface",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The platform has been equipped with a web-based client application for supporting users during the analysis of the processed data. Users can query the repository by means of a controlled query interface built on a single-page web application that provides all data visualization functionalities.",
               "The client interface has been designed with the aim of being very simple and intuitive. First of all, users have to select a category from the related list. They can eventually specify an aspect of their interest and, then, submit their request. The web service will provide the list of products according to the specified category and the requested aspect. The client application is then in charge of organizing the response data as shown in . The harmonization of the terms provided by the users (plural forms, synonyms, etc.) is performed by using the WordNet lexicalizer.",
               "Each row can be ordered according to the product name, the number of reviewed aspects, the average polarity, or the polarity of the aspect provided by the user, if any. These two last metrics are particularly useful because they represent, respectively, the customers' overall opinion of the product and their appreciation of the selected aspect.",
               "A complete visualization of the product's opinion hierarchy is generated by clicking on its name. shows the editable treeview obtained by selecting a specific product. Users can hide opinions for a better visualization of larger trees. Moreover, colors have been added to give an immediate feedback on polarity values.  For retrieving further product details, each row can be expanded for showing the details of every single aspect extracted from the reviewed entity. The aspects sub-table shows aspect's name, average polarity, and the number of related opinion.",
               "Single opinions can be visualized by expanding the aspect's row as shown in . Once displayed, opinion's table presents a slightly different structure. Each row reports opinion's name and its polarity as well as the values associated with the same word in the other lexicons resources. This way, it is possible to do an immediate comparison of such values. The count of positive and negative occurrences of the specific opinion are shown in two separates columns.",
               "From the technological perspective, the main component of the web interface has been developed with Spark Micro Framework."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 14,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "paragraphs": [
               "This Java library facilitate the creation of a simple REST service to manage client's requests. Each call is binded to a specific query function which automatically maps the results to a JSON serializable object. The client side JavaScript code has been written following MVC pattern. AJAX requests and responses are handled by JQuery, Bootstrap, 8 and Bootstrap-table 9 JavaScript libraries.",
               "These libraries are in charge of managing the presentation layer. Finally, the D3.js 10 library has been used to represent complex product data."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "head": {
               "type": "relatedwork"
          },
          "paragraphNo": 15,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "7.",
               "text": "Evaluation",
               "type": "experiment"
          },
          "paragraphs": [
               "In this Section, we present the evaluation of the proposed system. Such a system is evaluated under different perspectives aiming to show the efficiency and effectiveness of the implemented modules:",
               "? Aspect extraction. The OpenIE approach is in charge of detecting aspects within text. Such a task is important for defining, later in the analysis process, which aspects are the most significant ones and which are the opinion words associated with them. This evaluation task focused on measuring the effectiveness of the aspect-extraction approach.",
               "? Polarity detection. The computation of the aspect's polarity enables the detection of which product features are strong or weak. The Sentiment Module is in charge of inferring the polarity of each aspect given the context in which such an aspect is included. Here, we measured the capability of our approach to infer the correct polarity.",
               "? Lessons Learned. Besides the effectiveness of the technological components, we provide a discussion about the usability of the user interface and the direction we intend to follow for the evolution of the platform presented in this article. Here, the web-based tool has been evaluated by a group of 42 users of different expertises that answered to a survey. We report the most important feedback we collected.",
               "The OpenIE module has been evaluated on two benchmarks: the SemEval 2015 Task 12 and SemEval 2016 Task 5 12 datasets."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 16,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "paragraphs": [
               "Both benchmarks required the detection of aspects from text belonging to the Restaurant and Laptop domains and the computation of the associated polarity. Then, concerning the SemEval 2015 Task 12 dataset, the polarity computation was requested also for the Hotel domain. In Section 7.1, we report the results obtained on the aspect detection task. For the SemEval 2015 Task 12 dataset the precision, recall, and f-measure metrics were available, while for the SemEval 2016 Task 5 dataset only the f-measure was reported in the official evaluation report. Then, in Section 7.2, we report the results obtained on the polarity computation task. Here, the system accuracy has been reported. Finally, besides the systems participated to the SemEval challenges, we included also a comparison with other two approaches available in the state of the art that are particularly relevant for our use case. Technical details about such approaches are presented in and Qiu, Liu, Bu, and Chen (2011). We applied the paired t-test for measuring if the obtained results were significant or not. In each table, we used the following notation near the results obtained by the systems we compared: ? ? and ? means that the gap is significantly worse with a p-value of 0.01 or 0.05 respectively. While, + + and + means that the gap is significantly better with a p-value of 0.01 or 0.05 respectively."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "head": {
               "type": "experiment"
          },
          "paragraphNo": 17,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "7.1.",
               "text": "Evaluation on aspect extraction",
               "type": "experiment"
          },
          "paragraphs": [
               "Tables 1-3 report the results obtained by our system on the SemEval benchmarks. As mentioned above, the algorithm has been tested on both the Restaurant and Laptop domains.",
               "The overall performance are in line with the best systems participating in the evaluation campaigns and, in both cases, our approach obtained the best F-measure on the Laptop domain. It is also important to highlight that all the systems we compared to, apply a domain-specific supervised approaches for extracting aspects, while our approach implements an unsupervised technique. This peculiarity enables the possibility of implementing the system in any environment without the requirement of training a new model. 8 http://getbootstrap.com/. 9 https://github.com/wenzhixin/bootstrap-table. https://d3js.org/. 11 http://alt.qcri.org/semeval2015/task12/. 12 http://alt.qcri.org/semeval2016/task5/. Concerning the evaluation on the SemEval 2016 Task 5 dataset, we applied our system to the Subtask 1, Slots 2 and 3 only. We worked in this way because the other tasks and slots aimed to verify system facilities that were out of scope of this paper. Results obtained on the aspect extraction task, for the Restaurant domain on the SemEval 2015 Task 12 benchmark. For each dataset, we reported Precision, Recall, and F-Measure. Acronyms refer to the systems participated in the SemEval 2015 Task 12 competition. Technical details about the participant systems can be found in the SemEval 2015 Proceedings (http://aclweb. org/anthology/S/S15/).  While on the Laptop domain our system outperforms the others, a different scenario occurs for the Restaurant domain where our system loses around 3% and 6% on the two datasets, respectively. A more in depth analysis of the results obtained on the Restaurant datasets highlighted how around the 90% of the errors are caused by the extraction of aspects resulted as false positive. This observation was not unexpected. Indeed, one of the most common issue in unsupervised aspect-based approaches is the extraction of false positive elements (Liu, . By analyzing possible consequences of this weakness, we suppose that this may lead to a poor effectiveness of components that exploit the outcomes of the aspect extraction module.",
               "Concerning the results of the paired t-test, in the cases where our system did not obtain the best result, we performed the test by taking as reference the best system. While, in the cases where our system obtained the best result, we performed the test by taking as reference the runner-up system. Concerning the results show in , the precision value has been compared with the IHS-RDBelarus system by resulting not significant (p-value = 0.159), while the recall value has been compared with the NLANGP system and in this case the difference resulted significant (p-value = 0.020). Results presented in were compared with the NLANGP system for the precision value and with the TJUdeM system for the recall value. Both differences resulted significant at the t-test with p-values of 0.043 and 0.016, respectively. The same happened for the results shown in . Here, the comparison has been performed only against the NLANGP system and for both domain the improvements resulted significant with p-values of 0.041 and 0.047. Overall, by considering the F-Measure values, our system obtained significant improvement on the Laptop domain, while for the Restaurant and Hotel domains both positive and negative differences with respect to the other systems did not result statistical significant. However, by considering the unsupervised nature of our approach, with respect to the compared systems that are all supervised, we may consider our strategy feasible for being implemented in a real-world general purpose environment. report the results obtained on the polarity computation task. The approach has been evaluated on the two benchmarks described in the preamble of this section. Here, we measured the accuracy of the polarity computation algorithm: given Results obtained on the aspect extraction task, for both the Restaurant and Laptop domains on the SemEval 2016 Task 5 benchmark. For each dataset, we reported the F-Measure. Acronyms refer to the systems participated in the SemEval 2016 Task 5 competition. Technical details about the participant systems can be found in the SemEval 2016 Proceedings (http://aclweb.org/anthology/S/S16/). Results demonstrated the effectiveness of the polarity computation strategy implemented into the proposed system. The system obtained the best performance on the Laptop domain in both benchmarks, while the gap with the best systems on the other domains is always lower than 2%. After a detailed analysis of the results, we noticed that the reason for which our approach performs better on the Laptop dataset is due to the simple language used for describing product features. Indeed, in the Restaurant dataset opinions are expressed in a more articulated way and sometimes the approach fails to detect the right polarity. Part of future effort will be dedicated to improve our system in this direction."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 18,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "7.2.",
               "text": "Evaluation on polarity computation",
               "type": "experiment"
          },
          "paragraphs": [
               "We performed the same t-test described in the previous subsection also to the polarity computation results. Concerning the results Results obtained on the computation of polarities associated with single aspects on the SemEval 2016 Task 5 benchmark. For each dataset, we reported the accuracy obtained in computing polarities (positive, negative, or neutral). Acronyms refer to the systems participated in the SemEval 2016 Task 5 competition. Technical details about the participant systems can be found in the SemEval 2016 Proceedings (http://aclweb.org/anthology/S/S16/). reported in , we compared our system with SENTIUE on the Restaurant and Laptop domains, while for the Hotel domain the comparison has been done with the LSISLIF system. For both the Restaurant and Hotel domains the differences did not result significant (p-values of 0.218 and 0.227, respectively), while for the Laptop domain the improvement is significant (p-value of 0.029). Finally, concerning the results shown in , we compared our system with XRCE for the Restaurant domain and with INSIG for the Laptop domain. In the first case the difference was not significant (p-value = 0.189), while in the second case the improvement obtained by our system was significant (p-value = 0.038). Overall, in almost all cases our approach significantly improved the other systems. In particular, on the Laptop domain in both cases all improvements are significant for a p-value of at least 0.05."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 19,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "7.3.",
               "text": "Lessons learned",
               "type": "experiment"
          },
          "paragraphs": [
               "Early in this section, we demonstrated the suitability of the components integrated within the proposed platform. Besides such validation tasks, we interviewed a group of 42 users for collecting feedback about possible improvements on the client side. In particular, what we collected from users can be recognized in two main aspects: (i) efficient management of data streams, and (ii) understandability of the user interface."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 20,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "paragraphs": [
               "Architecture Efficiency. The scenario used in this first prototype focused on using document sets having a limited number of items. By switching from a test environment to a more complex one, we noticed that the time needed for extracting all aspects increased significantly. This issue was related to the necessity of detecting, for each aspect that was already extracted, the presence of further opinions connected to him. While a possible solution might be the parallelization of this task, some tricks have to be applied. Indeed, the constraint of analyzing documents by keeping the timing order in which they have been generated, requires to perform some checks based on the number of documents that we want to analyze at a certain time. Thus, by having, for example, a window of n documents that we want to parallelize, a possible strategy is to verify if there are conflicts between the aspects extracted from such documents. This way, we would be able to safely update aspect-based information without losing potential edges. For completeness, we report data concerning the scalability of the system. We run the scalability test on a server equipped with a double Xeon X5650 and 32Gb of RAM and we measured the time necessary for processing the 1,000,000 documents contained within the DRANZIERA dataset . We tested three systems: the one we propose, the approach presented in To Reviewers: here, we did not provided a detailed analysis of the user evaluation of the tool because we considered it out of scope of the paper. However, if the Reviewers consider it useful, we can integrate in a revision more details about how the user evaluation has been conducted. , and the one presented in . Our system completed the processing operation in 23 min and 27 s, the algorithm of in 63 min and 45 s, and the algorithm of in 92 min and 31 s. Thus, we may state that our system is definitely more efficient.",
               "User Interface Improvement. The second lesson we learned from this work is related to which improvements should be carried out to the user interface for making the platform more appealing from the user's perspective. Users interviewed for judging the tool provided feedback that can be summarized in the following two issues:",
               "? Contextual information into the aspect visualization: in this prototype we did not take into account the possibility of having different kind of users: Basic and Advanced. While basic users can be satisfied from a simple graphical information supporting the detection of the most interesting aspects, advanced users wanted to see detailed information associated with them, i.e. the polarity value, a summary of supporters and opponents associated with each aspect, etc. This functionality will be included in the next version of the platform.",
               "? Animate the evolution of single aspect: the second issue raised by the users was related to the impossibility of observing how each aspect evolves during the analysis of the data stream. In particular, a desiderata is the possibility of focusing on a single aspect and to observe how such aspect is judged through time. This feature has been considered as a valuable support for associating peaks of supporters or opponents based on contextual events that cannot be tracked through the proposed system.",
               "The two issues brought to light from users' feedbacks will be used as a starting point for improving the infrastructure of the presented platform. Thus it will be possible to employ such a platform in a larger scale context with the aim of increasing its technological readiness level."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "head": {
               "type": "experiment"
          },
          "paragraphNo": 21,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     },
     {
          "head": {
               "n": "8.",
               "text": "Conclusions and future work",
               "type": "conclusion"
          },
          "paragraphs": [
               "Results reported in the previous sections revealed the feasibility of the proposed architecture and of the implement techniques. Even if aspect recognition procedure presented in Section 5 may lack of precision and recall due to the adopted unsupervised techniques, the results reported in Section 7 shows that the effectiveness of the system is comparable with the supervised systems participated in the SemEval challenges. Thus, few changes in the proposed approach could result in significantly better performances. Examples of actions focus on the improvement of precision that could be achieved by adding a semantic clustering phase in the parsing pipeline shown in . Then, by detecting the semantic distances between extracted aspect might help to discard uncorrelated aspects that may not refer to the reviewed product. Recall values could be increased as well by applying less strict rules than the ones presented in Section 5. These possibilities will be taken into account for possible future developments.",
               "Another important part of this work focuses on aspect and opinion polarization. shown that the presented technique works well during the polarity inference phase. These results suggest that by using an aggregation of (i) general purpose sentiment lexicons and (ii) specific ones, the polarity evaluation phase is positively affected.",
               "Concerning the overall architecture, the presented solution provides a wide range of functionalities that can be applied to provide useful facilities for both customers and producers. For instance, the three level-tree structure shown in can be used to produce both a flexible ranking system and an effective representation of each expressed opinion that can highlight specific qualities and problematics of each reviewed product.",
               "In the future, efforts will be focused on several different perspectives. The first one concerns the developing of semantic clustering approach for extracting aspects This way, search would be based on inserted words' semantics rather than their syntax. As a result, ranking products by screen would also organize display and screen_resolution aspects rather than discarding them because of their different form.",
               "Other possible progresses regard the application of different aspect extraction techniques on the implemented framework, the refinement of the user interface described in Section 6 and a more detailed comparison between multiple domain-specific lexicon. This last perspective could result in interesting developments concerning the production of a domain-distance metric and the integration of fuzzy membership for unclassified reviews or automatic domain labeling. Once domain-specific lexicons have been produced, they can be used alongside aspect extraction techniques to give a score value to portion of texts which are not provided with that additional information. Such an application could be easily benchmarked with existing reviews."
          ],
          "paper_id": "dd54d2c0-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 22,
          "fromPaper": "An unsupervised aspect extraction strategy for monitoring real-time reviews stream"
     }
]