[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "During the ongoing outbreak of coronavirus disease (COVID-19), people use social media to acquire and exchange various types of information at a historic and unprecedented scale. Only the situational information are valuable for the public and authorities to response to the epidemic. Therefore, it is important to identify such situational information and to understand how it is being propagated on social media, so that appropriate information publishing strategies can be informed for the COVID-19 epidemic. This article sought to fill this gap by harnessing Weibo data and natural language processing techniques to classify the COVID-19-related information into seven types of situational information. We found specific features in predicting the reposted amount of each type of information. The results provide data-driven insights into the information need and public attention."
          ],
          "paper_id": "dd679770-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 0,
          "fromPaper": "Characterizing the Propagation of Situational Information in Social Media During COVID-19 Epidemic: A Case Study on Weibo"
     },
     {
          "head": {
               "text": "Characterizing the Propagation of Situational Information in Social Media During COVID-19 Epidemic: A Case Study on Weibo",
               "type": "abstract"
          },
          "paragraphs": [
               "Lifang Li, Qingpeng Zhang , Member, IEEE, Xiao Wang, Member, IEEE, Jun Zhang , Senior Member, IEEE, Tao Wang, Tian-Lu Gao, Wei Duan, platforms to acquire needed information and exchange their opinions , . There are many different types of information on social media platforms, and the situational information, the information that helps the concerned authorities or individuals to understand the situation during emergencies (including the actionable information such as help seeking, the number of affected people) , is useful for the public and authorities to guide their responses , . Identifying these types of information and predicting its propagation scale would benefit the concerned authorities to sense the mood of the public, the information gaps between the authority and the public, and the information need of the public. It would then help the authorities come up with proper emergency response strategies . The existing studies have not yet agreed on the definition of situational information. Some categorized help seeking and donations as situational information but neglecting other types of situational information such as criticism from the public, which reveals the concerns of the public, and emotional support, which reveals the empathy of others to the victims . However, it is necessary to identify situational information in a comprehensive manner. For example, identifying critismrelated information can help the authorities learn the main concerns of the public and come up with proper responses. Identifying emotional support information could help the authorities learn the social support patterns of social media users and take better advantage of such voluntary resources.",
               "Moreover, it is critical to identify the key features that can predict the propagation scale of situational information to ensure that the authorities can publish different types of situational information based on the needs of the public. Filling such information need is critical during sudden epidemics such as COVID-19.",
               "To fill these research gaps, we used COVID-19-related discussions on Sina Weibo, the major microblogging site in China (the Chinese equivalent of Twitter) to answer the following research questions:",
               "RQ1. How to identify and categorize the situational information in social media? RQ2. What is the various predictability of features of the propagation scale of different types of situational information?"
          ],
          "paper_id": "dd679770-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 1,
          "fromPaper": "Characterizing the Propagation of Situational Information in Social Media During COVID-19 Epidemic: A Case Study on Weibo"
     },
     {
          "head": {
               "text": "II. SITUATIONAL INFORMATION IN SOCIAL MEDIA",
               "type": "abstract"
          },
          "paragraphs": [
               "Social media platforms are widely used by people to share information in different situations - . During a crisis, rich situational information is generated by social media users , , .",
               "However, different researchers categorized situational information into different types . For example, Rudra et al. defined situational information as those notifications of the casualties or injured/stranded people or helping relief operations and categorized sympathizing with the victims, praising or criticizing the relief operation, postanalysis of the reasons the crisis happens, and donation-related information into nonsituational information. While in the study by  , the nonsituational information defined by Rudra et al. was categorized into situational information. Specifically, she categorized situational information into social environment information, built environment information, and physical environment information. The social environment information contains advice, caution, evacuation, fatality, injury, medical attention, people missing, and offering help. Built environment information contains damages caused by the crisis and the status of infrastructures. Physical environment information includes environmental impact, general area information (status of the hazard), and general hazard information (e.g., weather report) .",
               "Moreover, Imran et al. further categorized the situational information into seven types such as caution and advice, casualties and damage, donations of money, goods, or services, people missing, found, or seen, and information source based on Vieweg's work. Mukkamala and Beck categorized 10 types of situational information including initial information about the disaster, situation updates, criticism about insufficient attention, moral support, preparations, criticism and control rumors, help request, offering help, self-organizing support, and active volunteerism.",
               "According to , situational information is the posts which provide \"tactical, actionable information that can aid people in making decisions, advise others on how to obtain specific information from various sources, or offer immediate post-impact help to those affected by the mass emergency.\" Sharing such information helps the concerned authorities and individuals understand the crisis and guide their behaviors . Based on this definition, this study categorized seven types of COVID-19-related information as situational information: 1) caution and advice; 2) notifications and measures been taken; 3) donations of money, goods, or services; 4) emotional support; 5) help seeking; 6) doubt casting and criticizing; and 7) counter-rumor. presents the content types.",
               "Specifically, caution and advice information notifies the public to help them protect themselves from the harm of the virus. Notifications (situation updates or casualties and damages) of COVID-19 tell the public about the details of the epidemic, and sharing this type of information helps them learn the situation and helps others ease the anxiety of insufficient information , . Donation (offering help) information helps the public especially those who need help to learn what kinds of help are available . Emotional support information shows positive effect on the victims to recover from the emotional harm as a result of the epidemic, and sharing this type of information helps others obtain the collective support and feel the empathy . Help-seekingrelated posts spread information about immediate help or aid during the epidemic, and sharing this type of information helps authorities and individuals obtain the help or aid . In addition, doubt casting and criticizing information often discusses sociopolitical causes and implications of and responsibility for crisis, and sharing such information helps others vault the validity of information or enhance their understanding of the epidemic , . Counter-rumor information also helps the public learn the truth and lessen the confusion caused by rumors . Given that sharing these seven types of information benefits the efficiency of disaster/crisis relief processes, we categorized them into situational information."
          ],
          "paper_id": "dd679770-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 2,
          "fromPaper": "Characterizing the Propagation of Situational Information in Social Media During COVID-19 Epidemic: A Case Study on Weibo"
     },
     {
          "head": {
               "text": "III. FEATURES FOR PREDICTING THE PROPAGATION OF CRISIS INFORMATION IN SOCIAL MEDIA",
               "type": "abstract"
          },
          "paragraphs": [
               "Several features were applied to predict the propagation scale of social media content in crisis including the content features and user features. Content features mainly contain the following: whether URL/Hashtag is contained, the publishing timing of the content, and the content's length have been recognized to positively affect the reposted amount of social media content - . Moreover, the content type may also significantly affect the reposted amount of information for that previous study found that users show distinct information needs and interactions when sharing different types of information . Besides, emotions of the content also affect the information propagation scale of information . For example, Berger and Milkman characterized the effects of emotionality, positivity, awe, anger, anxiety, and sadness words in the content on the virality of social media content.",
               "From the perspective of social media users, whether users have a higher number of followers or followees (proxies of the social capital) and whether they are verified users or not also positively affect the propagation scale of the post in social media , . Another user-related feature is users' location, and if users are from the developed cities, they are more likely to attract more social capital which will enlarge their influence upon others . In addition, in the case of disasters, people are more likely to share the posts from users who are eyewitnesses of the event and located near the event . Besides, affiliations and perceptions of people could also affect users' information sharing behavior - . As suggested by , the affiliation, which indicates the close and friendly relationship of individuals with others, might positively be related to what people share with larger audiences. The perception of users (see, hear, and feel) also affects users' information sharing behavior ."
          ],
          "paper_id": "dd679770-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 3,
          "fromPaper": "Characterizing the Propagation of Situational Information in Social Media During COVID-19 Epidemic: A Case Study on Weibo"
     },
     {
          "head": {
               "text": "A. Data Collection",
               "type": "abstract"
          },
          "paragraphs": [
               "This article collected Weibo posts using the keywords \"New coronavirus ( )\" and \"unknown pneumonia ( )\" using the Weibo API after the start of the COVID-19 epidemic in Wuhan. According to a report of the authorities on February 17, 2020, this virus has taken 1772 persons' lives and with more than 70 000 people infected.",
               "We collected the following attributes of the Weibo data from December 30, 2019, to February 01, 2020: 1) the total number of posts is 36 746; 2) posts' attributes including the creating time of the post, the distinct ID of the post, text content, and the length of the post, reposted/comments/likes, and the amount of the post; and 3) user attributes such as user id, tagged location, verified, follower counts, and followee counts.",
               "In addition, we plotted the number of COVID-19-related posts within the time span by date to reveal the evolution trend of the public opinion as shown in . The results show that public opinion began to spread with increasing speed on January 19, peaked on January 25, and started declining since February 1. This suggests that the authorities need to pay more attention to the content types in early stage of the epidemic to understand the needs of the public and adjust their information publishing strategies properly. "
          ],
          "paper_id": "dd679770-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 4,
          "fromPaper": "Characterizing the Propagation of Situational Information in Social Media During COVID-19 Epidemic: A Case Study on Weibo"
     },
     {
          "head": {
               "text": "B. Situational Information Classification",
               "type": "abstract"
          },
          "paragraphs": [
               "Various natural language processing methods were used to classify social media content into several types , . Specifically, we use supervised learning methods such as support vector machines (SVM), naive Bayes (NB), and random forest (RF) to learn the types of unlabeled data based on labeled data , , . The classification process is as follows.",
               "First, we randomly sampled 3000 COVID-19-related posts from the collected data sets.",
               "Second, three graduate students manually labeled the type of information of the 3000 sampled data.",
               "Third, we calculated the Cohen's Kappa value of the three coders and the value was 0.81 Cohen's Kappa value, which is larger than 0.8 and indicates the convincible of labeling results. presents the labeling results and the definitions of each type of information.",
               "Fourth, the SVM, NB, and RF classifiers were trained using randomly sampled 85% (2550) data, and using the rest of the 450 to test the accuracy of each classifier, the average accuracy of these classifiers was 0.54, 0.45, and 0.65 respectively. Since we have eight types, we further plotted the confusion matrixes of each classifier as shown in . The results indicate that RF classifier performs the best.",
               "Fifth, we choose the RF classifier to automatically label the rest of the data using all the 3000-labeled data as training set.",
               "Sixth, we summarized the five attributes as shown in   users), the total (average) number of followers and followees of the users, and the total (average) reposted amount of the posts in each type of information. shows that during the COVID-19 epidemic, there are more verified users involved in the spreading process of Type 2 information (notifications and measures been taken). The verified users dominated the propagation of Type 3 information (donations of money, goods, and services). Type 5 information (help seeking) attracted the largest amount of average attitudes. Type 6 information (doubt casting and criticizing) have the second largest amount in our data set and a larger proportion of users involved in the propagation of this type of information. Such findings reveal the necessity to identify further information release strategies to this type of information as suggested by Atlani-duault et al. .",
               "In addition, the Type 8 information (nonsituational) in our data set has the largest total amount of reposted amount. By tracing back to the data set, we found that the dominating post was posted by \"CCTV News,\" which published this information on January 24, 2020 (Chinese New Year's Eve) to send greetings to all the users which attracted 2 774 936 reposted amounts (94.5% of all the reposted amount). After deleting this outlier, 1 62 497 total reposted amount and 56.9 average reposted amount are left. Then this nonsituational information becomes the least popular information compared with the situational information. It indicates that in this crisis, users are more likely to repost the situational information rather than the nonsituational information."
          ],
          "paper_id": "dd679770-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 5,
          "fromPaper": "Characterizing the Propagation of Situational Information in Social Media During COVID-19 Epidemic: A Case Study on Weibo"
     },
     {
          "head": {
               "text": "C. Situational Information Propagation Scale Prediction",
               "type": "abstract"
          },
          "paragraphs": [
               "To find the key features that can accurately predict the propagation scale (reposted amount) of each type of situational information, we extracted five groups of features as summarized in the literature , . The extracted features (with the name in italic format) are as follows. 3) Affiliation-related factors: affiliation, achieve, power, reward, and risk. 4) User-related features: followers' amount (Followers (log)), followees' amount (Followees (log)), near the event or not (NearCity), live in developed city or not (BigCity), and verified users or not. 5) Content-related factors: whether hashtag/URL contained (URL, Hash), the length of the post (length), and the publishing timing of the post (hours). Specifically, the emotional factors, perception factors, and affiliation factors are extracted using Linguistic Inquiry and Word Count (LIWC), a commonly used tool to extract the linguistic information from content , . Because the words and linguistic patterns people use in their text could reveal their emotions, perceptions, and their needs for affiliation, power, achievement, and so on .",
               "The number of followers/followees was log-transformed and 1 was to avoid zeros. The verified status of users was directly obtained from the data sets. Users' locations are obtained by the following definitions: 1) whether users are located near the crisis is defined as that if users are located in Hubei province, assign 1 to the variable; otherwise, assign 0 and 2) whether users are located in the developed area, assign 1, that is, if users are located in \"Beijing, Shanghai, Shenzhen, and Guangzhou\"; otherwise, assign 0.",
               "For the content-related factors URL/Hashtag, if it contained at least one URL or Hashtag, assign 1 to it; otherwise, assign 0. The length of the post is the total word counts of posts. The post timing of the post is defined as the number of hours between the post time and . summarizes the mean value of all the features for all types of situational information. Using the above-defined features for each type of situational information, we first selected the features using linear regression, RF, and stepwise methods. By comparing the performance of the selected features for each type of information, we finally choose the stepwise methods for Type 1-Type 6 information but use the RF feature selection results for Type 7 information (counter-rumor) for its high goodness of fit (R 2 ). In addition, we carried out multiple linear regression and negative binomial regression to predict the log-transformed reposted amount of each type of information using the selected features using 85% of the randomly sampled data as training data. shows the root mean square error (RMSE) of each prediction model. Because the linear regression models have lower RMSE, we finally choose linear regression to predict the reposted amount of the COVID-19-related posts. Moreover, shows the effect of the selected features for all the seven types of situational information. Specifically, the first column shows the potential features, and the left columns show the selected features and their effects for each type of situational information. For example, for Type 1 information (caution and advice), mainly six features are selected, namely, see, achieve, verified, followers (log), BigCity, and hours.",
               "Table V shows the following. 1) For Type 2 (notifications and measures that have been taken), Type 3 (donations of money, goods, or services), and Type 5 (help seeking) information, the use of hashtags will enlarge the reposted amount of their reposted amount. For these types of information, normally it was the authorities' responsibility to publish it. If the authorities want it to be reposted in larger amount, using hashtags would be a good choice. 2) Unverified users' COVID-19-related posts have a larger reposted amount of nearly all types of disaster-related information. Thus, the authorities need to pay more attention to the credibility of the unverified users for their great influence. In neglecting the credibility of their posts, it will do harm to the authorities. 3) Type 6 information (doubt casting and criticizing) will have a larger reposted amount if users have a larger number of followers, come from developed cities, or use less negative words. Moreover, compared with other types of situational information, the doubt casting information becomes popular in the later periods of the crisis. For the authorities, it is better to pay more attention to those rational criticizers who have higher number of followers (they might be the opinion leaders) and verify whether their views are valuable or not. If so, take their advices to improve the existing crisis response strategies. 4) For all types of situational information (except for Type 7, counter-rumor), the more the words contained in the content, the larger its reposted amount. For all types of situational information except counter-rumor, increasing the length can enlarge their propagation scale; otherwise, use the opposite strategies. As for the counterrumor, we need to enlarge the sample data to verify whether it is better to use fewer words to enlarge its propagation scale. 5) For Type 7 information (counter-rumor), if it comes from users who have a higher number of followers and comes from developed cities, it will enlarge its reposted amount. If the authorities want to enlarge the propagation scale of counter-rumor, it is better to target the high follower number users by mentioning or replying them. In summary, the authorities could apply the results of this article to understand the public such as their attitudes toward the current epidemic response strategies of the authorities, to identify and amplify the help seeking, donations, and notifications' information that may be needed for the public, and to identify and counter attempts to blames or rumors, to improve crisis information publishing strategies of the authorities in the future."
          ],
          "paper_id": "dd679770-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 6,
          "fromPaper": "Characterizing the Propagation of Situational Information in Social Media During COVID-19 Epidemic: A Case Study on Weibo"
     },
     {
          "head": {
               "text": "V. CONCLUSION",
               "type": "conclusion"
          },
          "paragraphs": [
               "The findings of this article indicate the necessity of using different information publishing strategies for different types of situational information. The selected features for different types of situational information could also help the authorities learn how to organize their COVID-19-related posts to enlarge or decrease the reposted amount of their posts. In addition, the definitions of the situational information will be useful for researchers or practitioners who aim to build effective social-media-based emergence response programs and crisis information systems.",
               "This article has limitations. First, we only obtained a subset of social media data for the constrains of Sina API. In future, we will collaborate with the data providers to obtain a larger amount of data. Second, in training the classifiers to identify the content types of situational information, we only trained three traditional NLP-based classifiers due to limited data. In future, we will use more data and train deep learning methods to identify the content types with higher accuracy , . Third, the manual labeling of the crisis data is time-consuming and might influence the efficiency of characterizing crisis information sharing. In future, we plan to apply automatic labeling methods to avoid this limitation , .",
               "Qingpeng Zhang (Member, IEEE) received the B.S. degree in automation from the Huazhong University of , and the Ph.D. degree in systems and industrial engineering from The University of Arizona, Tucson, AZ, USA, in 2012.",
               "He was a Post-Doctoral Research Associate with The Tetherless World Constellation, Department of Computer Science, Rensselaer Polytechnic Institute, Troy, NY, USA. He is currently an Assistant Professor with the School of Data Science, City University of Hong Kong, Hong Kong. His research interests include social computing, complex networks, data mining, and semantic web.",
               "Dr. Zhang is an Associate Editor of the IEEE TRANSACTIONS ON INTELLIGENT TRANSPORTATION SYSTEMS, the IEEE TRANSACTIONS ON COMPUTATIONAL SOCIAL SCIENCE, and PLOS One.",
               "Tian-Lu Gao received the master's degree from the School of Electrical and Computer, University of Denver, Denver, CO, USA.",
               "He is currently a Project Engineer with the School of Electrical and Automation, Wuhan University, Wuhan, China. His main research interest is the application of AI, NLP, and Blockchain in power system operation and control. His research interests include complex networks, epidemic modeling, information diffusion, agentbased simulation, and social computing."
          ],
          "paper_id": "dd679770-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 7,
          "fromPaper": "Characterizing the Propagation of Situational Information in Social Media During COVID-19 Epidemic: A Case Study on Weibo"
     }
]