[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Big data analytics has recently emerged as an important research area due to the popularity of the Internet and the advent of the Web 2.0 technologies. Moreover, the proliferation and adoption of social media applications have provided extensive opportunities and challenges for researchers and practitioners. The massive amount of data generated by users using social media platforms is the result of the integration of their background details and daily activities. This enormous volume of generated data known as \"big data\" has been intensively researched recently. A review of the recent works is presented to obtain a broad perspective of the social media big data analytics research topic. We classify the literature based on important aspects. This study also compares possible big data analytics techniques and their quality attributes. Moreover, we provide a discussion on the applications of social media big data analytics by highlighting the state-of-the-art techniques, methods, and the quality attributes of various studies. Open research challenges in big data analytics are described as well."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 0,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "The popularity of the Internet and the advent of the Web 2.0 technologies have transformed the contents of the web from publisherto user-created contents ). Such existence has assisted in publishing contents without the needs of programming. Today, interesting topics, reviews, and opinions from Web 2.0 and social media can easily be accessible globally via the Internet in real time. Moreover, the proliferation and adoption of social media have provided extensive opportunities and challenges for researchers and practitioners. More than a billion of people around the world are using social media platforms that generate overwhelming unstructured data in relatively short timescales. The huge amount of data generated by users is the result of the integration of their background details and daily activities in such platform. This massive amount of generated data referred to as \"big data\" has been intensively researched recently.",
               "The big data from the huge amount of the dataset collected in either structured, semi-structured and/or unstructured format have been researched in various domains, such as healthcare, astronomy, social web, and geoscience . Social media contents, such as tweets, comments, posts, and reviews, have contributed to the creation of big data extensively from either platform providers or different websites ). The emergence of big data from social media has brought about a new wave of excitement into the field of artificial intelligence and data analytics. Analyzing social media data using various traditional data mining and machine learning techniques is still an active domain of research. For instance, revealing market research information can be achieved through mining people's opinions that results in improved business decision making (B. . However, efficient techniques and analytical approaches to handle the ever-growing data generated by various social media applications are of paramount need . Over the last decade, research related to social media has been increasingly growing, and many algorithms related to artificial intelligence and machine learning have been developed.",
               "This study reviews recent works on social media big data analytics using machine learning approaches, provides a broad perspective of the area, and considers challenges and open issues that must be addressed. Perhaps, ) offered the most relevant related work. Other related works include \"an introduction to social network data analytics\" by (Charu C Aggarwal, 2011), \"opinion mining and sentiment analysis\" , and networking for big data (Yu, Liu, Dou, .",
               "The rest of the paper is organized as follows: Section 2 introduces the background of social media, big data analytics, and machine learning. Section 3 provides the taxonomy of big data analytics on social media. Moreover, this section discusses the recent advance in machine learning algorithms that have been developed for big data analytics for social media, particularly the application of deep learning, artificial neural networks, fuzzy systems, swarm intelligence, and evolutionary computation. Section 4 provides the discussion on social media big data analytics. Section 5 highlights the research challenges. Section 6 presents the conclusion and future directions."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 1,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "2.",
               "text": "Social media big data",
               "type": "introduction"
          },
          "paragraphs": [
               "Social media (SM) is a set of Internet-based applications that is grounded by the idea of Web 2.0 (E. . SM was initially used around 2004 to describe contents and applications that can be continuously modified and altered by users in many ways through participation and collaboration, rather than traditionally created, prepared, and published by only individuals . The broad utilization of available software and hardware to access social media platforms over the Internet led to the creation and exchange of user-generated content. listed three aspects to define social media that they referred to as \"social network site\" as web-based services. First, individuals are allowed to create their public or semi-public profile. Second, these individuals are allowed to connect to others to form a network. Last, these individuals are allowed to view and relate to other users and their activities, which are publicized in their network. The terms social media and social media sites have been used interchangeably. In this paper, the term social media refers to any social network sites that have all the three aspects as per Ellison. The examples of social network sites that generate a large amount of unstructured data are Facebook, Twitter, Instagram, LinkedIn, blogs, wikis, and YouTube. Social media big data along with the progress in computational tools have emerged as the key to crucial insights into human behavior and are continually stored and processed by corporations, individuals, and governments .",
               "The most common applications of big data for social media are trend discovery, social media analytics, sentiment analysis, and opinion mining. For instance, social media assists organizations to obtain customers' feedback regarding their products, which can be used to modify decisions and to obtain value out of their business . Studies confirmed that most of the existing approaches to social media big data analysis rely on machine learning techniques . Some of the most common techniques are classification , clustering , and deep learning . Machine learning is a field of artificial intelligence that has been applied in many social media platforms to detect patterns in data. However, dealing with a large amount of data collected from social media with various formats also has brought about some challenges due to the peculiarities of social media such as slang and jargon used in posts. Big data collected from social media are useless until properly utilized to drive decision making by turning a huge amount of social data into meaningful insights . shows the process of big data in social media. First, the data are collected from various social media sources and stored in big data storage technologies that can handle large amounts, such as HDFS, Hbase, and Cassandra. Social media data are noisy and full of irrelevant information for analysis and contain a huge amount of inconsistent data ). The data integration and cleaning are applied to prepare the big data for processing using technologies such as Spark, Hadoop, and Mesos. Finally, the users can be able to view the result data processing via various end devices, such as computers, servers, and smartphones.",
               "In this section, the taxonomy of big data analytics is discussed on the basis of the previous studies concerning social media data. Many studies focused on big data analysis techniques with social media data . Big data analytics is capable of handling various dominant research issues using computational intelligences. Thus, big data analytics on social media is categorized into different classes to grasp their characteristics. The taxonomy offered in this review is an effort to address most of the faults and shortcomings of previous works. shows the numerous categories of big data analytics. The classification is based on four aspects: data sources, characteristic, computational intelligence, and techniques. The proposed classification assists in providing a systematic approach to understand the techniques and technologies of big data analytics used in social media data. illustrates that, for each aspect of the classification, relevant research studies are collected and summarized to provide a background and a deep understanding of the classification. The most related classification found in the literature is discussed in ( , which focused on the big data analytics in the Internet of things. However, this study concerns with the use of machine learning approaches for big data analytics in social media."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 2,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "Social media data sources",
               "type": "introduction"
          },
          "paragraphs": [
               "The widespread popularity of social network has dramatically increased the rate of various data creation. Such increased data generation has drawn attention to the needs of real-time analytics. The variety of data is the different types of structural heterogeneity in a dataset. These different types of datasets are structured, semi-structured, and unstructured data, such as Microblogging, news articles, blog post, internet forum, reviews, and Q&A posts. For instance, M. used AddHealth, Egonet, Facebook 100, and WebKB datasets, which contain networks and node features to evaluate their model. Moreover, Spagnuolo, Maggi, and Zanero (2014) used Bitcoin OTC trust-weighted signed network datasets, which allows the monitoring of the Bitcoin economy through tracing users' money using attached identities. The massive amount of data generated by users is the result of the integration of their background details and daily activities in this platform. All the statuses, tweets, comments, posts, and reviews are the user-generated content. User-generated content is a type of data that typically refers to images, text, and videos. This content comes from regular people and not necessarily in a standard form. Therefore, various quality distributions of user-generated contents occur, which range from high-quality to low-quality things as the data generated by social media sites are naturally fuzzy and unstructured. All these data may incorporate the users' personal opinion, behaviors, and thoughts, which makes the task of extracting high-quality information from such data becoming increasingly important. It is a plentiful area to be discovered for businesses and researchers due to the availability of usergenerated content that possibly encapsulates useful and high-quality information.",
               "Selecting relevant literature reviews is an important task. The selection process is ensured to be comprehensive, unbiased, and an extensive systematic search for all literature pieces that meet the preferred criteria of this paper. The initial search is performed to retrieve literature that is published in credible journals to ensure quality. The selected journals are from a high-impact journal that is referred from Journal Citation Report (JCR), which is annually produced by the Science and Scholarly Research division of Thomson Reuters.",
               "The search process is executed by using the keyword parameter \"social media data analysis\" through Publish or Perish 4 software by for every selected journal. This software allows an efficient search of the literature by analyzing research publications and their citations. The retrieval is initiated in the \"General Citation Search\" category by entering all the specified \"keyword parameter\" (as mentioned above) in \"All of The Words\" field while at the same time restricting the selection of publication year between 2011 and 2017. The \"data source\" field is set to be Google Scholar. Google Scholar is chosen to provide access to a broad range of scholarly literature. depicts that 46% of the current studies perform analysis on tweets produced in microblogging. A total of 17% of these studies perform analysis on reviews by users, such product and movie reviews. The comments are also considered the opinions and views tracked in textual content. Moreover, 10% of these studies use blogpost as their data sources, while news articles and forum posts are used for analysis by 9% and 7% of the selected studies, respectively. A total of 5% of the studies use Q&A posts (from question and answers sites) as their data source. Similarly, tags in sites, such as Tumblr and Flickr, are also used by 5% of the selected studies. shows the summary of social data sources that are used during the analysis in different domains. Microblogs have become a major source of information for users ). Thus, most of the research focuses on microblogs as the main data sources for data analysis, especially in the social domain, descriptive analysis is mostly used in organizations for reporting of events, such as monitoring of sales, departmental, and finance. The descriptive models can quantify, identify, and categorize various relationships/connections in data ). In addition, the descriptive modeling tools can be used to improve additional models that can simulate a considerable number of customized agents and make predictions. such as sentiment, classification, and text analysis."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 3,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.2.",
               "text": "Characteristic",
               "type": "introduction"
          },
          "paragraphs": [
               "The characteristic of analytics in big data can be divided into four types, namely, descriptive, diagnostic, predictive, and prescriptive. shows that summary of the characteristic analytics on social media."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 4,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.2.1.",
               "text": "Descriptive analytics",
               "type": "introduction"
          },
          "paragraphs": [
               "In data processing, descriptive analytics is the initial phase that provides all the necessary historical/past data needed to provide valuable information. Moreover, it can be used in facilitating further data analysis . By a detailed understanding of the successful and failure parts of past data, historical data are provided. Descriptive analytics provides techniques on analyzing data based on this information. Also called as \"post-mortem analysis,\""
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 5,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.2.2.",
               "text": "Diagnostic analytics",
               "type": "introduction"
          },
          "paragraphs": [
               "The diagnostic analytics is an improved type of analytics characterized by techniques, such as data discovery, drill-down, data mining, and data correlations. Diagnostic analytics scrutinizes data or order to answer questions, such as \"For what reason did it happen?\". This analytics thoroughly investigates data to know the detailed behavior and causes of events ( . The diagnostic analytics provides a chance of fast data comprehension and quick attempts to some critical workforce questions. Cornerstone View is an example of diagnostic analytics that provides the speediest and easiest path for management/organizations to acquire valuable knowledge with respect to complex issues. It uses data visualization as an interactive tool that enables managers to enable effortlessly search and filter individuals by integrating data . For instance, managers can uncover significant knowledge about their employees when applying for critical position and the succession metrics and the performance of the existing employees."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 6,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.2.3.",
               "text": "Predictive",
               "type": "introduction"
          },
          "paragraphs": [
               "The predictive analytics transforms data into profitable and actionable information . This analysis utilizes data to decide the possible future result of an event or a possibility for a certain situation to occur. Predictive analytics involves different statistical methods that range from modeling, machine learning, and game theory for analyzing present and past facts to forecast future events. The historical data found in predictive models are used in businesses to identify risks and opportunities. The model identifies the relationships between various factors to permit risk assessment based on a specific set of condition, which will guide the decision-making process. Predictive analytics has three major stages , namely, modeling (predictive), decision examination and optimization, and transaction profiling. The optimization of customers' relationship management system is an example of predictive analytics. It allows the organization to analyze all their customers' data and to predict their customers' behavior. In sum, predictive analytics leads to high benefits and several strong customer relationships ).",
               "How to achieve the best outcome for any given condition?",
               "on demand to increase the online shopping revenues."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 7,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.2.4.",
               "text": "Prescriptive analytics",
               "type": "introduction"
          },
          "paragraphs": [
               "Prescriptive analytics can similarly propose decision opportunities on exploiting a future opportunity or lessen future risks. This analytics demonstrates the effects of every decision opportunity. Practically, prescriptive analytics can constantly and spontaneously process new data to enhance the precision and to offer good decision options . A prescriptive approach is an intensive approach that examines possible decisions, the connections among decisions, and the impacts and results of these decisions, which finally propose an ideal option in real time. The efficiency of predictive analytics depends on the sufficiency of the decision model in capturing the effect of the decisions being analyzed ( ). Furthermore, optimization, game theory, simulation, and decision techniques are the specific approaches employed in prescriptive analytics. Social media platforms have gained popularity of behavior-rich resources and interactive platforms, which offers challenges and opportunities in big data analytics . Moreover, these platforms require an active use of computational intelligence to help understand opinions . Computational intelligence is a new research field, which is defined by as the \"adaptive mechanisms that enable or facilitate intelligent behaviors in complex and changing environments\". shows various classifications of the computational intelligence approaches that are employed on processing a large amount of social data. The classification, as mentioned by ) in his book \"Computational Intelligence: An Introduction,\" is based on artificial neural networks (ANN), fuzzy systems, swarm intelligence, evolutionary computation, and deep learning.",
               "What will happen in next future What trends will continue?",
               "Statistical Methods, Data mining, and Modeling"
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 8,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.3.1.",
               "text": "Artificial neural networks",
               "type": "introduction"
          },
          "paragraphs": [
               "Artificial neural networks is inspired by the brain modeling called neuron or perceptron, which is effluenced by its internal state activation received from input (Fulcher, 2008, pp. 3-78; .  ) used the gas/liquid two-phase flow with principal component analysis to improve the classification accuracy of its flow pattern using support vector machine and fuzzy logic algorithms. Six types of flow patterns for the video have been utilized to covert 2D images for analysis. An image processing technique is used to extract textural and shape features as the inputs to various classification schemes "
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 9,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.3.3.",
               "text": "Swarm intelligence",
               "type": "introduction"
          },
          "paragraphs": [
               "Swarm intelligence is an effective problem-solving technique in artificial intelligence ). This technique employs the concept of swarm, such as ants, bees, and wasps, and intelligence based on the structured collection of interacting organisms or agents . Recently, this technique has been used in analyzing humans' social behavior pattern. For instance, Lv, Shen, Zhao, and Zhu (2016) used a social media platform to provide study on the complicated behavior of human social by proposing a Twitter optimization algorithm based on swarm intelligence. The proposed algorithm offers a good solution with respect to most of the real parameter optimization problems. Moreover, ( ) introduced a new indexing method named hybrid quantum swarm intelligence for social networks. The proposed algorithm is based on the fluctuation detection and optimal weight algorithms for link prediction. Moreover, nature-inspired theory based on swarm intelligence is proposed by to model the behavior of the group of users in various blogs. The idea is to be able to predict the event behavior of a large population during a training phase in an accurate mannar in the future after observing their interactions. analytics affirm that the researchers mainly rely on the backpropagation algorithm for the training of the DNN for big data analytics; however, the backpropagation algorithm is susceptible to falls in local minima. This also has a slow velocity for convergence to the optimum solution during learning. Currently, the long convergence time of the DNN limits the use of DNN to high-cost servers or platforms with multiple GPU cores due to the complex structure of the DNN. Many other studies focused on computational intelligent with respect to social media. For instance, ) applied DNN on feature extraction. The solution is based on a low-level structure for image processing to improve the performance of learning using input data. The analysis of the features is used to improve the edge-preserving filters of the image processing. The result confirms that edge-preserving filters can solve problems, such as noise amplification, edge blurring, and halos."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 10,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.4.",
               "text": "Techniques",
               "type": "introduction"
          },
          "paragraphs": [
               "The big data analytics techniques in social media context are related to natural language processing, sentiment analysis, social network analysis, and news analytics. This section presents important techniques for big data analytics with respect to social media data analysis. These techniques play an important role in improving the business and decision-making through analysis )."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 11,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.3.4.",
               "text": "Evolutionary computation",
               "type": "introduction"
          },
          "paragraphs": [
               "Evolutionary computation (EC) is a subfield of the artificial intelligence that is based on natural evolution and has been successfully used to solve various optimization problems. The concept of ECs has been drawn from the idea of survival of the fittest, natural selection, reproduction, mutation, competition, and symbiosis . Genetic algorithms are among the most useful approaches for multi-objective nonlinear discrete optimization problems. Various implementations of genetic algorithms have been used over the years, such as NSGA-II (non-dominated sorting genetic algorithm) ) and SPEA2 (strength Pareto evolutionary algorithm) ( ). For instance, distributed genetic algorithms have been proposed by ) for the detection of communities in networks. The authors introduced an alternative way to encode the network chromosomes, which greatly optimizes the memory use and computations that offer an efficient and scalable framework. ."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 12,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.4.1.",
               "text": "Modeling",
               "type": "modelling"
          },
          "paragraphs": [
               "Social media analytics deals with managing and evaluating informatics tools for social media data collection, monitoring and analyzing . It is extracting process that provides a suitable pattern for data analyses during conversations and interactions. The analytical processes in social media analytics is divided into three (3) phases, namely, capturing phase, understanding phase and presentation phase. Social media analytics involves the use of different modeling and analytical techniques from various fields (T. H. . In addition, social network graph are used in social network analysis to provide a detail understanding of its fundamental structure, connections, and theoretical properties (C. H. E. ). Its classified the comparative importance of various nodes inside the network."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 13,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.4.2.",
               "text": "Sentiment analysis",
               "type": "modelling"
          },
          "paragraphs": [
               "The sentiment analysis is a class of NLP, text analysis, and statistics. The idea is to find the sentiment of the text by classifying them into positive, negative, or neutral. This analysis is usually used for binary decision making, i.e., users like or dislike something, or the product is good or bad . Sentiment analysis, which is also named as opinion mining, includes categorizing consumer attitudes, emotions, and opinions of a company's product, brand, or service. In social media, sentiment analysis has various uses. For instance, this analysis can be applied to identify the feelings of consumers in a marketing and customer service department, which results into uncovering whether consumers are satisfied or dissatisfied with a product (Povoda, Burget, Dutta, & Sengar, 2017)."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 14,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.3.5.",
               "text": "Deep learning",
               "type": "modelling"
          },
          "paragraphs": [
               "The state-of-the-art literature on the applications of computational intelligence algorithms in social media big datasets shows that the most common algorithms are the deep neural networks (DNN) ( ) and large-scale recurrent ANN. However, these classes of ANN are susceptible to limitations as follows: the DNN is mostly trained using first-order stochastic gradient descent, e.g., the backpropagation training algorithm, which is difficult to parallelize due to its serial execution; the high number of parameters involved in the training of DNN on big data; slow convergence speed, especially for big data; high computational cost; vanishing of gradients; explosion; and the problem of inter-processor communication cost and bottlenecks incurred by the parallelisation algorithms. Previous studies using DNN for big data"
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 15,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.4.3.",
               "text": "Social network analysis (SNA)",
               "type": "modelling"
          },
          "paragraphs": [
               "Social network analysis is based on finding the social relationships between different users from social media using network theory of nodes and connections . Social network analysis has emerged as a key technique in social media applications, such as fraud detection and sociology. This analysis has also gained a significant following in medicine, anthropology, biology, and information science. SNA has become a popular topic of speculation and study. SNA has undergone a renaissance with the ubiquity and quantity of content from social media, web pages, and sensors . Social networks are embedded in many sources of data and at many different scales. Social networks can arise from information in sources, such as text,   To provide a management of the humans and robots interaction using microblogging A novel approach to social data analysis",
               "To study how different sentiment scopes, complement each other.",
               "To cluster a Weibo Message",
               "Observing and analyzing human behaviors during the Hurricane Sandy disaster A scalable social media data analytics system databases , sensor networks, communication systems, and social media (Evans, 2017)."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 16,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "3.4.4.",
               "text": "Text mining",
               "type": "modelling"
          },
          "paragraphs": [
               "Text mining emerges as the most popular techniques in social media for information extraction from numerous types of unstructured contents, such as text, images, and multimedia (Charu C. . A detailed survey on text mining on social media is presented by . In addition, used text mining techniques to compare disorder communities data related to their eating habits based on fitness tracking technology. Three types of eating related to disorder data are collected within three years from comments posted in social media. The data are composed of six subreddits, fitness, and weight management. The results validate that subreddits with pre-disorder are less recovered compared with eating disorder subreddits with the highest frequency of fitness tracker terms. explored whether computerized language analysis methods can be utilized to assess one's suicide risk and emotional distress in Chinese social media. The framework for social media content is proposed by . The authors used empirical study to test the framework during the FIFA World Cup 2014. "
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 17,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "4.",
               "text": "Discussion",
               "type": "modelling"
          },
          "paragraphs": [
               "The literature on the applications of social big media data analytics, as shown in , highlighted the state-of-the-art techniques, methods, and the quality attributes that offer an efficient performance on analyzing social media data. The selected publications listed in are based on the contribution effort on the domain of social media analysis using machine learning, metaheuristic, and evolutionary approaches. Moreover, various categories of the specified purpose of conducting analysis for social media data have been identified on the basis of the reviewed papers. The main focuses of most studies are users' emotion classification, information detection, spatiotemporal, clustering, and performance analysis. Thus, social media plays a vital role on modern data analysis for achieving the meaningful information. Sentiment analysis can be defined as a process of determining favorable or unfavorable opinions toward a specific subject in a texts . On the basis of the review process, sentiment analysis classification approaches have three levels, which are aspect, document, and sentence. The document level is when the prediction of sentiment is made to the entire document based on analysis done to the parts of the document. The sentence level is when the analysis of sentiment is done to the sentence parts to extract the sentiment for that particular sentence. Document and sentence are considered the basic unit of information for each classification. affirmed that no fundamental difference exists between these two as a sentence can be regarded as a short document. Differently, in the aspect level, the prediction of sentiment polarity is based on the aspect of a particular subject rather than on the literal meaning of a word to be analyzed. Furthermore, some features have been identified to correspond to the information detection process, which are mentioned in . They are spatiotemporal-the information about location and occurrence time, temporal-the information about occurrence time, social link-the information about users' network and behavior, semantic-the information related to the meaning of words or terms, sentiment-the information related to users' emotions, and term cooccurrence-the information related to frequency or words or terms. Information extraction from text can be defined as the process of drawing out useful or intended data from text. With regard to the discussion in Hogenboom,  Irony detection Negation approaches: (i) data driven, (ii) knowledge driven, and (iii) hybrid. A data-driven approach does not consider the semantic aspect of the information. This approach requires many data but little domain expertise. Differently, a knowledge-driven approach considers a semantic aspect of text by using linguistic, lexicographic, and human knowledge for the extraction process. This aspect requires considerable domain and expertise knowledge but only little data. A hybrid approach is the combination of both aspects. There are several aspects of research in the text analysis of social media data that have been covered, such as social media data categories, aims, approaches and methods involved, and data platform used for analysis. Social media data analysis is an up-and-coming area to be researched."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 18,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "5.",
               "text": "Research challenges",
               "type": "modelling"
          },
          "paragraphs": [
               "Big data analytics on social media bring significant advantages to companies and individuals regarding good decision making. However, several challenges remain unaddressed. Solving some problems related to big data requires concentrated efforts from the big data research communities, companies, and government to overcome such challenges. development of structure knowledge, such as relationship extraction, speech recognition, automatic summarization, topic segmentation, sentiment analysis, and entity recognition . Social media analysis is a good example of NLP that allows computers to process the unstructured texts collected from social media applications. This processing can be observed in forms, such as topic extraction, relationship extraction, named entity recognition, automatic text summarization, and stemming. NLP is commonly used for text mining, machine translation, and automated question answering ). NLP is characterized as a challenging problem in the area of big social data . The human language is rarely precise or plainly spoken. In comprehending the human language, not only the words but also the context and their relation to each other must be understood. Despite language being one of the easiest things for humans to learn, the ambiguity of the language is what makes natural language processing a difficult problem for computers to master )."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 19,
          "fromPaper": "Social media big data analytics: A survey"
     },
     {
          "head": {
               "n": "6.",
               "text": "Conclusion",
               "type": "conclusion"
          },
          "paragraphs": [
               "1) Data Quality: User-generated content is a type of data that is typically in the form of text, images, and videos. This content comes from regular people and is not necessarily in standard form. Hence, the various quality distributions of user-generated contents range from very high-quality to low-quality things as the data generated by social media sites are naturally fuzzy and unstructured ). All these data may incorporate users' personal opinion, their behaviors, and thoughts, which makes the task of extracting high-quality information from such data increasingly important. It is a plentiful area to be discovered for businesses and researchers due to the availability of a user-generated content that possibly encapsulates useful and high-quality information. 2) Data Locality: Data locality is the major challenge associated with different types of data ). In addition, all machine learning algorithms assume that datasets are located in the memory. However, this assumption is not applicable for big data because the complete data cannot fit into a memory. The data are usually distributed across different files residing in various physical locations. Big data is entirely different from the conventional machine learning that only transfers data to a computing location. Thus, for a successful big data system, the issue data locality of poor processing latency and network traffic must be addressed.",
               "3) Velocity: Most machine learning techniques rely on data availability, which implies that learning cannot start when the entire dataset is unavailable . However, achieving data availability will not be possible in the case of data streaming because of the continuous arrival of new data. Big data velocity deals with the speed and the rate at which the data are processed. The rapid growth in technologies, such as mobile devices and real-time sensor nodes, leads to rapid communication between our environment and other smart devices. Therefore, big data velocity during the development process must be considered. 4) Data Availability: Machine learning techniques solely rely on data availability. Therefore, in machine learning, the entire dataset must be available before learning can begin. Moreover, a model normally learns from the training set and later performs the learned tasks, such as prediction and classification. However, this scenario cannot be achieved in the case of data streaming where new data are continually arriving. 5) Natural language processing (NLP): NLP is an intelligent process of analysis and understands the meaning of the texts from the human language. Many tasks can be performed through the Social media big data along with the progress in computational tools have emerged as the key to crucial insights into human behavior and are continually stored and processed by corporations, individuals, and governments. First, we investigate the recent work on social media big analytics and provide a broad perspective of the area. Second, we classify the literature based on important aspects, such as data sources, characteristics, computational intelligence, and techniques. Third, we compare possible big data analytics techniques and their quality attributes. Fourth, we identify the opportunities with respect to big data analytics on social media. Finally, we describe the open research challenges in big data analytics."
          ],
          "paper_id": "dd88db10-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 20,
          "fromPaper": "Social media big data analytics: A survey"
     }
]