[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "We address the diffusion of information about the COVID-19 with a massive data analysis on Twitter, Instagram, YouTube, Reddit and Gab. We analyze engagement and interest in the COVID-19 topic and provide a differential assessment on the evolution of the discourse on a global scale for each platform and their users. We fit information spreading with epidemic models characterizing the basic reproduction numbers R0 for each social media platform. Moreover, we characterize information spreading from questionable sources, finding different volumes of misinformation in each platform. However, information from both reliable and questionable sources do not present different spreading patterns. Finally, we provide platform-dependent numerical estimates of rumors' amplification."
          ],
          "paper_id": "dd8c0f60-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 0,
          "fromPaper": "The COVID-19 Social Media Infodemic"
     },
     {
          "head": {
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "The World Health Organization (WHO) defined the SARS-CoV-2 virus (initially known as 2019-nCoV) outbreak as a severe global threat . As foreseen already in 2017 by the global risk report of the World Economic forum, global risks are interconnected; in particular, the case of the COVID-19 epidemic (the infectious disease caused by the most recently discovered human coronavirus) is showing the critical role of information diffusion in a disintermediated news cycle .",
               "The term infodemic has been coined to outline the perils of misinformation phenomena during the management of virus outbreaks 2 , since it could even speed up the epidemic process by influencing and fragmenting social response . As an example, CNN has recently anticipated a rumor about the possible lock-down of Lombardy (a region in northern Italy) to prevent pandemics , publishing the news hours before the official communication from the Italian Prime Minister. As a result, people overcrowded trains and airports to escape from Lombardy toward the southern regions before the lock-down was in place, disrupting the government initiative aimed to contain the epidemics and potentially increasing contagion. Thus, an important research challenge is to determine how people seek or avoid information and how those decisions affect their behavior , particularly when the news cycle -dominated by the disintermediated diffusion of information -alters the way information is consumed and reported on. The case of the COVID-19 epidemic shows the critical impact of this new information environment.",
               "The information spreading can strongly influence people behavior and alter the effectiveness of the countermeasures deployed by governments. To this respect, models to forecast virus spreading are starting to account for the behavioral response of the population with respect to public health interventions and the communication dynamics behind content consumption .",
               "Social media platforms such as Youtube and Twitter provide direct access to an unprecedented amount of content and may amplify rumors and questionable information. Taking into account users' preferences and attitudes, algorithms mediate and facilitate content promotion and thus information spreading . This shift of paradigm profoundly impacts the construction of social perceptions and the framing of narratives; it influences policy-making, political communication, as well as the evolution of public debate especially when issues are controversial . Indeed, users online tend to acquire information adhering to their worldviews , to ignore dissenting information and to form polarized groups around shared narratives . Furthermore, when polarization is high, misinformation might easily proliferate . Some studies pointed out that fake news and inaccurate information may spread faster and wider than fact-based news . However, this effect might be platform-specific. The definition of \"Fake News\" may indeed be inadequate since political debate often resorts to label opposite news as unreliable or fake .",
               "In this work we provide an in-depth analysis of social dynamics in a time window where narratives and moods in social media related to the COVID-19 have emerged and spread. While most of the studies on misinformation diffusion focus on a single platform , the dynamics behind information consumption might be particular to the environment in which they spread on. Consequently, in this paper we perform a comparative analysis on five social media platforms (Twitter, Instagram, YouTube, Reddit and Gab) during the COVID-19 outbreak. The dataset includes more than 8 million comments and posts over a time span of 45 days. We analyze user engagement and interest about the COVID-19 topic, providing an assessment of the discourse evolution over time on a global scale for each platform. Furthermore, we model the spread of information with epidemic models, characterizing for each platform its basic reproduction numbers (R 0 ), i.e. the average number of secondary cases (users that start posting about COVID-19) an \"infectious\" individual (an individual already posting on COVID-19) will create. In epidemiology, R 0 is a threshold parameter, where for R 0 < 1 the disease will die out in a finite period of time, while the disease will spread for R 0 > 1. In social media, R 0 > 1 will indicate the possibility of an infodemic.",
               "Finally, coherently with the classification provided by the fact-checking organization Media Bias/Fact Check 4 , we characterize the spreading of news regarding COVID-19 from questionable sources for all channels but Instagram, finding that mainstream platforms are less susceptible to misinformation diffusion. However, information marked either as reliable or questionable do not present significant differences in the way they spread.",
               "Our findings suggest that the interaction patterns of each social media platform combined with the peculiarity of the audience of the specific platform play a pivotal role in information and misinformation spreading. We conclude the paper by measuring rumors amplification parameters for COVID-19 on each social media platform."
          ],
          "paper_id": "dd8c0f60-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 1,
          "fromPaper": "The COVID-19 Social Media Infodemic"
     },
     {
          "head": {
               "n": "1",
               "text": "Results and Discussion",
               "type": "introduction"
          },
          "paragraphs": [
               "We analyze mainstream platforms such as Twitter, Instagram and YouTube as well as less regulated social media platforms such as Reddit and Gab. Gab is a crowdfunded social media whose structure and features are Twitter-inspired. It performs very little control on content posted; in the political spectrum, its user base is considered to be far-right. Reddit is an American social news aggregation, web content rating, and discussion website based on collective filtering of information.",
               "We perform a comparative analysis of information spreading dynamics around the same argument in different environments having different interaction settings and audiences. We collect all pieces of content related to COVID-19 from the 1st of January to the 14th of February. Data have been collected filtering contents accordingly to a selected sample of Google Trends' COVID-19 related queries such as: coronavirus, coronavirusoutbreak, imnotavirus, ncov, ncov -19, pandemic, wuhan. The deriving dataset is then composed of 1,342,103 posts and 7,465,721 comments produced by 3,734,815 users. For more details regarding the data collection refer to SI."
          ],
          "paper_id": "dd8c0f60-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 2,
          "fromPaper": "The COVID-19 Social Media Infodemic"
     },
     {
          "head": {
               "n": "1.1",
               "text": "Interaction patterns",
               "type": "introduction"
          },
          "paragraphs": [
               "First, we analyze the interactions (i.e., the engagement) that users have with COVID-19 topics on each platform. The upper panel of shows users' engagement around the COVID-19. Despite the differences among the single platforms, we observe that they all display a rather similar distribution of the users' activity characterized by a long tail. This entails that users behave similarly for what concern the dynamics of reactions and content consumption. Indeed, users' interactions with the COVID-19 content present attention patterns similar to any other topic . The highest volume of interactions in terms of posting and commenting can be observed on mainstream platforms such as YouTube and Twitter. Then, to provide an overview of the debate concerning the virus outbreak, we extract and analyze all topics related to the COVID-19 content by means of Natural Language Processing techniques. We build word embedding for the text corpus of each platform, i.e. a word vector representation in which words sharing common lexical contexts are in close proximity. Moreover, by running clustering procedures on these vector representations, we separate groups of words and topics that are perceived as more relevant for the COVID-19 debate. For further details see SI. The results , middle panel) show that topics are quite similar across each social media platform. Debates range from comparisons to other viruses, requests for God blessing, up to racism, while the largest volume of interaction is related to the lock-down of flights.",
               "Finally, to characterize users engagement with the COVID-19 on the five platforms, we compute the cumulative number of new posts each day , middle panel). For all platforms, we find a change of behavior around the 20 th of January, that is the day that the World Health Organization (WHO) issued its first situation report on the COVID-19 . The largest increase in the number of posts is the on the 21 st of January for Gab, the 24 th January for Reddit, the 30 th January for Twitter, the 31 th January for YouTube and the 5 th of February for Instagram. Thus, social media platforms seem to have specific timings for content consumption; such patterns may depend upon the difference in terms of audience and interaction mechanisms (both social and algorithmic) among platforms. st of January to the 14 t h of February. Due to limitations in gathering past data using the standard API, the first data point for Twitter is dated January 27 th ."
          ],
          "paper_id": "dd8c0f60-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 3,
          "fromPaper": "The COVID-19 Social Media Infodemic"
     },
     {
          "head": {
               "n": "1.2",
               "text": "Information Spreading",
               "type": "introduction"
          },
          "paragraphs": [
               "Efforts to simulate the spreading of information on social media by reproducing real data have mostly applied variants of standard epidemic models . Coherently, we analyze the observed monotonic increasing trend in the way new users interact with information related to the COVID-19 by means of epidemic models. Unlike previous works, we do not only focus on models that imply specific growth mechanisms, but also on phenomenological models that emphasize the reproducibility of empirical data . Most of the epidemiological models focus on the basic reproduction number R 0 , representing the expected number of infections directly generated by an infected individual for a given time period . An epidemic is considered to be dangerous if R 0 > 1, -i.e., if an exponential growth in the number of infections is expected at least in the initial phase. In our case, we try to model the growth in number of people publishing a post on a subject as an infective process, where people can start publishing after being exposed to the topic. While in real epidemics R 0 > 1 highlights the possibility of a pandemic, in our approach R 0 > 1 indicates the possibility of an infodemic. We model the dynamics both with the phenomenological model of (from now on referred to as the EXP model) and with the standard SIR (Susceptible, Infected, Recovered) compartmental model . Further details on the modeling approach can be found in Section 3.3.",
               "As shown in , each platform has its own basic reproduction number R 0 . As expected, all the values of R 0 are supercritical -even considering confidence intervals (table 1) -signaling the possibility of an infodemic. This observation may facilitate the prediction task of information spreading during critical events.",
               "While R 0 is a good proxy for the engagement rate and a good predictor for epidemic-like information spreading, social contagion phenomena might be in general more complex . For instance, in the case of Instagram, we observe an abrupt jump in the number of new users that cannot be explained with continuous models like the standard epidemic ones; accordingly, the SIR model estimates a value of R 0 ? 10 2 that is way beyond what has been observed in any real-world epidemic. "
          ],
          "paper_id": "dd8c0f60-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 4,
          "fromPaper": "The COVID-19 Social Media Infodemic"
     },
     {
          "head": {
               "n": "1.3",
               "text": "Questionable VS Accurate Information",
               "type": "introduction"
          },
          "paragraphs": [
               "We conclude our analysis by comparing the diffusion of questionable and reliable news on each platform. We tag links as reliable or questionable according to the data reported by the independent fact-checking organization Media Bias/Fact Check 6 . shows, for each platform, the plots of the cumulative number of posts and reactions related to questionable sources versus the cumulative number of posts and interactions referring to reliable sources. By interactions we mean the overall reactions, e.g. likes or other form or endorsement and comments, that can be performed with respect to a post on a social platform. Surprisingly, all the posts show a strong linear correlation, i.e., the number of posts/reactions relying on questionable and reliable sources grows with the same pace inside the same social media platform. We observe the same phenomenon also for the engagement with reliable and unreliable posts. Hence, the growth dynamics of unreliable posts/interactions is just a re-scaled version of the growth dynamics of reliable posts/reactions; however, the re-scaling factor(i.e., the fraction of unreliable over reliable) is strongly dependent on the platform. In particular, we observe that in mainstream social media the number of unreliable posts represent a small fraction of the reliable ones; the same thing happens in Reddit. Among less regulated social media, a peculiar effect is observed in Gab: while the volume of unreliable post is just the ? 70% of the volume of reliable ones, the volume of reactions for unreliable posts is ? 270% bigger than the volume for reliable ones. Such results hint the possibility that different platform react differently to reliable and unreliable news.",
               "To further investigate this issue, we define the amplification factor E as the average number of reactions to a post; hence, E is a measure that quantifies the extent to which a post is amplified in a social media. We observe that the amplification E U (for unreliable posts) and E R (for reliable posts) varies from social media to social media and that assumes the largest values in YouTube and the lowest in Gab. To measure the permeability of a platform to reliable/unreliable news, we then define the coefficient of relative amplification= E U /E R . It is a measure of whether a social media amplifies questionable (> 1) or reliable (< 1) posts. Results are shown in . Among mainstream social media, we notice that Twitter is the most neutral (? 100% i.e. E U ? E R ), while",
               "YouTube cuts out unreliable sources (? 10%). Among less popular social media, Reddit reduces the impact of unreliable sources (? 50%), while Gab strongly amplifies them (? 400%). Overall, our findings suggest that the main drivers of information spreading are related to specific peculiarities of each platform and depends upon the group dynamics of individuals engaged with the topic. . In more popular social media, the number of unreliable posts represent a small fraction of the reliable ones; same thing happens in Reddit. Among less popular social media, a peculiar effect is observed in Gab: while the volume of unreliable post is just the ? 70% of the volume of reliable ones, the volume of engagements for unreliable posts is ? 270% bigger than the volume for reliable ones. Further details concerning the regression coefficients are reported in SI. : The average engagement of a post is the number reaction expected for a post and is a measure of how much a post is amplified in a social media. The average engagements E U (for unreliable post) and E R (for reliable post) vary from social media to social media, and are the largest in Twitter and the lowest in Gab. The coefficient of relative amplification= E U /E R measures whether a social media amplifies more unreliable (> 1) or reliable (< 1) posts. Among more popular social media, we notice that Twitter is the most neutral social media (? 100% i.e. E U ? E R ) while YouTube cuts out unreliable sources (? 10%). Among less popular social media, Reddit reduces the impact of unreliable sources (? 50%) while Gab strongly amplifies them (? 400%)."
          ],
          "paper_id": "dd8c0f60-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 5,
          "fromPaper": "The COVID-19 Social Media Infodemic"
     },
     {
          "head": {
               "n": "2",
               "text": "Conclusions",
               "type": "conclusion"
          },
          "paragraphs": [
               "In this work we perform a comparative analysis on five different social media platforms during the COVID-19 health emergency. Such a timeframe is good benchmark for studying content consumption dynamics around critical events in a historic times when the accuracy of information is threatened. We assess users engagement and interest about the COVID-19 topic and characterize the evolution of the discourse over time. Furthermore, we model the spread of information with epidemic models by providing basic growth parameters for each social media. We then analyze the spreading of questionable information for all channels, finding that Gab is the environment more susceptible to misinformation diffusion. However, information marked either as reliable or questionable do not present significant differences in their spreading patterns. Our analysis suggests that information spreading is driven by the interaction paradigm imposed by the specific social media or/and by the specific interaction patterns of groups of users engaged with the topic. Finally, we conclude the paper by providing COVID-19 rumors amplification parameters for social media platform. We believe that the understanding of social dynamics behind content consumption and social media is an important subject, since it may help to design more efficient epidemic models accounting for social behavior and to implement more efficient communication strategies in time of crisis. reports the data breakdown of the five social platforms. Given the diversity of social media platforms, five different data collection processes have been performed. For Gab, Reddit, YouTube and Twitter data were gathered by the existing API services, while for Instagram no API services were available thus we built our own process. In particular, we manually collected data by visual inspection to build up the database for the analysis."
          ],
          "paper_id": "dd8c0f60-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 6,
          "fromPaper": "The COVID-19 Social Media Infodemic"
     },
     {
          "head": {
               "n": "3.1",
               "text": "Data Collection",
               "type": "conclusion"
          },
          "paragraphs": [
               "Reddit dataset was downloaded from the Pushift.io 7 archive, exploiting the related API. In order to filter contents linketo COVID-19, we selected a group of keywords based on Google Trends' COVID-19 related queries such as: coronavirus, pandemic, coronaoutbreak, china, wuhan, nCoV, IamNotAVirus, coronavirus update, coronavirus transmission, coronavirusnews, coronavirusoutbreak.",
               "In Gab, although no official guides are available, there is an API service that given a certain keyword, returns a list of users, hashtags and groups related to it. We queried all the keywords we selected based on Google Trends and we downloaded all hashtags linked to them. We then manually browsed the results and selected a set of hashtags based on their meaning. For each hashtag in our list, we downloaded all the posts and comments linked to it.",
               "For YouTube, we collected videos by using the YouTube Data API 8 by searching for videos that matched a variety of queries: coronavirus OR coronavirus weapon OR coronavirus epidemic OR coronavirus outbreak OR coronavirus pandemic OR coronavirus conspiracy OR coronavirus news OR nCov-2019 OR #coronavirus OR nCov OR corona virus OR corona-virus OR novelcoronavirus OR wuhanvirus OR novel coronavirus OR wuhan virus OR coronavirus bio-weapon OR corvid-19 OR COVID-19. Then an in depth search was done by crawling the network of videos by searching for more related videos as established by the YouTube algorithm. From the gathered set, we filtered the videos that contained coronavirus OR nCov OR corona virus OR corona-virus OR corvid OR covid OR SARS-CoV in the title or description. We also limited the dataset to the videos published during the analysis period (January 1 to February 14). We then collected all the comments received by those videos. This was done on February 28. For Twitter, we collect tweets related to the topic corona-virus by using both Twitter the search and stream endpoint of the Twitter API 9 using the following queries: coronavirus OR ncov OR coronavirusoutbreak OR wuhan OR iamnotavirus. The data deriving from stream API represent only 1% of the total volume of tweets, further filtered by the selected keywords.The data derived from the search API represent a random sample of the tweets containing the selected keywords up to a maximum rate limit of 18000 tweets every 10 minutes. Since no official API are available for Instagram data, we built our own process to collect public contents related to specific keywords such as: coronavirus, nCov, wuhan, pandemic and imnotavirus. We manually took notes of posts, comments and populated the Instagram Dataset.",
               "The results related to the engagement of users are obtained using only API search results. "
          ],
          "paper_id": "dd8c0f60-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 7,
          "fromPaper": "The COVID-19 Social Media Infodemic"
     },
     {
          "head": {
               "n": "3.2",
               "text": "Text analysis",
               "type": "conclusion"
          },
          "paragraphs": [
               "To provide an overview of the debate concerning the virus outbreak on the various platforms, we extract and analyze all topics related to COVID-19 by applying Natural Language Processing techniques to the written content of each social media. We first build word embedding for the text corpus of each platform, then, to assess the topics around which the perception of the COVID-19 debate is concentrated, we cluster words by running the Partitioning Around Medoids (PAM) algorithm on their vector representations. Word embeddings, i.e., distributed representations of words learned by neural networks, represent words as vectors in R n bringing similar words closer to each other. They perform significantly better than the well-known Latent Semantic Analysis (LSA) and Latent Dirichlet Allocation (LDA) for preserving linear regularities among words and computational efficiency on large data sets . In this paper we use the Skip-gram model to construct word embedding of each social media corpus. More formally, given a content represented by the sequence of words w 1 , w 2 , . . . , w T , we use stochastic gradient descent with gradient computed through backpropagation rule for maximizing the average log probability",
               "where k is the size of the training window. Therefore, during training the vector representations of closely related words are pushed to be close to each other. In the Skip-gram model, every word w is associated with its input and output vectors, u w and v w , respectively. The probability of correctly predicting the word w i given the word w j is defined as",
               "where V is the number of words in the corpus vocabulary. Two major parameters affect the training quality: the dimensionality of word vectors, and the size of the surrounding words window. We choose 200 as vector dimension -that is typical value for training large dataset -and 6 words for the window. Before applying the tool, we reduced to contents written in English language as detected with cld3 . Then we cleaned the corpora by removing HTML code, URLs and email addresses, user mentions, hashtags, stop-words, and all the special characters including digits. Finally, we dropped words composed by less than three characters, words occurring less than five times in all the corpus, and contents with less than three words.",
               "To analyze the topics related to COVID-19, we cluster words by Partitioning Around Medoids (PAM) and using as proximity metric the cosine distance matrix of words in their vector representations. In order to select the number of clusters, k, we calculate the average silhouette width for each value of k. Moreover, for evaluating the cluster stability, we calculate the average pairwise Jaccard similarity between clusters based on 90% sub-samples of the data. Lastly, we produce word clouds to identify the topic of each cluster. To provide a view about the debate around the virus outbreak, we define the distribution over topicsc for a given content c as the distribution of its words among the word clusters. Thus, to quantify the relevance of each topic within a corpus, we restrict to contents c with maxc > 0.5 and consider them uniquely identified as a single topic each. "
          ],
          "paper_id": "dd8c0f60-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 8,
          "fromPaper": "The COVID-19 Social Media Infodemic"
     },
     {
          "head": {
               "n": "3.3",
               "text": "Epidemiological Models",
               "type": "modelling"
          },
          "paragraphs": [
               "To allow predictions, assess the impact of policies, and thus to define optimal control/communication strategies, it is important to model the dynamics observed from data. Several mathematical models can be used to analyse potential mechanisms that underline epidemiological data; generally, we can distinguish among phenomenological models that emphasize the reproducibility of empirical data without insights in the mechanisms of growth, and more insightful mechanistic models that try to incorporate such mechanisms . To fit our cumulative curves, we first use the adjusted exponential model of since it naturally provides an estimate of the basic reproduction number R 0 . This phenomenological model (from now on indicated as EXP) has been successfully employed in data-scarce settings and shown to be on-par with more traditional compartmental models for multiple emerging diseases like Zika, Ebola, and Middle East Respiratory Syndrome .",
               "The model is defined by the following single equation:",
               "Here, I is incidence, t is the number of days, R 0 is the basic reproduction number and d is a damping factor accounting for the reduction in transmissibility over time.In our case, we interpret I as the number C auth of authors that have published a post on the subject. As a mechanistic model, we employ the classical SIR model . In such a model, a susceptible population can be infected with a rateby coming into contact with infected individuals; however, infected individuals can recover with a rate. The model is described by a set of differential equations:",
               "where S is the number of susceptible, I is the number of infected and R is the number of recovered. In our case, we interpret the number I + R as the number C auth of authors that have published a post on the subject. In the SIR model, the basic reproduction number R 0 =/corresponds to the ration among the rate of infection by contactand the rate of recovery. Notice that for the SIR model, vaccination strategies correspond to bringing the system in a situation where S < N/R 0 ; in such a way, both the number of infected will decrease.",
               "To estimate the basic reproduction numbers R EXP 0",
               "and R SIR 0",
               "for the EXP and the SIR model, we use least square estimates of the models' parameters . The range of parameters is estimated via bootstrapping ."
          ],
          "paper_id": "dd8c0f60-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 9,
          "fromPaper": "The COVID-19 Social Media Infodemic"
     },
     {
          "head": {
               "n": "3.4",
               "text": "Regression Table of Figure 3",
               "type": "modelling"
          },
          "paragraphs": [
               "Table 5 reports the regression coefficients and R 2 values displayed in . We observe an overall high value of R 2 meaning a strong explanatory power of the performed linear regressions."
          ],
          "paper_id": "dd8c0f60-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 10,
          "fromPaper": "The COVID-19 Social Media Infodemic"
     },
     {
          "head": {
               "n": "3.5",
               "text": "Matching ability",
               "type": "modelling"
          },
          "paragraphs": [
               "We consider all the posts in our dataset that contain at least one Uniform Resource Locator (URL) linking to a website outside the related social media (e.g., tweets pointing outside Twitter). We separate URLs in two main categories obtained using the classification provided by MediaBias/FactCheck (MBFC  .",
               "news outlet and the average score determined the bias of the outlet, as explained in the Methodology Section of the website. Accordingly, to each news outlet is associated a label that refers either to a political bias, namely, Right, Right-Center, Least-Biased, Left-Center and Left or to its reliability that is expressed in three labels namely, ConspiracyPseudoscience, Pro-Science or Questionable. Noticeably, also the Questionable set include a wide range of political bias, from Extreme Left to Extreme Right. For instance, the Right label is associated to Fox News, the Questionable label to Breitbart (the well-known extreme right outlet) and the Pro-Science label to Science. Using such a classification, we assign to each of these outlets a binary label that partially stems from the labelling provided by MBFC. Indeed, we divide the news outlets into Questionable outlets and Reliable outlets. All the outlets already classified as Questionable or belonging to the category Conspiracy-Pseudoscience are labelled as Questionable, the rest is labelled as Reliable.",
               "Considering all the 2637 news outlets that we retrieve from the list provided by MBFC we end up with 800 outlets classified as Questionable 1837 outlets classified as Reliable.",
               "Using such a classification we quantify our overall ability to match and labels domains of posts containing URLs (that are expanded in case they come in their shortened form). Our matching ability is reported in : Number of posts containing a URL, matching ability and classification for each of the five platforms.",
               "The matching ability that, in some cases like YouTube is pretty low, doesn't refer to the ability of identifying known domain but to the ability of finding the news outlets that belong to the list provided by MBFC. Indeed in all the social networks we find a strong tendency towards linking to other social media post that we are unable to match. The percentage of inter and intra-linking of social media is reported in "
          ],
          "paper_id": "dd8c0f60-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 11,
          "fromPaper": "The COVID-19 Social Media Infodemic"
     }
]