[
     {
          "paragraphs": [
               "Asian Pacific Journal of Letter to Editor Zoonoses Research Center, Jahrom University of Medical Sciences, Jahrom, Iran"
          ],
          "paper_id": "dd8de420-9018-11ea-9ac1-1bc38575703c",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 0,
          "fromPaper": "Using twitter and web news mining to predict COVID-19 outbreak"
     },
     {
          "head": {
               "text": "Asian Pacific Journal of Tropical Medicine",
               "type": "introduction"
          },
          "paragraphs": [
               "In December 2019, a cluster of severe respiratory infections were based automatic system can monitor, evaluate, and categorize news, reported in Wuhan, Hubei Province, China. At the beginning, it which, in addition to managing news articles, it is also applied in the appeared that some patients had a history of attending or working field of advisory systems .",
               "in the wholesale fish and seafood market . The market was Social networks fall into six groups as follows SARS and is a subspecies of Sarbecovirus. The virus is temporarily",
               "The Twitter social networking is a micro-blogging platform named the 2019-nCoV virus and the Coronavirus Study Group considered by researchers as a result of useful applications. There has nominated the virus as SARS-CoV-2 .",
               "are over 320 million active subscribers on the social network, which On January 11, 2020, the first deaths from the virus were reported daily generates approximately 6 million tweets containing instant in China, and more positive cases from other countries such as news and comments; due to the wealth of information and their easy Thailand, Japan, South Korea, and the United States of America access. Twitter has extensive applications, such as the predicting were reported by January 20, 2020, and the transmission of a political process, investigating the effectivity of a product, individual-to-health care, further complicated the situation . monitoring the events pertaining to the health and hygiene .",
               "Coronaviruses are zoonotic, meaning they are transmitted between Approximately 23% of Twitter subscribers are adults and on a daily animals and people, but the ways in which it is transmitted, animal basis, a total of approximately 500 million Tweets are broadcasted reservoirs, prophylaxis, and precise clinical manifestations requires each day . more investigation. There is currently no vaccine and appropriate",
               "In the model presented in this study, unstructured data on a novel treatment for COVID-19, so a high index of clinical suspicion and coronavirus (2019-nCoV) are extracted from Twitter and then inquiring about the history of travel and contact from patients with subjected to text cleaning, so-called screening or filtering, and fever and respiratory symptoms play a critical role in the prevention and control of the disease . of many researchers .",
               "Web news mining is one of the most significant tools and the subset Kia Jahanbin et al./ Asian Pacific Journal of finally classification operations. Since the focus is on real-time evolving of the TSK of mining, monitoring, storage and visualization programming, this model is implemented using a fuzzy rule-based of news and tweets about preparing our COVID-19. To execute the evolutionary algorithm called Eclass1-MIMO."
          ],
          "paper_id": "dd8de420-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 1,
          "fromPaper": "Using twitter and web news mining to predict COVID-19 outbreak"
     },
     {
          "head": {
               "text": "method, more than 364 080 clean and integrated tweets and news",
               "type": "introduction"
          },
          "paragraphs": [
               "One of the most effective ways to prevent and control epidemics is were then categorized using the Eclass1-MIMO method and finally to monitor and track the news and social networks about the spread viewed in real time on the world map.",
               "of infectious diseases. In this study, the FAMEC method was used In the recent years, a significant number of researchers have been to send an alert message to surveillance systems for timely detection working on categorizing, clustering, analyzing emotions, thinking outbreaks of the COVID-19. and developing recommenders based on social data, but most of The FAMEC method has four main phases as follows:",
               "these works have focused on either news websites or Twitter."
          ],
          "paper_id": "dd8de420-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 2,
          "fromPaper": "Using twitter and web news mining to predict COVID-19 outbreak"
     },
     {
          "head": {
               "n": "1.",
               "text": "Clearing and integrating data and extracting vocabulary; 2. Web",
               "type": "introduction"
          },
          "paragraphs": [
               "The evolving fuzzy algorithm with the Eclass1-MIMO method was and tweet crawling; 3. Applying fuzzy rules and storing data using used in the study of Iglesias for classifying six areas of knowledge, fuzzy classifier. 4. Visualizing and sending messages.",
               "health, technology, sports, arts and commerce . Also, Jahanbin et al.",
               "The visualization component of the suggested method aims to assist used web news mining in infectious disease surveillance systems to in real-time monitoring and tracking of the beginning and spread of timely diagnose epidemics . outbreaks, which can greatly contribute to the effectiveness of public",
               "The geographical origins of tweets posted about COVID-19 were health surveillance systems in this area.",
               "found to be consistent with the formal WHO report about incidence networks, using the web news mining of these network used by each shows the results obtained from the monitoring of a novel community, the geographical and demographical of the users can be coronavirus (2019-nCoV) related news in the study period, which identified accurately. This is due to the fact that these network report are associated to 364 080 tweets from 179 534 users. The most easily statistical data with the most comments, photos, videos, etc.",
               "Tweets about the coronavirus have been from the US (42.1%), China on COVID-19. This helps to predict morbidity rates in each region, (13.0%), Italy (11.8%) and Australia (6.6%). This is consistent with and bring attention of policy-maker in the health care systems to the report of the cases which was obtained from the WHO . In purposefully implement educational programs in the regions where this study, a new method based on fuzzy algorithm was applied for exposed to higher risks. Finally, this can help to reduce the incidence case and even mortality in communities. "
          ],
          "paper_id": "dd8de420-9018-11ea-9ac1-1bc38575703c",
          "paragraphNo": 3,
          "fromPaper": "Using twitter and web news mining to predict COVID-19 outbreak"
     }
]