[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "The problem of finding the optimal set of source nodes in a diffusion network that maximizes the spread of information, influence, and diseases in a limited amount of time depends dramatically on the underlying temporal dynamics of the network. However, this still remains largely unexplored to date. To this end, given a network and its temporal dynamics, we first describe how continuous time Markov chains allow us to analytically compute the average total number of nodes reached by a diffusion process starting in a set of source nodes. We then show that selecting the set of most influential source nodes in the continuous time influence maxi-mization problem is NP-hard and develop an efficient approximation algorithm with provable near-optimal performance. Experiments on synthetic and real diffusion networks show that our algorithm outperforms other state of the art algorithms by at least ?20% and is robust across different network topologies. Influence spread maximization tackles the problem of selecting the most influential source node set of a given size in a diffusion network. A diffusion process that starts in such an influential set of nodes is expected to reach the greatest number of nodes in the network. In information propagation, the problem reduces to choosing the set of blogs and news media sites that together are expected to spread a piece of news to the greatest number of sites. In viral marketing, it consists of identifying the most influential set of trendsetters that together may influence the greatest number of customers. Finally, in epidemiology, the influence maximization problem reduces to finding the set of individuals that together are most likely to spread an illness or virus to the greatest percentage of the population. In this latter case, the solution of the influence maximization problem helps towards developing vaccination and quarantine policies."
          ],
          "paper_id": "20d4ad70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Influence Maximization in Continuous Time Diffusion Networks"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "In recent years, there has been an increasing effort in uncovering, understanding, and controlling diffusion and propagation processes in a broad range of domains: information propagation ( , social networks ( ), viral marketing ( , and epidemiology ( ). Diffusion networks have raised many research problems, ranging from network inference ( ) to influence spread maximization ( . In this article, we pay attention to the latter problem, and we propose a method for continuous time influence maximization that accounts for the temporal dynamics of diffusion networks.",
               "In our work, we build on the fully continuous time model of diffusion recently introduced by . This model accounts for temporally heterogeneous interactions within a diffusion network -it allows information (or influence) to spread at different rates across different edges, as shown in real-world examples. We first describe how, given a set of source nodes, we can compute the average total number of infected nodes analytically using the work of . The key observation is that the infection time of a node in a network with stochastic edge lengths is the length of the stochastic shortest path from the source nodes to the node. Later, we show that finding the optimal influential set of source nodes in the continuous time influence maximization problem is a NP-hard problem. We then provide an approximation algorithm that finds a suboptimal set of source nodes with provable guarantees in terms of the average total number of infected nodes. Related work. were the first to study influence maximization as an algorithmic problem, motivated by marketing applications. In their work, they proposed heuristics for choosing a set of influential customers with a large overall effect on a network, and methods to infer the influence of each customer were de-veloped. posed influence maximization in a social network as a discrete optimization problem. They showed that the optimal solution is NP-hard for several models of influence, and obtained the first provable approximation guarantees for efficient algorithms based on a natural diminishing property of the problem, submodularity. Since then there have been substantial developments that build on their seminal work. Efficient influence maximization that uses heuristics to speed up the optimization problem has been proposed and influence maximization has been studied on the context of competing cascades or under additional constraints ( ). a node j, where t i and t j are infection times andi,j is the transmission rate. We assume that the likelihood depends on the pairwise transmission ratei,j and the time difference (t j ? t i ) (i.e., it is time shift invariant). Moreover, a node cannot be infected by a node infected later in time (i.e., t j > t i ) and asi,j0, the expected transmission time becomes arbitrarily long.",
               "However, to the best of our knowledge, previous work on influence maximization has ignored the underlying temporal dynamics governing diffusion networks -once a transmission occurs, it always occurs at the same rate or temporal scale. In contrast, we consider heterogeneous pairwise transmission rates, found in many real-world examples. In information propagation, news media sites and professional bloggers typically report news faster than people that maintain personal blogs. In epidemiology, people meet each other with different frequencies and then the pairwise transmission rates between individuals within a population differ. Finally, in viral marketing, some customers make up their minds about a product or service quicker than others, and then pass recommendations on at different rates.",
               "In the remainder of the paper, we consider the exponential distribution f (t j |t i ;i,j )e ?i,j (tj ?ti) to model pairwise interactions for the sake of simplicity. The exponential model is a well-known parametric model for modeling diffusion and influence in social and information networks ( . However, our results can easily be extended to diffusion networks with phase-type pairwise transmission likelihoods. This is important since the set of phase-type distributions is dense in the field of all positive-valued distributions and it can used to approximate power-laws, which have been also used for modeling diffusions in social networks ( , Rayleigh distributions, which have been used in epidemiology ( , and also subprobability distributions, which enable us to describe two step traditional diffusion models ( , in which with probability (1 ?) an infection may never occur.",
               "The main contribution of our work is twofold. First, it considers a novel continuous time formulation of the influence maximization problem in which information or influence can spread at different rates across different edges, as in real-world examples. Second, this continuous time approach allows us to analytically compute and efficiently optimize the influence (i.e., average total number of infections), avoiding the use of heuristics or Monte Carlo simulations ( )."
          ],
          "paper_id": "20d4ad70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Influence Maximization in Continuous Time Diffusion Networks"
     },
     {
          "head": {
               "n": "2.",
               "text": "Problem formulation",
               "type": "modelling"
          },
          "paragraphs": [
               "In this section, we build on the fully continuous time model of diffusion recently proposed by . We start by describing how the diffusion model accounts for pairwise interactions and then continue discussing some basic assumptions about diffusion processes. We conclude with a statement of the continuous time influence maximization problem.",
               "Pairwise transmission likelihood. In a diffusion network, we first need to model the pairwise interactions between nodes. We pay attention to the general case in which different pairwise interactions between nodes in the network occur at different rates. Define f (t j |t i ;i,j ) as the conditional likelihood of transmission between a node i and Continuous time diffusion process. We consider diffusion and propagation processes that occur over static networks with known (or inferred) connectivity and transmission rates. A diffusion process starts when a source node set A becomes infected at time t = 0 by action of an external source to the network. Then, source nodes try to infect their children (i.e., neighbors that they can reach directly through an outgoing edge). Once a child i gets infected at time t i , it tries to infect her own children, and so on. For some pairwise transmission likelihoods, it may happen that t iand child i is never infected. Here, we assume that a node i becomes infected as soon as one of its parents (i.e., neighbors that are able to reach node i through an outgoing edge) infects it, and later infections by other parents do not contribute anymore towards the evolution of the diffusion process. As a consequence of this assumption, at any time t0 there may be some nodes and edges in the network that are useless for the spread of the information (be it in the form of a meme, a sales decision or a virus) towards a specific node n. If these nodes get infected and transmit the information to other nodes, this information can only reach n through previously infected nodes. Therefore, the infection time t n of node n does not depend on these nodes.",
               "Finally, given a diffusion process that started in the set of source nodes A, we define N (A; T ) as the number of nodes infected up to time T and then define the influence function (a) t1: |I| = 2, |Un| = 2, |Xn| = 4 (b) t2: |I| = 3, |Un| = 4, |Xn| = 7 (c) X? * n : A ? X . Panels (a,b): Sets of infected nodes (I; in red) and useless nodes (Un; in orange) at two different times for a diffusion process that starts in the source node set A = {3, 5} relative to a particular sink node (n; in black) . Any path from a useless node to the sink node is blocked by an infected node. The set of disabled (Xn) nodes is simply the union of the sets of infected and useless nodes. Panel (c): Sets of disabled nodes X? * n such that A ? X. They represent the states that we need to describe the temporal evolution of a diffusion process towards the sink node n that starts in the set of sources A.",
               "(A; T ) as the average total number of nodes infected up to time T , i.e.,(A; T ) = EN (A; T )."
          ],
          "paper_id": "20d4ad70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Influence Maximization in Continuous Time Diffusion Networks"
     },
     {
          "head": {
               "text": "Continuous time influence maximization problem.",
               "type": "modelling"
          },
          "paragraphs": [
               "Our goal is to find the set of source nodes A in a diffusion network G that maximizes the influence function(A; T ). In other words, the set of source nodes A such that a diffusion process in G reaches, on average, the greatest number of nodes before a window cut off T . Thus, we aim to solve: cut-off. Therefore, we need to compute the probability of infection P (t nT |A) for each node n in the network. Note that whenever nA, the probability of infection P (t nT |A) is trivially 1. We will refer to node n as sink node.",
               "|A|k Revisiting the basic assumptions about a diffusion process that we presented in Section 2, we recall some definitions to describe its temporal evolution as in . Given a diffusion network G = (V, E), a set of nodes B ? V , and a node nV , we define the set of nodes blocked by or dominated by B:",
               "where the source set A is the variable to optimize and the time horizon T and the source set cardinality k are constants.",
               "S n (B) ={uV : any path from u to n in G visits at least one node in B}."
          ],
          "paper_id": "20d4ad70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Influence Maximization in Continuous Time Diffusion Networks"
     },
     {
          "head": {
               "text": "PMIA",
               "type": "modelling"
          },
          "paragraphs": [
               "of infected nodes as I(t|A), the set of useless nodes as U n (t|A), and the set of disabled nodes (i.e., infected or useless) as X n (t|A). Useless nodes are nodes that if they get infected and transmit the information to other nodes, this information can only reach the sink node n through previously infected nodes. Figures 1(a) and 1(b) illustrate the set of infected nodes (I) and the set of useless nodes (U n ) for a diffusion process in a small network at two different times. Note that the set of disabled nodes (X n ) is composed of the sets of infected (I) and useless nodes (U n ). By definition of S n (), U n (t|A) = S n (I(t|A))\\I(t|A) and X n (t|A) = S n (I(t|A)). Now, by studying the temporal evolution of X n (t|A) we will be able to compute P (t nT |A).",
               "where S 1 and S N denote respectively the first and last state of the CTMC. The length of the fastest (shortest) path is thus equivalent to the time until the CTMC {X n (t|A), t0} becomes absorbed in the final state S N starting from state S 1 (i.e., the state in which only the source nodes in A are infected). Then, computing the probability of infection of the sink node P (t nT |A) reduces to computing the distribution of time of the sink state of the CTMC. Such distributions are called continuous phase-type distributions. Their generator matrix Q and the cumulative density function satisfy ):",
               "First, for a diffusion process that starts in the set of source nodes A, it can be shown that the set of disabled nodes X n (t|A) at any time t0 belongs to ? where e ST denotes the exponential matrix, S is the submatrix of Q that results from removing the column and row associated to the last state S N , and S 0 = ?S1. By construction, {X n (t|A), t0} has the structure of a DAG and it is usually sparse. Then, S is upper triangular, sparse and e ST can be computed efficiently. * n . Theorem 1. ) Given a set of source nodes A, a sink node n and any time t0, X n (t|A)? * n .",
               "As noted in , this approach can be easily extended to diffusion networks with phase-type transmission likelihoods, which can approximate power-laws, Rayleigh or subprobability distributions. (c) enumerates all sets of disabled nodes X? * n such that A ? X for the small network depicted in Figures 1(a) and 1(b). They represent the states that we need to describe the evolution of a diffusion process that starts in the set of sources A relative to the sink node n. Now, assuming independent pairwise exponential transmission likelihoods in the diffusion network, the following Th. applies: ) Given a set of source nodes A, a sink node n and independent pairwise exponential Maximizing the influence. We have shown how to analytically evaluate our objective function(A; T ) for any set of sources A. However, optimizing(A; T ) with respect to the set of sources A seems to be a cumbersome task and naive brute-force search over all k node sets is intractable even for relatively small networks. Indeed, we cannot expect to find the optimal solution to the continuous time influence maximization problem defined by Eq. 1 since it is NP-hard:  Consider now the sets of nodes A ? A? V , and a node a such that a /A. Using the definition of submodularity,",
               "By construction,(?, T ) = 0 and(A; T )0. It also follows trivially that(A; T ) is monotonically nondecreasing in the set of source nodes A, i.e.,(A; T )(A; T ), whenever A ? A. Fortunately, we now show that the objective function(A; T ) is a submodular function in the set of source nodes A. A set function F : 2 WR mapping subsets of a finite set W to the real numbers is submodular if whenever A ? B ? W and sW \\ B, it holds that F (A{s}) ? F (A)F (B{s}) ? F (B), i.e., adding s to the set A provides a bigger marginal gain than adding s to the set B. By this natural diminishing returns property, we are able to find a provable near-optimal solution to our problem:",
               "and thus?t (A; T ) is submodular. Then, it follows that(A; T ) is also submodular.",
               "A well-known approximation algorithm to maximize monotonic submodular functions is the greedy algorithm. It adds nodes to the source node set A sequentially. In step k, it adds the node a which maximizes the marginal gain(A k?1{a}; T ) ?(A k?1 ; T ). The greedy algorithm finds a source node set which achieves at least a constant fraction (1 ? 1/e) of the optimal ( ).",
               "Theorem 4. Given a network G = (V, E), a set of nodes A ? V and a time horizon T , the influence function(A; T ) is a submodular function in the set of nodes A.",
               "Proof. We follow the proof of Th. 2.2 in . For simplicity, we assume that the infection time of all nodes in A is t = 0; the results generalize trivially. Consider the probability distribution of all possible time differences between each pair of nodes in the network. Thus, given a sample ?t in the probability space, we define?t (A; T ) as the total number of nodes infected in a time less than or equal to T for ?t.",
               "Moreover, we can also use the submodularity of(A; T ) to acquire a tight online bound on the solution quality obtained by any algorithm: Theorem 5 ( ). For a source set?Aset? set?A ? V with k sources and a node aV \\ ? A, leta =( ? A{a}; T )?( ? A; T ) and a 1 , . . . a k be the sequence of k nodes witha in decreasing order. Then, max |A|k(A;",
               "Lazy evaluation ( can be employed to speed-up the computation of the on-line bound for our algorithm, that we will refer as INFLUMAX.",
               "Speeding-up INFLUMAX. We can speed up our algorithm by implementing the following speed-ups:",
               "Define R ?t (k; T ) as the set of nodes that can be reached from node k in a time shorter than T . It follows trivially that?t (A; T ) = |kA R ?t (k; T )|. Define R ?t (k|N ; T ) as the set of nodes that can be reached from node k in a time shorter than T and at the same time cannot be reached in a time shorter than T from any node in Lazy evaluation (LE, ): it dramatically reduces the number of evaluations of marginal gains by exploiting the submodularity of(A; T ).",
               "Localized source nodes (LSN): for each node n, we speed up the computation of P (t nT |A) by ignoring any aA whose shortest path to n traverses more than m nodes.  Limited transmission paths (LTP): for each node n, we speed up the computation of P (t nT |A) by ignoring any path from aA to n that traverses more than m nodes.",
               "LSN and LTP should be used with care since they provide an approximate P (t nT |A). In the remainder of this article, if not specified, we run INFLUMAX with LE but avoid using LSN and LTP."
          ],
          "paper_id": "20d4ad70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Influence Maximization in Continuous Time Diffusion Networks"
     },
     {
          "head": {
               "n": "4.",
               "text": "Experimental evaluation",
               "type": "experiment"
          },
          "paragraphs": [
               "transmission ratesj,i , our aim is to find the most influential subset of k nodes, i.e., the subset of nodes that maximizes the spread of information up to a time T . In the traditional greedy algorithm, PMIA and SP1M, we ignore any of the transmission rates and consider all network edges to be active with probability 1, i.e., we do not consider the temporal dynamics. We did not need to use Montecarlo in the traditional greedy algorithm since we assume all edges to be always active.",
               "We evaluate our algorithm INFLUMAX on (i) synthetic networks that mimic the structure of real networks and on (ii) real networks inferred from the MemeTracker dataset 1 by using NETRATE's public implementation ( ). We show that INFLUMAX outperforms three state of the art algorithms: the traditional greedy algorithm ( ), PMIA ( ) and SP1M ( ).",
               "Solution quality. First, we compare INFLUMAX to exhaustive search and several state of the art algorithms on a small network. By studying a small network in which exhaustive search can be run, we are able estimate exactly how far INFLUMAX is from the NP-hard to find optimum. We then compare INFLUMAX to the state of the art on different large networks. Running exhaustive search on large networks is computationally too expensive and we compute instead the tight on-line bound from Th. 5."
          ],
          "paper_id": "20d4ad70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Influence Maximization in Continuous Time Diffusion Networks"
     },
     {
          "head": {
               "n": "4.1.",
               "text": "Experiments on synthetic data",
               "type": "experiment"
          },
          "paragraphs": [
               "Experimental setup. We perform experiments on two types of synthetic networks that mimic the structure of directed social networks: Kronecker ( and Forest Fire (scale free) ) networks. We consider three types of Kronecker networks with very different structure: random  First, we generate a network G using one of the network models cited above. Then, we draw a transmission rate for each edge (j, i)G from a uniform distribution. We can control the transmission rate variance across edges in the network by tuning the parameters values of the distribution. In social networks, transmission rates model how fast information spreads across the network. Given G and the We compare INFLUMAX to several state of the art methods on a small core-periphery Kronecker network with 35 nodes and 39 edges and transmission rates drawn from a uniform distribution? U (0, 10). We summarize the results in . In addition to INFLUMAX and three state of the art methods, we also run a baseline that simply chooses the set of sources randomly. For all methods, we compute the influence they achieve by evaluating Eq. 2 for the set of sources selected by them. Surprisingly, INFLUMAX achieves in most cases the optimal influence that exhaustive search gives but several order of magnitude faster. In other words, the solution given by INFLU-MAX may be in practice much closer to the NP-hard to find optimum than (1 ? 1/e), the theoretical guarantee given by , and it outperforms other methods by 20%. Now, we focus on different large synthetic networks. Figure 2 shows the average total number of infected nodes against number of sources that INFLUMAX achieves in comparison with the other methods on a 512 node ran- single CPU (2.3 Ghz Dual Core with 4 GB RAM). We use hierarchical Kronecker networks with an increasing number of nodes but approximately the same network density since real networks are usually sparse. Remarkably, the number of hops that we use in localized source nodes and limited transmission paths result in an approximation error for the influence(A; T ) of at most 10%, while achieving an speed-up of ?5x for the largest network (2,048 nodes). . Influence(A; T ) for time horizon T = 1 against number of sources for (a) a 1,000 node real diffusion network that we infer from hyperlinks cascades and (b) a 1,000 node real diffusion network that we infer from MemeTracker cascades. The proposed algorithm INFLUMAX outperforms all other methods by 20-25%."
          ],
          "paper_id": "20d4ad70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Influence Maximization in Continuous Time Diffusion Networks"
     },
     {
          "head": {
               "n": "4.2.",
               "text": "Experiments on real data",
               "type": "experiment"
          },
          "paragraphs": [
               "dom Kronecker network, a 1,024 node hierarchical Kronecker network and a 1,024 node Forest Fire (scale free) network. All three networks have approximately 2 edges in average per node. We set the time horizon to T = 1.0 and the transmission rates are drawn from a uniform distribution? U (0, 5). INFLUMAX typically outperforms other methods by at least 20% by exploiting the temporal dynamics of the network. We also compare INFLUMAX with the on-line bound from Th. 5. shows the average number of infected nodes against number of sources that INFLUMAX achieves in comparison with the on-line bound for the small core-periphery Kronecker network and the large hierarchical Kronecker network that we used previously. If we pay attention to the value of the bound on the small network for source set sizes significantly smaller than the number of nodes in the network, we observe that the bound value on the influence is not as close to the optimal value given by exhaustive search as we could expect. That means that although the bound is not very tight on the large network, we may be actually achieving in practice an almost optimal value on that network too.",
               "Experimental setup. We used the publicly available MemeTracker dataset, which contains more than 172 million news articles and blog posts ( ). We trace the information in two different ways and then infer two different diffusion networks using NET-RATE ( ).",
               "Influence vs. time horizon. Intuitively, the smaller the time horizon, the more important the temporal dynamics become when choosing the subset of most influential nodes of a given size. shows the average total number of infected nodes against time horizon for a hierarchical Kronecker network with 1,024 nodes and approx. 2 edges per node. We consider a source set of cardinality |A| = 10 and we draw the transmission rate of each edge from a uniform distribution? U (0, 5). The experimental results for all transmission rates configurations confirm the initial intuition, i.e., the difference between INFLUMAX and other methods is greater for small time horizons.",
               "First, we find more than 100,000 hyperlink cascades in the MemeTracker dataset. Each hyperlink cascade consists of a collection of time-stamped hyperlinks between sites (in blog posts) that refer to closely related pieces of information. From the hyperlink cascade data, we infer an underlying diffusion networks with the top (in terms of hyperlinks) 1,000 media sites and blogs. Second, we apply the MemeTracker methodology ( ) to find 343 million short textual phrases. We cluster the phrases to aggregate different textual variants of the same phrase and consider the 12,000 largest clusters. Each phrase cluster is a MemeTracker cascade. Each cascade consists of a collection of time-stamps when sites (in blog posts) first mentioned any phrase in the cluster. From the MemeTracker cascades, we infer an underlying diffusion network with the top (in terms of phrases) 1,000 media sites and blogs. Then, we sparsify further the networks by keeping the 1,000 fastest edges since it has been shown that in the context of influence maximization, computations on sparsified models give up little accuracy, but improves scalability ).",
               "Running time. shows the average computation time per source added of our algorithm implemented (i) with lazy evaluation, (ii) with lazy evaluation and localized source nodes with m = 6 hops and (iii) with lazy evaluation and limited transmission paths with m = 6 hops on a Solution quality. shows the average total number of infected nodes against number of sources that INFLU-MAX achieves in comparison with other methods for both real networks, that were inferred from the hyperlink cascade and the MemeTracker cascade datasets, as described above. We set the time horizon to T = 1.0. Again, INFLU-MAX outperforms all other methods typically by ?30%, by considering the temporal dynamics of the diffusion. Finally, we also compare INFLUMAX with the on-line bound from Th. 5 for the real network that we inferred from the hyperlink cascade dataset in . Similarly to the synthetic networks, the bound is not as tight as expected."
          ],
          "paper_id": "20d4ad70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Influence Maximization in Continuous Time Diffusion Networks"
     }
]