[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Recently, there has been a dramatic proliferation in the number of blogs; however, little is published about what motivates people to participate in blog activities. Based on the theory of reasoned action, we developed a model involving technology acceptance, knowledge sharing and social influences. A survey of 212 blog participants found strong support for the model. The results indicated that ease of use and enjoyment, and knowledge sharing (altruism and reputation) were positively related to attitude toward blogging, and accounted for 78% of the variance. On the other hand, social factors (community identification) and attitude toward blogging significantly influenced a blog participant's intention to continue to use blogs. Together they explain 83% of the variance of intention to blog. #"
          ],
          "paper_id": "24a23030-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "The growth of Weblogs, also abbreviated to blogs, on the Internet has been phenomenal. Originally an online writing tool that helped its users keep track of their own online records, the blog quickly turned into a key part of online culture. The method provides an easy way for an average person to publish material of any topic he or she wishes to discuss in a web site. With a popular issue, a blog can attract tremendous attention and exert great influence on society. Famous examples include ''War on Terrorism'' after the attacks; the fall of Trent Lott; the controversies of the Iraq war; the 2004 US presidential elections; etc. . The blog has become a new and significant way of information distribution.",
               "Blogs have grown in popularity. According to a survey by Pew Internet & American Life Project, blog readership increased 58% in 2004 . The number of blogs in the U.S. also surged from 29,500 in 2000 to 5,340,000 in 2005 . ''Where there are eyeballs, there are business models'' . Studies have indicated that most blog readers and creators are young, affluent males with high online tenure and that they are loyal online shoppers . Bloggers also value the information in blogs. Thus, businesses and organizations are looking for ways to exploit blogs. For example, to increase the effectiveness of online ads, Google has utilized the uniqueness of each blog and tied its AdSense products to the individual blog. Companies such as Nike and Paramount Picture also advertise through selected blogs as new way to reach potential customers. In fact, the subject-focused nature of blogs has grouped Internet shoppers with similar interests, making it easier to search for targeted customers.",
               "However, despite the great political and cultural influences and possible economic returns, it takes much effort to start and maintain an ''active'' weblog, which not only needs a host (blogger) to update the content regularly, but also requires blog readers to visit and frequently interact with it. Many blog sites have been abandoned soon after their creation . The Perseus reported that they found that 66% had not been updated in two months . Moreover, attracting blog readers was an even harder task: indeed, on average a blog reader spent less than 2 min reading a blog . Thus, the focus of our study was to investigate why blog participants (bloggers and readers) participated.",
               "To participate in blogs, one needs to be willing to use blogging tools provided by blog-hosting services (e.g., Blogger.com and LiveJournal). Also, since blogging is an act of sharing, a new form of socialization, we focused our investigation on three aspects: namely technology acceptance, knowledge sharing and social influence. Findings were expected to shed lights on developing strategies to understand and promote blog usages. satisfaction derived from performing a behavior , while extrinsic motivation emphasizes performing a behavior to achieve specific goals/rewards . Since blogging is a voluntary act which attempts to achieve social interaction, we expected intrinsic motivation would have as much of an impact as extrinsic. Therefore, usefulness, ease of use, and enjoyment were proposed as the factors that reflected the user's beliefs in blog usage."
          ],
          "paper_id": "24a23030-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation"
     },
     {
          "head": {
               "n": "2.1.",
               "text": "TRA and related studies",
               "type": "introduction"
          },
          "paragraphs": [
               "Over the past decade, TRA has become a widely accepted model for exploring an individual's behavior . According to Fishbein and Ajzen, it advocates that a person's behavior is predicted by intentions, and that the intentions are jointly determined by the person's attitude and subjective norm concerning his or her behavior. In recent years, TRA has been used to explain individuals' use of IT (such as expert systems and web site usage behavior ). TRA is a general model, which does not specify beliefs about a particular behavior. Therefore, while researchers have adapted TRA to explain social behavior, salient beliefs need to be considered for a specific extent. For example, Bock and Kim proposed that customers' beliefs about expected rewards, association and contribution had an impact on their attitude toward knowledge sharing in the organization. Additionally, Lu and Lin proposed that customers' beliefs about a particular web site's content, context, and infrastructure had an impact on their attitude toward repetitive transactions on it. Moreover, investigated different beliefs including those about information, interpersonal qualities, about the organization, and regarding tasks that affect user's intentions to share information in an organizational setting."
          ],
          "paper_id": "24a23030-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation"
     },
     {
          "head": {
               "n": "2.2.",
               "text": "Beliefs regarding technology acceptance",
               "type": "introduction"
          },
          "paragraphs": [
               "People's perceptions about blogging technology usage may be developed while they participate. To explain a user behavior, two influential beliefs: perceived usefulness (PU) and perceived ease of use (PE) were incorporated in TRA. Both of these influence the individual's attitude toward using a system, which, in turn, explain the individual's behavioral intention (BI) to use the system. Many studies have been aimed at finding the effect of additional factors that could influence behavior. In fact, research incorporating intrinsic motivation constructs, such as perceived enjoyment has been conducted . They involved the pleasure and While knowledge sharing has been explored at the enterprise-and task-oriented-level, many other forms of knowledge sharing are also occurring due to the ubiquitous nature of the Internet. Among them, blogs can be considered as one of the major ways of knowledge sharing. However, little effort has been devoted on investigating factors that affect blog participants' attitudes. Understanding such issues would not only expand the researchers' horizon in knowledge sharing, but also allow blog-hosting service providers to provide more effective strategies in managing successful blogs.",
               "In the past, knowledge sharing was viewed as a transaction process of knowledge markets, where the knowledge buyers and sellers needed to have reciprocal benefits from the exchange . Thus, expected reciprocal benefits, reputation, altruism and trust were considered as the incentives for knowledge sharing. Nevertheless, factors contributing to the sharing intention were likely to vary in the blog community due to its characteristics. We therefore believed that other determinants affecting knowledge sharing behavior should be included in our study.",
               "In general, social psychologists consider that knowledge sharing motivation has two complementary aspects: egoistic and altruistic . The first was based on economic and social exchange theory. It includes economic rewards. Empirically, Bock and Kim combined the two theories with social cognitive theory to propose expected rewards, expected social associations and expected contribution as the major determinants of an individual's knowledge sharing attitudes. Moreover, Bock et al. applied these two theories to produce two antecedents of sharing attitude: anticipated extrinsic rewards and anticipated reciprocal relationships.",
               "The second, altruistic motive, assumes that an individual is willing to increase the welfare of others and has no expectation of any personal returns. This resembles organization citizenship behavior (OCB), which is discretionary individual behavior, that is not directly or explicitly recognized by a formal reward system, and promotes the effective functioning of the organization . Bolino et al. furthered indicated that OCB would help develop a consolidated relationship between employees and lead to altruistic behavior with an organization. Hars and Ou found that altruism drove students and hobby programmers to participate in open-source projects. Blogging is a voluntary act of sharing among participants. Therefore, those with stronger OCB will tend to be more willing to share their knowledge.",
               "To develop factors of sharing motivation in blogging, we mainly used knowledge sharing factors such as expected reciprocal benefits, reputation, expected relationships, trust, and altruism. Notably, for egoistic motives, we omitted external economic rewards, since blog participation behavior seems to be voluntary and with no economic rewards. However, while bloggers provide knowledge, they expect others' feedback, thus obtaining mutual benefit. In addition, reputation, expected relationships, and trust are likely to provide perceptions of social rewards. Altruism can involve sharing knowledge with passion and being helpful to others, thus improving their welfare. participating in the blog. Theoretically, individuals' perceptions of norms consist of two influences: informational and normative . The first occurs if a user perceives information as enhancing his or her knowledge; the second occurs when a person conforms to the expectations of others in order to obtain a reward or avoid punishment. However, the question whether the effect of norms is still significant should be considered: people use IT because they need to comply with others. Hsu and Lu have found that social norm is a critical factor and positively influences an individual's online game usage. Many studies also verified the effect of norms on intention to use Internet-related service . These show that the social norm stems from the influence of reference groups. Thus we felt that the effect of norm should not be ignored in the context of blogs."
          ],
          "paper_id": "24a23030-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation"
     },
     {
          "head": {
               "n": "2.4.",
               "text": "Social influence perspectives",
               "type": "introduction"
          },
          "paragraphs": [
               "Ellis and Fisher posited that roles and norms are common standards for group members' behavior. Role is the basic unit of socialization. When people participate in a social system, they identify with and assume a role in it. In addition, they usually behave as expected by other members. According to social identity theory, people classify themselves into social categories . Through group action, they develop a perception of membership in a group. This social identification is an important component of group formation . Blogging defines a new community, whose identification may increase when people in the group identify themselves as members and treat others as kindred spirits.",
               "A norm is considered to influence an individual's behavior. The TRA and Theory of Planned Behavior (TPB) provided the theoretical bases for a relationship between social norm and user behavior. Empirical studies have found that social norms positively affect an individual's behavior .",
               "In our study, social norm was defined as the degree to which a user perceived that others approved of their "
          ],
          "paper_id": "24a23030-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "Technology acceptance factors",
               "type": "introduction"
          },
          "paragraphs": [
               "We defined perceived usefulness as the degree to which a person believed that using a blog enhanced his or her performance. Perceived ease of use was defined as the degree to which a person believed that using a blog was free of effort. Additionally, attitude was defined as the user preferences when blogging. Intention was the extent to which the user would like to blog in the future. Previous studies have confirmed that usefulness and ease of use have significant effects on attitude. In addition, an Internet user would be likely to participate in blog activity because the interacting process yields fun and enjoyment. Teo et al. confirmed that perceived enjoyment had a significant effect . Research model. on Internet usage. Similarly, many studies have indicated that the use of IT is influenced by perceived enjoyment. Accordingly, we hypothesized:",
               "H1a. Perceived usefulness will positively affect users' attitudes toward participating in a blog."
          ],
          "paper_id": "24a23030-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation"
     },
     {
          "head": {
               "text": "perception of belonging to a blogging community. Hars and",
               "type": "introduction"
          },
          "paragraphs": [
               "Ou confirmed that a user's identification with a community played an important role in participating in open-source projects. Accordingly, we hypothesized:",
               "H4a. Social norm will positively affect users' intentions to participate in a blog.",
               "H1b. Perceived ease of use will positively affect users' attitudes toward participating in a blog.",
               "H4b. Community identification will positively affect users' intentions to participate in a blog.",
               "H1c. Perceived enjoyment will positively affect users' attitudes toward participating in a blog."
          ],
          "paper_id": "24a23030-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation"
     },
     {
          "head": {
               "n": "4.",
               "text": "Methodology",
               "type": "introduction"
          },
          "paragraphs": [
               "H2. Attitude will positively affect users' intentions to participate in a blog."
          ],
          "paper_id": "24a23030-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation"
     },
     {
          "head": {
               "n": "3.2.",
               "text": "Knowledge sharing motivation",
               "type": "introduction"
          },
          "paragraphs": [
               "Many factors influence knowledge sharing behavior. Since blogging is a form of knowledge sharing and is voluntary, we proposed that expected reciprocal benefits, reputation, expected relationships, trust and altruism would affect blog participants' behaviors. Expected reciprocal benefits involved the degree to which a person believed he or she could obtain mutual benefits through knowledge sharing. Reputation was the degree to which a person believed that participation could enhance personal reputation through knowledge sharing. Expected relationship was the degree to which a person believed he or she could obtain an improved mutual relationship through knowledge sharing. Trust was to the tendency to believe in others and in their posted articles on the blog. Altruism referred to the degree to which a person was willing to increase other people's welfare without expecting returns. According to Davenport and Prusak, these factors have a positive effect on attitudes. Accordingly, we hypothesized:",
               "H3a. Altruism will positively affect users' attitudes toward participating in a blog.",
               "H3b. Expected reciprocal benefit will positively affect users' attitudes toward participating in a blog.",
               "H3c. Reputation will positively affect users' attitudes toward participating in a blog.",
               "H3d. Trust will positively affect users' attitudes toward participating in a blog.",
               "H3e. Expected relationships will positively affect users' attitudes toward participating in a blog."
          ],
          "paper_id": "24a23030-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation"
     },
     {
          "head": {
               "n": "3.3.",
               "text": "Social influence factors",
               "type": "introduction"
          },
          "paragraphs": [
               "We defined social norm as the degree to which the user perceived that others approved of his or her participating in the blog. Community identification was defined as the net/) for two months. These sites were chosen because of their wide reach and popularity in Taiwan. In addition, the blogs in these sites contained a variety of types which included personal diaries/opinions/editorials of their interests (e.g., hobbies) and/or specific topics forums (e.g., financial investments, new IT innovation reports and applications).",
               "At any time during the two months when the study was being conducted, participants could respond to the online questionnaire by entering the URL provided on the message, which also outlined the aim of the study, provided a hyperlink to the survey form, and included respondents in a drawing for 30 NT$100 bookstore certificates to be awarded at the completion of the survey.",
               "To effectively eliminate repeat responses to the survey, we removed responses with duplicate IP addresses from our sample. Since participants needed to leave their email addresses to enter the drawing, email addresses were also used to check for repeated entries. The online survey yielded 212 usable responses, including 127 males and 85 females. Ninety-four percent were under 35 years of age and 92% had at least a college degree, indicating that the respondents were primarily young and educated. The majority of the respondents had relatively short experience in using blogs. This coincided with a recent survey conducted by Yam.com.tw, one of the popular portal sites in Taiwan, which found that most blog participants started blogging less than 2 years earlier . All participants indicated that they had some experiences in writing their own blogs and/or reading and commenting on others'. summarizes the respondents' profile.",
               "Before conducting the main survey, we performed a pretest and a pilot to validate the instrument. The pre-test included eight graduate students who were experienced blog participants and had their own blogs, and often read and commented on others' blogs. Respondents were asked to comment on list items that corresponded to the constructs, including scales wording, instrument length, and questionnaire format. Finally, to reduce possible ambiguity, a pilot test was performed. "
          ],
          "paper_id": "24a23030-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation"
     },
     {
          "head": {
               "n": "5.1.",
               "text": "Descriptive statistics",
               "type": "introduction"
          },
          "paragraphs": [
               "Descriptive statistics were calculated and shown in . These show that, on average, our sample responded positively to participating in blogs (the averages of all constructs were greater than 3 out of 5 The proposed model was evaluated using SEM, which is a powerful second-generation multivariate technique for analyzing causal models with an estimation of the two components of a causal model: measurement and structural models. The measurement model is estimated using confirmatory factor analysis (CFA) to test whether the constructs possess sufficient validation and reliability. The structural model is used to investigate the strength and direction of the relationship between the theoretical constructs. Such analyzed technique has been widely applied in recent years. In our study, LISREL 8.7 was the software used to assess the measurement and the structural models .  5.3. The measurement model"
          ],
          "paper_id": "24a23030-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation"
     },
     {
          "head": {
               "n": "4.2.",
               "text": "Measurement development",
               "type": "introduction"
          },
          "paragraphs": [
               "The questionnaires were developed from material discussed and tested previously; the list of items is displayed in Appendix A. The items were slightly modified to suit the context of blogs. Our scale items for perceived ease of use, perceived usefulness, attitude, and behavioral intention to blog were from . Perceived enjoyment was measured by items adapted from Venkatesh, Speier and Morris. Additionally, the items to measure knowledge sharing motivations including expected reciprocal benefits, reputation, expected relationships, trust and altruism were modified from . Furthermore, to develop a scale for measuring social factors such as social norms and community identification, we used materials from Taylor and Todd, Ashforth and Mael and Bock et al., with modifications to fit our setting of a blog. Each item was measured on a five-point Likert scale, ranging from ''disagree strongly'' (1) to ''agree strongly'' (5).",
               "The measurement model was tested using CFA. Segars and Grover suggested that the measurement model should be evaluated first and then respecified as necessary to generate the 'best fit' model. The initial assessment of the model indicated that some items should be removed. After respecifying the instruments, 24 items were retained, as shown in . Item reliability ranged from 0.76 to 0.96, which exceeded the acceptable value of 0.50 recommended by Hair et al. . The internal consistency of the measurement model was assessed by computing the composite reliability. Consistent with the recommendations of Bagozzi and Yi , all composite reliabilities were above the 0.60 benchmark. The average variance extracted for all constructs exceeded the The diagonals represent the average variance extracted (AVE). threshold value of 0.5 recommended by Fornell and Larcker . Since the values of reliability were above the recommended thresholds, the scales for evaluating the constructs were deemed to exhibit convergence reliability. shows that the variances extracted by constructs were greater than any squared correlation among constructs; this implied that constructs were empirically distinct. In summary, the measurement model test, including convergent and discriminant validity measures, was satisfactory.",
               "The fitness measures for the measurement models are shown in . x 2 , GFI (goodness-of-fit index), AGFI (adjusted GFI), NFI (normalized fit index), CFI (an incremental fit index of improved NFI) and RMSEA (root-mean-square error of approximation) were used to test the goodness of fit of the proposed model. It is suggested x 2 /d.f. should not exceed 3 while GFI and AGFI should be greater than the recommended value of 0.8 .",
               "Bentler further suggested that model fit indices should be used, and scores of 0.9 or higher on NFI and CFI should be considered evidence of good fit. Accordingly, all the fitness measures in the study fell into acceptable ranges. Consequently, the proposed model provided a suitable fit. see . The results show that attitude and community identification had significant effects on the intention to use (b = 0.57, p < 0.001; b = 0.32, p < 0.001), supporting hypotheses 2 and 4b. Together, these two paths accounted for 83% of the variance in intent to use. Contrary to expectations, social norm had no direct influence on user intention to use (?0.02, p > 0.05), hypothesis 4a was not supported. Also the results showed that perceived ease of use (b = 0.20, p < 0.01), perceived enjoyment (b = 0.67, p < 0.001), altruism (b = 0.14, p < 0.05) and reputation (b = 0.16, p < 0.05) significantly affected attitude, providing support for hypotheses 1b, 1c, 3a and 3c. The model accounted for 78% of the variance in attitude. Unexpectedly, perceived usefulness, expected reciprocal benefit, trust and expected relationships had no direct influence on attitude. Therefore, hypotheses 1a, 3b, 3d and 3e were not supported."
          ],
          "paper_id": "24a23030-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation"
     },
     {
          "head": {
               "n": "5.4.",
               "text": "Tests of the structural model",
               "type": "modelling"
          },
          "paragraphs": [
               "We examined the structural equation model by testing the hypothesized relationships among the research variables;",
               "Our study presented and validated a multi-facet model to help in understanding the factors contributing to blog usage. With empirical analysis, several implications were obtained.",
               "First, ease of use and enjoyment appeared to be important variables in the context of blogs. Specifically, enjoyment was found to have the most significant influence on attitudes, with a coefficient much higher than others (b = 0.67). Additionally, perceived usefulness had no effect on the use of the blog. These results are in line with previous studies (e.g. ), which argued that perceived usefulness played a critical factor only in work-related environments. On the other hand, the intrinsic motivation such as enjoyment may be the most significant antecedent of attitude toward using IT. Our findings confirmed this and showed that if users did not perceive blogging as enjoyable, they were unlikely to . Results of structural modeling analysis.",
               "contribute to it, which is hardly surprising. Ease of use was another essential factor. Indeed, an easy-to-use interface could influence a user's preference while difficulties can create user resistance. This reinforces the general beliefs that blog-hosting service providers should continue to develop tools that require minimum effort to learn and use.",
               "Second, only two factors, altruism and reputation, affected a user's attitude, while other knowledge sharing motivation factors had no significant effect. Generally, previous studies emphasized the importance of egoistic motives but contrary to expectations, our study showed that people actively participated in a blog to increase welfare of others; participating in blogs was not expected to produce direct rewards. People participating in blogs were motivated intrinsically to contribute knowledge to others because they enjoy helping each others. Knowledge sharing in the context of task-oriented organization, however, stressed the importance of external rewards such as a reciprocal benefit and anticipated reciprocal relationships.",
               "In addition, even though blog users usually viewed blogs as online diaries or journals to record their daily lives and interests, our results verified that people were eager to share their thoughts and experiences with others, thereby obtaining an online reputation.",
               "Finally, from a social influence perspective, a plausible finding was that users were willing to blog because of their community identification. Additionally, social norm had no significant influence on a user's intention to blog. This finding differed from theories such as TRA and TPB. In summary, the social viewpoints showed that blog participants gain a sense of belonging. fore, publicly praising individual participant's effort can enhance attitude toward blogging. 4. Community identification is important in blogging.",
               "Therefore, blog-hosting service providers should promote and encourage people to share their social lives and opinions or at least add comments. Reward systems, such as keeping a billboard of top 100 blogs, rewarding virtual points for participations, etc. can also be a positive motivator. The more information and comments posted and discussed, the longer people will stay in the blog. This will, in turn, establish a stronger sense of community identification among participants."
          ],
          "paper_id": "24a23030-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation"
     },
     {
          "head": {
               "n": "6.3.",
               "text": "Limitations",
               "type": "modelling"
          },
          "paragraphs": [
               "This study should be interpreted and accepted with caution since the survey data had certain inherent limitations. First and foremost, a bias existed because the sample was self selected.",
               "Second, the subjects were blog users in Taiwan. Culture and lifestyle may differ among countries.",
               "Lastly, with a goal to better understand the blog participants' behaviors, we did not differentiate participation roles (bloggers, blog readers, or comment providers) since many blog participants play all roles.",
               "1. The findings underscored the importance of enjoyment.",
               "Bloggers should strive to increase participants' intrinsic motivations such as enjoyment, fun, curiosity, and exploration. For example, the home page of a blog should contain interesting, fresh, fun, and enjoyable information. At the same time, blog-hosting services should continue to develop tools that make creation of innovative contents possible. 2. Most people recognize blogs as easy publishing tools.",
               "Our results also verified that ease of use is an important and influential factor in determining users' attitude toward using blog. "
          ],
          "paper_id": "24a23030-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Acceptance of blog usage: The roles of technology acceptance, social influence and knowledge sharing motivation"
     }
]