[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Networked multiagent systems are very popular in large-scale application environments. In networked multiagent systems, the interaction structures can be shaped into the form of networks where each agent occupies a position that is determined by such agent's relations with others. To avoid collisions between agents, the decision of each agent's strategies should match its own interaction position, so that the strategies available to all agents are in line with their interaction structures. Therefore, this paper presents a novel decision-making model for networked multiagent strategies based on their interaction structures, where the set of strategies for an agent is conditionally decided by other agents within its dependence interaction substructure. With the presented model, the resulting strategies available to all agents can minimize the collisions of multiagents regarding their interaction structures, and the model can produce the same resulting strategies for the isomorphic interaction structures. Furthermore, this paper uses a multiagent citation network as a case study to demonstrate the effectiveness of the presented decision-making model."
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "Decision Making of Networked Multiagent Systems for Interaction Structures",
               "type": "abstract"
          },
          "paragraphs": [
               "Yichuan Jiang, Member, IEEE, Jing Hu, and Donghui Lin Abstract-Networked multiagent systems are very popular in large-scale application environments. In networked multiagent systems, the interaction structures can be shaped into the form of networks where each agent occupies a position that is determined by such agent's relations with others. To avoid collisions between agents, the decision of each agent's strategies should match its own interaction position, so that the strategies available to all agents are in line with their interaction structures. Therefore, this paper presents a novel decision-making model for networked multiagent strategies based on their interaction structures, where the set of strategies for an agent is conditionally decided by other agents within its dependence interaction substructure. With the presented model, the resulting strategies available to all agents can minimize the collisions of multiagents regarding their interaction structures, and the model can produce the same resulting strategies for the isomorphic interaction structures. Furthermore, this paper uses a multiagent citation network as a case study to demonstrate the effectiveness of the presented decision-making model."
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "S",
               "type": "abstract"
          },
          "paragraphs": [
               "TRATEGY is the action that an agent adopts to behave in multiagent systems ; for example, an agent can select the strategy of cooperation or defect in the Prisoner's Manuscript received January Dilemma game. When agents are uncertain about the precise results of adopting such strategies, they will take decision making as a means to analyze which of a series of strategies should be taken , . Previous works on decision making always use game theory or other economics techniques, such as negotiation, bargaining, auction, and contracting, and mainly concern negotiation protocols and decision-making procedures , , . Nowadays, with the development of large-scale multiagent systems, agents are always organized in networked structures where an agent interacts only with its immediate neighbors - . The interactions among agents can be shaped in the form of networks in which the vertices denote the agents and the edges indicate their interaction relations. According to the social-network-analysis method, each agent occupies a position against other agents in the interaction structure ; such position can only be shaped and described by the agent's relations with other agents, but not by its own inherent attributes. The interaction position of an agent is very important to determining its role in the system ; for example, in a multiagent system simulating corporation organization, the action strategies of a manager agent should be different from those of a staffer agent. If the staffer agent adopts the manager agent's strategies, some disorders may result. Therefore, agents should adopt the strategies that match their positions in the interaction structures to avoid colliding with other agents. Making decisions according to the interaction structure is a crucial problem in solving agent coordination within networked multiagent systems.",
               "Distributed decision making for the coordination of networked agents has received much attention in recent years. Saber and Murray provide convergence, performance, and robustness analyses of an agreement protocol for a network of integrator agents with directed information flow and switching topology, which mainly rely on the tools of algebraic graph theory and matrix theory. Roy et al. introduce a quasilinear stochastic distributed protocol that can be used by a network of sensing agents to reach a collective action agreement. Generally, previous works on the decision making of networked agents mainly concerned the agreement problems in which all agents within the network must achieve the same opinion, and the connection between the networked topology and the performance of the agreement protocol. Therefore, previous works seldom took into account the interaction structures of agents while they decide the agents' action strategies.",
               "In addressing the aforementioned issues, this paper takes both the agent's interaction position and the strategies into account and presents a model for deciding the strategies available to agents that can satisfy the constraints created by interaction structures. In our decision-making model, we focus upon the multiagent dependence relations that are always seen where the strategies of some agents are dependent on others . Dependence relations occur in multiagent systems due to many reasons, such as resource constraints, environmental constraints, task allocations, etc. Clearly, the strategies available to an agent should be conditionally determined by its dependent agents within the interaction structure.",
               "In this paper, the main purpose of decision making is to put restrictions on agent strategies that can match the interaction positions of all agents within the interaction structure. With our approach, the decision-making result can minimize the collisions between agents regarding their interaction positions.",
               "The rest of this paper is organized as follows. In Section II, we model the interaction structures of networked multiagents; in Section III, we present the decision-making model for interaction structures; in Section IV, we highlight a case study of decision-making in multiagent citation networks; in Section V, we introduce related work; and finally, we conclude this paper in Section VI. Definition 2: The dependence substructure of an agent in the interaction structure is defined as the set of in interaction relations of various types linking this agent with other agents. Let the agent interaction structure be N = A, R, where A denotes the set of agents and R denotes the set of agent interaction relations. Then, the first-order dependence substructure of an agent, namely, a iA, is the union of its immediate in links",
               "Obviously, the second-order dependence substructure of a i can be defined as"
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "A. Interaction Structures",
               "type": "abstract"
          },
          "paragraphs": [
               "An interaction structure consists of the interaction relations between agents. In this paper, we summarize the interaction relations to be in two forms: 1) the dependence relations, which denote that some agents are reliant on other ones; and 2) the domination relations, which denote that some agents can overpower others. For an agent, the \"in\" interaction relations denote its dependence on other agents and the \"out\" interaction relations refer to its domination over other agents.",
               "Generally, the interaction structure among agents can be understood in a networked form in which the vertices denote the agents and the edges symbolize their interaction relations. According to the network analysis method , each agent has its position against other agents in the interaction network. Clearly, such a position can only be shaped and described by the agent's relations with other agents, but not by the inherent attributes of an individual agent.",
               "Definition 1: The interaction position of an agent is defined as the set of interaction relations of various types linking this agent with other agents. Let the agent interaction structure be N = A, R, where A denotes the set of agents and R represents the set of agent interaction relations. The position of an agent a i is the union of its immediate in interaction relations and immediate out interaction relations Therefore, the nth-order dependence substructure of a i can be defined as",
               "The set of agents within the first-order dependence substructure of a i (called its first-order dependence agents) is",
               "Therefore, the set of all agents within the all-orders dependence substructures of agent a i is",
               "Example 1: shows an agent interaction structure and the positions of agents a, c, e, f, h, and k.",
               "If agent a is the source of an interaction relation rR, then we can refer to it as a r. If agent a is the destination of an interaction relation rR, then we can denote it as a ? r.",
               "On the other hand, an agent may also influence other agents' strategies for actions within the interaction structure, so we have the following definition.",
               "Definition 3: The domination substructure of an agent in the interaction structure is defined as the set of out interaction relations of various types linking this agent with other agents. Let the agent interaction structure be N = A, R, where A denotes the set of agents and R denotes the set of agent interaction relations. Then, the first-order domination substructure of an agent, namely, a iA, is the union of its immediate out links",
               "denotes that there is a path from a to b; therefore, there is a cycle which contains a and b. Obviously, the second-order domination substructure of a i can be defined as",
               "Therefore, the nth-order domination substructure of a i can be defined as",
               "The set of agents within the first-order domination substructure of a i (called its first-order domination agents) is",
               "Therefore, the set of all agents within the all-orders domination substructures of agent a i is",
               "Example 2: Now, we consider the dependence and domination substructures of agent d in , as shown in Dep",
               "notes that there is a path from a to b and a? b denotes that there is a path from b to a; hence, there is a cycle that contains a and b. Obviously, those situations are impossible in a DAG; therefore, we have Lemma 1.",
               "If two agents have identical ties to and from all other agents in the interaction structure, we can say that they are structurally equivalent.",
               "Definition 4: Interaction structural equivalence . Let the agent interaction structure be N = A, R, where A denotes the set of agents and R denotes the set of agent interaction relations; |A| = m, |R| = n, a i , a jA, and 1i, jm. Then, a i and a j are structurally equivalent if for all agents a kA, k = 1, . . . , m and k = i, j, and all interaction relations r x , x = 1, . . . , n, a i has an interaction relation to a k , if and only if a j also has an interaction relation to a k , and a i has an interaction relation from a k , if and only if a j also has an interaction relation from a k . If a i and a j are structurally equivalent, we can denote them as a ia j .",
               "Lemma 2: If two agents are structurally equivalent, then they have the same first-order dependence and domination agents, i.e.,",
               ". Moreover, they also have the same nth-order (n > 1) dependence and domination agents.",
               "Proof: From Definition 4, if two agents are structurally equivalent, they have the same first-order dependence agents and first-order domination agents. According to (4) and (9), the nth-order (n > 1) dependence substructure is fully dependent on the (n ? 1)th-order dependence agents and the nth-order (n > 1) domination substructure is fully controlled by the (n ? 1)th-order dependence agents. Therefore, the two agents have the same nth-order (n > 1) dependence and domination agents.",
               "Example 3: From , the agent sets that have immediate in interaction relations to a and c are the same, namely, {b}, and the agent sets that have immediate out interaction relations from a and c are also the same: {d, e}. Therefore, agents a and c are structurally equivalent. Moreover, h and k are also structurally equivalent. Obviously,",
               "Lemma 1: Let an agent interaction structure be ",
               "Such situation is impossible in a DAG. Therefore, we have Lemma 3."
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "B. Constraints Among Agents' Strategies in the Interaction Structures",
               "type": "abstract"
          },
          "paragraphs": [
               "When agents interact with and depend on each other, there may be some constraints which limit their available strategies for avoiding collisions. For example, if there are two paths between places x and y and each path can only be passed by one agent at the same time, agent a 1 will go from x to y and agent a 2 will go from y to x. Moreover, a 1 has the priority to select the path first (i.e., the decision of strategy of a 2 depends on the strategy of a 1 ). Thus, we can set the constraint to a 2 as \"a 2 cannot select the same path as a 1 \".",
               "Definition 6: Social constraint. Let there be, first, a finite set of agents, A = {a 1 , a 2 , . . . , a n }, and second, an initial set of strategies for each agent, containing a finite and discrete strategies' domain for each agent, S = {S 1 , S 2 , . . . , S n }?i[1, n] and s ijS i , where s ij is the jth strategy that agent a i adopts in the operation. Then, a social constraint set is C = {C(A 1 ), C(A 2 ), . . . , C(A m )}, where each A i is a subset of the agents and each social constraint C(A i ) is a set of tuples indicating the mutually consistent strategy values of the agents in A i .",
               "In reality, the social constraint with the arity of 2 is always seen and is the basic form of most constraints. Thus, we mainly consider such constraint form in this paper.",
               "Definition 7: A binary social constraint is the one that only affects two agents. If there is a binary social constraint c ij occurring from agent a i to a j , i.e., the constraint is only endowed on a j by a i , we can say that such a constraint is unilateral. Now, agent a i is referred to as the subject one of c ij and a j is called the object one of c ij .",
               "Therefore, if a social constraint is unilateral, we think that the strategies of the object agent will be influenced by the subject agent, but the strategies of the subject agent will not be influenced by the object agent. Obviously, the dependence relation between two agents can be considered as a unilateral binary social constraint between them; thus, we can use the unilateral binary social constraint between two agents to denote the interaction relation between them. Let there be two agents, a i and a j ; if a j depends on a i , then the available strategies of a j are constrained by a i .",
               "In real systems, some social constraints can be satisfied, but others can never be satisfied; accordingly, some dependence relations can be fulfilled, but some other ones cannot be satisfied in the interaction structure. Therefore, we have the following definition.",
               "Definition 8: Lawful and unlawful dependence relations. Let there be a dependence constraint c ij occurring from agents a i to a j . The sets of strategies for a i and a j are S i and S j , respectively. If ?s jS j , there exists a strategy in S i , i.e., ?s iS i , that satisfies c ij , we can say that c ij is lawful. Otherwise, we say that c ij is unlawful. If S j is empty, we can also say that this dependence relation is unlawful.",
               "If an agent is restricted by more constraints, then its behavior freedom will be more limited.",
               "Definition 9: Freedom degree of agent. For an agent a j , let the initial set of strategies for a j while it is not constrained by any dependence relations be S; now, if a j is constrained by the set of dependence relationsi c ij , then S is the set of strategies of a j that take into account the dependence relationsi c ij . Therefore, the freedom degree of agent a j under the dependence relationsi c ij is",
               "If S is empty, we say that the freedom degree of a j is 0."
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "III. DECISION-MAKING MODEL FOR MULTIAGENT INTERACTION STRUCTURES",
               "type": "modelling"
          },
          "paragraphs": [
               "On the basis of our previous work on the social law extracting model in networked multiagent systems , here, we present a decision-making model for multiagent interaction structures."
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "A. Some Concepts",
               "type": "modelling"
          },
          "paragraphs": [
               "The conditional dependence assumption provides a practical way to construct the joint distribution among agents . As stated in Section II, the strategies of some agents are conditionally determined by their dependence agents.",
               "Definition 10: Conditional strategy. An interaction structure A, R is given, where the first-order dependence structure of agent aA is Dep a and the set of strategies available to the agents of Dep a isia S i . Therefore, the set of strategies available to a is the one given that the agents of its dependence substructure adopt the strategiesia S i ; this can be referred to as the conditional strategy S a| a .",
               "The different constraints of dependence relations may produce collisions among themselves. To achieve the global harmony of the system, we should implement decision making to restrict the agents' strategies so as to minimize the conflicts among agents (the definition of decision making in this paper is a little similar to the concept of social law in and ).",
               "Definition 11: Decision of multiagent strategies. An environment A, S 1 , S 2 , . . . , S n is given, where A is the set of agents, A = {a 1 , a 2 , . . . , a n }, and S i is the initial set of strategies for a i . We define a decision of multiagent strategies to be a restriction of",
               ". . , S n to S * n ? S n , which can minimize conflicts among agents. Definition 12: Useful decision of multiagent strategies. Let the total constraints of dependence relations in the system be C; a decision SL = S * 1 , S * 2 , . . . , S * n is completely useful if for every constraint of dependence relation, ?c ijC, there exists s iS * i such that ?s jS * j , we have s i , s j satisfying c ij . Therefore, in a completely useful decision, all dependence relations are lawful.",
               "However, in real multiagent systems, sometimes, a decision may only satisfy the requirements of some but not all dependence relations, i.e., a decision may be only approximately useful. Then, how could one evaluate the usefulness of a decision for the interaction structure? We can use the following definition.",
               "Definition 13: Usefulness degree of a decision. Let the set of constraints of dependence relations that can be satisfied by the decision SL be C sat , and if the total constraints of dependence relations in the system is C, then at first, we can simply define dependence ones are all decided or empty. Now, if all agents in the system can be decided with definite strategies, then the decision making is successful; otherwise, it can be noted that there are cycles in the interaction structure. the usefulness degree of a decision SL as |C sat |/|C|. Moreover, a decision should enable the agents to have more total freedom under the condition that social constraints can be satisfied. Thus, we can extend the definition as Algorithm 1. Decision making of multiagent strategies for directed acyclic interaction structure",
               "? Input A = {a 1 , a 2 , . . . , a n } and R;",
               "? Input S = {S 1 , S 2 , . . . , S n }; / * the initial strategies * / ? Creatstack (stack);",
               "? For ?a iA:",
               ", return (\"There are no cycles\"); else return (\"There are cycles\");",
               "whereandare parameters to define the relative importance of agent freedom degree and dependence constraint satisfaction degree, respectively. We can set the values of the parameters according to real situations. Therefore, our aim of decision making is to explore the decision with the maximum degree of usefulness. Example 4: is an example of the decided multiagent strategies with different usefulness degrees. is an interaction structure where there are four agents {a 1 , a 2 , a 3 , a 4 } and four social constraints taken by the dependence relations {c 12 : s 1 > s 2 , c 24 : (s 2 ? 2) > s 4 , c 13 : (s 1 ? 5) > s 3 , c : s 4 > s 3 }. In such a system, it is assumed that the agents can take actions of adopting values in the set S = {1, 2, . . . , 10}; hence, the strategies are the values in S. The initial strategy profiles of four agents are all set to {1, 2, . . ., 10}. Now, we randomly make four decisions and compute their usefulness degrees, as shown in ."
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "B. Basic Decision-Making Model for DAG Structures",
               "type": "modelling"
          },
          "paragraphs": [
               "If an interaction structure N = A, R is a DAG, then we have the following: ?a iA, a i is fixed . The basic idea in our model is as follows: ?a iA, if we want to decide the set of available strategies for agent a i , we should decide the sets of available strategies for ?a ia i in advance. Thus, we can obtain the joint distribution of strategies for all agents step by step.",
               "Therefore, our algorithm can be designed as follows: At first, we restrict the available strategies of the agents whose dependence agents are all decided or empty; such iteration will be repeated until it cannot find any undecided agents whose Algorithm 1 is O(n * e), where n denotes the number of agents and e denotes the number of dependence relations.",
               "Theorem 1: Let the interaction structure be N = A, R. If N is a DAG, then Algorithm 1 can make a unique decision, i.e., the decided strategies for all agents are definite.",
               "Proof: ?a iA, the set of available strategies for a i in the decision making is fully determined by the following three factors:",
               "1) the initial set of strategies for a i ; 2) the set of social constraints using a i as object agent, namely, Dep ai ; 3) the set of available strategies for a i in the decision making. Obviously, the uniqueness of 1) can be satisfied. Now, the core procedure of Algorithm 1 is the same as the one of the Topology Sorting Algorithm ; hence, a i is unique and the uniqueness of 2) and 3) can also be satisfied. Therefore, Algorithm 1 can make a unique decision for a directed acyclic structure.",
               "Lemma 4: In the multiagent strategies decided by Algorithm 1, if the set of strategies for one agent is empty, then the dependence relations using such agent as object are unlawful.",
               "Proof: From Definition 8, we have Lemma 4. Two graphs containing the same number of graph vertices connected in the same way are considered isomorphic , ; now, we present the definition of isomorphic multiagent interaction structures, shown as follows.",
               "Definition 14: Let there be two interaction structures; one is G with the agent set A g = {a g1 , . . . , a gn }, and the other is H with the agent set A h = {a h1 , . . . , a hn }. G and H are said to be isomorphic if, first, there is a bijection f such that interaction relation a i , a j is in G iff f (a i ), f(a j ) is in H, and second, the constraints taken by the interaction relations a i , a j and f (a i ), f(a j ) are the same.",
               "Theorem 2: Assume a scenario in which two interaction structures G and H satisfy the following: 1) G and H are both DAGs; 2) G and H are isomorphic; and 3) ?a giA g and its peer in H, namely, f (a gi ), the initial strategies of a gi and f (a gi ) are the same. Then, we can deduce that the decided strategies of a gi and f (a gi ) by using Algorithm 1 are the same.",
               "Proof: From the definitions of conditional strategy and decision making in the interaction structure, for agent a, it is determined by its first-order dependence structure Dep a . Therefore, a's final strategies in the restriction of decision making is determined by the following: 1) the agents in Dep a (i.e., a ); 2) the strategies of a ; and 3) the constraints taken by the interaction relations from ?a ja to a. Now, while Algorithm 1 is used, a gi and f (a gi ) have the same three factors if G and H are isomorphic; thus, the decided strategies of a gi and f (a gi ) are the same.",
               "in Algorithm 2. For example, in , if we first decide agent a 1 , then we can ignore the constraint c 21 , as can be seen in ; if we first decide agent a 2 , then we can ignore the constraint c 32 , as can be seen in ; if we first decide agent a 3 , then we can ignore the constraint c 13 , as can be seen in .",
               "Algorithm 2. Cycle breaking and decision making (A, a). / * A is the set of agents within the cycle and a is the cycle-breaking point. * /",
               "? a temp = a;",
               "? While a? atemp : ?a j? atemp : if a jA / * if a j is in the circle * / {Restrict S j according to the social constraint from a temp to a j ; a temp = a j ;} ? Compute the usefulness degree of decision for A."
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "C. Extended Decision-Making Model for Interaction Structures With Cycles",
               "type": "modelling"
          },
          "paragraphs": [
               "If there are any cycles in the interaction structures, then there exist some agents whose a i cannot be decided. For example, is a directed cyclic structure, where a 1a 3 , a 3a 2 , and a 2a 1 . Therefore, we cannot make a definite decision according to Algorithm 1.",
               "There are many forms of cycles; among them, the simple cycle is popular. A simple cycle is one with no repeated vertices in the cycle. If there is more than one cycle, and none of them contains a vertex of another, then the cycles are independent .",
               "For the reason of decision-making certainty, we have the following assumption, which assures that the decision with maximum usefulness degree can be obtained.",
               "Assumption 1: In this paper, if there are dependence cycles in the interaction structures, the cycles are all simple and independent from each other.",
               "In a simple dependence cycle, if we want to compulsively decide the strategies of an agent in the cycle a i , then we can ignore the dependence relations of a i on other agents in the cycle (now, a i is a \"cycle-breaking point\"). After an agent is decided compulsively in a simple dependence cycle, other agents within the cycle can be decided step by step according to the basic model in Section III-B. Such a method can be seen",
               "In the interaction structures with cycles that satisfy Assumption 1, the agents can be divided into three groups: 1) the agents whose strategies can be decided by Algorithm 1 (Group 1); 2) the agents in any simple cycle (Group 2); and 3) the agents that are not in any cycle but depend on some agents in cycles (Group 3). For example, in is the agent of Group 1; a 2 , a 3 , and a 4 are the agents of Group 2; and a 5 is the agent of Group 3.",
               "In our extended decision-making model for interaction structures with cycles, we use different methods to decide strategies for the three groups of agents: 1) For the first agent group, we can simply use Algorithm 1 to decide their available strategies; 2) for the second agent group, we can utilize the cycle-breaking method of Algorithm 2 for each agent in the cycle and then select the decision with the maximum usefulness degree; and 3) after the first and second agent groups are decided, then the third agent group can be decided by using Algorithm 1. The whole extended decision-making model can be shown as Algorithm 3. to a. Now, while the extended model is used and the cyclebreaking points in G and H are fully peer to peer, a i and f (a i ) have the same three factors if G and H are isomorphic; hence, the decided strategies of a i and f (a i ) are the same.",
               "Example 5: Now, we give an example to demonstrate Algorithm 3. is an interaction structure with a cycle. The initial set of strategies for each agent is {1, . . ., 100}. Now, a 1 , a 2 , and a 3 are attributed to Group 1; thus, they can be decided by Algorithm 1. Agents a 4 , a 5 , and a 6 form a cycle. We can use the following three scenarios.",
               "In Algorithm 3, the first and third parts are both O(ne), where n denotes the number of agents in the group and e denotes the number of dependence relations in the group; the second part is O(lm 2 ), where l denotes the number of cycles and m denotes the number of agents in a cycle. Therefore, Algorithm 3 is O(lm 2 ). As said in the proof of Theorem 1, the set of available strategies of an agent is determined by three factors. In Algorithm 3, the agents in A i and A * cannot satisfy the three factors. Therefore, the decision-making result of Algorithm 3 is not unique, i.e., different executions of Algorithm 3 may get different decisions. However, we can have the following theorem.",
               "Theorem 3: Let an interaction structure be N = A, R. If N has cycles and satisfies Assumption 1, then Algorithm 3 can make the decision with the maximum usefulness degree.",
               "Proof: In Algorithm 3, the agents in N can be divided into three groups: 1) A , the agents whose strategies can be fully decided; 2)i A 1) If we select a 4 to break the cycle, the dependence relation c 64 is ignored, the decided strategies are as shown in , and the usefulness degree of such decision is U SL = 0.53+ 0.9. 2) If we select a 5 to break the cycle, the dependence relation c 45 is ignored, the decided strategies are as shown in , and the usefulness degree of such decision is U SL = 0.67+ 0.9. 3) If we select a 6 to break the cycle, the dependence relation c 56 is ignored, the decided strategies are as shown in (e), now, only five dependence relations (c 12 , c 13 , c 67 , c 78 , c 68 ) can be satisfied, and the usefulness degree of such decision is U SL = 0.62+ 0.5.",
               "From the results of the three scenarios, the decision in 2) has the maximum usefulness degree. Therefore, we should adopt such decision. i , the agents that are attributed to any simple cycle; and 3) A * , the set of agents that do not attribute to any cycle but depend on some agents in the cycles. Obviously, the available strategies of the agents in A are decided by Algorithm 1; hence, the strategy restrictions endowed on A"
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "A. Introduction to Multiagent Citation Networks",
               "type": "introduction"
          },
          "paragraphs": [
               "are unique. The available strategies of the agents ini A i are decided by the procedures in Algorithm 2, which can obtain the strategy restriction with the maximum usefulness degree. After the strategy restriction related toi A i is fixed, then the available strategies of the agents in A * are determined by Algorithm 1; therefore, the strategy restrictions endowed on A * are unique. Therefore, the decision-making result for the whole system has the maximum usefulness degree.",
               "Theorem 4: Assume that two interaction structures G and H satisfy the following conditions: 1) G and H are both directed graphs with cycles; 2) G and H are isomorphic; 3) the initial strategy spaces for any two peer agents in G and H are the same; and 4) for any cycle-breaking point in G, i.e., a, its peer agent f (a) is also the cycle-breaking point in H while we use the extended model and vice versa. Then, the following is true: For each agent in G, namely, a i , and its peer agent in H, i.e., f (a i ), the decided strategies of a i and f (a i ) by using the extended model are the same.",
               "Proof: From the definitions of conditional strategy and decision making in the interaction structure, agent a is decided by its first-order dependence structure of agent Dep a . Therefore, a's final strategies is decided by the following: 1) the agents in Dep a (i.e., a ); 2) the strategies of a ; and 3) the constraints taken by the interaction relations from ?a ja In multiagent systems, the operation of some agents may be implemented by calling the operation results of other agents, which can be denoted as citation networks where the link between two nodes denotes that the agent associated with the first node directly cites the operation result of the one associated with the second node. A citation network is a typical interaction structure that is a DAG. Now, we propose that the agents that have no direct citation links may also have indirect citation relations. Then, in a citation structure, from which does an agent cite results? Thus, we need to endow some citation rules among the agents in citation networks, which can design a strategy profile for each agent from which it can cite results.",
               "Multiagent Citation Rules: By introducing the citation concepts in , we design the citation rules of agents according to the property of citation structure, shown as follows. Obviously, to satisfy the requirements of citation rules ?aA, the set of strategies of agent a should have the following properties (decision laws).",
               "1) Law 1: ?aA, ? a ? S a (Citation Rule 1 and 2). 4) An agent cannot cite the operation result of itself (Citation Rule 4). 5) Agent a cannot cite the results of agents in the all-orders dependence structures of a (Citation Rule 5). 6) If two agents are independent of each other in the interaction structures, then they can cite each other (Citation Rule 6). Example 6: shows an agent citation network; therefore, now, we can design some operation citation relations. and 5). 3) Law 3: ?aA, aS a (Citation Rule 4). ). Now, according to the decision laws, we can design the conditional strategy set of agent aA as",
               "Therefore, the decision of the whole system can be the joint distribution of the conditional strategies of all agents which can satisfy the requirements of citation rules, i.e., we have n n"
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "B. Strategies and Decision Making in Multiagent Citation Networks",
               "type": "introduction"
          },
          "paragraphs": [
               "In citation networks, the strategies of a are the set of agents from which a can cite operation results. For example, if S a = {a 1 , a 2 , a 3 }, then agent a can cite the operation results from agents a 1 , a 2 , and a 3 .",
               "Definition 15: In the environment of citation network A, R, where A denotes the agents and R denotes the citation links among agents, a useful decision is the one that restricts the citation relations among agents to satisfy the requirements of multiagent citation rules.",
               "Theorem 5: The decision making of multiagent strategies implemented by and is useful, and the final set of strategies available to all agents can satisfy the citation rules (i.e., can satisfy the decision laws).",
               "Proof: Now, we prove that the decided strategies satisfy the four decision laws. . Therefore, in the decision results determined by , a can cite operation results from agent b?b? a , which then satisfies Law 1. 2) For agent aA, if b is the all-orders dependence agents of a, i.e., ba , then we have b(S a| a = A ? {a} ? a ) according to . Thus, in the decision results determined by , a cannot cite operation results from b?ba , which satisfies Law 2. 3) For agent aA, we have a(S a| a = A ? {a} ? a ) according to . Therefore, in the decision re-"
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "D. On the Adjustment and Scalability in Citation Networks",
               "type": "introduction"
          },
          "paragraphs": [
               "Proposition 1: In the decision results determined by and , agents having structurally equivalent interactions have the same set of strategies except for the citations between themselves, i.e., ab ? ((S a| a ? {b}) = (S b| b ? {a})).",
               "Proof: ab ? ( a = b ). According to ,",
               "Example 7: We take the citation network in as an example. The decision-making result is",
               "1) Adjustment for the Oscillation of Citation Links: Decision making should be adjusted as a choice for the interaction oscillation regarding the history. In the operations of agent systems, some new citation links may be added to the structure and some old citation links may be deleted from the existing structure. We do not need to decide the entire strategies from the beginning, as that would be costly. Instead, we should adjust the existing decided strategies locally.",
               "Given that a citation network N = A, R and N is a DAG, if an existing relation a u , a v is deleted from N , then the new structure N = A, R , R = R ? { u , a v }, is still a DAG. However, if a new citation link is added to the citation network, we need to justify whether there are any cycles in the structure.",
               "While some citation links oscillate in the citation network, we can adjust the decided strategies according to the following adjustment law.",
               "Adjustment Law:",
               "Obviously, the aforementioned SL for the citation network in is useful. Moreover, a 2a 3 ; hence, we have S a2 ? {a 3 } = S a3 ? {a 2 } = {a 4 , a 5 }. 1) Given an environment A, R, a u , a vA, if a new citation link a u , a v is added to the citation network and does not produce any cycles, then the set of strategies",
               "can be changed as follows:"
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "V. RELATED WORK",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Growth Law: Given an environment A, R and the existing decision SL, we let an agent a and some citation links associated with it be added to the existing structure, the new set of agents be A , and the new citation structure be R . The growth of citation links should not produce any cycles in the new citation network; now, we change the strategies of agents according to the following laws.",
               "1) ?a ia , their strategies are changed as",
               "Theorem 7: Obviously, the four parts of the growing law are all determined according to and ; thus, the growth law can obtain useful decision results.",
               "Example 10: We now take (ix) as an example; let a new agent z and two new citation links z, g and h, z be added to the structure. Now, we can change the decided strategies of the system according to our growth law; the result Our research is related to the decision making of multiagents, where each agent should make decisions about which action to perform to ensure a good joint action for the whole multiagent group. Generally, related work can be categorized as follows.",
               "1) Decision Making of Multiagents Based on Game Theory and Economics : While agents inhabit a shared environment, they negotiate with each other to decide their actions - . To conduct negotiations, they always adopt game theory or other economics techniques, such as bargaining, auction, contracting, etc. The negotiation protocols and decisionmaking procedures are always focused. The related works include two aspects: cooperative agents and self-interested agents.",
               "In the decision making of cooperative agents, the agents need to cooperate with each other to solve a problem or to reach a common goal. For example, Moehlman et al. use decentralized negotiation to solve the distributed planning problem; Lander and Lesser employ multistage negotiation as a means to conduct distributed searches among agents; Pelta and Yager consider a problem of mediated group decision making where a number of agents provide a preference function over a set of alternatives and present an optimization approach for the decision strategies in mediated multiagent negotiations. Another typical example for the decision making of cooperative multiagents is the one in robot soccer, where the agents share a common decision-making criterion and take into account what their partners are able to do . Therefore, in cooperative agents, they always negotiate to reach an agreement, and the decision is made according to the maximum utility of the system.",
               "In the decision making of self-interested agents, the agents try to maximize payoff without concern of the global good; thus, such a self-interested agent will choose the best negotiation strategy for itself . Game theory is a branch of economics that is always used to study interactions between self-interested agents . Game theory may be used to analyze the problems of how interaction strategies can be designed to maximize the welfare of an agent in a multiagent encounter and how protocols or mechanisms can be designed that have certain desirable properties . An agent's equilibrium strategy depends on the information that it has about the preferences and behaviors of other agents. The decision making of self-interested agents is typically seen in the market or electronic commerce . For example, present a classification scheme for the negotiation of self-interested agents in electronic commerce.",
               "2) Decision Making of Networked Agents: With large-scale and networked application environments, distributed decision making for the coordination of networked agents has received much attention in recent years. In the related works on decision making of networked agents, a network of agents with initially different opinions can reach a collective decision and hence take action in a distributed manner . Saber and Murray provide convergence, performance, and robustness analyses of an agreement protocol for a network of integrator agents with directed information flow and (perhaps) switching topology, which mainly relies on the tools of algebraic graph theory and matrix theory . Roy et al. introduce a quasi-linear stochastic distributed protocol that can be used by a network of sensing agents to reach a collective action agreement; moreover, they put forth the viewpoint that it is useful to consider the information-fusion and decision-making tasks of networks with sensing agents jointly, as a decentralized stabilization or agreement problem. "
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "describe several new decision-making models that represent, learn, and adapt to various social attributes that influence people's decision making in open mixed networks including agents and people.",
               "type": "modelling"
          },
          "paragraphs": [
               "3) Modeling the Interdependence Among Multiagents: The dependence among multiagents can be modeled by dependence networks. The dependence network can be used for the study of emerging social structures, such as groups and collectives, and may form a knowledge base for managing complexity in both competitive and organizational or other cooperative contexts . model multiagent interdependences among different agents' goals and actions and construct a tool for predicting and simulating their emergence. Wong and Butz propose an automated process for constructing the combined dependence structure of a multiagent probabilistic network, where the dependence structure is a graphical representation of the conditional independencies that are known to hold in the problem domain. Generally, the related works on the interdependence among multiagents mainly focus on the knowledge representation and reasoning dependence among multiagents.",
               "Summarization: The main concerns of related works can be summarized as follows: 1) In the previous decision-making works of multiagents based on game theory and economics, they mainly focus on negotiation protocols and decisionmaking procedures; 2) in the previous works on the decision making of networked agents, they mainly concern the agreement problems in which all agents in the network must achieve the same opinion and on the connection between the network topology and the performance of the agreement protocol; and 3) in the previous works on the interdependence among multiagents, they mainly focus on the knowledge representation and reasoning dependence among multiagents.",
               "Therefore, previous works seldom take into account the interaction structures of agents. Aiming to solve the structured interaction collision problem of networked multiagents, this paper investigates the interaction structure-oriented decision making."
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "VI. CONCLUSION",
               "type": "conclusion"
          },
          "paragraphs": [
               "Networked structures are very popular in the large-scale multiagent systems. We have presented a novel interactionstructure-oriented decision model of networked multiagent strategies, which can satisfy the requirement of interaction structure among agents. The presented model can restrict the strategies of all agents to match their interaction positions. The presented decision-making model contains two parts: One is the basic model for the directed acyclic interaction structure and the other is the extended model for the directed interaction structure with cycles. We theoretically prove that the former can produce the unique outcome, which is to minimize the conflicts among agents, and that the latter can produce the maximum utility. Moreover, the model can produce the same resulted strategies as for isomorphic structures.",
               "Finally, we adopted a multiagent citation network to make a case study. Through the case study, we can then see that our model can minimize collisions for citation relations. In our case study, citation networks are considered DAGs. However, there are also some other special cases of citation structures that are not DAGs, such as mutually citation companion agents and cyclic citation structures occurred in some agents; therefore, we will solve the strategy decision in cyclic citation structures by using our extended model. Moreover, in the future, we will focus on the application of our decision-making model in more complex interaction structures, such as hypergraph, complex social networks, etc."
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     },
     {
          "head": {
               "text": "APPENDIX PROOF OF THEOREM 6",
               "type": "conclusion"
          },
          "paragraphs": [
               "Obviously, the adjustment law can result in a useful decision only if we can prove that the adjustment law satisfies the requirements of the decision laws in Section IV-B.",
               "1) Law 1: ?aA,",
               "and a jS a i . Now,",
               "? ,",
               "and a jS a u . Now,",
               "? When a new citation link a u , a v is added to the citation structure, the following occurs. Now that a j? . ii) When an old citation link a u , a v is deleted from the citation structure, the following happens. Now,",
               "? When an old citation link a u , a v is deleted from the citation structure, the following occurs.",
               "If",
               ", if a i / a j is in the old citation structure, then a iS a ja jS a i is true. Now, it is true that a i / a j is in the new citation structure and",
               "; hence, we do not need to address them.",
               "? When a new citation link a u , a v is added to the citation structure, the following occurs. Now, S",
               "), if a i / a j is in the old citation structure, then a iS a ja jS a i is true.",
               "? When a new citation link a u , a v is added to the citation structure, the following happens. Now,",
               "and S a j a i = S a i ? (A ? S a u ) and a jS a u ; hence, a jS = S a j ? (A ? S a u ). If a i / a j is in the new citation structure, then a i / a u , so a iS a u . Thus, we have a iS a j a i .",
               "? When an old citation link a u , a v is deleted from the citation structure, the following is possible: . ii) For agent a u ? When a new citation link a u , a v is added to the citation structure, the following happens.",
               "Obviously, a i / a j is not true in the new structures; hence, we need not address them.",
               "? When an existing citation link a u , a v is deleted from the citation structure, the following occurs.",
               "If a i / a u or a i? a u is in the old citation structure, then we have a iS a u . We have to the citation structure, the following takes place.",
               "As the citation structure between a i and a j is not changed, if a i / a u is in the new citation structure, then a i / a u is also true in the old citation structure and a iS a ja jS a i . Now, ? When an existing citation link a u , a v is deleted from the citation structure, the following scenario occurs. Since the citation structure between a i and a j is not changed and if a i / a u is in the new citation structure, then a i / a u is also true in the old citation structure and a iS a ja jS a i . Now, S a i ? S a i and S a j ? S a j ; then, we have"
          ],
          "paper_id": "24b3bc60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Decision Making of Networked Multiagent Systems for Interaction Structures"
     }
]