[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "and was under review for 5 months Keywords: Word of mouth Impact Brand commitment Familiarity NPS Using two methods, three measures, and data covering a large number of categories, we present findings on the respondent-assessed impact of positive and negative word of mouth (PWOM, NWOM) on brand purchase probability. For familiar brands, we find that: 1. The impact of PWOM is generally greater than NWOM. The pre-WOM probability of purchase tends to be below 0.5, which gives more latitude for PWOM to increase purchase probability than for NWOM to reduce it. 2. The impact of both PWOM and NWOM is strongly related to the pre-WOM probability of purchase, the strength of expression of the WOM, and whether the WOM is about the respondent's preferred brand. 3. PWOM and NWOM appear to be similar forms of advice-giving behavior, except for their opposed effects on choice. 4. Respondents resist NWOM on brands they are very likely to choose, and resist PWOM on brands they are very unlikely to choose. In the Discussion section, we show how our methods could be used to construct a word-of-mouth metric."
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "1.1.",
               "text": "Defining the field",
               "type": "abstract"
          },
          "paragraphs": [
               "Word of mouth (WOM) is informal advice passed between consumers. It is usually interactive, swift, and lacking in commercial bias. WOM is a powerful influence on consumer behavior. noted that 50% of service provider replacements were found in this way. WOM may be positive (PWOM), encouraging brand choice, or negative (NWOM), discouraging brand choice.",
               "Brand purchase probability will be affected by the relative incidence of PWOM and NWOM about the brand and also by the relative impact of instances of PWOM and NWOM. Here, we are concerned with the impact of PWOM compared with NWOM. There is little evidence on this matter, which may relate to the difficulty of making accurate measurements in this field. Below, we review this measurement problem.",
               "WOM can affect the adoption of new categories and the choice of brands in mature categories. In product adoption research, interest falls on the few initial users of products whose advice to non-users may decide the success or failure of a new product. In mature categories, which are our research focus, changes occur mainly as switching between brands and interest falls on users of the category, who may be a majority of the population when categories such as cell phones and restaurants are studied. Among users of mature categories, WOM acts within a framework of acquired consumer beliefs, preferences, habits, and commercial influences that may constrain or assist response to the advice.",
               "Research on the role of WOM in brand switching is required for three reasons. First, WOM is often the major reason for brand choice, but we do not yet understand how PWOM and NWOM contribute to this influence. Second, some groups are more responsive to WOM than others, and we show how segments with different probabilities of purchase will respond differently to PWOM and NWOM. Third, Net Promoter Score has performed poorly as a predictor of brand/company performance. Our work provides some explanation for this failure, and our methods may be used to develop a better WOM metric."
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "2.",
               "text": "Previous research",
               "type": "abstract"
          },
          "paragraphs": [
               "Although consumers often attribute their brand choice to WOM, it is difficult to observe cases where advice affects brand choice since WOM about a specific category is relatively uncommon and any effect is often delayed. When evidence is scarce, too much weight may be given to the limited research that is available. One solitary field study by is often cited. Arndt found that NWOM had twice as much impact on purchase as PWOM. However, he studied only one brand, and systematic research should be based on all the brands in a category and should include a range of categories. In addition, although the category was familiar, Arndt used a new brand about which there could be few established beliefs. Without direct evidence of WOM effect, inferences have been made from experimental work on the impact of positive and negative information. It is well established that negative information usually has more impact on judgment than positive information but this finding may not extend to the relative impact of PWOM and NWOM on brand choice in familiar categories.",
               "Although there is little evidence, it appears that marketers believe that NWOM has more impact than PWOM. For example, states, \"Negative word of mouth is more influential than positive word of mouth\" (though this claim may conflate relative incidence and relative impact). Conventions in media publicity also support the idea that negative information is more potent. According to the principle, negative copy is four times as persuasive as positive copy.",
               "When direct observation is not feasible, we have to gather evidence on the relative impact of PWOM and NWOM using indirect methods. One method is to measure Internet postings about brands and their subsequent sales performance (e.g., . A problem with this method is that there may be little correspondence between the content of consumer-generated media and face-to-face advice. One is not necessarily typical of the other, and the large amount of face-to-face advice is likely to be the dominant influence on consumption. found that 8% of advice was Web mediated, 70% was face-to-face, and 19% was by telephone. For this reason, we did not specifically explore the effect of Internet advice, though growth of Internet use is likely to make this an increasingly important form of WOM. A second method is to use laboratory experiments to investigate the response to information on familiar brands. Other techniques that may be used include role-play experiments and surveys. These methods also present problems. Role-play may not typify naturally occurring behavior, and the measures of PWOM and NWOM in surveys may be subject to different degrees of bias that will distort the estimation of their relative impact.",
               "Since no single method can provide conclusive evidence, we adopt a three-pronged approach designed to build a persuasive argument about the relative impact of PWOM and NWOM. First, using both roleplay experiments and surveys, we find that PWOM usually has somewhat more effect than NWOM. This finding is similar to experimental evidence that positive and negative information have much the same impact on attitudes when the brands are familiar ). Second, we describe how the pre-WOM probability of purchase (hereafter referred to as PPP) and other variables contribute to the impact of WOM. We show that this evidence suggests that PWOM and NWOM are closely similar behaviors, making it less likely that measures of the two are subject to strongly differential bias. Third, we explain why PWOM could have more effect than NWOM if the pre-WOM probability of purchase (PPP) is less than 0.5, and we find that this is so.",
               "The organization of the paper follows this three-pronged approach. The empirical work is preceded by reviews of relevant research and followed by a discussion of findings."
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "2.1.",
               "text": "Rarity and room for change",
               "type": "abstract"
          },
          "paragraphs": [
               "Fiske observed that negative information is usually rarer than positive information and argued that this made negative information more useful (or diagnostic) than positive information because the latter could often be presumed. For example, evidence that a brand is unreliable is more useful than evidence that the brand is reliable because reliability may be assumed as the default condition for modern products. Under these circumstances, we would expect negative information to have more effect on judgment. Studies have supported this \"negativity effect\" (e.g., .",
               "Fiske's explanation may be expressed in terms of the gap between the position implied by the message and the position held by the receiver. Information that restates what the receiver believes may increase certainty but is unlikely to change other aspects of a receiver's judgment. In contrast, information that differs from the receiver's position may change their judgment. In most circumstances, the greater amount of positive information on everyday matters ensures that the position of most receivers is positive so there will be more impact from negative information when it is received. Exceptionally, when the receiver's expectation is negative and the information received is positive, there could be a \"positivity effect\".",
               "Fiske's work was extended in the accessibility-diagnosticity (A-D) theory of judgmental response . These researchers also suggest that negative information is more useful, or diagnostic, by virtue of its rarity. According to the A-D theory, people use diagnostic information in preference to more accessible information when both are available, so that negative information should normally have dominance.",
               "There are other explanations for the larger impact of negative information. One of these is that the rarity of negative information makes it surprising and, thus, draws more attention . A second is the effect of attribution . For example, a positive Web comment may be discounted because of suspicion that it is \"arranged\". Research on the negativity effect is reviewed in detail by .",
               "Psychological studies typically measure the way attitude is changed by advice. In research on the purchase of brands, it is more relevant to measure the change in the probability of purchase brought about by advice. Accordingly, we measure the impact of WOM on choice as a shift in the stated probability of purchase, from PPP to post-WOM. If the PPP is below 0.5, there is more room for change in response to PWOM than in response to NWOM. For example, if the PPP is 0.4, PWOM can have a maximum effect of 0.6 (up to unity), whereas NWOM has a maximum effect of 0.4 (down to zero)."
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "2.2.",
               "text": "Contrary responses to advice",
               "type": "abstract"
          },
          "paragraphs": [
               "In the preceding section, we assumed that PWOM makes a receiver more positive and that NWOM makes a receiver more negative about the object of advice. However, found that people sometimes reacted against advice and became even more committed to a brand that was subject to negative comment. This contrary response to advice has also been observed by and by . Such contrary responses may be explained by reactance theory . In Brehm's account, reactance is a state of arousal that motivates the maintenance of selfdetermination when it is under threat. Reactance can even occur when people are directed to do things that they want to do.",
               "Reactance effects can be strong in experimental work. In Fitzsimons and Lehmann's study, the recommendation of an unattractive option shifted preference toward the attractive alternative choice while recommendation of an attractive option reduced the preference for this option. Thus, a bizarre feature of Fitzsimons and Lehmann's study was that an attractive option was chosen more often when it was the subject of negative advice than when it was the subject of positive advice, making the advice counterproductive.",
               "Contrary responses may be increased by the experimental design used to investigate them. Advice in experiments is unsolicited and this could arouse caution among participants. In addition, when the effects of advice are measured immediately after receiving it, there is no time for any reactance effects to fade. In retrospective surveys, measures are taken some time after the claimed social exchanges have occurred. Thus, survey evidence will show the eventual effect of the advice rather than the immediate effect. This is more appropriate because consumers do not usually purchase immediately after receiving advice.",
               "There are two other processes that could produce contrary responses. One occurs when the receiver of advice disagrees with the values of the advisor and expects to dislike what he/she recommends and like what he/she dismisses. A second response relates to \"damning with faint praise\". If a receiver expects a strong recommendation from a communicator but receives only a lukewarm recommendation, the object's attraction may be diminished although the advice is still positive. We are concerned about contrary responses because, if these are common, it is difficult to interpret findings on the impact of PWOM and NWOM. work in this field was done by and, more recently, by . The experimental work reviewed above differs from our approach in several ways, particularly:",
               "? The short interval between exposure to the stimulus and measurement of the response gives no time for the impact of information to fade or develop. In surveys, there is usually a substantial interval between the occurrence of WOM and the measurement of any effect.",
               "? Ahluwalia and her colleagues use cognitive and attitudinal measures to assess impact. We use a measure of purchase likelihood that, if accurate, relates to sales gained or lost . Attitude measures could show an increase even when a person was fully committed to repurchasing a brand and purchase likelihood was unchanged."
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "2.4.",
               "text": "What causes WOM?",
               "type": "abstract"
          },
          "paragraphs": [
               "2.3. Experimental studies on real brands: commitment and familiarity propose that prior commitment to a brand may prevent consumers from fully accepting useful negative information about that brand. These researchers describe commitment as a form of attitude strength and measure it with three items that relate to brand retention. To measure the response to information, Ahluwalia et al. use support arguments, counter-arguments, attitude, and perceived diagnosticity (the subjective judgment of diagnosticity).",
               "The first experiment conducted by Ahluwalia et al. showed that high-commitment participants treated written negative information about Nike (in the form of newspaper articles) as less diagnostic than low-commitment participants. In addition, they gave this information less weight and mobilized a substantial number of counter-arguments compared with low-commitment participants. These findings were confirmed in a second study that used a less popular brand of athletic shoe.",
               "In further work, Ahluwalia (2002) compared responses to written positive and negative information on a brand when participants were familiar or unfamiliar with the brand. When the brand was unfamiliar, the negative information elicited more supporting arguments and was perceived to have more diagnosticity and weight. When the brand was familiar, there were no significant differences in the impact of positive and negative information. Thus, Ahluwalia argues that brand familiarity attenuates perception of the greater diagnostic value of negative information and suggests that, under these circumstances, positive information may be perceived to be more diagnostic than negative information when, objectively, this is not so. This work follows earlier work by and , which showed that the impact of advice was greatly reduced when the object of the advice was familiar.",
               "If these experimental findings apply to WOM, we would expect PWOM and NWOM to have similar impacts when the categories are familiar. However, differences between the laboratory and the natural setting may weaken inferences from one to the other and Ahluwalia and her colleagues are careful not to claim that their findings can be generalized to WOM.",
               "In social psychology, the generalization of experimental findings to natural settings has been a matter of concern for many years. Early",
               "We discuss the antecedents of WOM because these cast light on the nature of PWOM and NWOM. Our argument is that PWOM and NWOM are similar behaviors, except for their opposed effects on brand purchase. Researchers have claimed that PWOM is based on satisfaction and NWOM on dissatisfaction (e.g., , which may provide a basis for differential effects. However, , found that the satisfaction or dissatisfaction of the communicator and receiver are the catalysts of WOM in only 12% of cases. Furthermore, PWOM and NWOM had the same triggers, which occurred at similar frequencies. This indicates that the two forms of WOM are very similar in origin. In Mangold et al.'s work, most PWOM and NWOM arose as a response to the perceived need of another or occurred as part of a conversation.",
               "Turning to impact, if we can show that the impacts of PWOM and NWOM rest on the same factors to the same degree, we will support our argument that PWOM and NWOM are similar in nature and, therefore, that biases in their measurement are likely to be similar."
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "2.5.",
               "text": "Factors that may be associated with impact",
               "type": "abstract"
          },
          "paragraphs": [
               "Several factors may be associated with the impact of WOM.",
               "1. Room for change. As we have noted, room for change in purchase probability (in the direction indicated by the WOM) is limited by the PPP, which could favor the impact of either PWOM or NWOM, depending on the mean value of the PPP. 2. The strength of expression of WOM. It seems likely that the strength of expression of WOM directly affects impact. However, sometimes people react against advice, and this could produce an inverse or more neutral relationship between strength of expression and impact. 3. The closeness of the communicator to the receiver. Does advice from a strong tie (a close friend or relative) have more impact than advice from a weak tie (acquaintances and distant relatives)? argued that weak ties have more impact on the transmission of information through a network of social groups because weak ties tend to be members of more groups and can receive information in one group and pass it on in another. studied \"who told whom\" with regard to the customers of piano teachers. Their findings supported Granovetter's thesis (network effect), but they also found that receivers thought that strong ties had more immediate impact (local effect). In this research, we test the local effect. 4. Whether WOM is solicited or not. East, Hammond, studied the relative impact of solicited and unsolicited WOM. They found that the impact ratio of solicited to unsolicited WOM was approximately 1.5 to 1 for both PWOM and NWOM. also claimed that solicited WOM has more impact, but neither of these studies took the effect of other variables into account. It is possible that other variables, such as the closeness of the communicator or the room for change, are related to whether or not the advice is solicited. This could occur if people ask for advice more often from those they are close to or when there is more scope for change. The separate effects of these variables can be established by using multiple regression analysis. 5. Whether the WOM is about the receiver's main brand. WOM about the main brand may have a different effect than WOM about other brands when factors such as PPP are controlled. We would expect PWOM to be more acceptable and NWOM to be less acceptable when it is about the main brand. 6. How much WOM the respondent reported giving on the category that was studied. Here, although we had no prior evidence, it seemed useful to know how those who give WOM are affected by the receipt of PWOM and NWOM. 7. Age, gender and category. We tested the contribution of these variables.",
               "RQ3. Do the same variables explain the impact of PWOM and NWOM to the same degree? RQ4. How do the mean impacts of PWOM and NWOM relate to the PPP? RQ5. Does brand commitment reduce the impact of PWOM and NWOM?",
               "4. Research"
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "4.1.",
               "text": "Preliminary role-play experiments",
               "type": "relatedwork"
          },
          "paragraphs": [
               "We did not directly measure the receiver's need for advice, which would probably make a very substantial contribution to impact; our view here was that this relationship would be close to tautological and not very informative. We did not ask the receiver to assess the communicator's satisfaction or dissatisfaction, which requires inference about the communicator's state of mind. To some extent, the communicator's feelings will affect the strength of expression of WOM, which can be directly assessed by the respondent. In addition, we did not measure the receiver's stated brand commitment but inferred this from the PPP."
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "4.1.1.",
               "text": "Methods",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The preliminary role-play experiments were conducted from 2003 to 2005 using eight surveys, seven in the UK and one in France. Nonusers of the category were excluded. All surveys were one-wave. No incentives were used. All but one of the surveys covered two categories, and some categories were covered more than once. We present each category in a survey as a separate study, giving a total of 15 studies. The methods of questionnaire distribution are shown in together with the sample sizes and response rates (column 1). The main method of distribution was house-to-house delivery, with return by pre-paid mail. In each survey, the investigator delivered to several middle-income suburban districts. A letter requesting help accompanied the questionnaire. In some cases, the investigator spoke to the householder, which may have raised the response rate. There were 1905 respondents in total. The questionnaires carried a range of questions, but only two were relevant to the role-play study. Respondents were asked to state how they would respond if they received symmetrically phrased positive and negative advice from a friend. The response was registered on a 7-point scale, and the questions and scales are illustrated in Appendix A."
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "3.",
               "text": "Research questions",
               "type": "relatedwork"
          },
          "paragraphs": [
               "In summary, the questions that we raise are: RQ1. Which has the most impact on brand choice, PWOM or NWOM? RQ2. How do the variables identified above affect the impact of PWOM and NWOM? shows the findings from the 15 studies on the effect of positive and negative advice. Mean responses for PWOM and NWOM are shown in columns 3 and 4, and the data are ordered by column 3. In answer to RQ1, we find that the impact of the positive and negative advice is similar but that PWOM has slightly more effect, which, with the large amount of data available, is significant (p b 0.001, one-tailed, Wilcoxon exact test). To check the influence of response rate, we correlated the response rates with the scores in columns 3 and 4. These correlations were not significant (p = 0.81; p = 0.93). "
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "4.2.1.",
               "text": "Methods",
               "type": "relatedwork"
          },
          "paragraphs": [
               "We surveyed the recalled impact of PWOM and NWOM on brand purchase using 11 new surveys conducted from 2005 to 2007. Five of the surveys covered one category, and seven covered two categories. We report this research as 19 separate studies. The methods of questionnaire distribution are shown in , together with the sample sizes and response rates (column 1). All studies were onewave, and no incentives were used. In 16 studies, questionnaires were delivered by hand to middle-income homes in urban areas near to London in the UK. The investigator collected the completed questionnaire by arrangement (usually two days later), or pre-paid mail was used for return. In three of these studies, supplementary data collection was made via intercept or friends. In one study, members of the public were approached in a coffee shop (luxury brands). The study of luxury leather goods was conducted by distributing questionnaires to customers of two stores in Lebanon. The study of Iranian restaurants was restricted to Iranians living in the London area, and distribution was via friends. The Lebanese study on luxury leather goods and the hair colorant study (conducted in Japan) were restricted to women. In total, we gathered data from 2544 respondents, but, since only a portion of these had received PWOM or NWOM on the focal category, analyses were conducted on smaller numbers.",
               "The questionnaires covered a range of issues, and the relevant questions are shown for one category in Appendix B. In all cases, respondents were asked if they had received positive and negative advice in the last six months on any brand in a specified category. If advice had been received, respondents were asked to state whether the last instance of PWOM/NWOM had affected their brand choice (or had affected their prospective brand choice when delayed purchase was likely). This measure allowed us to compare the proportion of respondents who claimed to have been affected by PWOM with the proportion of respondents who claimed to have been affected by NWOM.",
               "In each of these studies, we used the Juster scale (shown in Appendix B) to measure the probability of purchase before and after receiving WOM . The Juster scale measures probability in 10% intervals, and have shown that it tracks objective measures quite closely.",
               "Other questions allowed us to establish: (1) how strongly expressed the advice was, (2) whether the communicator was close to or distant from the receiver, (3) whether the advice was about the main brand, (4) whether the advice was sought or not, and (5) how much advice on the category was given by the respondent. We also noted age and gender. shows the results. Column 1 shows the category, method, sample size, and response rate. Columns 2 and 3 show the numbers of respondents who report having received PWOM and NWOM. Columns 4 and 5 show the percentages of these respondents claiming that the last instances of PWOM and NWOM had affected their decision (the studies are ordered by column 4). Columns 6 and 7 are the PPPs for PWOM and NWOM, and columns 8 and 9 are the mean shifts in the probability of purchase produced by the last instances of PWOM and NWOM."
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "4.2.2.",
               "text": "Findings",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The data at the base of columns 4 and 5 show the mean impacts of PWOM and NWOM. Overall, 64% claimed that PWOM, and 48% claimed that NWOM, affected their decisions. A Wilcoxon test on the individual data forming these percentages is significant (p b 0.001, one-tailed exact test), and the difference between the study means (columns 4 and 5 of ) also reaches significance (p = 0.014, onetailed exact test). Based on these results, PWOM is more influential than NWOM. When impact is measured as the shift in purchase probability, we see that PWOM produces a mean shift of 0.20 and that NWOM produces a shift of ? 0.11, making PWOM 76% more influential than NWOM. When absolute numbers are tested, PWOM has significantly more impact than NWOM in the pooled data (p b 0.001, one-tailed exact test) as well as across studies when columns 8 and 9 are compared (p = 0.028, one-tailed exact test). Thus, using both Methods of gathering data: DP is drop-off with free post back; DF is distribution via friends; DC is drop drop-off and collect; CS is distribution and collection in coffee shop; DS is distribution in stores; DI is face-to-face distribution and collection by intercept.",
               "was sought. The first was significant (p b .001), but the second did not reach significance (p = 0.067). Here, again, it appears that the simple association depends in part on other variables since sought advice did not have a significantly greater effect than unsought advice in the regression analysis. The last variable was the amount of WOM given. This is significant in the case of NWOM, which means that those who give more NWOM are more responsive to NWOM received measures of impact, we get the same answer to RQ1: overall, PWOM has more impact than NWOM. We also conducted a check on the level of contrary responses (where PWOM produces a negative shift or NWOM produces a positive shift). Four percent of the responses to PWOM were negative, and 7% of the responses to NWOM were positive. We did not find that the omission or reversal of contrary responses increased the R 2 in later regression analyses, and we used all responses as given.",
               "RQ2 concerned the contribution of different variables to impact.",
               "Step 1 was to use all the variables in an ordinal regression analysis to predict the impact of WOM, measured as a shift in purchase probability . This produced a Cox and Snell R 2 of 0.30 for PWOM and 0.28 for NWOM. Most of the category dummies made a significant contribution, and the categories that related to the impact of PWOM also related to the impact of NWOM (the correlation between coefficients for the categories was 0.63, p = 0.005). Age and gender were not significant in the regression analysis, and we do not further consider these factors further.",
               "Step 2 was to assess the effect on impact of the six variables remaining after excluding age, gender, and categories. For this, we used OLS regression. Initially, we included response rate in the analyses to check its effect but it was found to be insignificant and was removed. is based on only 14 of the 19 studies because data were missing on whether the advice was about the main brand in five of the studies. Comparisons between the 19 and 14 studies, omitting the advice about the main brand, indicated that the 14 studies were typical of the 19. The variables in are arranged in order of the PWOM betas.",
               "From , we see that the PPP, indicating room for change, has the greatest beta weight for both PWOM and NWOM, followed by strength of expression and whether the WOM was about the main brand. These are the main contributors to impact among the variables measured.",
               "The closeness of the communicator does not reach significance for NWOM in the regression analysis but a simple cross-tabulation showed that shifts in the probability of purchase for PWOM and NWOM are 32 and 51% greater for close ties compared to distant ties (both significant, p b 0.001). Thus, it appears that the stronger impact of close ties in a cross-tabulation depends partly on interactions with other variables, the effect of which is removed in a multiple regression analysis. In a similar manner, we tested the simple association between impact and whether the advice was sought/unsought. Impacts for PWOM and NWOM were 24 and 17% greater when advice .",
               "We turn now to whether PWOM and NWOM are determined by the same variables to the same degree (RQ3). shows that the beta coefficients are similar except for whether the WOM was about the main brand, where a reverse in sign is seen. This was expected since it relates to the direction of effect of PWOM and NWOM. PWOM goes with brand commitment but NWOM has an uphill task dissuading a committed respondent. The correlation between the two columns of beta weights in (using absolute numbers) is 0.96 (p = 0.003), showing a high degree of symmetry.",
               "RQ4 was about the relationship of the PPP to the mean impact of PWOM and NWOM. shows the relevant data and presents these data in a more accessible form. For both PWOM and NWOM, we see a relatively straight section on each plot that then deflects toward the x-axis. These deflections can be attributed to the effect of brand commitment and show how this factor constrains impact.",
               "We can compare the overall impacts under these conditions by summing the scores on the y-axis for each point on the x-axis. This gives PWOM a score of 1.94 compared with 1.56 for NWOM. So, PWOM remains 24% more influential when the effect of the distribution of the PPP is removed. Without removing the effect of the PPP distribution, PWOM is 76% more influential than NWOM, indicating that about two-thirds of the greater impact of PWOM can be related to the greater room for change created by the distribution of the PPPs.",
               "The plots in provide a partial answer to RQ5 about the way brand commitment reduces the impact of PWOM and NWOM. We can estimate this effect numerically by imposing regression lines on the last seven points of the PWOM plot and the first seven points of the NWOM plot, and extending these over the areas of deflection. Without the deflection, the score for PWOM would be 2.41 (24% more) and the score for NWOM would be 1.97 (26% more). However, confining the commitment effect to the relevant four points gives 44 and 46% more, respectively.",
               "It is possible that the deflections are related to other factors than brand commitment. To test this, we compared the plots for highcommitment categories against those for low-commitment categories. We reasoned that repertoire categories such as restaurants are low-commitment because a consumer can easily include a new restaurant in his/her repertoire. Also, dropping a restaurant in response to NWOM is easier when there are several alternatives. Based on these assumptions, we grouped restaurants (three studies), leather goods, luxury brands, holiday destinations (two studies), coffee shops, hair colorants and supermarkets as low commitment. shows the plots when the categories are divided in this manner. While near-linear parts of the distribution are similar for the plot Binary interaction terms combining the strength of expression, closeness of the communicator, whether the advice was about the current brand and whether the advice was sought were added to the analyses and did not show significant beta weights in the prediction of the impact of either PWOM or NWOM. Interaction terms combining other variables with PPP were tested. In the prediction of PWOM, strength of expression and current brand interactions with PPP were significant and raised the R 2 from 0.23 to 0.26. In the prediction of NWOM, strength of expression, current brand, Although the output measure is close to ratio-scale and OLS regression is probably more appropriate, ordinal regression (in SPSS) has a convenient facility for creating dummy variables (for the categories).",
               "closeness of the communicator and whether advice was sought were significant and raised the R 2 from 0.21 to 0.26. This evidence shows that the impact of other variables is moderated by room for change, as would be expected. pairs, the rest of the plot shows more deflection for the highcommitment categories."
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "5.1.",
               "text": "Main findings",
               "type": "relatedwork"
          },
          "paragraphs": [
               "We examined the relative impact of PWOM and NWOM on reported brand purchase probability. We used two methods of investigation, employed three measures of impact in total, and gathered data across a range of categories. Overall, PWOM had more impact on brand purchase probability than NWOM. This finding is similar to the findings from experiments. We have also shown that the same determinants govern the impact of PWOM and NWOM, with closely similar weights. This finding suggests that these two forms of WOM are similar behaviors and, thus, that they are likely to have similar measurement biases.",
               "We provided an explanation for the greater effect of PWOM. We found that the prior probability of purchase (PPP) tends to be below 0.5, leaving more room for change in response to PWOM than NWOM. We also found that room for change is related to impact. We can thus employ Fiske's gap explanation to explain why, in this case, there is a \"positivity effect\", with PWOM having more impact than NWOM. This account differs from that of Ahluwalia , who argued that negative information was more diagnostic, but that brand familiarity attenuated the perception of this diagnostic value. By interpreting diagnosticity as the gap between receiver position and message, we found that NWOM is less diagnostic than PWOM with regard to brand choice.",
               "Our work also shows the effect of other factors on the impact of PWOM and NWOM. The strength of expression of WOM has a strong effect on both PWOM and NWOM. If the WOM is about the receiver's main brand, it has a positive effect when it is PWOM and a negative effect when it is NWOM.",
               "We found that the impact of PWOM and NWOM from close ties was more significant in a cross-tabulation than in the multiple regression analysis. This suggests that part of the effect of close ties (e.g., as observed by comes from associated variables. Similarly, we found that advice that was sought tended to have more effect than unsought advice in a cross-tabulation. This finding was significant for PWOM but not for NWOM, but the effect was significant for neither PWOM nor NWOM in the regression analyses. This suggests that earlier work by and should be treated cautiously since this work excluded the effect of other variables. However, the simple association may be more relevant in practical application if associated variables are likely to be invoked by the application."
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "5.3.1.",
               "text": "Setting the record straight",
               "type": "relatedwork"
          },
          "paragraphs": [
               "It is our understanding that both academic and practitioner marketers believe that NWOM has more impact on brand purchase than PWOM. Our evidence indicates that this belief is mistaken. Marketers need to purge their discipline of beliefs that are little more than hearsay, particularly when they apply to one of the most powerful influences on consumption. We need to have an understanding of how PWOM and NWOM exert impact on consumer decision making if we are to conduct more focused research in this field. indicates how the effect of WOM is conditioned by the PPP and commitment. Other forms of communication such as advertising and direct marketing could be similarly conditioned. From the plots we see that positive messages have more impact when the PPP is 0 to 0.5 and that negative messages have more influence in the range 0.5 to 0.9. Thus, the potential impact of WOM, and possibly other communication types, can be estimated from if the PPP of a segment can be assessed using purchase records or management judgment, for example. . Shift in probability of purchase (impact) as a function of PPP. "
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "5.3.3.",
               "text": "A metric for WOM",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Our work describes a method of measuring WOM impact using the Juster scale, while a companion paper by East, measures the relative incidence of PWOM and NWOM. By combining the two methods, we obtain a metric for the net effect of PWOM and NWOM and this may be compared with alternative metrics. The main alternative is Reichheld's (2003) Net Promoter Score (NPS). The NPS was designed to measure the number of people who are likely to provide positive comments about the brand (promoters) minus those likely to give negative comments (detractors). Many firms now use this measure to assess performance. While Reichheld showed support for the NPS in a correlational study, subsequent tests were less encouraging. constructed a measure similar to the NPS and found it to be less effective at predicting company revenue. Further work by , using the industries studied by Reichheld, found again that the NPS gave a poor prediction of performance. In another study, showed that a multiple-item measure, rather than the single-item NPS, gave a better prediction of retention and recommendation.",
               "This poor performance of the NPS may be because WOM is not related to brand performance or because Reichheld's metric fails to accurately measure the effect of WOM. We take the latter position. We identify four potential weaknesses in the NPS in addition to any deficit due to its single-item form. The first weakness is the use of selfprediction (how likely is it that you would recommendto a friend?) since respondents cannot easily anticipate the circumstances that would permit them to give advice about specific firms. The second weakness is the 'one size fits all' feature of the NPS. The measure uses an 11-point scale to measure the likelihood of recommendation, assigning scores of 0 to 6 to detractors and scores of 9-10 to promoters (the NPS is the difference in the percentages of respondents in these segments). This measure does not allow for variation in the impact of PWOM and NWOM across brands in a category. Third, NWOM is not measured in the NPS but is inferred from low PWOM. However, those who give little PWOM may not give NWOM. Indeed, found that those who gave less PWOM also gave less NWOM and that most of the NWOM given was on brands other than the focal brand. found that the incidence of NWOM was more variable in relation to market share than PWOM. This means that specific brands may get more NWOM than PWOM even though there is more PWOM than NWOM in the category. This makes it important to measure NWOM as accurately as possible. The fourth weakness is that the NPS measures the propensity to give advice but the advice that people claim to have received is closer to impact on brand choice.",
               "In our procedure, the incidence and impact of received PWOM and NWOM on all brands in the category are measured. Using the product of incidence and impact measures, we can assess the combined effect of PWOM and NWOM on each brand in a category. We illustrate this in using our own data from 2005 on cell phones in the UK. shows the brands, the number of instances of PWOM and NWOM about each brand, the mean impact on brand purchase probability that each instance of PWOM/NWOM produced, and the products of number and impact. We combine the products to get the net effect of PWOM and NWOM, which should relate to volume gain. To assess the proportionate effect on market share, we divide the net effect by the market share revealed by the respondents. indicates that Motorola and Samsung receive more support from WOM than other brands but, with so few respondents, this is unlikely to be predictive. This metric may perform better than the NPS and thus show that WOM does predict brand performance."
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     },
     {
          "head": {
               "n": "6.",
               "text": "Conclusion",
               "type": "conclusion"
          },
          "paragraphs": [
               "We used role-play experiments and survey methods and found that PWOM usually had more effect than NWOM. We explained why this was found, adapting the explanation that is often cited in support of the belief that NWOM has more impact than PWOM. We showed that the impact of both PWOM and NWOM had the same determinants with closely similar beta weights, which suggests that these two forms of WOM are similar behaviors. This makes it less likely that our findings are distorted by differential recall bias. In this way, we present a persuasive case that PWOM usually has more impact than NWOM.",
               "To what extent do you agree/disagree with the following? \"I am looking for a new restaurant. A friend tells me that he/she has had a negative experience with a restaurant. This would stop me from going there\" Strongly disagree DisagreeSlightly disagree Neither disagree nor agree Slightly agree AgreeStrongly agree To what extent do you agree/disagree with the following? \"I am looking for a new restaurant. A friend tells me that he/she has had a positive experience with a restaurant. This would get me to go there\" Strongly disagree DisagreeSlightly disagree Neither disagree nor agree Slightly agree AgreeStrongly agree "
          ],
          "paper_id": "24f4bd00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Measuring the impact of positive and negative word of mouth on brand purchase probability"
     }
]