[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Social networks have recently been widely explored in many fields; these networks are composed of a set of autonomous social actors and the interaction relations among them. Multiagent computing has already been widely envisioned to be a powerful paradigm for modeling autonomous multientity systems; therefore, it is promising to connect the research on social networks and multiagent systems. In general, there are three views for research on social networks: the structure-oriented view, in which only the network structure characteristics among actors are considered, the actor-oriented view, in which only the behavior characteristics of actors are considered, and the actor-structure crossing view, in which both actors and network structures are considered and their crossing effects are explored. This survey paper mainly concerns studies on social networks that have the last two views and discusses the relationship between social networks and multiagent systems. Because coordination is critical for both multiagent systems and social networks, this paper classifies studies on social networks that are based on the coordination mechanisms among the actors in the social networks. By referring to typical types of coordination situations in multiagent systems, social networks in previous studies can be classified into three classes: cooperative social networks, noncooperative social networks, and multiple social networks; for each class, this paper reviews the existing studies and discusses the challenge issues and possible future research directions. From this survey, we find that social networks can be understood well via a multiagent coordination perspective and also that many multiagent coordination techniques can be cogently applied in research on social networks. Moreover, this paper discusses the advantages and disadvantages of the multiagent coordination perspective by comparing with other perspectives on studying social networks."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "1",
               "text": "INTRODUCTION",
               "type": "introduction"
          },
          "paragraphs": [
               "S OCIAL networks have received much attention recently in many fields. A social network is composed of a set of social actors (such as individuals, groups, or organizations in the society) and the interaction relations between the social actors , , . In general, there are three views taken in studies on social networks: the structure-oriented view, the actor-oriented view, and the actor-structure crossing view.",
               "1. In the structure-oriented view, researchers mainly focus on analyzing the network's topological structure characteristics of interaction relations among social actors, such as the random degree distribution property , the scale-free property , the small world property , or the community structure property , . In this view, the social actors are abstracted into uniform nodes in graphs, and their behavior characteristics are neglected.",
               "2. In the actor-oriented view, researchers mainly focus on analyzing the characteristics and effects of social actor behaviors in social networks, where social networks are considered to be the environments for social actors' behaviors. In this type of view, the characteristics of the topological structures of the social networks are not strengthened , , , , . 3. In the actor-structure crossing view, both social actors and network structures are subjects of concern, and their crossing effects are explored , . Currently, many studies on social networks hold the actor-structure crossing view. In this type of view, researchers investigate both how social network structures influence the behaviors of actors and how the behaviors of actors shape the network structures , , , , , .",
               "In this paper, we mainly survey related studies that have actor-oriented and actor-structure crossing views; the reason is as follows: 1) the structure-oriented view, which neglects the effects of actors, is mainly seen in related studies on complex networks and early social networks, and most recent studies take into account both the actors (especially humans) and social network structures; 2) social actors, especially humans, have critical roles in the evolution of social networks, and real social network structures are always influenced by and could be changed by the behaviors of actors; and 3) specifically, many scholars who study the evolution of social network structures have recently turned their attention to the coevolution of social networks and actors. From the views of actor-oriented and actor-structure crossing, social networks are distributed, self-organizing, and emergent, such that some global characteristics appear from the local interactions of the autonomous actors in the social networks. Multiagent computing has already been widely envisioned to be a powerful paradigm for modeling autonomous multientity systems with the characteristics of self-organizing and distributed computing. Therefore, being inspired from the autonomy-oriented computing method or multiagent modeling method , social networks can be modeled as complex multiagent systems in which the social actors can be modeled as distributed agents with autonomous computing capabilities , , , , , , , .",
               "Next, we ask what multiagent methods can offer to social networks and how multiagent technology helps to analyze social networks? We mainly present the following aspects: 1) the multiagent modeling method can explore the effects of autonomous and interactive actors in social networks, which can be better suited for current social networks in which actors take on more and more important roles; 2) the coordination mechanism in multiagent systems can be used for the interaction of social actors, which satisfies the characteristics of autonomous and collective behaviors of actors; and 3) techniques from multiagent methods for analyzing complex and dynamic systems, such as self-organization, emergence from local interactions to global patterns, adaptation and evolution, can help to analyze the complexity and dynamics of current social networks.",
               "Especially, coordination is critical for multiagent systems and can improve the performance of the overall behaviors of the systems , , , , , , . Similarly, in social networks coordination are also critical and can make actors not only learn successful strategies and adapt to the environments of social networks but also condition their own behaviors on the behaviors of others in social networks , , , , .",
               "Generally, the following coordination techniques are common in multiagent systems: 1) cooperative coordination, which denotes that agents work together toward achieving some common goals , ; 2) noncooperative coordination, which denotes that each agent pursues its own goal irrespective of the others and cannot form an enforceable agreement on any joint actions ; and 3) heterogeneous or multiple-dimensional coordination , , which denotes that agents are heterogeneous and belong to different organizations or the agents have varying types of characteristics or their interaction types are multiple-layered , . While multiagent coordination techniques are applied in social networks, the social networks can be classified into three classes: cooperative social networks, noncooperative social networks, and multiplex social networks. Therefore, this survey paper will review related studies on social networks that are based on these three classes.",
               "In summary, the main contribution of this paper is that it reviews social networks from a multiagent coordination perspective for the first time. Compared with other perspectives, our perspective can consider the impacts of actors and presents an effective and economic method for modeling and simulating the coordination and evolution of social networks. The organization of this survey is shown in . The remainder of this paper is organized as follows. In Section 2, we compare our perspective with other related perspectives on studying social networks; in Section 3, we review cooperative social networks; in Section 4, we review noncooperative social networks; in Section 5, we review multiplex social networks; in Section 6, we summarize the applied multiagent coordination methods and discuss the suitability of the multiagent paradigm to deal with social networks; and finally, we conclude our paper in Section 7."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "2",
               "text": "COMPARISON WITH OTHER PERSPECTIVES",
               "type": "introduction"
          },
          "paragraphs": [
               "The previous perspectives on research of social networks can be categorized into graph theory and structure analysis perspective, empirical data analysis perspective, and multiagent perspective according to the applied techniques. Now we compare our perspective with those previous perspectives."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "2.1",
               "text": "Graph Theory and Structure Analysis Perspective",
               "type": "introduction"
          },
          "paragraphs": [
               "In early stage of studying social networks, the researchers mainly adopt the graph theory and structure analysis perspective , where a social network is depicted in the form of a graph in which the vertices denote the social actors and the edges indicate their interaction relations. In this perspective, only the relational structures among actors are considered; therefore, this perspective adopts the structure-oriented view described in Section 1. To investigate the structural characteristics of actor interactions, graph theory are always used, such as dyads, triads, components, geodesics, centrality, density, peripherality, etc. With the graph theory, the following structural and locational properties of social networks are often investigated : centrality and prestige, structural balance and transitivity, cohesive and overlapping subgroups, roles and positions. The advantage of this perspective is that it has solid theory foundations and there are many mature related graph theory and mathematics tools that can be used; this perspective is good at analyzing the local and locational characteristics of networks. However, such perspective ignores the effects of actors in social networks; moreover, traditional graph theory is mainly based on static data, but it may not perform well when the social networks are large and dynamic. Therefore, to deal with current large scale and dynamic social networks, the traditional graph theory perspective should be improved by introducing other effective means. rent studies of multiagent perspective mainly come from the following aspects:"
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "2.2",
               "text": "Empirical Data Analysis Perspective",
               "type": "introduction"
          },
          "paragraphs": [
               "In reality, many of current studies adopt the empirical data analysis perspective , , which investigates the properties of social networks by means of analyzing the observation or experience data. This perspective mainly includes the following steps: predesign the question and approach, collect data, analyze data, and interpret the analysis results regarding initial questions . In those steps, data collection and data analysis are always concerned. There are many types of data collection methods, such as interview, observation, questionnaires; especially, in the research on online social networks, the empirical data are collected from the Internet and some web crawler tools are often used. On the other hand, the data analysis methods are crucial and really constitute the majority of related studies, such as statistical analysis or data mining .",
               "The advantage of empirical data analysis perspective is that it has good practical feasibility and can be easily used in real applications; moreover, this perspective can perform well in dynamic and large scale environments, such as the social networks in sociology and economics areas. However, this perspective mainly investigates social network properties from empirical data and ignores the proactive knowledge of experts, thus the investigation may sometimes be costly or deviate from the research objective; moreover, the research results are too dependent on empirical data which may be undependable in some environments. Such perspective can be improved by combing it with other perspectives, e.g., there are a few studies integrating the perspectives of graph theory and empirical data analysis , where graph theory method provides the theory analysis for local topology structures and empirical analysis method investigates the global statistical properties of social networks."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "1.",
               "text": "Providing a method for modeling and simulating social",
               "type": "modelling"
          },
          "paragraphs": [
               "networks . One of the most obvious advantages of multiagent system is its capacity of modeling and simulating autonomous distributed systems. Therefore, many related studies adopt multiagent modeling and simulating methods, such as agent based models of collaborative social networks , agent based models of friendship links , and agent based models of social interaction . 2. Providing a means for the realization of intelligent, adaptive, and autonomous services for social networks . Agent technology can provide a flexible service for users in social networks. For example, used the agent and semantic web technologies to enhancing social networks which can deal with the situation where there are huge amount of extremely sparse and heterogeneous users' data. 3. Providing a computing method or algorithm for investigating social networks. This method can utilize the distributed problem solving capabilities of multiagents. For example, Yang et al. integrated the multi-agent system control mechanisms with community discovery algorithm and proposed a multiagent system method which is applied to real-time dynamic web texts for community discovery."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "2.4",
               "text": "Novelty of Our Perspective",
               "type": "modelling"
          },
          "paragraphs": [
               "In fact, our perspective in this paper is a special type of multiagent perspective, which mainly considers the application of multiagent coordination technologies in social networks since coordination is crucial for both multiagent systems and social networks. Now we present the advantages and disadvantages of our perspective by comparing with other perspectives."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "2.3",
               "text": "Existing Multiagent Perspective",
               "type": "modelling"
          },
          "paragraphs": [
               "Both social networks and multiagent systems are composed interacting individuals and are realized for accomplishing some goals, thus it is natural to investigate social networks from the perspective of multiagent systems . , presented the research framework of integrating multiagent systems and social networks. Cur-1. Compared with the graph theory and structure analysis perspective, our multiagent coordination perspective considers the impact of coordination among actors and the emergence from local to global coordination in social networks; and, our perspective can provide a more effective tool for modeling and simulating the autonomous social network systems. However, our perspective may not provide a strict structural analysis method for the local structures and locational characteristics of social networks. 2. Compared with the empirical data analysis perspective, our multiagent coordination perspective can provide a relatively economic means to investigate the social networks since multiagent method can simulate and predict the behaviors and evolution of social networks; moreover, many multiagent coordination techniques can be used for improving the performance of social networks. However, social networks are often very large and wide where millions of actors act concurrently, thus the complexity of social networks is much larger than that understood via the following four corresponding cooperation mechanisms in multiagent systems: collective behavior, coalition, collaboration within an organization, and task allocation. The correspondence relation between cooperative social networks and multiagent cooperation mechanisms is shown in . . Corresponding relationship between the representative studies of cooperative social networks and multiagent cooperation mechanisms. studied in multiagent systems due to their realities and factors in real applications; and, some of rules in mutiagent systems are not true in social networks. Therefore, the practicability and suitability of our perspective in large and dynamic social networks should be solved well. 3. Compared with existing multiagent perspective which mainly concerns how to apply the multiagent modeling and multiagent-oriented software technologies in social networks, our perspective mainly concerns how to apply the multiagent coordination technologies in social networks since coordination is critical for both multiagent systems and social networks. In this paper, we review social networks and provide the challenges and possible research directions from the multiagent coordination perspective for the first time."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "3",
               "text": "COOPERATIVE SOCIAL NETWORKS",
               "type": "modelling"
          },
          "paragraphs": [
               "In cooperative social networks, the actors can cooperate with each other to achieve a common goal. In summary, the representative studies can be classified into four types, as follows:",
               "1. the spreading of behavior in cooperative social networks , , , , where actors mainly have a cooperative attitude toward making decisions when they are interacting with other social actors; 2. community structures and behaviors , , , , where actors within the same community always cooperate with each other because they are often attributed to the same organization or have similar characteristics; 3. the scientific collaboration networks , , , where scientists often build up collaboration communities in accordance with their research topics; 4. task allocation in cooperative social networks , , where actors can cooperate with each other to allocate resources among actors to implement optimal task allocation for multiple tasks in social networks.",
               "Through the comparison between cooperative multiagent systems and social networks, we find that the four typical cooperation types in social networks can be Collective behavior is an interesting and popular phenomenon in multiagent systems , , . In research on collective behavior in multiagent systems, the alignment rule is a widely adopted approach in which an individual agent adjusts its behavior by considering the behavioral strategies of its neighbors , ; especially, imitation is a special form of alignment rule in which an agent imitates the average strategy of other agents . With an alignment rule, all of the agents will reach a consensus within the whole system .",
               "In social networks, a typical form of collective behavior is spreading or diffusion, such as the spreading of behavior in online and human social networks , , and the diffusion of social influence and knowledge in social networks . In fact, the techniques used in diffusion and spreading among cooperative actors are similar to the alignment rule in multiagent systems, i.e., actors use specific mechanisms to adjust their behaviors by considering the average strategies of other actors in the social networks.",
               "Single interaction and multiple interactions are two types of coordination mechanisms in multiagent systems; the former denotes that two agents can obtain coordination result by a single interaction, and the latter denotes that two agents should conduct multiple interactions before the coordination result is achieved. Similarly, in the spreading of behaviors in social networks, sometimes an actor can accept a behavioral strategy from others once it is influenced by others; however, sometimes an actor can accept others' behavioral strategies only after repeated influences. Therefore, we can categorize the spreading of behaviors in social networks into two types: 1) spreading after only needing a single interaction, such as the spreading of emotion and sentiments , or the spreading of viruses or infectious diseases ; 2) spreading after needing multiple interaction reinforcement, such as the spreading of technological innovations , the spreading of living habits or opinions , or the spreading of rumors . The relevant studies mainly concern the spreading performance of different types of behaviors in different social networks.",
               "The structures of social networks can affect the spreading of behaviors , . Usually, in the spreading of behaviors that require only a single interaction, the networks with small-world topologies can spread the behavior farther and more quickly than highly clustered networks, because the former network structure can provide more and faster single interactions; in contrast, in the spreading of behaviors that need multiple interaction reinforcement, highly clustered networks can better promote the spreading of behaviors, because such network structures can provide more redundant ties that can reinforce the interactions. Specifically, Centola  investigated the effects of social network structures in the case of health behavior diffusion and found that an individual agent is more likely to adopt a behavior strategy if it received social reinforcement from multiple neighbors in the social network; thus, such behavior spreads farther and faster across clustered-lattice networks than across corresponding random networks.",
               "Moreover, the characteristics of ties in social networks also influence the spreading of behaviors . In general, it states that strong ties can promote the spreading of behaviors in social networks because agents who interact more often have a greater opportunity to influence one another ; thus, strong ties can better promote the spreading of behaviors that require multiple interaction reinforcements. However, Bakshy et al. conducted an interesting research and found that, although stronger ties are individually more influential, it is the more abundant weak ties that are responsible for the propagation of novel information; therefore, we can suggest that weak ties could play a more dominant role in the spreading of behaviors only requiring a single interaction compared with behavior spreading that require multiple interactions.",
               "Our summary on the spreading of behaviors in cooperative social networks is shown in ."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "3.2",
               "text": "Community Structures and Behaviors in Social Networks",
               "type": "modelling"
          },
          "paragraphs": [
               "Community is popular in many social networks; with community, network nodes (social actors) are joined together in tightly knit groups, between which there are only looser connections , . There are many studies on community in social networks. In summary, the research on community in social networks can be categorized into two classes: 1) community structure detection, which mainly concerns how to detect community structures in social networks; and 2) community formation and behaviors, which mainly concerns how actors form communities and behave under the constraints of communities.",
               "The first class of research is community structure detection, which constitutes the majority of the related studies , . The traditional methods for detecting community structure in networks are based on the structure-oriented view, such as hierarchical clustering , edge betweenness method (by progressively removing edges from the original graph ), the spectral method , and the community mining method for social networks that contain both positive and negative relations . In those community detection methods that are based on the structure-oriented view, the characteristics and effects of social actors are neglected; moreover, they are often implemented in a centralized manner and cannot be fitted into the dynamic networks.",
               "To consider the effects of actor characteristics, the actorstructure crossing view has been recently introduced into community detection, especially applications of the method of agent-based computing (ABC) or autonomy-oriented computing (AOC) . With the agent-based computing method, each actor in the social networks is modeled as an agent and acts autonomously to join or leave the communities; for example, formulated the agents' utility by the combination of a gain function and a loss function and make agents select communities by a game-theoretic framework to achieve an equilibrium for interpreting a community structure. With the autonomyoriented computing method, some agents are distributed in the networks to detect communities; for example, utilized reactive agents to make distributed and incremental mining of communities based only on their local views and interactions. In conclusion, the agent-based computing or autonomy-oriented computing method can be implemented in a distributed manner so that it can be used in dynamic networks.",
               "Another class of research is about community formation and behaviors and is becoming a new and attractive direction for current studies that mainly concern how actors form communities and behave in community structures . For example, explored the participation behaviors in an online photo-sharing community from a multidimensional perspective; aimed at the naming game in social networks and investigated community formation and consensus engineering by an agentbased model. Moreover, community formation is also seen in online social networks; for example, I? iguez et al. addressed opinion and community formation in coevolving networks and developed a dynamic agent-based network model to investigate the coevolution between opinions and community structures.",
               "Usually, the main multiagent techniques applied in community formation and behaviors are coalition formation and structure-based decision making . Coalition formation is a general method in multiagent systems that allows agents to join together to perform certain tasks cooperatively . Based on the coalition formation method in multiagent systems, we can develop a protocol that enables agents to negotiate and form communities in social networks, and provide them with simple heuristics for choosing community partners for considering network structure constraints. Moreover, network structure-based decision making can also be used in community agents in multiagent systems . Moreover, team collaboration among scientists can be modeled by multiagent teamwork and can be analyzed by the sociogram method .",
               "Based on a combination of multiagent and social network technologies, Jiang modeled the scientists as agents with different roles and the collaboration relations as weighted communities and presented a method for locating active actors in scientific collaborations; this method can be effectively used for the assignment of large-scale scientific projects and can reduce the cost of collaborating in research projects. behaviors, in which each actor (agent) can decide its behavioral strategies by considering the strategies of other neighboring actors (agents) in community structures.",
               "In summary, the above two classes of research understood by a multiagent coordination perspective can be expressed in ."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "3.3",
               "text": "Scientific Collaboration Networks",
               "type": "modelling"
          },
          "paragraphs": [
               "A social network provides a popular platform for collaboration among social actors. Specially, the scientific collaboration network has been considered to be a representative social network in previous studies, in which teamwork is an important issue in scientific and technological activities . Currently, some research projects can be very large and cannot be performed by a single scientist; thus, some projects should be conducted with the collaboration of many scientists; and, scientists often build up collaboration communities in accordance with their research topics and interests.",
               "In reality, the research paper is the most common format for publishing scientific results; thus, two scientists are considered to be connected if they have coauthored one or more papers together , . Newmanstudied social networks of scientists in which the actors are authors of scientific papers, and a tie between two actors represents coauthorship of one or more papers. By drawing on the lists of authors in four databases of papers in physics, biomedical research, and computer science, Newman found that the distributions of a large number of statistics on the networks roughly follow a power-law form and also found that there exists a very large group of scientists any two of whom can be connected by a short path of intermediate collaborators. Moreover, Ding found that productive scientists tend to directly coauthor with and closely cite colleagues sharing the same research interests.",
               "By considering the importance of the actors, scientific collaboration can be investigated by combining both multiagent and social network technologies, where the scientists can be modeled as agents and their collaboration relations can be modeled as social networks. For example, the dynamic mechanism of preferential attachment in a coauthorship network can factually be expressed by the dynamic team formation of networked multiagent systems ; highly-productive or influential scientists can be modeled by outlier or prominent Here, the task allocation of multiagents in social networks is highlighted since task allocation is a typical coordination mechanism in which agents are connected in a social network and tasks arrive at the agents distributed over the network , . Without loss of generality, task execution of multiagents in social networks can be described through agents' operations when accessing necessary resources distributed in the social networks . The formal definition of task allocation in social networks via a multiagent perspective can be shown as follows , . Definition 1. Given a social network, hA; Ei, where A is the set of agents and E is the set of social relations, and 8ha i ; a j i 2 E indicates the existence of a social relation between agent a i and a j . It is assumed that the set of resources in agent a i is R?a i ?, and the set of resources required by task t j is R?t j ?. If the set of tasks is T ? ft 1 ; t 2 ; . . . ; t m g, then the task allocation in the social network can be defined as the mapping of task 8t j 2 T; 1 j m, to a set of agents, A?t j ?, which can satisfy the following situations:",
               "1. The resource requirements of t j can be satisfied, i.e., R?t j ? [ 8ai2A?tj? R?a i ?. 2. The predefined objective can be achieved by the task execution of A?t j ?. 3. The agents in A?t j ? can execute the allocated tasks under the constraint of the social network, e.g., 8a i ; a j inA?t j ?, N ij E, where N ij denotes the negotiation path between a i and a j .",
               "Weerdt et al. proved that the complexity of task allocation in social networks remains NP-hard and developed a distributed algorithm based on the contract-net protocol that only requires agents to know local knowledge about tasks and resources. Jiang provided a spectrum between a totally centralized approach and a totally decentralized approach to task allocation in social networks: the centralized heuristic is utilized to control the overall status information, and the distributed heuristic is utilized to achieve the flexibility of task allocation; Jiang's work in combines the influences of social networks and physical networks so that the communication time of executing tasks can be significantly reduced. The task allocation in is implemented based on the resource access situations of agents; the resource access situation of an agent can be influenced by both its social contexts and its physical contexts, shown as follows:",
               "1 sdij where i ?k? denotes the accessibility of agent a i on resource type r k ; the higher i ?k? is, the more likely a i will be allocated the task that requires r k . F i ?k? and Y i ?k? denote the accessibilities of a i for resource r k in physical and social networks, respectively; p and s are used to determine the relative importance of the two types of networks, and p ? s ? 1; PC i and SC i denote the contexts of a i in the physical and social networks, respectively; pd ij and sd ij denote the distance between a i and a j in the physical and social networks respectively; and n j ?k? denotes the amount of resource type r k that is owned by agent a j .",
               "To consider the importance of the agent locality in social networks, Jiang and Li proposed a locality-aware task allocation mechanism in social networks that takes into account both the resources and localities of the agents. Moreover, the preferential attachment of multiagent task allocation in social networks with resource caching was investigated by Jiang and Huang in , in which agents that were (or are) heavily burdened by tasks could have certain preferential rights to obtain new tasks in the future because those agents have easier access to resources in social networks.",
               "Another research approach is to implement task allocation by adjusting network structures to achieve a better performance. presented a decentralized approach to structural adaptation by explicitly modeling problem-solving agent organizations. Their approach enables agents to modify their structural relations to achieve a better allocation of tasks, and agents can set the edge weights to either 0 (disconnected) or 1 (connected) for the task allocations.",
               "In summary, task allocation in social networks can be seen as a special type of task allocation of multiagent systems that considers the influence of social network structures. Therefore, research methods for task allocation in social networks always originate from the methods in multiagent systems.",
               "its own local perception of the social network; however, individual actor may sense the influences from the actors in the global contexts as well as the local neighbors, so it needs to balance the influences of the local neighbors and the ones of the global counterparts in social networks. In fact, the balance between local and global performances in large scale multiagent systems has already achieved successful results ; therefore, in the future we can consider how to extend the related model in multiagent systems into the social networks and investigate how the actors in social networks make trade-off between local and global influences in the spreading.",
               ". Concurrency of multiple spreading processes in social networks. In existing studies, they mainly consider the situation where only one spreading process is taking place at a time. However, in reality there are multiple spreading processes from collective agents to collective agents which may take place concurrently. Therefore, in the future it needs to explore the concurrent mechanism and correlation effect of multiple spreading processes in the large social networks.In previous studies of large scale multiagent systems in control area, the coordination of concurrent actions of many agents has been significantly investigated. Therefore, the future work can be based on those related multiagent coordination models and extend them to the situation of spreading in social networks, e.g., the future work will deal with how an actor decides its behavior when it encounters multiple spreading processes.",
               "In the community structures and behaviors in social networks, the following issues should be addressed:"
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "3.5",
               "text": "Challenges and Future Research Directions",
               "type": "modelling"
          },
          "paragraphs": [
               "Now we summarize some challenges in existing studies of cooperative social networks and present some insights on the future research directions from a multiagent coordination perspective, shown as follows.",
               "In the spreading among cooperative agents, the following issues should be addressed:",
               ". Trade-off between local and global influences. In existing studies, each actor acts solely on the basis of . Impacts of social and behavioral factors in community detection. Existing studies on community detection in social networks are always based on the structure-oriented view; although there are some related studies based on the multiagent methods, they only use software agents as a computing means to detect the community structure. However, in real social networks, each actor has different and complex social and behavioral characteristics which are important to the formation of community and should be considered systematically. In the future, the related models of social agents and artificial society systems may be extended to the community detection area. . Social laws in community-constrained behaviors.",
               "Social laws in multiagent systems allow the agents enough freedom on the one hand, but at the same time constrain them so that they will not interfere with each other in the system . In the future, the social laws in community-constrained behaviors will be explored, which can both discover the rules of collective behaviors in communities and restrict the actors to take reasonable behaviors in communities. . Correlation effects of behaviors between different communities. Although there are many existing studies on the structural overlapping between communities, they do not make systematic investigation on the correlation effects of behaviors between communities. Thus, how the behaviors in a community is transferred to another overlapping community will be concerned in the future."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "4",
               "text": "NONCOOPERATIVE SOCIAL NETWORKS",
               "type": "modelling"
          },
          "paragraphs": [
               "When two agents have no common goals and behave without considering one another's benefits, we can say that those two agents are noncooperative. Noncooperative actions might take place among agents that serve the interests of truly distinct parties. Currently, noncooperative coordination has attracted much attention in multiagent systems where the agents are self-motivated and attempt to maximize their own benefits , . Similarly, in social networks, there can be selfish actors; networks with such actors are called noncooperative social networks . Usually, the methods used for noncooperative social networks are very similar to the methods used for noncooperative multiagent systems, such as game theory , mechanism design , trust and reputation mechanisms , and formation adaptation , . Therefore, noncooperative social networks can be modeled well by noncooperative multiagent technologies. Representative studies on noncooperative social networks are the following:",
               "In the scientific collaboration networks, the following issues should be addressed:",
               ". Multiplexity in scientific collaboration networks.",
               "Current studies on scientific collaboration networks always concern single collaboration relation, such as cauthorship. In fact, scientists may have many collaboration relations simultaneously; and each type of relation may play different role in the networks. Therefore, in the future we can study the impact of such multiplexity on evolution and dynamics of scientific collaboration networks. In this direction, the multi-linked negotiation and multidimensional organizations of multiagents can be based. . Group dynamics in scientific collaboration networks. Current related studies always concern the behavior of individual scientist in scientific collaboration networks. In fact, scientists often form some groups and the scientists in one group always undergo the same research project or the similar research topics. The formation of groups is often dynamic and can be evolved as the science develops; therefore, the group dynamics in scientific collaboration networks should be dealt with in the future.",
               "1. diffusion and spreading among noncooperative actors in social networks, where threshold or game theory-based decision making is often used while each actor makes decisions by considering the other actors' influence , ; 2. evolution of collective behaviors of noncooperative actors in social networks, which is called social games and in which the Prisoner's Dilemma game is often used ,; 3. task allocation of self-interested actors in social networks, where actors can compete for resources in the execution of tasks , ; 4. undependable social networks, which is an extreme type of noncooperative social networks where some malicious or deviant actors take subjective initiative for generating malicious behaviors , , .",
               "The related studies on noncooperative social networks and the often-used multiagent coordination techniques are shown in ."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "4.1",
               "text": "Spreading of Behaviors in Noncooperative Social Networks",
               "type": "modelling"
          },
          "paragraphs": [
               "In the task allocation in cooperative social networks, the following issues should be addressed:",
               ". Community-based task allocation. Existing studies often implement the task allocation on agents. In fact, current social networks are often composed of many communities, and the cooperation of agents is always constrained by communities. Therefore, task allocation should consider the impact of communities; and the community-based task allocation will be explored in the future. We think that such topic may be launched based on the related studies of task allocation via coalition formation in multiagent systems.",
               "In Section 3.1, we review the spreading of behavior among cooperative actors by analyzing the relationships between spreading forms and network structures. Next, we review spreading among noncooperative actors based on the multiagent coordination techniques used. In the noncooperative collective behavior of multiagent systems, three techniques are often used: game theory , threshold theory , and trust/reputation . Accordingly, the related studies on the spreading of behaviors in noncooperative social networks are also categorized into three types: game theory-based spreading models, threshold theory-based spreading models, and trust/reputationbased spreading models.",
               "A game theory-based spreading model is always used in scenarios in which an individual's behavior is the result of a strategic choice among competing alternatives , such as the diffusion of technologies, advertisements, or innovations , . represented a social network by a graph in which each node represents an agent in the system; then, they studied the spreading of innovations in social networks based on the dynamics of coordination games: each agent or player must make a choice between two alternatives ?x i 2 f?1; ?1g?; the payoff of each of the two choices for the agent increases with the number of neighbors who are adopting the same choice; finally, they showed that innovation spreads much more slowly on well-connected network structures that are dominated by long-range links compared with low-dimensional structures that are dominated, for example, by geographic proximity. Alon et al. introduced a game-theoretic model for competitive diffusion and studied the relation between the network diameter and the existence of pure Nash equilibria in the game; the strategy space of each agent in the game is the set of vertices V in the network that can simulate the strategy of actors in competitive diffusion; finally, they showed that, if the diameter is at most two, then an equilibrium exists and can be found in polynomial time, whereas if the diameter is greater than two, then an equilibrium is not guaranteed to exist. RodriguezAchach et al.",
               "studied a diffusion model of innovations in a network of agents that are characterized by their technological level; there, agents can follow Nash or Pareto strategies when they decide whether to upgrade their level or not. They found that the strategy that maximizes the velocity of progress depends on the value of the upgrading cost, independently of the relative number of agents that use one or the other strategy.",
               "A threshold theory-based spreading model is used as one explanation for the diffusion of innovations and other social collective actions of success or failure in which an agent decides whether to adopt a behavior strategy that is based on the proportion of agents in the social network already adopting such a behavior strategy . In the model, each agent has a threshold; the agents with low thresholds can easily adopt others' behavior strategies, and the agents with high thresholds may adopt others' behavior strategies only after most of the others have adopted that behavior strategy. Borodin presented a threshold model for competitive influence in social networks, and suggested several natural extensions to the well-studied linear threshold model. Jiang presented a novel collective strategy diffusion model that not only was based on the proportion of agents that have already adopted a behavior strategy but was also based on the collective social positions of those adopter agents; an agent decides to accept a behavior strategy if the number of adopters and their collective social positions are more than a predefined threshold.",
               "A trust and reputation-based spreading model is based on agents' past behaviors in social networks. Trust can be defined as an agent's expectation of another agent's behaviors based on their past interactions. An agent will incline to adopt another agent's behavior strategy if it trusts that agent; for example, in the diffusion of recommendation information, an agent will decide whether to rely on another's recommendation according to its trust in the agent . The reputation of an agent refers to other agents' opinions of that agent, which is available to other agents even when they have not interacted with that agent; if an agent's reputation is higher, then its behavior strategies will be more easily accepted by other agents in the spread. For example, Paolucci and Conte focused on social reputation as a fundamental mechanism in the diffusion of socially desirable behavior and presented a cognitive analysis of reputation."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "4.2",
               "text": "Social Games in Social Networks",
               "type": "modelling"
          },
          "paragraphs": [
               "Social games are games played by agents that are placed in social networks. Certainly, the game theory-based spreading model introduced in Section 4.1 is a special type of social game. Next, we will review general social games in social networks, which can be categorized into two types according to the actor-structure crossing view: one type constitutes the social games that are played by agents under the constraints of the existing network structure; the other type is that agents play social games to form a new network structure.",
               "The first type of research is to implement social games by satisfying the constraints of the existing network structure, which mainly concerns the effect of the network structure on the games. Abramson and Kuperman studied an evolutionary version of the Prisoner's Dilemma game played by agents placed in a small world network, where agents can change their strategy by imitating the strategy of the most successful neighbor; they observed the effects of different topologies, ranging from regular lattices to random graphs, on the emergent behaviors of agents, and they found surprising collective behaviors that correspond to small-world systems. Gracia-L ? zaro et al. performed a large experiment with humans playing a spatial Prisoner's Dilemma on a lattice and a scale-free network, and they observed that the levels of cooperation in both networks are the same.",
               "Another type of approach is to implement social games to form new network structures for achieving better performance, which mainly concerns how to reach a social network structure that can obtain high payoffs. Skyrms and Pemantle presented a dynamic model of social network formation by repeated games played by agents; the game payoffs determine which interactions are reinforced, and the network structure emerges as a consequence of the agents' learning behavior during the games. Moreover, Corten and Buskens studied how agents handle coordination problems if the social network structures can be changed by the agents and co-evolve with the agents' behavior in coordination; they provided the coordination games in which agents can choose both their behavior and their interaction partners such that the social network structures can be adapted."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "4.3",
               "text": "Task Allocation of Self-Interested Actors",
               "type": "modelling"
          },
          "paragraphs": [
               "In contrast to Section 3.4, we review here the related work on task allocation of self-interested actors in social networks, which is different from the task allocation in cooperative social networks because the agents holding the resources are self-interested when they are allocated with tasks. Usually, the related studies aim to design a mechanism or an optimal algorithm to incentivize agents to be selfless in the task allocations. One of the benchmark studies was conducted by , who treated social networks from a multiagent coordination perspective is shown in . the problem as a mechanism design problem in which every agent is incentivized to contribute its true resources; the mechanism design for such a problem is defined as follows :"
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "4.4.1",
               "text": "Undependable Actors",
               "type": "modelling"
          },
          "paragraphs": [
               "Given the parameter space Z, the strategy space A and the social welfare function W , the mechanism design problem for task allocation in social networks is to find a mechanism M ? ?O; p? that comprises an allocation function O : Z ? A m ! , and a payment function p i : Z? A m ! R such that the selected output o maximizes the total social welfare W ?o?.",
               "Therefore, the aim of task allocation of self-interested actors is to obtain an efficient and truthful mechanism . developed an algorithm that was based on the contract-net protocol, which is completely distributed; the algorithm assumes that agents have only local knowledge about tasks and resources; an agent with a task is called a manager, and its neighboring agents may act as contractors to provide their resources to this task. The presented algorithm can decide which tasks to execute and which resources of which contractors to supply their resources so that the total value of the allocated tasks is maximized. The results demonstrated that the algorithm can work well in three different types of social networks, namely small-world, random, and scale-free networks; moreover, the algorithm can scale well to large-scale applications."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "4.4",
               "text": "Undependable Social Networks",
               "type": "modelling"
          },
          "paragraphs": [
               "Dependability is the property of a social actor that allows reliance to be justifiably placed on its behavior, as perceived by other actors in the social network; a social network is undependable when some behaviors deviate from agreed-upon expected behaviors. In fact, undependable social networks can be considered to be one extreme type of noncooperative social network, where undependable actors could have subjective (deliberate) initiative to make some deviation or malicious behaviors in their coordination. Therefore, we review the undependable social networks separately from the aforementioned noncooperative social networks.",
               "Here, we review the existing studies by considering the following two typical situations: undependable actors and connections. Related studies mainly aim at either incentivizing actors to perform the expected behaviors or preventing actors from performing malicious behaviors; to achieve such aims, some multiagent coordination techniques are used in the related studies: game theory, trust/reputation, or formation adaptation. A summary of undependable Currently, social networks are becoming more popular; a side-effect of this growth is that possible exploits can turn social networks into platforms for malicious activities . There are two types of actors in an undependable social network: cooperator and defector. A cooperator is someone who pays a cost, c, for another individual to receive a benefit, b; a defector pays no cost and does not distribute any benefits . In undependable social networks, an actor may choose to behave as a cooperator or defector according to surrounding environments for maximizing benefits. For example, Ohtsuki described a surprisingly simple rule in a Nature letter that is a good approximation for all network structures, including cycles, spatial lattices, random regular graphs, random graphs and scale free networks: natural selection favors cooperation, if the benefit of the malicious act, b, divided by the cost, c, exceeds the average number of neighbors, k, which means b=c 9 k. Moreover, introduced the continuous snowdrift game, in which cooperative behaviors are costly but yield benefits to others as well as to the cooperator itself; thus, such a game can be used in undependable social networks to encourage agents to act as cooperators.",
               "Jiang et al. addressed task allocation for undependable multiagent systems in social networks, in which there are deceptive agents that might fabricate their resource status information during task allocation but not truly contribute resources to task execution. To achieve dependable resources with the least access time to execute tasks in undependable social networks, Jiang et al. presented a task allocation model that was based on the negotiation reputation mechanism, where an agent's past behaviors in the resource negotiation of task executions can influence its probability to be allocated new tasks in the future. In this model, the agent that contributes more dependable resources with less access time during task execution is rewarded with a higher negotiation reputation and could receive preferential allocation of new tasks. The task allocation model in is superior to the traditional resources-based allocation approaches and game theory-based allocation approaches in terms of both the task allocation success rate and the task execution time, and it usually performs close to the ideal approach (in which deceptive agents are fully detected) in terms of the task execution time.",
               "The electronic commerce community is a typical undependable social network, in which some actors may generate deceiving or malicious behaviors for the purpose of gaining benefits. proposed a social mechanism of reputation evaluation that aims at avoiding interactions with undependable participants in C2C electronic communities; with such a mechanism, the malicious agents can be easily identified. Moreover, some criminals can use undependable social networks to commit a crime; therefore, fighting criminals in social networks is important for current society. Xia proposed a technique that employs a trust propagation algorithm to help criminal investigators to infer the criminal probability of actors by using verified partial information. tiagent systems will be extended to explore the complex spreading in social networks."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "4.4.2",
               "text": "Undependable Connections",
               "type": "modelling"
          },
          "paragraphs": [
               "Another situation of undependable social networks is that the social connections may be undependable. Usually, if the connections are undependable and cannot provide the desired results, actors will take some measures to adapt the connections. Thus, it is natural and desirable to allow evolution of the social network structures . To adapt social network structures to prevent undependable connections, game theory is often used in which the interactions are modeled as games. Skyrms and Pemantle considered a dynamic social network model in which agents play repeated games in pairs, and the game payoffs determine which connections are reinforced; thus, the network structure emerges as a consequence of the dynamics of the agents' learning behavior, with the result that the undependable connections can be prevented. Moreover, Corten and Buskens modeled the conventions as coordination games, where individuals can choose their interaction partners; thus, undependable connections can also be prevented to some degree.",
               "Furthermore, some social connections may be undependable because they cannot provide the desired resources, as a result of some failures. For example, the social connections that are based on mobile technologies could be inaccessible because of poor signals for the underlying communication networks. In such cases, agents should adapt the formation of network structures for dependable and good performance. For example, presented a decentralized approach with structural adaptation to generate more dependable connections so that better performance can be achieved.",
               "In the social games in social networks, the following issues should be addressed:",
               ". Emergence from local equilibrium to global equilibrium in heterogeneous social networks. Existing studies always concern how agents reach local equilibrium with their neighbors in homogeneous social networks. However, many social networks are heterogeneous; thus the emergence from local equilibrium to global equilibrium in the heterogeneous environments is an important issue to be solved.",
               "In the task allocation of self-interested actors, the following issues should be addressed:"
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "4.5",
               "text": "Challenges and Future Research Directions",
               "type": "modelling"
          },
          "paragraphs": [
               "Now we summarize some challenges in existing studies of noncooperative social networks and present some insights on the future research directions from a multiagent coordination perspective, shown as follows.",
               "In the spreading among noncooperative agents, the following issues should be addressed:",
               ". The impact of evolution of agent roles on task allocation. In existing studies, the agent' roles are fixed, i.e., each agent is self-interested to maximize its own benefits. However, in real noncooperative social networks, some agents may also take cooperative actions while they find that the cooperative strategies can bring more benefits; therefore, the roles of agents may evolve according to the surrounding environments. Then, how does such evolution of agent roles impact the task allocation? Such issue will be addressed in the future. . Self-adaptive task allocation in dynamic social networks. Existing studies always assume that the task allocation results are fixed until the tasks are completed. However, now social networks are often dynamic where the interaction structures and resource distribution may be changed during the task execution. Therefore, in the future the task allocation should be implemented to adapt for the dynamic social networks.",
               "In the undependable social networks, the following issues should be addressed.",
               ". Group game theory in spreading. Existing related studies based on game theory always adopt the form between two agents. However, in current social networks, agents may form some groups or communities; and the agents in each group or community may take the same interests. Therefore, in the future the spreading between noncooperative groups in social networks will be explored based on the group game theory of multiagent systems. . Dynamic and non-linear threshold model in spreading. Existing studies of threshold-based spreading mainly adopt the linear threshold model. However, in real social networks, there may be no direct proportionality between input and output of an agent in the spreading; and the behaviors of some agents cannot be summed up to produce the final state. Therefore, the dynamic and non-linear threshold-based decision making models in mul-",
               ". Group collusion behaviors in undependable social networks. Existing studies only consider the undependable behavior of individual agent. In fact, some agents in social networks may collude with each other to take group malicious behaviors. Therefore, how to locate and prevent group collusion behaviors is a crucial problem in undependable social networks. To solve such problem, we think that related studies in collective malicious agents can be introduced; certainly, there are still many differences between collusion behaviors in social networks and the ones in multiagent systems, such as the collusion mechanism and organization, which need to be addressed well. . Improving the fault tolerance for undependable connections. Existing studies mainly focus on how to prevent undependable connections. Now, we think that the fault tolerance for undependable connections is also very important. In fact, in multiagent systems there are already some studies on fault tolerance for malicious agents that are always implemented by replication and voting. If we use the replication technique in undependable social networks in the future, a new replication mechanism for satisfying the requirements of social networks needs to be presented.",
               "the independent links. Therefore, interactions via different link types are implemented independently, but the independent interaction results will be combined together and compromised by the receiver actors in the end. Brummitt et al.",
               "studied cascades in multiplex social networks by generalizing the threshold cascade model, in which an actor activates if a sufficiently large fraction of its neighbors in any type of link are active. In their diffusion model, the influences of behaviors via different types of links arrive at an actor independently; the actor becomes active if the fraction of its active neighbors in any link type exceeds a certain threshold, i.e., the following condition is satisfied :"
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 19,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "5",
               "text": "MULTIPLEX SOCIAL NETWORKS",
               "type": "modelling"
          },
          "paragraphs": [
               "In multiagent systems, there is a special type of coordination that is called multi-linked negotiation. The concept of multi-linked negotiation was presented by , ; they mainly described situations in which one agent needs to negotiate with multiple agents about different issues, and the negotiation over one issue influences the negotiations over the other issues. Obviously, the complexity of multi-linked negotiation is much higher than the complexity of single-linked negotiation. Similarly, there is also a new type of social network that is called multiplex social networks (MSNs), in which actors are connected by multiple types of links , ; for example, people in a society interact via their friendships, family relationships, and/or more formal work-related links . In the multiplex networks, the actors belong to different layers of heterogeneous networks that partly overlap or even entirely overlap , . From similar characteristics between multi-linked multiagent negotiation and multiplex social networks, multiplex social networks can be easily modeled by multi-linked multiagent negotiation views.",
               "In general, there are two approaches for multi-linked negotiations in heterogeneous multiagent systems , : 1) independent negotiation: addressing multiple issues independently as separated issues during negotiations and ignoring their interactions; and 2) correlated negotiation: making decisions by considering the correlation between different negotiation issues and finding a compromised solution that satisfies all of the issues. Similarly, the related studies on multiplex social networks can be categorized into two types: independent multiplex networks and correlated multiplex social networks, as shown in . Next, we will review those two types of studies separately.",
               "where r denotes the number of link types, i denotes the type i links, m i denotes the amount of active neighbors, k i denotes the amount of all neighbors, and denotes the predefined threshold. Finally, it showed that multiplexity in social networks can facilitate cascades.",
               "Then, Yag ? an and Gligor presented an improved model on the diffusion of influences in random multiplex networks. In their model, each link type is associated with a content-dependent parameter c i in ?0; 1? that measures the relative bias that type i links have in spreading such context. All of the types of links spread the contexts according to their biases, but finally, the receiver actor will combine the received results and decide its state; such a receiver actor will become active if the following condition can be satisfied :",
               "Moreover, Li et al.",
               "studied the influence propagation and maximization for multiplex social networks. They proposed a model of influence propagation in multiplex networks which contains multiple typed labels on both agents and links. Therefore, the novelty in is that their multiplexity contains both multiple types of links and multiple types of agents."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 20,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "5.1",
               "text": "Independent Multiplex Social Networks",
               "type": "modelling"
          },
          "paragraphs": [
               "In independent multiplex social networks, all of the types of links are independent from each other, i.e., the interactions via different link types are independent. For example, in the information diffusion in independent multiplex social networks, the diffusion processes via different link types are independent, and the actors decide their states by filtering the final received information from In reality, links of different types may influence each other; for example, a person with many links in the friendship layer is likely to also have many links in another social network layer. Such a nonrandom or correlated multiplexity has recently been observed in large-scale social network analysis . In correlated multiplex social networks, the key is to study how the interplay among multiple correlated social networks affects the behavior of actors. For example,explored how the correlation of different network types determines the organization of the social system; specifically, they studied correlations and overlap between different types of links and demonstrated the tendency of individuals to play different roles in different networks.",
               "Lee et al.",
               "presented two cases in correlated multiplex social networks: 1) maximally positive correlated multiplexity, where an actor's degrees in different layers are"
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 21,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "text": "TABLE 1 Applied Multiagent Coordination Methods, Theory Foundations, and Characteristics of Three Classes of Social Networks",
               "type": "modelling"
          },
          "paragraphs": [
               "maximally correlated to their degree order, i.e., the actor that has the largest degree in one layer also has the largest degree in the other layers, and vice versa; 2) maximally negative correlated multiplexity: a node's degrees in different layers are maximally anti-correlated in their degree order, i.e., a node that has the largest degree in one layer has the smallest degree in the other layer. They demonstrated that correlated multiplexity can dramatically change the giant component properties.",
               "Buldyrev et al.",
               "studied catastrophic cascades of failures in correlated networks and found that a fundamental property of correlated networks is that a failure of actors in one network can lead to a failure of correlated actors in other networks. They found a surprising result: a border degree distribution increases the vulnerability of correlated networks to random failure, which is opposite to how a single network behaves. Therefore, their results show that there may be basic differences between a single network and correlated multiplex networks. Moreover, Gmez-Garde? es et al. showed that multiplexity enhances the resilience of cooperation to defection, which relies on a nontrivial organization of cooperative behavior across network layers. investigated the correlation of behaviors among different types of links and presented a model for the scalable learning of collective behavior in correlated social networks.",
               "Kazienko et al.",
               "presented a new recommendation method in multiplex social networks that takes into account all users' activities stored in separate lays of multiplex social networks. Leicht and Souza studied large systems in which multiple networks with distinct topologies coexist and in which elements distributed among different networks can interact directly; they developed a mathematical framework that was based on generating functions for analyzing a system of more than one interacting network given the connectivity within and between networks; finally, they found that the percolation threshold in an individual network can be significantly lowered once ''hidden'' connections to other networks are considered."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 22,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "5.3",
               "text": "Challenges and Future Research Directions",
               "type": "modelling"
          },
          "paragraphs": [
               "Now we summarize some challenges in existing studies of multiplex social networks and present some insights on the future research directions, shown as follows.",
               ". A feasible research methodology specially for multiplex social networks. As said above, the existing studies always adopt two methods to investigate multiplex social networks: dividing multiplex networks to several single-relation networks, and extending the concepts from single networks to multiple networks. Therefore, the real methods are still originated from previous methods on single social networks. In fact, there are some significant differences between multiplex networks and single networks, thus a new feasible methodology specially for multiplex networks is needed. ; inspired by this concept, in the future we can explore the transfer coordination among network layers, i.e., the coordination results for one network layer can be transferred to another network layer. Moreover, the multiagent technique can predesign the question and the proactive knowledge for the research framework, and then the empirical data analysis techniques can be based on such proactive knowledge to implement the collecting and analyzing data in real social networks. . Improving the suitability of multiagent models for real social networks."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 23,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "7",
               "text": "CONCLUSION AND FUTURE WORK",
               "type": "conclusion"
          },
          "paragraphs": [
               "correlated effects between network layers will also need to be investigated systematically."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 24,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     },
     {
          "head": {
               "n": "6",
               "text": "SUMMARIZATION AND DISCUSSION",
               "type": "conclusion"
          },
          "paragraphs": [
               "In summary, the applied multiagent coordination methods, theory foundations, and main characteristics of the three classes of social networks are shown in . From , we can see that the research of each class of social networks can introduce the related multiagent techniques. However, it is not fully perfect while the multiagent coordination techniques are used in real social networks; in fact, there are many limitations on the suitability of the multiagent paradigm to deal with social networks. For example, the results achieved by the multiagent model may not accord with the real social networks. This is because the social networks are natural phenomena that need to be modeled, simulated, analyzed, and their properties investigated; comparatively speaking, multiagent systems are artifacts that are constructed to achieve certain goals, and appropriate control strategies need to be devised for them.",
               "To improve the suitability of multiagent models in the research of social networks, we may use the multiagent model as an intermediary means to study social networks and can be expressed as follows: when sufficient knowledge about the social networks is difficult or impossible to know, we can construct a preliminary multiagent model that is based on some observable behaviors; with assumptions about unknown knowledge on social networks, the multiagent model can predict the behaviors of social networks and can be verified by data from real social networks. Moreover, this multiagent model for social networks can be continually improved by taking more observable data on social networks, and this process will be repeated until a good multiagent model of the social network is achieved. This method is shown in .",
               "On the other hand, as said in Section 2.2, the empirical data analysis perspective has good practical feasibility and can be easily used in real applications; moreover, this perspective can effectively investigate the natural phenomena and perform well in dynamic and large scale environments, such as the social networks in sociology and economics areas. Therefore, to improve the suitability of multiagent model for real social networks, we can combine it with the empirical data analysis technique, e.g., the Social networks are distributed and are composed of a set of social actors and their interaction relations. Multiagent technologies have already achieved significant success in past years, especially for modeling and analyzing autonomous and distributed multientity systems. The questions then arise of how to connect social networks and multiagent systems and how to use multiagent technologies to model and analyze social networks. This paper attempts to answer this problem by surveying social networks from a multiagent perspective.",
               "In this paper, we mainly review the related studies of the actor-oriented view and the actor-structure crossing view. Since coordination is critical for both multiagent systems and social networks, this paper proposes that coordination mechanisms can be used as links between research on multiagent systems and research on social networks. Therefore, this survey paper mainly categorizes related studies on social networks based on the coordination mechanisms among the actors in the social networks, which mainly include three typical classes: cooperative social networks, noncooperative social networks, and multiplex social networks. Then, for each class, we review the representative works and discuss their relationship with corresponding multiagent systems, and we also present the challenge issues and possible future research directions.",
               "With this survey, we find that there is a very close relationship between social networks and multiagent systems, and social networks can be understood well via a multiagent coordination perspective. Therefore, we can conclude that the research on social networks and multiagent systems can be correlated and can crossfertilize each other in reality.",
               "However, although it is obvious that multiagent techniques are beneficial to research on social networks from this survey, in fact, there are still some effective multiagent coordination techniques that have not been fully used for social networks. In the future, several important research issues must be addressed. First, reasoning is an important function of an agent that can be used in social networks to model and analyze the thinking of social networks; second, more learning techniques of agents can be used for modeling the social actors' learning and evolving behaviors, especially collective learning techniques, which can be used to analyze large-scale evolution and cross-organization evolution in social networks; third, some mechanisms of complex adaptive multiagent systems, such as emergence and swarm intelligence, can be explored more in complex dynamic social networks.",
               "More importantly, as said in Section 1, the complexity of social networks is much larger than that studied in multiagent systems due to their realities and factors in real applications and some rules in mutiagent systems are not true in social networks, thus the practicability and suitability of multiagent techniques in social networks are critical issues and need to be addressed."
          ],
          "paper_id": "252c95e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 25,
          "fromPaper": "Understanding Social Networks From a Multiagent Perspective"
     }
]