[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "With the rapid growth of the Web, users get easily lost in the rich hyper structure. Providing relevant information to the users to cater to their needs is the primary goal of web-site owners. Therefore, finding the content of the Web and retrieving the users' interests and needs from their behavior have become increasingly important. Web mining is used to categorize users and pages by analyzing the users' behavior , the content of the pages, and the order of the URLs that tend to be accessed in order. Web structure mining plays an important role in this approach. Two page ranking algorithms, HITS and PageRank, are commonly used in web structure mining. Both algorithms treat all links equally when distributing rank scores. Several algorithms have been developed to improve the performance of these methods. The Weighted PageRank algorithm (WPR), an extension to the standard PageRank algorithm, is introduced in this paper. WPR takes into account the importance of both the inlinks and the outlinks of the pages and distributes rank scores based on the popularity of the pages. The results of our simulation studies show that WPR performs better than the conventional PageRank algorithm in terms of returning larger number of relevant pages to a given query. users want to view in the future. Web mining consists of Web Content Mining (WCM), Web Structure Mining (WSM), and Web Usage Mining (WUM) [6, 7, 9]. WCM deals with the discovery of useful information from web content. WSM discovers relationships between web pages by analyzing web structures. WUM ascertains user profiles and the users' behavior recorded inside the web logfile. WCM and WUM have been studied by many researchers who have achieved valuable results. Based on the topology of the hyperlinks, WSM categorizes web pages and generates related patterns, such as the similarity and the relationships between different Web sites. Technically, WCM focuses mainly on the structure within a document (the inner-document level) while WSM tries to discover the link structure of the hyperlinks between documents (the inter-document level). The numbers of inlinks (links to a page) and of outlinks (links from a page) are valuable information in web mining. This is due to the facts that a popular web-page is often referred to by other pages and that an \"impor-tant\" webpage contains a high number of outlinks. Therefore , WSM is seen as an important approach to web mining. This paper focuses on WSM and provides a new Weighted PageRank Algorithm."
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "In the highly competitive world and with the broad use of the Web in e-commerce, e-learning, and e-news, finding users' needs and providing useful information are the primary goals of website owners. Therefore, analyzing users' patterns of behavior becomes increasingly important.",
               "Web mining is used to discover the content of the Web, the users' behavior in the past, and the webpages that the The rest of this paper is organized as follows. A brief background review of web structure mining is presented in the next section. Section 3 presents the PageRank algorithm, a commonly used algorithm in WSM. An extended PageRank algorithm called the Weighted PageRank algorithm (WPR) is described in Section 4. Different components involved in the implementation and evaluation of WPR are presented in Section 5. The experimental results and their implication for WPR are given in Section 6. Section 7 summarizes the conclusions of the present study. Finally, the result sets of PageRank and WPR for the query \"travel agent\" are given in Appendices A and B respectively."
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "n": "2.",
               "text": "Background",
               "type": "relatedwork"
          },
          "paragraphs": [
               "scores of hubs and authorities are calculated as follows :",
               "With the rapid growth of the Web, providing relevant pages of the highest quality to the users based on their queries becomes increasingly difficult. The reasons are that some web pages are not self-descriptive and that some links exist purely for navigational purposes. Therefore, finding appropriate pages through a search engine that relies on web contents or makes use of hyperlink information is very difficult.",
               "To address the problems mentioned above, several algorithms have been proposed. Among them are PageRank and Hypertext Induced Topic Selection (HITS) algorithms. PageRank is a commonly used algorithm in Web Structure Mining. It measures the importance of the pages by analyzing the links . PageRank has been developed by Google and is named after Larry Page, Google's co-founder and president . PageRank ranks pages based on the web structure.",
               "Google first retrieves a list of relevant pages to a given query based on factors such as title tags and keywords. Then it uses PageRank to adjust the results so that more \"important\" pages are provided at the top of the page list . The Pagerank algorithm is described in detail in the next section.",
               "HITS ranks webpages by analyzing their inlinks and outlinks. In this algorithm, webpages pointed to by many hyperlinks are called authorities whereas webpages that point to many hyperlinks are called hubs . Authorities and hubs are illustrated in .",
               "qI(p) shows an example of the calculation of authority and hub scores."
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "text": "Figure 2. An example of HITS operations",
               "type": "relatedwork"
          },
          "paragraphs": [
               "HITS is a purely link-based algorithm. It is used to rank pages that are retrieved from the Web, based on their textual contents to a given query. Once these pages have been assembled, the HITS algorithm ignores textual content and focuses itself on the structure of the Web only. Some difficulties arise from this feature :",
               "? HITS frequently returns more general webpages on an otherwise narrowly focused topic because the web does not contain many resources for the topic,",
               "? Topic drift occurs while the hub has multiple topics because all of the outlinks of a hub page get equivalent weights, and",
               "? Some popular sites that are not highly relevant to the given query gain overhead weight values."
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "text": "Figure 1. Hubs and authorities",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Hubs and authorities are assigned respective scores. Scores are computed in a mutually reinforcing way: an authority pointed to by several highly scored hubs should be a strong authority while a hub that points to several highly scored authorities should be a popular hub . Let a p and h p represent the authority and hub scores of page p, respectively. B(p) and I(p) denote the set of referrer and reference pages of page p, respectively. The",
               "The CLEVER algorithm is an extension of standard HITS and provides an appropriate solution to the problems that result from standard HITS . CLEVER assigns a weight to each link based on the terms of the queries and end-points of the link. It combines anchor text to set weights to the links as well. Moreover, it breaks large hub pages into smaller units so that each hub page is focused on as a single topic. Finally, in the case of a large number of pages from a single domain, it scales down the weights of pages to reduce the probabilities of overhead weights .",
               "Another major shortcoming of standard HITS is that it assumes that all links pointing to a page are of equal weight and fails to recognize that some links might be more important than others. A Probabilistic analogue of the HITS Algorithm(PHITS) has been developed to solve this problem . PHITS provides a probabilistic interpretation of term-document relationships and identifies authoritative documents. In the experiment on a set of hyperlinked documents, PHITS demonstrates better results compared to those obtained by standard HITS. The most important feature of the PHITS algorithm is its ability to estimate the actual probabilities of authorities compared to the scalar magnitudes of authority that are provided by standard HITS ."
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "n": "3.",
               "text": "The PageRank Algorithm",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The PageRank algorithm, one of the most widely used page ranking algorithms, states that if a page has important links to it, its links to other pages also become important. Therefore, PageRank takes the backlinks into account and propagates the ranking through links: a page has a high rank if the sum of the ranks of its backlinks is high . ranks of the pages to which page p is pointing. The rank scores of pages of a website could be calculated iteratively starting from any webpage. Within a website, two or more pages might connect to each other to form a loop. If these pages did not refer to but are referred to by other webpages outside the loop, they would accumulate rank but never distribute any rank. This scenario is called a rank sink ."
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "text": "Figure 3. An example of backlinks",
               "type": "relatedwork"
          },
          "paragraphs": [
               "To solve the rank sink problem, we observed the users' activities. A phenomenon is found that not all users follow the existing links. For example, after viewing page a, some users may not decide to follow the existing links but directly go to page b, which is not directly linked to page a. For this purpose, the users just type the URL of page b into the URL text field and jump to page b directly. In this case, the rank of page b should be affected by page a even though these two pages are not directly connected. Therefore, there is no absolute rank sink.",
               "Based on the consideration of the phenomenon mentioned above, the original PageRank is published :"
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "Simplified PageRank",
               "type": "relatedwork"
          },
          "paragraphs": [
               "A slightly simplified version of PageRank is defined as :",
               "where u represents a web page. B(u) is the set of pages that point to u. P R(u) and P R(v) are rank scores of page u and v, respectively. N v denotes the number of outgoing links of page v. c is a factor used for normalization. shows an example in which c = 1.0 to simplify the calculation. In PageRank, the rank score of a page, p, is evenly divided among its outgoing links. The values assigned to the outgoing links of page p are in turn used to calculate the where d is a dampening factor that is usually set to 0.85. We also could think of d as the probability of users' following the links and could regard (1 ? d) as the pagerank distribution from non-directly linked pages.",
               "To test the utility of the PageRank algorithm, Google applied it to the Google search engine . In the experiments, the PageRank algorithm works efficiently and effectively because the rank value converges to a reasonable tolerance in the roughly logarithmic (log n) .",
               "The rank score of a web page is divided evenly over the pages to which it links. Even though the PageRank algorithm is used successfully in Google, one problem still ex-ists: in the actual web, some links in a web page may be more important than are the others.",
               "In this example, Page A has two reference pages: p1 and p2. The inlinks and outlinks of these two pages are I p1 = 2, I p2 = 1, O p1 = 2, and O p2 = 3. Therefore,"
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "n": "4.",
               "text": "Weighted PageRank (WPR)",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The more popular webpages are, the more linkages that other webpages tend to have to them or are linked to by them. The proposed extended PageRank algorithm-a Weighted PageRank Algorithm-assigns larger rank values to more important (popular) pages instead of dividing the rank value of a page evenly among its outlink pages. Each outlink page gets a value proportional to its popularity (its number of inlinks and outlinks). The popularity from the number of inlinks and outlinks is recorded as W"
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "paragraphs": [
               "and W",
               "Considering the importance of pages, the original PageRank formula is modified as",
               "is the weight of link(v, u) calculated based on the number of inlinks of page u and the number of inlinks of all reference pages of page v."
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "relatedwork"
          },
          "paragraphNo": 9,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "n": "5.",
               "text": "Experiments",
               "type": "experiment"
          },
          "paragraphs": [
               "where I u and I p represent the number of inlinks of page u and page p, respectively. R(v) denotes the reference page list of page v. W",
               "To evaluate the WPR algorithm, we implemented WPR and the standard PageRank algorithms to compare their results. illustrates different components involved in the implementation and evaluation of the WPR algorithm.",
               "The simulation studies we have carried out in this work consist of six major activities: ",
               "where O u and O p represent the number of outlinks of page u and page p, respectively. R(v) denotes the reference page list of page v. shows an example of some links of a hypothetical website.",
               "2. Building a web map: There is no web map available for this website. A free spider software-JSpider-is used to generate the required web map.",
               "3. Finding the root set: A set of pages relevant to a given query is retrieved using the IR search engine embedded in the web site. This set of pages is called the root set.",
               "4. Finding the base set: A base set is created by expanding the root set with pages that directly point to or are pointed to by the pages in the root set. "
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "text": ". Links of a website",
               "type": "experiment"
          },
          "paragraphs": [
               "Normally, websites in different domains focus on different topics. Usually, the websites have rich linkages to describe the focused topics. On the other hand, they do a poor job describing non-focused topics. For example, the websites of most universities have a lot of information about scholarships and courses whereas the websites of travel companies mainly provide travel paths and scenes around . Architectural components of the system used to implement and evaluate the WPR algorithm the world. To test the WPR algorithm for both focused and non-focused topics, we choose several queries from both categories. In this paper, an experiment using \"travel agent,\" a non-focused topic in the website of Saint Thomas University, is provided in Appendices A and B.",
               "from irrelevant pages, we categorized the pages in the results into four classes based on their relevancy to the given query:",
               "? Very Relevant pages (VR), which contain very important information about the given query,"
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "n": "6.",
               "text": "Evaluation",
               "type": "experiment"
          },
          "paragraphs": [
               "? Relevant pages (R), which have relevant but not important information about the given query,",
               "The query topics \"travel agent\" and \"scholarship\" are used in the evaluation of the WPR and the standard PageRank algorithms. \"Travel agent\" represents a non-focused topic whereas \"scholarship\" represents a focused (popular) topic in the website of Saint Thomas University. The results of the evaluation are summarized in the following subsections.",
               "? Weak-Relevant pages (WR), which do not have relevant information about the given query even though they contain the keywords of the given query, and",
               "? Irrelevant pages (IR), which include neither the keywords of the given query nor relevant information about it."
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "n": "6.1.",
               "text": "The determination of the relevancy of the pages to the given query",
               "type": "experiment"
          },
          "paragraphs": [
               "An objective categorization of the results (lists of pages) is achieved by integrating the responses from several people: for each page, we compared the count of each category (i.e., VR, R, WR and IR) and chose the category with the largest count as the type of that page.",
               "The Standard PageRank and the WPR algorithms provide important information about a given query by using the structure of the website. Some pages irrelevant to a given query are included in the results as well. For example, even though the home page of Saint Thomas University, http://www.stu.ca/index.htm, is not related to the given query, it still receives the highest rank because of its many existing inlinks and outlinks. To reduce the noise resultant"
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "n": "6.2.",
               "text": "The Calculation of the relevancy of the page lists to the given query",
               "type": "experiment"
          },
          "paragraphs": [
               "The performances of the WPR and the standard PageRank algorithms have been evaluated to identify the algorithm that produces better results (i.e., results that are more relevant to the given query). The WPR and the standard PageRank algorithms provide sorted lists (i.e., . The relevancy values for the query \"travel agent\" produced by PageRank and WPR using different page sets ranked pages) to users based on the given query. Therefore, in the result list, the number of relevant pages and their order are of great importance. The following rule has been adopted to calculate the relevancy value of each page in the list of pages."
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "text": "Number of Relevant Pages Relevancy Value(��) Size of the page set PageRank",
               "type": "experiment"
          },
          "paragraphs": [
               "by standard PageRank. This case indicates that WPR may be able to identify more relevant pages from the top of the result list than can standard PageRank.",
               "Relevancy Rule: the relevancy of a page to a given query depends on its category and its position in the page-list.",
               "The larger the relevancy value is, the better is the result. The relevancy,, of a page-list is a function of its category and position:",
               "? Within the first 20 pages, the relevancy value obtained from WPR is larger than that obtained from standard PageRank, even though one more relevant page is identified by standard PageRank. This scenario indicates that the relevant pages determined by WPR are either more relevant or ranked higher inside the list.",
               "where i denotes the ith page in the result page-list R(p), n represents the first n pages chosen from the list R(p), and W i is the weight of page i. where",
               "The value of W i for an experiment could be decided through experimental studies. For our experiment, we set1 ,2 ,3 and4 to 1.0, 0.5, 0.1 and 0, respectively, based on the relevancy of each category.",
               "The relevancy values for the query \"travel agent\" are shown in . In this table, relevant pages represent the pages in the category V R as well as in the category R.",
               "From , we see that WPR produces larger relevancy values, which indicate that WPR performs better than standard PageRank does. illustrates the performance. Moreover, the following two points are observed from "
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "n": "6.3.",
               "text": "Focused topic queries",
               "type": "experiment"
          },
          "paragraphs": [
               "This subsection evaluates the results obtained for the query \"scholarship.\" This query is a focused topic within the website of Saint Thomas University. The relevancy values of the results are shown in .",
               "Similar to the query \"travel agent,\" demonstrates that the WPR algorithm produces better results (larger relevancy values) for the query \"scholarship.\" Moreover, the two points derived from the query \"travel agent\" are shown more clearly in this case (see ).",
               "In conclusion, the results obtained from WPR and standard PageRank for the focused and non-focused topics show that WPR is superior to standard PageRank."
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "Weighted PageRank Algorithm"
     },
     {
          "head": {
               "n": "7.",
               "text": "Conclusion",
               "type": "conclusion"
          },
          "paragraphs": [
               "Web mining is used to extract information from users' past behavior. Web structure mining plays an important role in this approach. Two commonly used algorithms in web structure mining are HITS and PageRank, which are used to rank the relevant pages. Both algorithms treat all links equally when distributing rank scores. Several algorithms have been developed to improve the performance of these methods. This paper introduces the WPR algorithm, an extension to the PageRank algorithm. WPR takes into account the importance of both the inlinks and the outlinks of the pages and distributes rank scores based on the popularity of the pages. Simulation studies using the website of Saint Thomas University show that WPR is able to identify a larger number of relevant pages to a given query compared to standard PageRank. In the current version of WPR, only the inlinks and outlinks of the pages in the reference page list are used in the calculation of the rank scores. In our future study of this method, we would like to consider the possibility of calculating the rank scores by using more than one level of reference page list. Moreover, a detailed analysis of WPR's performance using different websites and multiple levels of reference page lists would be carried out.",
               "As part of our future work, we plan to carry out extensive performance analysis of WPR by using other web sites and increasing the number of 'human' users to categorize the web pages."
          ],
          "paper_id": "25306670-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "Weighted PageRank Algorithm"
     }
]