[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Brands and agencies use marketing as a tool to influence customers. One of the major decisions in a marketing plan deals with the allocation of a given budget among media channels in order to maximize the impact on a set of potential customers. A similar situation occurs in a social network, where a marketing budget needs to be distributed among a set of potential influencers in a way that provides high-impact. We introduce several probabilistic models to capture the above scenarios. The common setting of these models consists of a bipartite graph of source and target nodes. The objective is to allocate a fixed budget among the source nodes to maximize the expected number of influenced target nodes. The concrete way in which source nodes influence target nodes depends on the underlying model. We primarily consider two models: a source-side influence model, in which a source node that is allocated a budget of k makes k independent trials to influence each of its neighboring target nodes, and a target-side influence model, in which a target node becomes influenced according to a specified rule that depends on the overall budget allocated to its neighbors. Our main results are an optimal (1 ? 1/e)-approximation algorithm for the source-side model, and several inapproximability results for the target-side model, establishing that influence maximization in the latter model is provably harder."
          ],
          "paper_id": "2533e8e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Optimizing Budget Allocation Among Channels and Influencers"
     },
     {
          "head": {
               "n": "1.",
               "text": "INTRODUCTION",
               "type": "introduction"
          },
          "paragraphs": [
               "Brands and agencies use marketing as a tool to influence customers and make them into loyal buyers. One of the major decisions in a marketing plan deals with the allocation of a given budget among media channels in order to maximize the impact on a set of potential customers. Several examples of media channels are TV, newspapers, billboards, and websites. In many cases, a fine-grained decision is needed regarding the budget allocated within a specific channel, e.g., how to distribute the budget for radio commercials among the different major radio channels. In some cases, there are additional constraints on the amount of budget that can be spent on any specific outlet. Such constraints may be enforced by the policy makers or the regulations in an organization.",
               "An underlying assumption is that the amount of budget allocated to a channel determines the chances of influencing particular customers. As a result, one may model this setting as a bipartite graph in which one side is the set of possible marketing channels, and the other is the population of customers. An edge between channel i and a customer j indicates that j may influence i with some probability that depends on the budget allocated to j. We emphasize that a similar situation occurs in a social network, where a marketing budget needs to be distributed among a set of potential influencers in a way that provides high-impact. Given that an influencer can effect the decisions of her neighbors in the network, and that her level of effort depends on the budget allocated to her, we get a setting that is similar to the one described above.",
               "Both of the above-mentioned scenarios deal with the allocation of budget among different channels. A convenient way for modelling the fact that the probability of a channel to influence a customer depends on its allocated budget is by focusing on discrete budgets. The allocation of k units of budget to channel j corresponds to k attempts made by channel j to influence each of its corresponding customers. We note that each such attempt may have a different probability to influence a customer. These probabilities depend on the underlying model, as formally described in Subsection 1.1. We emphasize that all these models leave much freedom in the way one measures the expected number of customers that are influenced by a particular budget allocation. We also note that probabilistic models are natural since our knowledge of customers behavior is inherently limited, and thus, we can only have some probabilistic estimate for the typical impact of a budget allocation to some channel. We like to point out two major differences between our models and previous work (e.g., "
          ],
          "paper_id": "2533e8e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Optimizing Budget Allocation Among Channels and Influencers"
     },
     {
          "head": {
               "text": "):",
               "type": "introduction"
          },
          "paragraphs": [
               "Copyright is held by the International World Wide Web Conference Committee (IW3C2). Distribution of these papers is limited to classroom use, and personal use by others.",
               "WWW 2012, , Lyon, France.",
               "1. Budgets -previous work on so-called budget allocation in similar contexts have only focused on the selection of a subset of influencing nodes. In particular, the allocation of budget among nodes was not treated. We believe this to be a central issue, essential in the context of an algorithmic approach to marketing."
          ],
          "paper_id": "2533e8e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Optimizing Budget Allocation Among Channels and Influencers"
     },
     {
          "head": {
               "n": "1.2",
               "text": "Our results",
               "type": "introduction"
          },
          "paragraphs": [
               "2. Propagation of influence -our work does not deal with the propagation of influence, which may happen in social networks. We emphasize that this is due to the fact that a major motivation for our work is the distribution of budget among marketing channels, although we believe that our models are applicable to social networks as well.",
               "We study both influence models and attain the following results:"
          ],
          "paper_id": "2533e8e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Optimizing Budget Allocation Among Channels and Influencers"
     },
     {
          "head": {
               "n": "1.1",
               "text": "The influence models",
               "type": "modelling"
          },
          "paragraphs": [
               "We primarily focus on two models: a source-side influence model and a target-side influence model. The common setting in both models consists of a bipartite graph G = (S, T, E), where S and T are collections of source and target nodes, respectively, and E ? ST is an edge set. Each source node s has a capacity csN+, and there is a (global) budget BN+. The objective is to distribute the budget among the source nodes in a discrete way that respects the capacities of nodes, and maximizes the expected number of target nodes that become active (or influenced). Specifically, each source node s should be allocated a budget bs{0, 1, . . . , cs} such thatsS bsB. The process in which target nodes become active depends on the underlying model:",
               "Source-side influence model. We devise an efficient deterministic algorithm that has an approximation ratio of 1 ? 1/e0.632 for influence maximization in the sourceside model. We observe that this result is best possible under the assumption that P ? = NP. Specifically, this result matches the NP-hardness bound of 1 ? 1/e, which already holds for the special setting of maximum coverage . We also discuss several generalizations of our model and techniques. In particular, we demonstrate that our approach can be employed in a general setting where the underlying graph is arbitrary and each source node has a different influence on each of its neighbors. This latter setting is well-motivated as it may abstract the question of influence maximization in social networks.",
               "? Source-side influence model -Each source node sS has a probability vector",
               "cs . A source node s that is allocated a budget of bs makes bs independent trials to activate each neighboring target node t. The probability that t is activated by s in the ith trial is p s i . Thus, if the set of source nodes(t) designates the neighbors of t in G then the probability that t becomes active is Target-side influence model. We demonstrate that influence maximization in this model extends both the maximum edge biclique and the dense k-subgraph problems. Consequently, we attain among some additional hardness results that our problem is hard to approximate within a factor of ?(1/B ? ) for some ? > 0, assuming a certain hypothesis about the average-case hardness of random 3SAT . This implies that influence maximization in the target-side model is provably harder than in the source-side model. In light of the above state of affairs, we then focus our attention on a modified model in which there are no capacity constraints on the source nodes. We develop an efficient deterministic algorithm that achieves a logarithmic approximation ratio. This establishes a computational separation between the two target-side models, and proves that the budget capacity constraints underlie the hardness of the problem in the former model."
          ],
          "paper_id": "2533e8e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Optimizing Budget Allocation Among Channels and Influencers"
     },
     {
          "head": {
               "n": "1.3",
               "text": "Related work",
               "type": "relatedwork"
          },
          "paragraphs": [
               "We note that all the trials that s makes (to all its neighboring nodes) are independent.",
               "? Target-side influence model -Each target node tT has a probability vector",
               "Suppose the set of source nodes(t) designates the neighbors of t in G, and let Bt =sʦ(t) bs. Then, the probability that t becomes active is",
               "We emphasize that the probability that a target node t becomes active is a function of the overall budget Bt allocated to its neighbors.",
               "Notice that our models are very general as they support completely arbitrary probability vectors, and not necessarily ones that are monotone or have any other restrictive structural properties. Also note that one can argue that in reallife situations the exact values of the probabilities are unknown. We believe however that one can almost always have some good estimate for these probabilities, and therefore, we assume that these probabilities are known.",
               "Previous work dealing with influence in multi-agent systems considered issues such as finding a set of most influential individuals, and understanding the effects of the social structure on emergent behavior (see, e.g., and the reference therein). More generally, the diffusion and spreading of opinions in societies has long been a topic of study in the social sciences , and later got the attention of game-theorists and AI researchers among others. While a main interest in this research concerns with the need to influence individuals, the related literature does not consider the distribution of budgets among those individuals; rather, it primarily concentrates on issues such as information propagation. Our work seems to be the first to optimize the budget distribution beyond deciding the identity of the individuals that should be approached. Our notion of a budget is a discrete one. This is consistent with common practices in organizations (e.g., working in multiplications of some fixed value) and related simulations . Other work relating to the subject of budget constraints in markets and advertising appears in ."
          ],
          "paper_id": "2533e8e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Optimizing Budget Allocation Among Channels and Influencers"
     },
     {
          "head": {
               "n": "2.",
               "text": "A SOURCE-SIDE INFLUENCE MODEL",
               "type": "modelling"
          },
          "paragraphs": [
               "In this section, we devise an efficient deterministic algorithm that has an approximation ratio of 1 ? 1/e0.632 for the problem of maximizing the influence in the source-side model. This result is best possible under the assumption that P ? = NP. Specifically, this result matches the NPhardness bound of 1 ? 1/e, which already holds for the special setting of maximum coverage . The latter setting is equivalent to the case in which all the probability vectors are of the form ?1, * , . . . , * ?, where each * can be any valid value. In this case, the objective reduces to selecting B source nodes in a way that maximizes the cardinality of their neighbor set.",
               "We note that our algorithm and analysis has similarities with the algorithm for maximizing a nondecreasing submodular set function subject to a knapsack constraint . We emphasize that our problem is not an instance of the latter problem. In particular, in our problem, one may select a node multiple times (i.e., allocate it a budget other than 0 or 1), and these selections may not satisfy a decreasing marginal influence property as required for submodularity. Informally, our problem does not admit a decreasing marginal influence property since adding an extra unit of budget to some node may have a higher marginal influence with respect to prior budget increments."
          ],
          "paper_id": "2533e8e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Optimizing Budget Allocation Among Channels and Influencers"
     },
     {
          "head": {
               "n": "2.2",
               "text": "Analysis",
               "type": "modelling"
          },
          "paragraphs": [
               "In what follows, we prove that our algorithm has an approximation ratio of 1?1/e0.632. This result matches the NP-hardness bound of 1 ? 1/e, which holds for the special setting of maximum coverage . We begin by introducing a notation and terminology that will be used later: ? ?}. Clearly, if we prove that this solution is a (1 ? 1/e)-approximation for the optimal outcome then our algorithm is guaranteed to have (at least) the same approximation ratio.",
               "Let ALG = ALG1 +ALG2 be the expected number of target nodes that become active in the above-mentioned solution A. Here, ALG1 indicates the overall marginal influence of the first ? pairs in A (with respect to the empty solution), and ALG2 stands for the overall marginal influence of the remaining pairs in A (with respect to the solution that consists of the first ? pairs). Note that ALG1 = OPT1 due to our assumption regarding the enumeration step. Hence,",
               ") we are left to analyze the performance of the solution of the greedy completion procedure.",
               "Recall that the greedy procedure is built around one main loop. In each iteration i of that loop, the algorithm extends the current solution with a pair ?si, ki? whose per unit marginal influence is maximal, namely, the budget of node si is increased by ki. We mark the per unit marginal influence in that iteration byi, and the corresponding marginal influence by ?i =iki. Notice that if the required budget ki is more than the remaining budget then the algorithm cannot extend the current solution. In such a case, the algorithm does not increase the budget of any node, the underlying pair is removed, and the loop continues. Also note that the algorithm may increase the budget of any node multiple times in different iterations.",
               "Let ?sL, kL? be the first pair for which the greedy procedure cannot extend the current solution. For the sake of the analysis, we may assume without loss of generality that ?sL, kL? involves an increase towards the optimal solution. That is, suppose the current budget allocation is {bs}sS then bs + kLb",
               "where the first inequality follows from Lemma 1, and the last inequality is due to the induction hypothesis.",
               "Notice thatis concave and monotonically decreasing in the range . This implies that given x1, . . . , xL(0, 1], we know that",
               "( s . We note that our assumption is valid since if there is such a prior pair that does not involve an increase towards the optimal solution then excluding it from the potential pairs list Q does not change the greedy solution (with respect to the same initial solution), the optimal solution, and the analysis. Note that such a pair may be excluded by initially adjusting the budget constraint of the underlying node in an appropriate way. Lastly, we remark that in case that the greedy procedure does not experience a situation in which it cannot extend the current solution then we denote the last inspected pair by ?sL, kL?.",
               "where the last inequality follows as",
               "Proof. Let dq be the difference between the budget allocated to node s * We are now ready to prove the main theorem of this section. ?+q in the optimal solution and the budget allocated to it by the greedy procedure up to iteration i. In case the greedy procedure allocated more budget to node s Theorem 1. ALG(1 ? 1/e)OPT. * ?+q than the optimal solution then we set dq = 0. Using a simple counting argument, one can attain that there is a node s * ?+q * such that increasing its budget by dq * increases the overall influence by at least",
               "where the inequality follows since K is the overall budget allocated to the nodes s * * ?+1 , . . . , s r * by the optimal solution. Since our greedy procedure selects a pair whose per unit marginal influence is maximal and the pair ?s Proof. Recall that ALG1 = OPT1 due to our assumption regarding the enumeration step. In addition, notice that ALG2L?1 i=1 ?i in case that the greedy procedure could not extend the solution in iteration L, and ALG2 =L i=1 ?i, otherwise. In the former case, one can easily verify that ?LOPT1/?. This follows since the pair ?sL, kL? involves an increase towards the optimal solution, and by our assumption regarding the enumeration step, the marginal influence of such an increase cannot be higher than the marginal influence of extending the solution that consists of the pairs",
               "Proof. We prove this lemma by induction on i. The lemma clearly holds when i = 0. Assume that the lemma holds for i ? 1 and notice that",
               "where the second inequality is due to Corollary 1, and the last inequality holds since ?3."
          ],
          "paper_id": "2533e8e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Optimizing Budget Allocation Among Channels and Influencers"
     },
     {
          "head": {
               "n": "2.3",
               "text": "Discussion and extensions",
               "type": "modelling"
          },
          "paragraphs": [
               "Generalized graph models. A natural generalization of our model is when the edges, rather than the source nodes, are associated with probability vectors. In this setting, a source node s that is allocated a budget of bs makes bs independent trials to activate each neighboring target node t; the probability of activating t depends on the probability vector of the edge (s, t) in a similar way to the original model. Notice that an instance of the original model can be translated to an instance of the new model in which the probability vectors of all edges adjacent to any source node are identical. It is not hard to verify that our algorithm from Subsection 2.1 can be applied in this generalized model, attaining the same approximation ratio. In particular, one can easily validate that the counting argument from the proof of Lemma 1 is also applicable in this latter model. An even more general model is when the underlying (directed) graph is arbitrary, rather than bipartite. In this setting, a node s that is allocated a budget of bs makes bs independent trials to activate each neighboring node t, where the probability of activating t depends on the probability vector of the edge ?s, t?. Furthermore, any node s may become influenced as a result of the budget allocated to it. This can be modelled by a self-loop in the underlying graph, that is, an edge ?s, s?, where this edge has a probability vector having the same interpretation as before. This general model is well-motivated as it may be used to abstract the question of influence maximization in social networks. Similarly to before, one can verify that our algorithm from Subsection 2.1 can be applied in this generalized model, attaining the same approximation ratio. Specifically, this case can be reduced to the bipartite case by (1) creating a source node copy sv and a target node tv copy in the bipartite graph for each graph node v, and (2) creating an edge (su, tv) in the bipartite graph for each directed graph edge ?u, v?, having the same probability vector. in the source-side model. This is done by demonstrating that both the maximum edge biclique and the dense k-subgraph problems can be reduced to our problem. As a result, we attain that our problem is hard to approximate within a factor of ?(1/B ? ) for some ? > 0, assuming a certain hypothesis about the average-case hardness of random 3SAT . We also establish some additional hardness results that depend on other computational complexity assumptions.",
               "We then turn to consider a modified model in which there are no capacity constraints on the source nodes, or equivalently, one may assume that each cs = B. We develop an efficient deterministic algorithm that achieves a logarithmic approximation ratio. This establishes a computational separation between both models, and proves that the budget capacity constraints underlie the hardness of the problem in the former model. We remark that this modified model is still NP-hard, and in fact, it is NP-hard to approximate to within a factor better than 1 ? 1/e as it extends the maximum coverage problem . The latter problem is equivalent to the case in which all the probability vectors are of the form ?1, * , . . . , * ?, where each * can be any valid value. In this case, there is no use for allocating a budget greater than 1 to any of the source node. Consequently, the objective reduces to selecting B source nodes in a way that maximizes the cardinality of their neighbor set."
          ],
          "paper_id": "2533e8e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Optimizing Budget Allocation Among Channels and Influencers"
     },
     {
          "head": {
               "n": "3.1",
               "text": "Hardness results",
               "type": "modelling"
          },
          "paragraphs": [
               "A tradeoff between running time and approximation. Our algorithm from Subsection 2.1, although efficient, may not be practical due to the enumeration step. Nonetheless, one can utilize it and its analysis to develop a simple algorithm that has a practical running time (essentially, the running time of the greedy completion procedure) with a somewhat worse approximation guarantee. This algorithm selects the budget allocation that achieves the maximal influence from |S| + 1 solutions: the first solution is obtained by executing the greedy procedure on the given input instance, and the remaining |S| solutions are obtained by allocating the maximal possible budget to each single source node. One can validate that this algorithm attains a (e ? 1)/(2e)0.316-approximation. Specifically, the outline of the analysis is the following: If the optimal solution has a single node whose marginal influence (with respect to the empty solution) is at least (e ? 1)/(2e)OPT then we are clearly through; otherwise, one can demonstrate that the greedy solution achieves an approximation ratio of (1 ? 1/e) ? (e ? 1)/(2e) = (e ? 1)/(2e) by applying a similar reasoning to that presented in Theorem 1, while noting that ?L(e ? 1)/(2e)OPT."
          ],
          "paper_id": "2533e8e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Optimizing Budget Allocation Among Channels and Influencers"
     },
     {
          "head": {
               "n": "3.",
               "text": "A TARGET-SIDE INFLUENCE MODEL",
               "type": "modelling"
          },
          "paragraphs": [
               "In this section, we prove that the problem of maximizing the influence in the target-side model is provably harder than A reduction from maximum edge biclique. We begin by demonstrating that our problem is as hard to approximate as the maximum edge biclique problem. As input for maximum edge biclique, we are given a bipartite graph G = (S, T, E). Our goal is to find a biclique in G having a maximum number of edges. A vertex set",
               "In what follows, we show a reduction to our problem from a variant of maximum edge biclique in which the cardinality k of the optimal subset of S-vertices is known in advance. Notice that the maximum edge biclique problem is polynomial-time reducible to this latter problem by enumerating over all |S| possible values of k, and hence, this variant shares the same computational hardness as maximum edge biclique.",
               "Given an input instance of the above-mentioned variant of maximum edge biclique, we construct an input instance of our problem that consists of the same bipartite graph G. Moreover, we set the capacity of each source node sS to 1, the budget B = k, and the probability vector associated with each target node tT to ?0, . . . , 0, 1?; here, the length of the prefix of 0's is B ? 1. Now, one can easily verify that a solution STfor maximum edge biclique with |S||T| = k|T| edges implies a budget allocation in the newly-created instance with an influence of |T|. Specifically, the claimed influence is attained by allocating a unit of budget to each of the source nodes corresponding to S. Conversely, it is not difficult to verify that given a valid budget allocation, one can perform a similar gap-preserving transformation in the opposite direction. In particular, notice that the subgraph induced by the source nodes that are allocated a unit budget and the target nodes that are influenced to an extent of 1 is indeed a biclique.",
               "As a result of this gap-preserving reduction, and in conjunction with the hardness results presented by Feige and Feige and Kogan , we attain two inapproximability results. The first is based on a certain hypothesis about the average-case hardness of random 3SAT ."
          ],
          "paper_id": "2533e8e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Optimizing Budget Allocation Among Channels and Influencers"
     },
     {
          "head": {
               "n": "4.",
               "text": "CONCLUDING REMARKS",
               "type": "modelling"
          },
          "paragraphs": [
               "We study the problem of allocating a given budget to various media channels to maximize the influence on a candidate audience. We present two models of influence, namely, a source-side and a target-side influence models. We develop an optimal approximation algorithm for the first model, while establishing that the latter model is provably harder. We also demonstrate that the budget capacity constraints underlie the computational hardness of the latter model.",
               "We discuss several extensions of the source-side influence model in Subsection 2.3. We believe that it is worthwhile to further study those directions. We also think that it would be interesting to prove hardness results for the target-side influence model under more standard assumptions, like a P ? = NP assumption. Finally, another worthy direction for"
          ],
          "paper_id": "2533e8e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Optimizing Budget Allocation Among Channels and Influencers"
     }
]