[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Large numbers of college students have become avid Facebook users in a short period of time. In this paper, we explore whether these students are using Facebook to find new people in their offline communities or to learn more about people they initially meet offline. Our data suggest that users are largely employing Facebook to learn more about people they meet offline, and are less likely to use the site to initiate new connections."
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "n": "1.",
               "text": "INTRODUCTION",
               "type": "introduction"
          },
          "paragraphs": [
               "Over the past few years, the use of social software tools like MySpace , Friendster , MeetUp and Facebook has been increasing. Facebook, in particular, has become hugely popular among college students since its inception in 2004. While participation in sites like Facebook raise some concerns about privacy , there are potential benefits from participation, such as meeting new people through the site, or learning more about people in one's offline community. While an assumed goal of many online networking sites may be to facilitate interactions between strangers, it's unclear how Facebook members are using the site. Are Facebook members using the site to make new online connections, or to support already existing offline connections?",
               "Often, the development of online interactions focuses on finding people online with whom you have a shared connection, but would not be likely to meet in an offline context. There are examples of participants who do meet people online for emotional support or understanding that they may not be able to receive in their offline interactions , or for offline encounters as one might find in dating sites .",
               "Like most of the social software tools mentioned above, Facebook allows users to create profiles and articulate connections with other users, who are then listed as \"friends.\" Certain other features, like testimonials, the ability to join groups of shared interest, and the ability to post pictures are also increasingly incorporated into Online social networking sites may have other interpersonal functions as well. Facebook may foster relationship building by allowing users to track other members of their community. This \"surveillance\" function allows an individual to track the actions, beliefs and interests of the larger groups to which they belong . In some cases, this may act as a warning mechanism against unsuitable behavior from a fellow participant, while in other cases this surveillance may help the watcher search for social cues that indicate group norms. Resnick has framed this as the \"peripheral awareness\" function of online systems, which can support one's ability to remain aware of increasing large and diverse offline communities, thereby increasing social capital.",
               "This type of surveillance may be classified by the goals of users in searching for others, which we frame as \"social searching\" or \"social browsing.\" Social searchers would use the site to investigate specific people with whom they share an offline connection to learn more about them. Social browsers would use the site to find people or groups online with whom they would want to connect offline. These terms reflect options in Facebook that support both searching for specific users, and browsing, which returns a random set of users within the network. Determining whether there is a preponderance of social searchers or social browsers on the site has design implications; for instance, in offering guidance about the necessity of features that support the various uses, or in designing new systems that may be used to support offline communities. users who spent less than 30 minutes per day on the site stayed the same, a smaller percentage of users in the second survey reported spending more than an hour a day on Facebook."
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "n": "2.",
               "text": "METHODS",
               "type": "introduction"
          },
          "paragraphs": [
               "This paper reports data from two surveys of first-year students at Michigan State University (MSU) conducted by the Department of Residence Life. An invitation to participate in the first survey was sent by email to all 7,200 incoming first-year students at the end of August 2005, the first week of classes. 1,440 participants responded, a response rate of 20%. The instrument was delivered over the Web through a URL embedded in the invitation message. Students entered a unique identification number, preventing against potential respondent fraud. The second survey was conducted in the third week of January 2006, using the same email/Web methodology. Of the 7,200 students invited to participate in the follow-up survey, 1,085 students (15%) responded. This survey was administered by university staff , and the authors of this paper did not have access to identifying information. Consequently, we were not able to determine what percentage of the first-year students who participated in the first survey also participated in the second, and vice-versa, preventing longitudinal analysis.",
               "In the second survey, respondents were asked to rate how accurately their profiles portrayed them and whether that portrayal was positive, as judged on a 1 to 5 Likert scale, with 5 indicating high agreement. Respondents reported high confidence that their Facebook portrayals described them accurately (mean=4.16) and that those portrayals were positive (mean=4.19).",
               "The accuracy of the Facebook profile is important when considering who students see as the potential audience for their profiles. displays responses to the question: \"Since you created your profile, who do you think has looked at it?\" High school friends (93%), people in classes (86%), people met at parties (70%) and even unknown students at the university (69%) were seen by the majority of respondents as being likely to view the profile. Far fewer felt their profile had been viewed by people not affiliated with schools (10%), professors (5%), administration (3%) and law enforcement (3%). Facebook members view their audience as peer group members, as opposed to other institutional members like administration and faculty."
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "text": "Table 1: Percentage of Facebook users who think named",
               "type": "introduction"
          },
          "paragraphs": [
               "group has looked at their profile"
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "text": "Group Percentage",
               "type": "introduction"
          },
          "paragraphs": [
               "This section will show how MSU students are using Facebook, their attitudes about their profiles on the site, and how they use Facebook to either browse or search for other members of the site."
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "text": "My high school friends 93%",
               "type": "introduction"
          },
          "paragraphs": [
               "People in my classes 86%"
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "n": "3.1",
               "text": "Students heavily use Facebook",
               "type": "introduction"
          },
          "paragraphs": [
               "Someone I met at a party or social event 70%",
               "In their first week of classes, 95% of respondents to the first survey reported they had heard of Facebook. 84% (1,210) reported they were Facebook members. Students received institutional email addresses in the summer before the term started, explaining some of the high adoption rate early in the semester. Of the students who were Facebook users at the time of the first survey ), 68% reported that they had created their accounts within the last three months. 70% of these users reported that they spend 30 minutes or less on Facebook per day, and 21% indicated they spent more than hour a day on average per week on the site."
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "text": "Total strangers from MSU 69%",
               "type": "introduction"
          },
          "paragraphs": [
               "My Resident Mentor (often called Resident Advisors at other Universities) 49%",
               "Total strangers from other campuses 29%",
               "Total strangers who aren't affiliated with any college or school 10%",
               "My MSU professors 5%",
               "A semester later, the second survey revealed that 95.5% (1,026) of respondents to the survey indicated they were Facebook users. 69% of respondents to the second survey reported that they spent 30 minutes or less on Facebook per day. 12% of Facebook users reported spending more than an hour a day on the site."
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "text": "MSU Administration 3%",
               "type": "introduction"
          },
          "paragraphs": [
               "Law enforcement 3%"
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "n": "3.3",
               "text": "Students engage in \"social searching\"",
               "type": "introduction"
          },
          "paragraphs": [
               "These data suggest that many respondents joined Facebook in the summer before coming to the university, and if they had not joined by the beginning of the fall semester, had done so by the beginning of the subsequent term. (Students receive an MSU email address as soon as they are admitted, and attend an orientation session in the summer where they may have talked with others about Facebook.) The difference between the first and second survey could also be the result of respondent non-response differences between the two data collections. Although the percentage of",
               "We asked students about the purposes for which they used Facebook, providing us with some insight into whether they were more likely to engage in social searching or social browsing. shows the average response on a 5-point scale to an item asking how likely it was that the respondent would use Facebook for the stated purpose. A score of 5 indicates a high likelihood of using Facebook for a given purpose. The uses reported as most likely by respondents were to keep in touch with friends from high school (mean=4.63) and find out more about a person they had met socially (mean=4.51). The low standard deviation for these"
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "n": "4.",
               "text": "DISCUSSION",
               "type": "introduction"
          },
          "paragraphs": [
               "Facebook users anticipate their profiles being searched and viewed by peers, not faculty, administration within the campus community, or outsiders. The strongest expectations are that peers who have some sort of offline connection -either by virtue of prior friendship, common classes, or having met at a social eventconstitute the audience for one's profile. They also primarily use Facebook to find information about those with whom they have an offline connection. . Each of these anticipated uses had higher standard deviations, indicating more diversity of opinion among respondents in how likely they were to engage in these activities. These uses also indicate specific instances of social searching, using Facebook to find out more about someone with whom they have a previous connection, even if that connection is as tenuous as sharing a class.",
               "Respondents indicated they felt their Facebook profiles represented them accurately and positively. Users may assume that others are engaging in the same types of behaviors they report in themselves, namely searching for information about their offline connections. In that case, profile construction might be intended for that audience of peers they report are seeking them."
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "n": "4.1",
               "text": "Limitations",
               "type": "introduction"
          },
          "paragraphs": [
               "Finding casual sex partners (1.32), finding people to date (1.99), and finding people to meet offline (2.41) were all lower on the expectation scales. These uses are instances where the connection is sought first online, and then moved offline, or social browsing in our parlance. This pattern seems to indicate that people do not use Facebook for social browsing activities.",
               "One possible exception is the diversity of responses about whether the user would be likely to use Facebook to search for parties or events on campus. Searching for parties on campus through Facebook was the most widely divisive activity among expected likelihoods. shows the responses to the likelihood to search for a party or event, which are distributed between all categories. One explanation for this pattern might be that users are truly mixed about how often they search for social events through Facebook. Another explanation might be that some respondents interpreted the question to include attendance of the event they learned about. In this case, some users may be using Facebook to track where social events are occurring on campus.",
               "The primary limitation of this study is that Facebook has characteristics that may undermine the generalizability of results reported here. By virtue of being tied to an offline community through the registration process, Facebook is uniquely tied to offline uses like social searching. Studying an online social network like MySpace or Orkut would yield different results. These sites may still have an underlying offline component that is ignored. Also, Facebook may be better compared to corporate intranets than to entirely online social networks. Previous work has shown that user profiles are popular in online communities stemming from offline organizations . Even though Facebook is unlike other social networking sites, we feel the differences add an interesting point of comparison.",
               "This study took place during a snapshot of time in the lifecycle of Facebook. Other social software sites have seemed to enjoy rapid growth, followed by a dramatic drop off in participation. It remains to be seen if this is a pattern that will emerge for this site as well.",
               "Given these indicators, we find support for the idea that Facebook members are using the site to engage in social searches, i.e. find out more about people in their offline communities. Social browsing, finding people online for offline encounters, was widely reported as an unlikely use by the survey respondents.",
               "Although the surveys used in this analysis received relatively high response rates, there may be a relationship between likelihood of participation in the Web survey and Facebook use. People more likely to participate in online surveys may also be more likely to be Facebook participants, indicating our measures of participation are inflated. There is also a chance that Facebook users would over-respond to a survey about Facebook, however, this is unlikely as there was no mention of Facebook in the invitational email.",
               "The survey captured the attitudes of first year students only. Use may differ over the life of a student. For example, one might expect that older students are less committed to using Facebook as a way to keep track of high school friends. Studies of different groups of Facebook users, including non-students like faculty and administration, would be useful in the future.",
               "Surveys collect opinions and beliefs, but not actual behaviors. While this study provides insight into members' beliefs about their use of Facebook, it does not capture information on how they do use the site. It could be that their reports of how they use Facebook differ from their actual behavior on the site.",
               "\"social browsing,\" or searching for users online initially with the intention of moving that relationship offline."
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "n": "4.2",
               "text": "Future Work",
               "type": "conclusion"
          },
          "paragraphs": [
               "Besides broadening the scope of respondents included in this study, there are several future steps that will help us to understand how Facebook helps students reify their existing communities, and maybe forge new ones.",
               "We would like to thank Nancy Lange and Jennifer Hodges in the Department of Residence Life at Michigan State University as well as the College of Communication Arts and Sciences for supporting this research."
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "n": "7.",
               "text": "REFERENCES",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Other methods, such as content analysis of profiles and interviews with users, may provide more context for the survey data. Content analysis could determine whether users craft their profiles around geographically relevant items and provide further insight into the interactions between offline and online communities. Interviews would help explicate motivations of use and allow us to understand users' self-presentation strategies and how they assess others online.",
               "A longitudinal study could illustrate how Facebook use changes over time. For example, it could be that as students progress through their college careers, surveillance functions become less important, or that self-presentation strategies change as users anticipate leaving the university and beginning their professional lives.",
               "While most students did not report that they would use Facebook to find people online for offline encounters, some users did. It would be valuable to analyze the characteristics of these atypical users and see what motivates this perceived use, and to determine whether and how actual usage varies."
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "n": "4.3",
               "text": "Design Implications",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Given the link between offline encounters and online searches, Facebook and similar sites could add tools that facilitate that connection. Especially as Facebook use evolves over time, features that help delineate previous group memberships might be important for the social surveillance taking place on the site. For example, users might want to see where another member lived their first year, even though they have moved off-campus.",
               "Another feature of social networking sites that would facilitate social searching is the ability to form groups based on offline activities other than courses. For example, a user might join a hockey interest group, but also be interested in who else in their residence hall has joined the same group. This would allow users to more readily learn about those around them by connecting them to their activities in other types of associations."
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "A face(book) in the crowd"
     },
     {
          "head": {
               "n": "5.",
               "text": "CONCLUSIONS",
               "type": "conclusion"
          },
          "paragraphs": [
               "In this paper, we have shown that many first-year students at Michigan State University choose to become Facebook members. Those students using the site anticipate that their audience is comprised of peers, rather than other university members like faculty and administration. Facebook members seem to be using Facebook as a surveillance tool for maintaining previous relationships, and as a \"social search\" tool by which they investigate people they've met offline. There seems to be little"
          ],
          "paper_id": "20f66640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "A face(book) in the crowd"
     }
]