[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "This paper presents a generalized version of the linear threshold model for simulating multiple cascades on a network while allowing nodes to switch between them. The proposed model is shown to be a rapidly mixing Markov chain and the corresponding steady state distribution is used to estimate highly likely states of the cascades' spread in the network. Results on a variety of real world networks demonstrate the high quality of the estimated solution."
          ],
          "paper_id": "2112c7e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "A Generalized Linear Threshold Model for Multiple Cascades"
     },
     {
          "head": {
               "text": "I. INTRODUCTION",
               "type": "introduction"
          },
          "paragraphs": [
               "Cascading processes are models of network diffusion used to study phenomenon concerning the spread of new trends and innovations in social networks. Each node can be in one of two states: infected (i.e., supports an idea or a product) or uninfected. Every infected node can infect its neighbors and thus, the infection, formally called a cascade, propagates through the network. These processes have been studied in many applications such as viral marketing , blog networks and contagion models .",
               "Broadly two theoretical models of diffusion have been explored: the linear threshold model , and the independent cascade model , . In the former, every infected neighbor for a node contributes certain weights and if their sum is greater than a threshold, the node is infected. The weights depend often on the edge strength between the node and its neighbors. In the latter, each infected node is allowed one chance to infect a neighbor with some probability generally depending on the edge strength between the nodes.",
               "Existing literature has primarily focused on single cascade models but this assumption breaks down in many real world scenarios when there are many competing products, different political messages, ideas etc. It is also possible for nodes' affinities towards certain cascades to evolve with those of their neighbors'. This situation has different dynamics and requires more sophisticated models. Research in multiple cascades has looked at variations of the independent cascade model , , . However, the models do not allow nodes to change their cascade states once infected. To the best of our knowledge, the research presented in this paper is the first to discusses multiple cascades while allowing nodes to switch between them.",
               "The proposed model is a generalized version of the linear threshold model. It assumes that edges in the network are symmetric and carry non-negative edge-weights. For k cascades propagating in graph G(V, E), a node can be in k + 1 states (any one of the casacades or uninfected) and there are (k + 1) |V | possible states for G. The key challenge is estimating the most likely state of the cascades' spread in the network. A stochastic graph coloring process is presented and is shown to be a rapidly mixing Markov chain. This allows efficient simulation based algorithms for deducing the steady state distribution, and consequently the likely states of cascades' spread in the network.",
               "The rest of the paper is divided as follows -Section 2 discusses related work. Section 3 presents the generalized linear threshold model along with an algorithm for estimating the most likely cascades' spread in a given network. In Section 4 results using the proposed algorithm are investigated on real world networks from a variety of applications and Section 5 concludes the paper along with future directions."
          ],
          "paper_id": "2112c7e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "A Generalized Linear Threshold Model for Multiple Cascades"
     },
     {
          "head": {
               "text": "II. RELATED WORK",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Apart from the linear threshold and independent cascade models, Markov random field , and game theory based methods for network diffusion have also been studied. One of the more interesting problems in cascading processes is that of influence maximization , . In Kempe et al. prove that it is NP-hard and show performance guarantees for greedy hill climbing strategies. A method for simulating propagation of a single cascade, while allowing nodes to switch between infected and uninfected states, for finite time segments is presented along with a general model that subsumes both the linear threshold and independent cascade models. In the traditional independent cascade model is extended to allow nodes more than one chance to infect its neighbors. A comprehensive review on network diffusion processes and their applications can be found in . Models for multiple cascades have been studied as extensions of the independent cascade model for the progressive case, where once a node is infected with a cascade, it never change its state , , , ."
          ],
          "paper_id": "2112c7e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "A Generalized Linear Threshold Model for Multiple Cascades"
     },
     {
          "head": {
               "text": "III. PROPOSED APPROACH",
               "type": "modelling"
          },
          "paragraphs": [
               "In the literature, graph coloring is the problem of labeling vertices, with k colors, so that no two adjacent vertices . (a) G with 3 partitions, (b) Coloring the graph with cascades induces the same partitioning as (a), note that endemic regions appear as smooth regions of colors, (c) Endemic regions with a coloring that merges p 2 and p 3 with the third cascade dying out, (d) Another coloring that splits p 1 into two regions, allowing a fourth cascade in the network nature of the process, nodes are allowed to switch back and forth between the two states. For multiple cascades, |C| > 2, weights from neighbors having different colors are summed up and one of the colors is sampled as the new state.",
               "This trivial extension to the vanilla linear threshold model has three problems that make it unsuitable: (i) the trivial state of coloring all nodes with the same color is favored, (ii) if a state where some color c p is not assigned to any node is reached, then the chain can never transition to a state where any of the nodes have color c p . Thus, the chain is not ergodic and will not have a unique steady state distribution, and (iii) given the state space size |C| |V | , it is difficult to say how many iterations are required to reach steady state. The next sub-section presents a small modification to (1) that addresses all of these problems.",
               "have the same color. In the context of this paper, a general definition of graph coloring is considered which includes problems of labeling vertices with k colors subject to a given set of constraints, not necessarily requiring adjacent vertices to have different colors."
          ],
          "paper_id": "2112c7e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "A Generalized Linear Threshold Model for Multiple Cascades"
     },
     {
          "head": {
               "text": "B. A generalized linear threshold model for multiple cascades",
               "type": "modelling"
          },
          "paragraphs": [
               "wv i"
          ],
          "paper_id": "2112c7e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "A Generalized Linear Threshold Model for Multiple Cascades"
     },
     {
          "head": {
               "text": "A. Simulating cascades using graph coloring",
               "type": "modelling"
          },
          "paragraphs": [
               "Consider the graph G(V, E) and set of colors C. In each step, node v i is sampled according to the fixed distribution J = Consider an undirected graph G(V, E), with non-negative edge-weights w ij > 0 for each edge (i, j)E and no self-loops w ii = 0, ?v iV . Weight w ij represents the similarity and/or affinity between nodes i and j. Nodes in G are colored using |C| number of colors from the set C = {c 1 , c 2 , . . . , c |C| }. The state space S of all possible colorings is of size |C| |V | and each colored state G CS induces a corresponding partitioning on G. Nodes in each partition are a maximal subgraph in G C , such that they are all connected and have the same color. Semantically, the colors correspond to different states a node can be in, one of the cascades or uninfected. The partitions are the subgraphs, in G, where different cascades are endemic ).",
               "Consider the following process: In each step, node v iV is sampled uniformly and then a color c p is sampled for it. If G C is the current colored state of the graph and n W , where w vi is weighted degree of v i and W is the total weighted degree in G. Then, given colors for all other nodes, color c p is sampled for v i with probability,",
               "is the jth neighbor of v i , then probability of assigning color c p to node v i , given colors for all other nodes is,",
               "is colored with c p and 0 otherwise. The process described in (1) is a Markov chain with state space being the set of all possible colorings of G using |C| colors. If |C| = 2 in (1) then the vanilla linear threshold model is obtained. Nodes can be in one of two states (infected/uninfected) and in each step weights from a node's infected neighbors are summed up and used as a Bernoulli probability to sample a new state for that node. This is equivalent to sampling a threshold between (0, 1). By In (2)(0, 1). This is also a Markov chain with state space S. In (2), there is a chancethat node v i ignores its neighbors and picks a color from a uniform distribution. The number of colored states corresponding to 1p|V | number of partitions, is greater than the same for every p< p number of partitions. Consequently, the first term in the RHS of (2) acts as a regularizer against the second terms bias to color all nodes with the same color.",
               "For a stochastic process sampling colors for nodes in G according to , (i) there are a finite number of states (|S| = |C| |V | ), (ii) every state is reachable from every other state, and (iii) aperiodic states exist. Thus the process is ergodic and will converge to a unique stationary state distribution.",
               "The nature of the steady state distribution depends on how the two terms in the R.H.S. of (2) work together. The steady state distribution tends to favor states in which (i) nodes in close knit-regions of the graph have the same color, (ii) no two such close-knit regions with low connectivity between them have the same color. If a local region in G has high intra-connectivity then a cascade should be endemic in this region and appear as a partition having the corresponding color. However, if two such adjoining colored partitions have sufficiently low connectivity between them then nodes within one partition have enough support for each others' state such that there is significant resistance for the cascade from the adjoining partition to transition in and take over any of the nodes. Larger values offavor states having more number of tight-knit endemic regions and lower values favor states with fewer number of coarser (some of the tight-knit regions are merged) endemic regions.",
               "The most important feature of this process is that it is a rapidly mixing Markov chain allowing us to place an upper bound on the number of steps required for the chain to reach steady state ",
               "for v lN (v q ) and 0 for all other nodes.",
               "Lemma 1: For a given undirected graph G(V, E) with non-negative edge-weights and no self-loops, if the Markov chain proposed in (2) takes t(?) number of steps to reach the steady state distribution then, = 1 ?w min W Since, 0 << 1 we have< 1 and steady state is achieved in t(?)W |V | wminlog ? steps. Lemma 1 holds even when arbitrary multinomial distributions are used, instead of the uniform one, in the first term in the R.H.S. of (2). It also holds when one or more nodes are acting as sources for any of the cascades. If M Y is observed independent of M X , then it appears to be following (2). Thus, a coupling is defined between them. Assume M Y is following the true steady state distribution and their respective states X t and Y t (at some time t), differ only in the color of a single vertex v qV . If ? t is the number of nodes having different colors in X t and Y t , then ? t = 1. According to the path-coupling lemma , in order to prove that (2) is rapidly mixing it is sufficient to show that the maximum possible value for E[? t+1 ] is less than one i.e.,= max Xt,YtS,vqV E[? t+1 ] < 1. Moreover, if the above condition holds then then the mixing time will be t(?)log(|V |?",
               ", are equivalent. Consequently, the steady state is a multi-modal distribution and the expectation is not a good representation of how the different cascades will be endemic in the network. A preferred approach is to work with the most likely state instead of the expectation.",
               "The most likely state is estimated using simulated annealing and the complete procedure, called StochColor, is presented in Algorithm 1. Function getColoredPartitions(G C ) uses a breadth first search traversal method, that looks for connected regions having the same color, to compute partitions corresponding to the most likely state. Thus, the StochColor algorithm is used to estimate a solution state for simulating multiple cascades on G, with time complexity O((",
               "StochColor takes as input: number of colors (|C|),, error ? and simulated annealing parameters final temperature (T f ), cooling rate (). Empirically, results from StochColor were observed to be robust over large changes in them. Parameter ? measures error between estimated and true steady state distributions, in terms of statistical variation. It offers a runtime vs. accuracy trade-off. Since we are interested in the most likely state and not the actual steady state distribution itself, larger errors in the estimated steady state distribution are tolerable and results are stable over orders of magnitude of change. Empirically ? = 10 ?20 was sufficient for many applications. For the annealing process empirically it was observed that= 0.99 and T f = 0.1 worked well for networks from various domains."
          ],
          "paper_id": "2112c7e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "A Generalized Linear Threshold Model for Multiple Cascades"
     },
     {
          "head": {
               "text": "IV. EXPERIMENTS",
               "type": "experiment"
          },
          "paragraphs": [
               "In this section, results on real networks demostrate the quality of the estimated solution along with the impact of varying |C| and. illustrates solutions estimated using StochColor on small social networks. and compared to results from state of the art graph partitioning methods on a variety of real world datasets: 32-bit adder (add32), structural engineering (bcsstk29), finance (finance256), yeast network (NDyeast) ,human brain network (brain) , and General Relativity, Physics, coauthorship network (ca-GrQc)  .",
               "For each dataset, results from the following algorithms were computed:",
               "A. Real Networks 1) Methodology: The endemic regions, estimated using StochColor are treated as a partitioning of the input graph",
               "? StochColor: In all experiments values |C| = 100,= 0.9, ? = 10 ?20 , T f = 0.1 and= 0.99 were used and the result corresponding to the median of number of partitions returned over 5 runs was taken.",
               "? Graclus : Graclus with base spectral clustering algorithm and 20 steps of localized search. It requires the number of partitions as input, which was taken to be  Normalized Cut (NCut) was used to measure quality of partitioning. Lower NCut means better partitioning. For a given set of partitions P = {V i } i=1...p on a graph G(V, E),  compares StochColor with Graclus and Metis on datasets in . StochColor is doing a little worse on add32, comparable on brain and significantly better for all other graphs. The observations regarding NCut performances were consistent when varying |C| and. Metis had memory issues with NDyeast and so the results are not reported. presents similar results for Modularity.",
               "Figures 3-a and 3-b show the number of partitions returned by StochColor when varying |C| andrespectively. While results are generally stable over changes in C, on increasing it even to larger values, a limiting behavior on the number of partitions returned is observed as redundant colors die out. Semantically, this is indicative of a \"cascade saturation number\" i.e., the maximum number of cascades that the network can support. Forthe stability is relatively less and as expected, a general trend of largerreturning more partitions can be observed.",
               "In this work a generalized version of the liner threshold model, capable of handling multiple cascades while allowing nodes to switch back and forth between them, is presented. The corresponding stochastic process is shown to be a rapidly mixing Markov chain and the StochColor agorithm is provided for discovering the most likley states of the cascades' spread in a given graph. Results on real data demonstrate the high quality of solutions estimated using StochColor, while revealing an interesting limiting behavior on the number of cascades' surviving in the network. Future work will study the influence maximization problem as well as a more effective algorithm for computing the optimal state representative of the cascades' behavior."
          ],
          "paper_id": "2112c7e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "A Generalized Linear Threshold Model for Multiple Cascades"
     }
]