[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Influence maximization is a fundamental issue to find a set of key individuals in social network such that targeting them initially will maximize the spread of influence. However, the problem of finding the most key nodes is NP-hard. It is shown that a greedy algorithm with provable approximation guarantees can give good approximation. However, it is too computationally expensive to apply in a large social network. Based on the community structure of social network, a cooperative game theoretic algorithm (CGINA) to find key nodes is proposed. In CGINA, we first detect the community structure of the social network with the topological structure and information diffusion model. Then, we will find key nodes in communities. Different from other literature, we think of the information diffusion in the whole network as a cooperative game with transferable utility. The communities of the network happen to be the players in the game. With the Shapley value in game theory, we allocate the number of key nodes for each community. In my view, the key nodes include two parts. One is composed of \"bridge\" nodes, which are easy to propagate information across communities, the other is composed of \"influential\" nodes, which can diffuse information quickly in its own community. Empirical studies on a large social network show that our algorithm is efficient and powerful."
          ],
          "paper_id": "211fe740-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "A New Community-based Algorithm for Influence Maximization in Social Network ?"
     },
     {
          "head": {
               "n": "1",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Kempel et al. establishes the optimization of influence maximization is NP-hard . They use the greedy algorithm and prove that the optimal solution can be approximated to with a factor (1-1/e-). Chen et al. propose an improved version of greedy called NewGreedy. It takes the first round with NewGreedy algorithm and the rest rounds using CELF Greedy algorithm , called MixedGreedy, which is shown to be more efficient than other Greedy algorithms . However, when a large network with millions of nodes needs to deal with, all these algorithms are incapable. Based on the community structure, Wang et al propose a community-based greedy algorithm (CGA), which is applicable to the large network with millions of nodes. Similar to CGA, based on the community structure of the network, CGINA is proposed in this paper. Different from CGA, with the community structure of the network, we think of the information diffusion in the network as a cooperative game between the communities. With the Shapley value, we propose a novel algorithm. Experiments show that our algorithm is powerful and effective in the large social network.",
               "The paper is organized as follows. Section 2 describes the related work. Next we describe the community detection algorithm based on influential model in section 3. In section 4, we describe the CGINA algorithm for the top-k nodes problem. We report a performance evaluation in section 5. Finally, we offer conclusions and research directions in section 6."
          ],
          "paper_id": "211fe740-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "A New Community-based Algorithm for Influence Maximization in Social Network ?"
     },
     {
          "head": {
               "n": "2",
               "text": "Related Work",
               "type": "relatedwork"
          },
          "paragraphs": [
               "In this paper, we focus on the problem that how we can find the key nodes in information propagation based on the community structure.",
               "Domingos and Richardson are the first to study the influence maximization as an algorithm problem and propose a probabilistic solution. Chen et al. present a degree discount heuristic algorithm called DegreeDiscount that runs faster than MixedGreedy. Scripps et al present a metric to estimate the number of communities to which a node is attached and define communitybased roles for a node. They also briefly discuss the application of community-based roles for a node. As mentioned before, these approaches are incapable of dealing with the large social network."
          ],
          "paper_id": "211fe740-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "A New Community-based Algorithm for Influence Maximization in Social Network ?"
     },
     {
          "head": {
               "n": "3",
               "text": "Community Detection",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Community structure is the intrinsic property of social network. In this paper, we will make use of the detected communities to estimate the influence of nodes in the whole network. So, we want to detect the communities based on the influences between nodes in the information diffusion, rather than only on the topological structure, such that the influence of nodes in a community is close to that in the whole network. The algorithm we adopt is in . The main idea of the algorithm is as follows:",
               "The community detection algorithm includes two steps, partition and combination.",
               "(1) Partition. The algorithm is extended from the algorithm with the information influence mechanism based on Independent Cascade model (ICM).",
               "(2) Combination. The generated communities in a social network by step partition are small and dispersed; Combination is developed to combine these communities to get a better result.",
               "The detailed algorithm can be seen in algorithm 2 in ."
          ],
          "paper_id": "211fe740-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "A New Community-based Algorithm for Influence Maximization in Social Network ?"
     },
     {
          "head": {
               "n": "4",
               "text": "Key Nodes Discovering",
               "type": "relatedwork"
          },
          "paragraphs": [
               "In this section, we first present the preliminaries about cooperative game theory and Shapley value, and then we will propos algorithm CGINA to find key nodes."
          ],
          "paper_id": "211fe740-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "A New Community-based Algorithm for Influence Maximization in Social Network ?"
     },
     {
          "head": {
               "n": "4.1",
               "text": "Cooperative game and Shapley value",
               "type": "relatedwork"
          },
          "paragraphs": [
               "A cooperative game with transferable utility(TU game) is defined as the pair , where N={1,2,. . . ,n} is the set of players and v::2 NR is a real-valued mapping with v(?)=0. 2 N is the set of all possible subsets of N. v is called the characteristic function. Given S ? N, v(S) is called the value of the coalition S and represents the total transferable utility that can get by the players in S, without help from the players in N \\S.",
               "Shapley value provides a unique expected payoff allocation for a given coalition game. For a given TU game (N,v), its Shapley value is",
               "denotes the Shapley value of player i , mathematically, it is given by,",
               "C?N \\{i}",
               "Given iN, C ? N and i /C, the marginal contribution of node i to the coalition C is defined as v(C{i})-v(C), ?C?N\\{i}. Now, consider the set ? of all possible n! permutations on N. Letbe a permutation in ?, C i () is defined as the set of all nodes appearing before i in. The average marginal contribution of i to the given game as,",
               "It is easy to see that the computational complexity of this approach is O((n/e) n ). So, when the number of players is very large, it is not tractable to compute the Shapley values of the players directed."
          ],
          "paper_id": "211fe740-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "A New Community-based Algorithm for Influence Maximization in Social Network ?"
     },
     {
          "head": {
               "n": "5",
               "text": "Experiment",
               "type": "experiment"
          },
          "paragraphs": [
               "In this section, we evaluate the effectiveness and efficiency of CGINA algorithm."
          ],
          "paper_id": "211fe740-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "A New Community-based Algorithm for Influence Maximization in Social Network ?"
     },
     {
          "head": {
               "n": "5.1",
               "text": "Experimental setup",
               "type": "experiment"
          },
          "paragraphs": [
               "By the benchmarks developed in , we get the experimental data set, which has 10,000 nodes and 1498772 edges. The average degree of the graph is 13.4. After community detecting, we get 52 communities. The biggest has 23215 nodes, and the smallest one has 107 nodes. In experiments, similar to , we take MixedGreedy as the benchmark to evaluate the algorithm CGINA. The parameters for the algorithm are heuristic factor l, the number of key nodes K. Same to the previous work in influence maximization, two metrics are employed to evaluate CGINA, namely influence degree and runtime. As defined in , the influence degree of set A is computed as: R(A)=V A /|N|,where V A is the number of nodes influenced by A in information diffusion."
          ],
          "paper_id": "211fe740-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "A New Community-based Algorithm for Influence Maximization in Social Network ?"
     },
     {
          "head": {
               "n": "5.2",
               "text": "Experimental result",
               "type": "experiment"
          },
          "paragraphs": [
               "In this subsection, we will show the changing of the experimental result varies with the parameters.",
               "(1) Varying of the heuristic factor l To evaluate the effect of the parameter l on the influence degree, we run CGINA in the whole network and we set k at 30. The results are shown in . The heuristic factor l indicates the proportion of the number of bridge nodes in the total key nodes. As shown in , with the growth of l, the influence degree increases firstly, then decreases gradually. In a community, there is a proper ratio for the number of bridge nodes. When l is greater then the value, the total influence degree decreases quickly. As shown in , with the increasing of l, the running time decreases gradually. But when the value of l is 0, the running time decrease rapidly. As shown in section 4, the discovery of key nodes is divided into two parts, namely influential nodes discovering and bridge nodes discovering. According to the complexity analysis in section 4, we know that the complexity of influential nodes' discovering is more time-consumed than the other. So, when we set l at 0 ,the running time is decreased rapidly.",
               "(2) Varying of the size of key nodes K To evaluate the effect of the parameter K, we run CGINA in the whole network and we set l at 0.2. The results are shown in . In , we can see that the influence degree of MixedGreedy is the best of these three algorithms. The influence degree of CGA is slightly better than CGINA . As for the running time, the efficiency of MixedGreedy is the worst in these algorithms. With the growth of K, the running time of MixedGreedy increases quickly. Since the discovering of key nodes in CGA and CGINA is within the community, the efficiency of these two algorithms is much stronger than MixedGreedy. , we can see the efficiency of CGINA is slightly stronger than CGA.",
               "(3) Scalability with the network size N To evaluate the scalability of CGINA and other algorithms, in experiment, we set K at 30, and l is 0.2. In this experiment, we vary size of N from 10k to 100k. In the experiment, we randomly choose nodes with pre-specified size from the original network. The experimental results are shown in . It is shown that the influence degree of these algorithms is relative stable in these three algorithms. As for the running time, we can see that the running time of CGA and CGINA are relative stable, but when the size of the network is greater than some value, the running time of MixedGreedy increases quickly. So, CGINA and CGA are very applicable to those large networks."
          ],
          "paper_id": "211fe740-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "A New Community-based Algorithm for Influence Maximization in Social Network ?"
     },
     {
          "head": {
               "n": "6",
               "text": "Conclusion",
               "type": "conclusion"
          },
          "paragraphs": [
               "We propose a novel community-based algorithm CGINA to mine the key nodes for information diffusion in social network. Different from other algorithms, we think of the information diffusion in the whole network as a TU game. With the Shapley value, we get the number of key nodes to mine in each community. The discovering of key nodes are divided into bridge nodes mining and influential nodes mining. In the former , we employee the bridge weight to indicate the importance of every out node. In the latter, we employee MixedGreedy to discover the influential nodes within a community. Empirical results show that CGINA is effective and efficiency. There are some interesting directions for further work. The main issue is as follows. How to determine a proper value of heuristic factor? Is it appropriate to estimate the difficulty of information diffusion in a community with its weight density? How to compute the Shape value for every community more quickly?"
          ],
          "paper_id": "211fe740-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "A New Community-based Algorithm for Influence Maximization in Social Network ?"
     }
]