[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "In this paper, we propose an anticipatory stig-mergy model for decentralized traffic congestion management. Managing traffic congestion is one of the main issues for smart cities, and many works have been trying to address it from the IT and Transportation research perspectives. Recently, dynamic coordination methods are becoming possible using the more short-term traffic information that can be provided by probe-vehicle information or smart phones. Some approaches have been trying to handle short-term traffic information in which a stigmergy-based approach is employed as an indirect communication method for cooperation among distributed agents and for managing traffic congestion. One drawback of these approaches is that handling near-future congestion remains problematic because stigmergies are essentially based on past information. In this paper, we propose anticipatory stigmergy for sharing information on near-future traffic and allocating drivers adequately. In this model, all vehicles submit their near-future intention as anticipatory stigmergy to research their routes. Our preliminary results demonstrate that anticipatory stigmergy with allocation strategy works well."
          ],
          "paper_id": "212d2db0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "A Preliminary Study on Anticipatory Stigmergy for Traffic Management"
     },
     {
          "head": {
               "text": "I. INTRODUCTION",
               "type": "introduction"
          },
          "paragraphs": [
               "In this paper, we propose an anticipatory stigmergy model for decentralized traffic congestion management. Recently, there are several studies and practices for observing traffic flow and providing information on traffic congestion. These are usually done by counting the vehicles that pass particular locations using sensing gates that are usually placed on the arterial roads. Such information is broadcasted as current information to vehicles. It is rarely stored and cannot work as shared memory. More sophisticated coordination methods are becoming feasible by utilizing the current traffic information. More precise traffic information can be provided by car navigation systems with GPS and probe-vehicle information. These data are stored in central servers as long-term memory that can provide stochastic traffic congestion information to vehicles. Such information technologies have been already applied in the real world. Researches in the field of transportation and multi-agent systems have been focusing on dynamic shortterm memory. Vehicles share this dynamic information, and drivers can choose their routes more dynamically based on real-time information. This short-term traffic information is usually modeled as a stigmergy. Stigmergy has been used for indirect communication for cooperation among agents.",
               "For example, ants' pheromone is a kind of stigmergy for cooperation among them. In this case, ants are modeled as agents in multi-agent models and also as vehicles in traffic situations. Vehicles can estimate their nearest future situation based these stigmergies. One drawback of these stigmergies approaches is that handling near-future congestion remains problematic because stigmergies are basically past information. In this paper, we propose anticipatory stigmergy for sharing information about near-future traffic. In our model, each vehicle submits its near-future intention as anticipatory stigmergy and reschedules its route plan based on the submitted anticipatory stigmergies. In this paper, we assume the following types of stigmergies: long-term, shortterm, and anticipatory. We conducted several simulations to compare the different kinds, and evaluate how to allocate effectively the drivers to the road network. Our preliminary results demonstrate that the anticipatory stigmergy works especially well by considering each driver time spent in congestion. In the rest of this paper, Section 2 presents our basic simulation model for traffic simulation. In Section 3, we propose an anticipatory stigmergy model and show preliminary experiments and their results in Section 4. In Section 5, we review related works, and finally in Section 6, conclusion is drawn."
          ],
          "paper_id": "212d2db0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "A Preliminary Study on Anticipatory Stigmergy for Traffic Management"
     },
     {
          "head": {
               "text": "II. SMART TRAFFIC SIMULATION MODEL",
               "type": "modelling"
          },
          "paragraphs": [
               "In this paper, we model a road network as a graph. Let directed graph G = (N, E, Cap, t 0 ) serves as a model of the road network, where N is a finite set of nodes that model intersections, and E ? NN is a set of links that model one-way roads among intersections. Link l = (n, n )E if and only if there is a link that permits traffic to flow from intersections n to n . Function Cap(l) defines the capacity on link l. Function t 0 (l) defines a free flow travel time of link l. Each vehicle i has origin node n o i and destination node n d i . |l| is the length of link l. We assume two road classifications: arterial and ordinary. Arterial roads have two lanes while ordinary roads have one lane. The following is the procedure to determine the characteristic values for each link in this paper.",
               "1) The links in road network are classified into an arterial road or an ordinary road. 2) If a link is an arterial road, the number of lanes of link l is 2. Otherwise, it is 1.",
               "3) If a link is an arterial road, the maximum speed of link l, v max (l), is sampled from U nif orm km/h. Otherwise, it is sampled from U nif orm km/h. 4) Every link is divided into some cells. The number of cells for one lane in l is defined by int( |l| vmax(l) ). 5) We call one unit-time for passing one cell. The number of cells equals to a free flow travel time t 0 (l).",
               "One unit-time is supposed 1 minute in this paper. 6) The capacity Cap(l) is calculated from the number of cells and lanes. In order to treat each vehicle as a discrete one (not continuous), our developed traffic simulation model is a cellular automaton model. A vehicle can move from a current cell cell current to next cell cell next at time t + 1 if there is no other vehicle at cell cell next at current time t. If there is a vehicle at cell cell next at current time t, then it stops at current cell cell current .",
               "about the travel time of probe cars for only the most recent five minutes, and provides short-term stigmergy value v s = ave + sd * 0.05, where ave is the average and sd is the standard deviation of the most recent 5-min stored data. If there is no vehicle passing the link for 5-min, short-term stigmergy value is v s = v 0 . Each probe vehicle utilizes this short-term stigmergy information to search new route by Dijkstra algorithm every five unit-times (minutes)."
          ],
          "paper_id": "212d2db0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "A Preliminary Study on Anticipatory Stigmergy for Traffic Management"
     },
     {
          "head": {
               "text": "III. HOW TO COLLECT AND PROVIDE TRAFFIC INFORMATION",
               "type": "modelling"
          },
          "paragraphs": [
               "A road (link) stores and manages long-and short-term stigmergies. As mentioned before, the long-term stigmergy information is the value of v l that is updated hourly, the short-term stigmergy information is the value of v s that is updated every five unit-times (minutes). Each probe vehicle utilizes combined long-and short-term stigmergy information to make a new route plan by Dijkstra search every five minutes. Eq. (2) shows how to combine long-and short-term stigmergies, and v ls is the combined stigmergy information:",
               "We set the following five cases for traffic simulation, and explain how to collect and provide traffic information in each case to evaluate and compare the effect of short-term, long-term, and anticipatory stigmergies",
               "where v s is the short-term stigmergy value, v l is the longterm stigmergy value, and w is the weight of the long-term stigmergy."
          ],
          "paper_id": "212d2db0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "A Preliminary Study on Anticipatory Stigmergy for Traffic Management"
     },
     {
          "head": {
               "text": "E. Case4: Anticipatory Stigmergy",
               "type": "modelling"
          },
          "paragraphs": [
               "No traffic information is gathered or provided. Each vehicle finds the best path by Dijkstra search before it departs. We assume several different starting and end points since people have different origins and destinations. The cost of link l can be shown in equation :",
               "where t 0 (l) defines a free flow travel time, and v max (l) defines the maximum speed and |l| is distance of link l."
          ],
          "paper_id": "212d2db0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "A Preliminary Study on Anticipatory Stigmergy for Traffic Management"
     },
     {
          "head": {
               "text": "B. Case1: Long-Term Stigmergy",
               "type": "modelling"
          },
          "paragraphs": [
               "Every five unit-times (minutes), all probe vehicles find the best route to their destination node based on long-and short-term stigmergy, as in case 3. Here, they submit (as a link) where they will be in the next ten unit-times (minutes). This is how we define anticipatory stigmergy. Then they can confirm the traffic situation in future and search the best route based on the anticipatory stigmergies. Eq. shows the heuristic cost of link l by using anticipatory stigmergies, which are average travel time calculated by link performance function defined by The Bureau of Public Road (BPR) in U.S. :",
               "A road (link) stores and manages long-term stigmergy (historical) information forever. As long-term stigmergy information, the each link stores the travel time from the vehicles equipped with GPS (i.e., probe cars), and provides them a long-term stigmergy value v l = ave + sd * 0.05, where ave is the average and sd is the standard deviation of all stored data of each link. Each probe vehicle utilizes this long-term stigmergy information to make a new plan by Dijkstra search before its department. Long-term stigmergy is updated every x hours, where in our simulations x is 1 (i.e., hourly update)."
          ],
          "paper_id": "212d2db0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "A Preliminary Study on Anticipatory Stigmergy for Traffic Management"
     },
     {
          "head": {
               "text": "C. Case2: Short-Term Stigmergy",
               "type": "modelling"
          },
          "paragraphs": [
               "A road (link) stores and manages stigmergy information for only the most recent five unit-times (minutes). As shortterm stigmergy information, the each link keeps storing data V ol(l) is the total number of probe vehicles in near-future on link l gathered by anticipatory stigmergy. Function t 0 (l) is a free flow travel time, and function Cap(l) is a capacity of link l that is adjusted adequately (in this study for the cellular automaton model, the adjustment value is set 0.4 because the condition to drive freely is a half of capacity).= 0.48, and= 2.48. This cost function v a is a heuristic; if there are many vehicles, then v a will be increased briefly. In this case 4, we assume that most drivers obey a new route estimated by the information of anticipatory stigmergies (Eq. (3)), however, in real world some drivers might not pass the recommended links. In this study, we evaluate the effects of trust level of the stigmergy information as a sensitivity analysis."
          ],
          "paper_id": "212d2db0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "A Preliminary Study on Anticipatory Stigmergy for Traffic Management"
     },
     {
          "head": {
               "text": "F. Case5: Anticipatory Stigmergy with Allocation Strategy",
               "type": "modelling"
          },
          "paragraphs": [
               "Every five unit-times (minutes), all probe vehicles search the best route to their destination node based on a link travel time with anticipatory stigmergy (Eq. ). In case 4, the route that a driver chooses actually is randomly set based on the trust level, so it might not be efficient. In this case 5, we introduce a strategy to allocate drivers reasonably into the two routes, that one is a route searched with historical information (i.e., combined long-and short-term stigmergy in case 3) and the other is a route searched with near-future information (i.e., anticipatory stigmergy in case 4). Although there are various allocation ways, in this study, we adopt an assignment by a time involved in congestion so far. A concrete procedure to allocate drivers into two routes is as follows.",
               "1) Firstly a time stayed in congestion from departure is calculated for each driver like this formula,",
               "where t congestion is a time involved in congestion from departure, t travel (l) is the driver s travel time on link l and t 0 (l) is a free flow travel time on link l. 2) If the number of drivers on the link searched with the traffic information of anticipatory stigmergy is larger than the congestion criteria, which is a half of capacity to drive freely in the cellular automaton model, drivers are sorted in descending order by his/her time stayed in congestion (t congestion ). Otherwise, all drivers choose that link. (In this study, there is no penalty or incentive to obey this rule, thus introduction of some mechanism is future work.) 3) In the concentrated situation, the top x% drivers are assigned to the link that is recommended as the best route with anticipatory stigmergy, and the rest of drivers are assigned to the link that is searched with combined long-and short-term stigmergy. We evaluate the effects of a ratio of allocation to the route searched by anticipatory stigmergy (x%) as a sensitivity analysis given from 10% to 90% respectively. OD is 2 -22). Every minute, each vehicle starts from node 0 or node 4 or node 2. Also, we assume that 75% of vehicles in each OD pair have a device to send and receive information (like car-navigation systems that can handle stigmergies). We conducted 50 iterations for each of the above cases. We assume one iteration is 24 hours. Our simulator can keep the map information based on XML format that is almost equivalent to the format of the OpenStreetMap . Future work includes simulations on the real city or town maps.  compares the average of total travel times between 41 and 50 iterations in all cases (cases 0 to 5). The following summarizes the strategies for managing traffic congestion."
          ],
          "paper_id": "212d2db0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "A Preliminary Study on Anticipatory Stigmergy for Traffic Management"
     },
     {
          "head": {
               "text": "A. Setting",
               "type": "modelling"
          },
          "paragraphs": [
               "First, we use a simple road network ), where 6-7, 7-8, 6-11, 11-12, 12-13, and 8-13 are set arterial roads (the number of lane is two), and the others are the ordinary roads (the number of lane is one). For artificial congestion, the shape is not a complete square. Some links are intentionally removed, e.g., link 5-10, link 10-15, etc. The numbers assigned for each link show the number of cells (which is equal to a free flow travel time) of this particular road network. OD (origin-destination) volumes are 300 vehicles. The 100 vehicles start from nodes 0 to 24 (i.e., OD is 0 -24). The other 100 vehicles start from nodes 4 to 20 (i.e., OD is 4 -20). The other 100 vehicles start from nodes 2 to 22 (i.e., Compared the result of case 1 with that of case 2, the long-term stigmergy in case 1 (i.e., a historical traffic information gathered by probe-vehicles updated hourly), works better than the short-term stigmergy in case 2 (i.e., a real time (past five minutes) traffic information gathered by probe-vehicles). Although it is only one result in this numerical experiment, it could be said that accumulation of traffic information is more effective. The result of case 3 (i.e., long-and short-term stigmergy is combined) is one under the condition that the weight of the long-term stigmergy w is 0.3 in Eq. (2). Since both characteristics are harnessed by integrating long-and short-term stigmergy, the total travel time is decreased greatly. And we can confirm that anticipatory stigmergy (i.e., near-future traffic information) is more effective than to utilize historical traffic information from the result of case 4. This result is based on the trust level of drivers whether to obey a new route that searched with anticipatory stigmergy is 80%. This means that it is not effective that all drivers choose steadily the recommended route, and it is necessary to manage adequate allocation. As one of a management to allocate drivers to network, we proposed in case 5 to assign by the level of the time involved in congestion after departure. This result of case 5 is one under the condition that the top 50% drivers are assigned to the link that is recommended as the best route with anticipatory stigmergy. From the comparison of the results of the total travel time in each case, a car navigation services, which have been introduced already in real world and utilize the historical traffic information maximally as in case3, is one of the effective management. In order to increase efficiency more, it is better to gather the near-future traffic information as anticipatory stigmergy and to allocate drivers appropriately. "
          ],
          "paper_id": "212d2db0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "A Preliminary Study on Anticipatory Stigmergy for Traffic Management"
     },
     {
          "head": {
               "text": "C. Results of Sensitivity Analysis",
               "type": "modelling"
          },
          "paragraphs": [
               "We will show more details of cases 3 to 5 with sensitivity analysis below.",
               "Firstly, in order to examine how to combine long-and short stigmergy in case 3, we change the weight of the longterm stigmergy w in Eq. (2) from 10% to 90% respectively, and compared the total travel time in each condition. shows that the every iteration s result of the total travel time in each condition. Our traffic simulator is a cellular automaton model to handle a vehicle as a discrete one, so there is a case that the total travel time is changing unstably. However, we can say that integration of historical traffic information and real time information is a valid approach, and the combination ratio of historical information is more effective between 60% and 90%. shows the average total travel time in last ten iterations in each condition. As analyzed before, the combined long-and short stigmergy is more effective than only using solely each stigmergy (i.e., w=0.0 (case 2) and w=1.0 (case 3)), and in this numeral experiment, the best result is under condition that the weight of the long-term stigmergy w in Eq. (2) is 0.9. In this study, the optimal combination of two kind of information can decrease the total travel time by about 8,000 minutes from case 1 and by about 16,000 minutes from case 2. Next we examine the effect of trust level of the anticipatory stigmergy information in case 4, and a ratio of allocation to the route that searched with anticipatory stigmergy information in case 5. shows the results of total travel time, which is averaged in last ten iteration, in each case, and the X-axis is a trust level of the route based on anticipatory stigmergy in case 4 and an allocation rate of the route based on anticipatory stigmergy in case 5. As shown in , the best result in case 4 is under condition that the trust level is 90%, this means a half of drivers obey the recommended route calculated by a near-future traffic information. Another trust level (except in 80%) is the same result in case 3. Similarly, the best result in case 5 is under condition that the a ratio of allocation to the new route is 50%, this means 50% of drivers obey the recommended route calculated by a near-future traffic information and 50% of drivers choose the route calculated by historical traffic information. Excluding the condition from 70% to 100%, the total travel time in case 5 is smaller than that in case 3 (43, 672.1 minutes). Thus it is not effective that all drivers choose steadily the recommended route, and it is necessary to develop and manage some allocation strategies. This study clarified that the allocation strategy to use the time stayed in congestion is more effective than the random assignment method in case 4.",
               "allocation strategy (refer to the results 50% in ). Each driver s time staying in congestion is an important indicator because it relates to the stress and the safety in driving. shows the histogram of a driver s time difference in congestion between case 4 and case 5 (case 5 -case 4). Total time difference is -21.53 minutes (i.e., a time staying in congestion in case 5 is smaller than that in case 4), and the number of drivers whose time involved in congestion is decreased in case 5 is 266 among 300 drivers. Therefore it is also effective to adopt a decision criterion in case 5. Here is one example of a driver s route in case 4 and case 5. Although a network in this numerical experiment is small, it turns out that a use route changes greatly with the allocation strategy."
          ],
          "paper_id": "212d2db0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "A Preliminary Study on Anticipatory Stigmergy for Traffic Management"
     },
     {
          "head": {
               "text": "D. Effect of Allocation Strategy",
               "type": "modelling"
          },
          "paragraphs": [
               "In case 4, it is effective to allocate 90% drivers into the link that searched with anticipatory stigmergy, but the assignment method is to decide only randomly. Thus we proposed an allocation strategy to set a decision criterion which is a time involved in congestion, and confirmed the validity in case 5. Now in this section, we analyze the effect of allocation strategy in detail under the same conditions, in which an allocation rate of 50% to the recommended link by anticipatory stigmergy in both case 4 and case 5. Although the driver who have to obey the new route with near-future traffic information are decided randomly in case 4, in case 5, they are decided based on a decision criterion. From the view point of efficiency, the total travel time in case 5 is smaller than that in case4, so it is effective to introduce the Many approaches have handled traffic congestion from real-world approaches to theoretical ones. The paper has shown, as a preliminary result, the comparison among some types of stigmergies in transportation management. Actually, while the paper could not show the real effect of anticipatory stigmergy, this paper successfully shows the effect. The main reason is that, in the paper , the experimental setting could not make the anticipatory stigmergy work. Precisely, in the paper , as anticipatory stigmergies, each vehicle sends its 5-minutes-future position. But, in that experimental setting, it was impossible for vehicles to pass one edge in 5 minutes since it might take around at least 10 minutes. This made the effect of the anticipatory stigmergy worse. Thus, this paper adjusted these experimental setting so that we can figure out when the anticipatory stigmergy can work well. Stochastic congestion estimation from long-term stored data was used to estimate congestion in the real world (for example, reference ). As we showed in this paper, long-term stochastic congestion estimation works well in a pure experiment. However, congestion continues. The reasons might be incentive issues, the dynamic nature of traffic (accidents, road construction, unpredictable human behaviors) or such habitual driver activities as bounded rationality. Congestion pricing reference , which is another common topic for avoiding congestion, is a system of surcharging drivers of a traffic network in periods of peak demand to reduce congestion. Some toll-like road pricing fees or carpool lanes are real examples. Congestion pricing is not new. Credit Based Congestion Pricing , is one future direction for congestion pricing. Here, a point-based mechanism is adopted for exchanging the rights to pass a congested road during peak demand. Congestion pricing is a kind of centralized mechanism. However, our mechanism can be implemented as a distributed mechanism with indirect communication stigmergy. Reference proposes an evolutionary gametheoretic model for dynamic congestion pricing in traffic networks. Their learning model improves dynamic congestion pricing for some real-world road networks. Distributed approaches have been widely studied in the field of multiagent systems and artificial intelligences. A very large-scale survey paper investigated the entire transportation field with multi-agent systems from traffic congestion to railway transportation. Some work is focusing on Ant Colony Optimization (ACO) , , which can be fit into congestion avoidance problems. We also believe that the swarm intelligence approach can be adapted for traffic congestion control. Reference proposed anticipatory vehicle routing using multi-agent systems. Here, their multi-agent systems actually resemble ACOs. For anticipation purposes, they use ACO as an optimization mechanism before the actual routing. Reference models a vehicle as an ant in an approach that closely resembles ours. The difference is that reference adopts only pheromone mechanisms without probe information used in the real world. Their methodology could be improved by integrating it with current real-world approaches to reduce traffic congestion. Recently, the paper uses a inverse ant colony optimization. It is inverse in the sense that a strong pheromone trace will influence following cars not to follow their predecessors but instead to avoid this road, taking a different route to their goals. Reference provides knowledge on drivers' dynamic route choice behavior using probe-vehicle data. Modeling route choice from real probe-vehicle data is essential because real route choices could be biased by habitual activities. References , also approach drivers' dynamic routing modeling. Reference is constructed acitivity based model by MATSIM. They simulated decreased gas emission in 2031 at Toronto. Reference provides lease vehicles whose fuel is decided by game-theoretic approach. These approaches results that it is effective to avoid congestion. Reference decide use of road resources based on marketbased approach. In the paper, these resources are needed reservations. Reference focuses on multiagent planning. The best planner combines the agent's plan. It doesn't consider RTA. Reference proposed that in order to scale up of multi-agent planning which blows up case exponentially, each single agent computes its best response to other agents. Reference approach loosely copled multi-agent systems planning established with two problem's parameters. Reference proposed the concept of people who have similar departure and destination sharing a vehicle which is between private transport and conventional bus transport by using GPS. Reference takes an agent-based approach to real-time traffic signal control on a 5X5 one-way grid network. Each agent obtains scheduled outflows from direct upstream neighbors. Reference also approach real time simulation on ARCHISIM model. Reference presents agent-base approach used generic negotiation algorithm. Reference models individual behavior of whose."
          ],
          "paper_id": "212d2db0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "A Preliminary Study on Anticipatory Stigmergy for Traffic Management"
     },
     {
          "head": {
               "text": "VI. CONCLUSION",
               "type": "conclusion"
          },
          "paragraphs": [
               "We proposed anticipatory stigmergy models for decentralized traffic congestion control and evaluated the effect of the following types of stigmergies: long-term, short-term, and anticipatory. We conducted several simulations to compare different kinds of stigmergies. Our preliminary results demonstrated that anticipatory stigmergy works well. And it is effective to combine long-and short-term stigmergy, because the total travel time by introducing them is almost equal to the result of anticipatory stigmergy. Furthermore, in order to avoid traffic congestion, we propose and validate the anticipatory stigmergy with an allocation strategy which decides the assignment of drivers who can use the recommended route by anticipatory stigmergy information. Future work will examine more types of stigmergies, larger maps, and dynamic environments including accidents and road construction. All of our analysis was based on the particular network we showed in the previous section. We have to investigate the effect of the shape of different networks.",
               "J. Dallmeyer, R. \"Don't go with the ant flow: Ant-inspired traffic routing in urban environments,\" in In the Proceedings of the 8th Workshop on Agents in Traffic and Transportation (ATT2012), 2012.",
               "T. Morikawa and T. Miwa, \"Preliminary analysis on dynamic route choice behavior using probe-vehicle data,\" Journal of Advanced Transportation, 2006."
          ],
          "paper_id": "212d2db0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "A Preliminary Study on Anticipatory Stigmergy for Traffic Management"
     }
]