[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Ant Colony Optimization (ACO) is a Swarm Intelligence technique which inspired from the foraging behaviour of real ant colonies. The ants deposit pheromone on the ground in order to mark the route for identification of their routes from the nest to food that should be followed by other members of the colony. This ACO exploits an optimization mechanism for solving discrete optimization problems in various engineering domain. From the early nineties, when the first Ant Colony Optimization algorithm was proposed, ACO attracted the attention of increasing numbers of researchers and many successful applications are now available. Moreover, a substantial corpus of theoretical results is becoming available that provides useful guidelines to researchers and practitioners in further applications of ACO. This paper review varies recent research and implementation of ACO, and proposed a modified ACO model which is applied for network routing problem and compared with existing traditional routing algorithms."
          ],
          "paper_id": "21319a80-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "A survey: Ant Colony Optimization based recent research and implementation on several engineering domain"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Swarm Intelligence (SI) is a growing discipline of field of study which contains relatively optimal approach than the traditional approach for problem solving of almost all engineering domain. SI is developed from the imitations which are learned from the social behaviours of insects and animals, for example: ACO, Artificial Honey Bee (ABC), Fire Flies (FF), and Honey Bot. In which the ACO, is the field of ''Ant Algorithm'' studies models which is learned from the behavioural observation of real ant colonies. The ACO models used for the design of novel algorithms for the solution of optimization and distributed control problems. Foraging behaviour, division of labour, brood sorting, and co-operative transport are the several different aspects of the behaviour of ant colonies have inspired from the real ants' and based on these inspiration different kinds of Ant Algorithms are proposed in the recent years. In which, the ACO is inspired by the foraging behaviour of ant colonies, and targets the discrete optimization problems.",
               "The French Entomologist named Pierre-Paul Grasse observed that some species of termites react, which termed as ''significant stimuli''. The term stigmergy is used to describes the particular type of communication in which the ''workers are stimulated by the performance they have achieved''. Now the term, stigmergy is used for indirect, non-symbolic form of communication mediated by the environment. This stigmergy is achieved in the ACO using a chemical substance called pheromone, this chemical substance is deposited on the ground when ants walking to and from a food source. Other ants perceive the presence of this pheromone and tend to follow the routes where pheromone concentration is higher. Through this mechanism, ants are able to identify and transport food to their nest in a remarkably effective and easy way. thoroughly investigated the pheromone laying behaviour of the real ants in the experiment called as ''double bridge experiment''. In this double bridge model, the nest was connected to a food source by two bridges of equal lengths. The author used the term argentine ants for the ants which identifies the route, simply says these ants are the predictor or scout of their colony. In such a setting, ants start to explore the surroundings of the nest and eventually reach the food source. Along their route between food source and nest, argentine ants deposit pheromone. Initially, each ant randomly chooses one of the two bridges. In the later stages due to random fluctuations, one of the two bridges presents a higher concentration of pheromone than the other bridge and therefore attracts more ants. This behaviour increases a further amount of pheromone on that bridge which makes more attractive. Therefore, after some time the whole colony converges toward for use the higher concentrated bridge for their transport.",
               "Goss, Aron, Deneubourg, and considered a variant of the above double bridge experiment in which one bridge is significantly longer than the other; refer the double bridge in the . In this case, the ants choosing by chance the short bridge are the first to reach the nest. Therefore, the short bridge receives more density of pheromones earlier than the long bridge and this fact will increases the probability of shorter bridge for choosing by the further ants to select it. Deneubourg, Aron, Goss, and Pasteels (1990) developed a probability model of the observed behaviour of real ant. In which, assuming that at a given moment of time, m 1 ants have used the first bridge and m 1 ants have used the second one, the probability 'p 1 ' for an ant to choose the first bridge is: h It has an initial state. Although it cannot sense the whole graph, it can collect two kinds of information about the neighbourhood, (1) the weight of each trail linked to nf; and (2) the characteristics of each pheromone deposited on this trail by other ants of the same colony. Moves toward a trail C ij that connects nodes 'i' and 'j' of the graph. Also, it can alter the pheromones of the trail C ij , in an operation called as ''deposit of pheromone levels''. It can sense the pheromone levels of all C ij trails that connects a node i. It can determine a set of ''prohibited'' trails. It presents a pseudo-random behavior enabling the choice among the various possible trails. This choice can be (and usually is) influenced by the level of pheromone. It can move from node i to node j.",
               "where parameters k and h are constant and which is to be fitted to the experimental data. By changing these k and h the impact of shorter path and the impact of less congestion path can achieved.",
               "In the double bridge experiment, the probability of the other bridge is p 2 , which is p 2 = 1 ? p 1 .",
               "The real ant and artificial ants are differed in few assumptions, in the real ant behaviour the pheromone intensity is reduced over time as the pheromone is the chemical substance and so it evaporates over time. However, in the ACO, this can be set to a constant rate, this pheromone evaporation reduces the influence of the pheromones deposited in the early stages of the search, and this property is very useful for adaptive route search in such a situation that frequent path failures.",
               "Ant System, Ant Colony System and Ant Net proposed by ) are the significant implementation of ACO. applied the simple probability rule and applied the state transition rule for the decision model. According to , , the following characteristics of Ant Model is described, redefined the pheromone update policy of ACO, and the term argentine ant is replaced with forward ant. Furthermore, there are some ACO approaches that adopt the privileged pheromone lying in which ants only deposit pheromones during their return trips. Simple ACO (SACO) uses two working ant model called forward ant and backward ant, the probabilistic forward ant generated in the nest and flooded towards food source. The forward ant do not deposit pheromone while moving, this helps in avoiding the formation of loops. Once the forward ant reaches its destination, it switched to the backward ant and copies the route information from the forward ant. Then the backward ant moves to the nest using the information copied from the forward node. Further in this paper, the research and application of ACO is explained, the organization of this paper is presented in the . This paper is the extended version of our previous reviews ) with some more recent advancement in the survey of ACO and the proposed ACO based routing for the wide spread coverage and for helping the researchers community."
          ],
          "paper_id": "21319a80-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "A survey: Ant Colony Optimization based recent research and implementation on several engineering domain"
     },
     {
          "head": {
               "n": "2.",
               "text": "Review on recent research in ACO on various engineering domain",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The Ants exists in an environment represented mathematically as a graph, the ant always occupies a node in a graph which represents a search space. This node is called nf. This paper reviews the recent systematic approach of ACO on various engineering field of domain on various factors like research issues, application and implementations, papers which are published in 2010 and after only considered in this survey."
          ],
          "paper_id": "21319a80-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "A survey: Ant Colony Optimization based recent research and implementation on several engineering domain"
     },
     {
          "head": {
               "n": "2.1.",
               "text": "Traveling salesman problem",
               "type": "relatedwork"
          },
          "paragraphs": [
               "using library of sample instances for the TSP at the internet and the results are compared against some recent related works. The comparison is shows that the HGSAA is effective in terms of results and time.",
               "Let V = {a, . . . , z} be a set of cities, A = {(r, s) : r, s 2 V} be the edge set, and d(r, s) = d(s, r) be a cost measure associated with edge (r, s) 2 A. The TSP is the problem of finding a minimal cost closed tour that visits each city once. In the case cities r 2 V are given by their co-ordinates (x r , y r ) and d(r, s) is the Euclidean distance between r and s, then it is an Euclidean TSP. If d(r, s) -d(s, r) for at least some (r, s) then the TSP becomes an Asymmetric TSP (ATSP). The dynamic TSP (DTSP) is a TSP in which cities can be added or removed at run time. The goal is to find the shortest tour as early as possible after each and every iteration in order to update the link failures. proposed a Beam-ACO for the traveling salesman problem with time windows. This authors deals with the minimization of the travel-cost using a Beam-ACO algorithm, which is a hybrid method combining ACO with beam search. In general, Beam-ACO algorithms heavily rely on accurate and computationally inexpensive bounding information for differentiating between partial solutions. The Beam ACO uses the stochastic sampling as a useful alternative, which is evaluated on seven benchmark sets. The Beam-ACO algorithm is currently a state-ofthe-art technique for the traveling salesman problem with time windows when travel-cost optimization is concerned. , proposed an ACO for the minimum spanning tree problem. The authors presented the first comprehensive rigorous analysis of a simple ACO algorithm for a combinatorial optimization problem which consider the minimum spanning tree (MST) problem and examines the effect of two construction graphs with respect to the runtime behaviour. You, Liu, and Wang, (2010a) proposed Parallel Ant Colony Optimization algorithm (PQACO) based on quantum dynamic mechanism for traveling salesman problem. In PQACO, the author explains the Parallel Evolutionary Algorithms (PEA) can be classified into three different models: Master-slaves PEA, Fine-grained PEA, Coarse-grained PEA and used this model for the travelling salesman problem of quantum computing applications.",
               "Andziulis, Dzemydiene, and Steponavi?ius (2011) proposed a production scheduling problems, belongs to the class of ATSP. The authors proposes Nearest Neighbor (NN) and ACO for solving ATSP, it is tested on a specific real-life problem. The performances of the NN and the ACO techniques were evaluated and compared using two criteria, (1) the minimum value of the objective function achieved and (2) the CPU time. This paper concludes that the ACO algorithm works better than NN if looking at the achieved minimum values of the objective function and in the other hand, the computational time of the ACO algorithm is slightly longer.",
               "For TSP, numerous techniques such as Genetic Algorithms (GA), Evolution Strategies (ES), Simulated Annealing (SA), Ant Colony Optimization (ACO), Particle Swarm Optimizers (PSO) are used to solve in the large-scale optimization problems. In this some of them are time consuming, and the time complexity algorithms could not find the optimal solution. Therefore, for making tradeoff between time consumption and optimal solution combining two or more algorithms in order to improve solutions quality and reduce execution time is a mandatory process. propose new operations and techniques are used to improve the performance of GA and then combined the improved GA with SA to implement a hybrid algorithm (HGSAA) to solve TSP. The authors discussed that the TSP is the most wellknown NP-hard problem and is used as a test bed to check the efficacy of any combinatorial optimization methods. In this work, the hybrid algorithm was tested using known instances from TSPLIB"
          ],
          "paper_id": "21319a80-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "A survey: Ant Colony Optimization based recent research and implementation on several engineering domain"
     },
     {
          "head": {
               "n": "2.2.",
               "text": "Scheduling",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Job Scheduling problems have a vital role in recent years due to the growing consumer demand for variety, reduced product life cycles, changing markets with global competition and rapid development of new technologies. The Job Shop Scheduling Problem (JSSP) is one of the most popular scheduling models existing in practice, which is among the hardest combinatorial optimization problems. The definition of job scheduling problem is as follows: Many approaches, such as, Simulated Annealing (SA), Tabu Search (TS), Genetic Algorithm (GA), Ant Colony Optimization (ACO), Neural Network (NN), Evolutionary Algorithm (EA) and other heuristic approach have been successfully applied to JSSP. For improving the performance of EA, several researches integrated some optimization strategies into the EA. Also, the study of interaction between evolution and learning for solving optimization problems has been attracting much attention. The diversity of these approaches is shown in Xing, Chen, , in which the authors developed a frame work called Knowledge-Based Heuristic Searching Architecture (KBHSA). This framework integrates the knowledge model and the heuristic searching model to search an optimal solution. The performance of this architecture in the instantiation of the Knowledge-Based Ant Colony Optimization (KBACO) is applied to the common benchmark problems. The experimental results of KBACO algorithm outperform the previous approaches when solving the FJSSP.",
               "Chen, Shi, Teng, Lan, and Hu proposed an efficient hybrid algorithm for resource-constrained project scheduling. This hybrid algorithm is known as the ACOSS algorithm which combines Scatter Search (SS) with ACO. Research on ACO has shown that improved performance can be obtained by stronger exploitation of the best solutions found during the search . For improving the performance of ACO algorithms, the author proposes a combined and improved exploitation of the best solutions with an effective mechanism for avoiding early search stagnation. In this paper, as a first step, all ants in the ACO search the solution space and generate activity lists to provide the initial population for the SS. Then, although the SS improves all the ants' solutions, only the best solution (thus far) is used to update the pheromone trails. Finally, ACO searches the solution space again using the new pheromone trails. In other words, the SS uses the previous population constructed by ACO, which subsequently updates the pheromone trails using the best solution from the SS, and searches again. In addition, a local search strategy is employed to improve the quality of solutions generated by ACO, and also as the improvement method in the SS.",
               "Several studies have been devoted to optimize the interdependent and controversy functions of the production scheduling and the maintenance planning. Production scheduling is a static whereas the maintenance scheduling is dynamic, therefore the static can be scheduled in advance however the dynamic scheduling requires more computational efforts. Providing a single model for both the problem is a challenging task and need combinatorial optimization solutions. proposed a Bi-Objective ACO approach to optimize production and maintenance scheduling, in this paper, the author presents an algorithm based on ACO paradigm to solve the joint production and maintenance scheduling problem. This approach is focused to deal with the parallel machine case, to improve the quality of solutions; an algorithm based on Multi-Objective Ant Colony Optimization (MOACO) approach is developed. The goal is to simultaneously determine the best assignment of production tasks to machines as well as preventive maintenance periods of the production system, satisfying at best both objectives of production and maintenance.",
               "Chen, Zhang, Chung, Huang, and Liu applied ACO in the cash flow monitoring and to control the project cost. The objective of the cash flow problem is to reduce the amount of cash being received and spent during a pre-defined time period. Without the positive cash flows, the basic obligations such as payments to suppliers and payrolls are become series issues. In project level, even a high-profit project may turn out to be a failure if cash short-fall suddenly occurs; therefore the cash flow management in the project level has attracted a considerable amount of research effort in recent years. A promising progress is to integrate cash flow management with the resource-constrained project-scheduling problem (RCPSP). The authors proposed a multimode RCPSP with discounted cash flows using ACO. The application of ACO requires setting up a construction graph and designing the pheromones and heuristic information. Based on the construction graph, the serial schedule generation scheme is applied for artificial ants to build solutions. In the process of this algorithm, each ant maintains a schedule generator and builds its solution following the rules of ACS using pheromones and heuristic information. For further studies, the comprehensive survey of Herroelen, and Brucker, Drexl, Mohring, Neumann and Pesch (1999) are better choices.",
               "The maintenance of green areas is important in most of the places like schools, parks, and recreational areas, this green area maintenance plays a heavy burden on both manpower and budget concern. proposed a model to search for the minimum gardener manpower requirements and a near-optimal maintenance schedule for the green areas. The authors are implemented the proposed model using a decision support system called the Garden-Ant, in this proposal the authors grouped the ants into teams to represent gardeners and considered the route of an ant team for the schedule solution. In this paper, the proposed Garden Ant model provides an appropriate maintenance plan, including manpower estimation and an all-inclusive maintenance schedule and this proposal helps for overcoming the complicated calculations in the maintenance planning of green areas can be accomplished in an easy and efficient manner.",
               "In geographic information systems, the spatial information takes different forms in different applications which ranging from accurate coordinates in to the qualitative abstractions. Therefore, the existing spatial information processing techniques will tend to be any one type of spatial information, and this is not extended with the heterogeneity of spatial information when the values are arises in practice, also the approximate boundaries of the spatial regions are to be constructed. In order to solve the spatial information processing, Schockaert, Smart, and Twaroch (2011) proposed a ACO model for heterogeneous spatial information processing, in this ACO model, genetic algorithm are used to find an optimal ordering of variables and spatial constraints. Through hybridization with Ant Colony Optimization, this ACO algorithm is able to learn geometric constraints that are implicit in the available information. For example, the pheromone maps are generated and used to encode for the parts of the plane which likely to be contained/ excluded from a certain region. Therefore, this technique with the popular technique of generating kernel density surfaces from possibly imperfect point data overcomes the existing techniques for processing imperfect information."
          ],
          "paper_id": "21319a80-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "A survey: Ant Colony Optimization based recent research and implementation on several engineering domain"
     },
     {
          "head": {
               "n": "2.3.",
               "text": "Structural and concrete engineering",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The design of bridge piers is crucial for the design of prestressed concrete viaducts. The piers make up between 20% and 50% of the total cost of the viaduct depending on pier heights and foundation conditions. Rectangular hollow cross-sections as described in the present paper are most frequently used. Current designs of such reinforced concrete (RC) structures are highly conditioned by the experience of structural engineers. Design procedures usually adopt cross-section dimensions and material grades based on commonly sanctioned practice. Once the geometry and materials of the structure are specified, the reinforcement of the pier is tentatively defined according to experience. The firstorder stress resultants are analyzed and second-order (buckling) stress resultants are then estimated according to simplified and conservative formulae or following a more general method that accounts for second-order deformations and includes the non-linear stiffness of the column. Tentative passive reinforcement must then satisfy the limit states prescribed by concrete codes. Should the dimensions, the material grades or the reinforcement be insufficient, the structure is redefined on a trial-and-error basis. This process leads to safe designs, but the cost of the RC pier is, consequently, highly dependent upon the experience of the structural designer. In contrast to designs based on experience, artificial intelligence has been applied to a variety of fields including the solution of constrained problems. The design of RC structures is a problem of selecting design variables as subject to structural constraints for which artificial intelligence is aptly suited. Exact methods and heuristic methods are the two main approaches to structural optimization. Exact methods are usually based on the calculation of optimal solutions following iterative techniques of linear programming of the expressions of the objective function and the structural constraints . These methods are computationally quite efficient when the number of variables is limited since they require a small number of iterations. However, they must solve the problem of linear conditioned optimization in each iteration of the analysis, which is computationally laborious when there are a large number of variables. In addition, exact methods require explicit expressions for the constraints which are not available in the present case of a non-linear buckling column. The second approach involves the heuristic methods based on artificial intelligence procedures. These methods include a wide range of artificial intelligence search algorithms, such as genetic algorithms, simulated annealing, threshold accepting, tabu search, ant colonies. These methods involve simple algorithms, but they also require a considerable computational effort, since they include a large number of iterations in which the objective function is evaluated and the structural constraints are checked.",
               "Martinez, Gonzlez-Vidosa, Hospitaler, Yepes (2010) proposes the ACO model for economic optimization of reinforced concrete (RC) bridge piers with hollow rectangular sections. The author describes the efficiency of their proposal in three heuristic algorithms which are variants of the ACO algorithm, the Genetic Algorithm (GA) and the Threshold Acceptance (TA) algorithm. The GA and TA are used for comparison with the new ACO algorithms, the calibration of this ACO algorithm is recommended for a 250-member ant population and 100 stages which saved the 33% of project cost when compared with the existing design.",
               "Biofilm processes are increasingly used for wastewater purification as they are environmental friendly and less energy intensive. Biofilms are agglomerations of microorganisms or bacteria, which due to their metabolic activity convert the contaminant components of the wastewaters into harmless products. The behaviour of a biofilm is determined by a variety of biological, chemical and physical processes internal to the film as well as interactions between the biofilm and its environment. Rama Rao, Srinivasan, and ",
               "Multi-target tracking (MTT) is a classic and an intractable problem which applied for sonar based tracking of submarines, radar based tracking of aircrafts, video based tracking of people for surveillance or security purposes. The issues of the MTT are the number of targets, the time that some target appears or dies, and the association of measurements with related targets, data association problems including measurements-to-measurements, measurements-to-tracks, and tracks-to-tracks. For MTT, various approaches are already applied, namely, the nearest neighbor (NN) method, the strongest neighbor method, the joint probabilistic data association (JPDA) method, the multiple hypothesis tracking (MHT) method. Xu, Chen, Zhu, and Wang (2011) applied ACO model for MTT, and the result shown are optimal than the above said methods.",
               "Ant System (AS) algorithm is applied for intelligent initialization of cluster centroids with adaptivity. proposes a novel histogram thresholding -fuzzy C-means hybrid (HTFCM) approach that could find different application in pattern recognition as well as in computer vision, particularly in colour image segmentation. The results shows that the execution time and pattern matches are optimal than AFHA.",
               "Wavelet-based transformation techniques are widely used for performing image interpolation in the digital image processing. In this wavelet transform, a common assumption in the wavelet based image interpolation approach is that the input image is treated as the low frequency sub-bands of an unknown wavelet transformed high-resolution image. Then the unknown high resolution image can be reconstructed by estimating the wavelet coefficients of the high frequency sub bands, followed by applying the inverse wavelet transform. This model neglects the correlations among the sign information of the wavelet coefficients, since the Gaussian distribution is symmetrical around the zero. Inaccurate estimation of the sign of wavelet coefficients could result in poor performance in the reconstructed image. To tackle this challenge, Tian, Ma, and Yu (2011) propose a Three-Component Exponential Mixture (TCEM) model, by formulating the probability distribution of individual wavelet coefficient using three components: (i) a Gaussian component, (ii) a positive exponential component, and (iii) a negative exponential component. To address the parameter estimation challenge of the proposed TCEM model, the Ant Colony Optimization (ACO) technique is exploited to classify the wavelet coefficients into one of three components of the proposed TCEM model for estimating their parameters."
          ],
          "paper_id": "21319a80-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "A survey: Ant Colony Optimization based recent research and implementation on several engineering domain"
     },
     {
          "head": {
               "n": "2.4.",
               "text": "Digital Image Processing",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Image segmentation is used to identify a spatially connected pixels or regions of a digital image. The objective of the image segmentation is to partition an input image into multiple segments so that objects and boundaries could be located and the image could become more meaningful and easier to analyze. In image processing and computer vision, the segmentation process is considered as one of the most important problems. Although many segmentation techniques is appeared in the literature, which can be classified into image-domain based, physics based and feature-space based techniques. These segmentation techniques are used extensively but each has its own advantages and limitations. Image-domain based techniques utilize both colour features and spatial relationship among colour in its homogeneity evaluation to perform segmentation. The Fuzzy C-means (FCM) algorithm has been used extensively to improve the compactness of the regions due to its clustering validity and simplicity of implementation. It is a pixels clustering process of dividing pixels into clusters so that pixels in the same cluster are as similar as possible and those in different clusters are as dissimilar as possible. This accords with segmentation application since different regions should be visually as different as possible. Recently, some feature-based segmentation techniques have employed the concept of ant colony algorithm (ACA) to carryout image segmentation. Recent researches concentrated on applying threshold with intelligent algorithms like ACO and fuzzy measures so that more adaptive and accurate decisions could be made to achieve better results. Yu, Au, Zou, Yu, and Tian (2010) proposes Ant Colony-Fuzzy C-means Hybrid Algorithm (AFHA) for adaptively clusters the image pixels which is viewed as three dimensional data pieces in the RGB colour space. The Economic dispatch(ED) problem is one of the mathematical optimization issues in the power system operation. With an increasing concern over the environmental pollution caused by thermal power plants, environmental/economic dispatch (EED) problem has drawn much more attention for a good dispatch scheme from it would not only result in great economical benefit, however it reduce the pollutants emission. Different techniques have been reported in the literature pertaining to EED problem, including conventional approaches such as weighted mini-max method, direct analytical solution method, linear programming and 1-constraint method, and artificial intelligence technology such as genetic algorithm, particle swarm optimization, fuzzy set theory and evolutionary programming. In principle, these approaches usually employed to deal with EED problems which can be classified into two categories, namely, Lagrange multiplier methods and a multi-objective stochastic search technique. Many researchers have performed studies in this field, a trade-off relations between cost and emission is the main objective of this problem. proposed a multi-objective chaotic ant swarm optimization for EED. This paper developed a multi-objective chaotic ant swarm optimization (MOCASO) method for solving the EED problems of thermal generators in power systems considering both economic and environmental issues. In MOCASO method, Pareto-dominance is employed to handle multi-objective problems, and fuzzifying, fitness sharing and turbulence factor perturbing techniques are also embedded. The proposed method was successfully employed to solve the EED problems in three test systems considering some constraints, such as power balance constraints and generation limits constraints. The author produced numerical simulation results which indicated that the MOCASO method is feasible and effective for solving EED problem for power systems.",
               "Pothiya, Ngamroo, and proposed an Ant colony optimisation for economic dispatch problem with non-smooth cost functions. This paper presents a novel and efficient optimisation approach based on the ACO for solving the economic dispatch (ED) problem with non-smooth cost functions. In order to improve the performance of ACO algorithm, three additional techniques, i.e. priority list, variable reduction, and zoom feature are presented. To show its efficiency and effectiveness, the proposed ACO is applied to two types of ED problems with non-smooth cost functions. first, the ED problem with valve-point loading effects consists of 13 and 40 generating units. Second, the ED problem considering the multiple fuels consists of 10 units. Additionally, the results of the proposed ACO are compared with those of the conventional heuristic approaches. The experimental results of this paper show that the proposed ACO approach is comparatively capable of obtaining higher quality solution and faster computational time.",
               "Reactive power management is essential to transfer real energy and support power system security. Developing an accurate and feasible method for reactive power pricing is important in the electricity market. In conventional optimal power flow models the production cost of reactive power was ignored. proposed an Application of the ant colony search algorithm to reactive power pricing in an open electricity market. In this paper, the production cost of reactive power and investment cost of capacitor banks were included into the objective function of the OPF problem. Then, using ant colony search algorithm, the optimal problem was solved. Marginal price theory was used for calculation of the cost of active and reactive power at each bus in competitive electric markets. The application of the proposed method on IEEE 14-bus system is confirms its validity and effectiveness. This ACO algorithm has the following features: (1) The points in feasible region are regard as ''ants''. After some iteration, the ants will centralize at the optimum points which could be one or more points. There are two choices for an ant in the each iteration: moving to other ants' point or searching in neighborhood. The iteration would be guided by changing the distribution of intensity of pheromone in feasible region. 3) Sequential quadratic programming (SQP) is used as neighborhood-searching algorithm to improve the precision of convergence. The roulette wheel selection and disturbance are used to prevent the sub-optimization in ACO. The result of this paper shows that the effects of various factors on reactive power price on several case studies.",
               "Fuel cell power plants (FCPPs) have been taken into a great deal of consideration in recent years. The continuing growth of the power demand together with environmental constraints is increasing interest to use FCPPs in power system. Since FCPPs are usually connected to distribution network, the effect of FCPPs on distribution network is more than other sections of power system. One of the most important issues in distribution networks is optimal operation management (OOM) which can be affected by proposed a practical algorithm for optimal operation management of distribution network including fuel cell power plants. In this paper, the author proposes a new approach for optimal operation management of distribution networks including FCCPs. In the article, they consider the total electrical energy losses, the total electrical energy cost and the total emission as the objective functions which should be minimized. Whereas the optimal operation in distribution networks has a nonlinear mixed integer optimization problem, the optimal solution could be obtained through an evolutionary method. The author uses a new evolutionary algorithm based on Fuzzy Adaptive Particle Swarm Optimization (FAPSO) to solve the optimal operation problem and compared this method with Genetic Algorithm (GA), Particle Swarm Optimization (PSO), Differential Evolution (DE), ACO and Tabu Search (TS) over two distribution test feeders."
          ],
          "paper_id": "21319a80-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "A survey: Ant Colony Optimization based recent research and implementation on several engineering domain"
     },
     {
          "head": {
               "n": "2.6.",
               "text": "Clustering",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Clustering, also called set partitioning problem, is a basic and widely applied methodology various application which includes statistics; mathematical programming such as location selecting, graph theory, scheduling and assignment problems; and in computer science which includes pattern recognition, network partitioning, routing, learning theory, image processing and computer graphics. Clustering is mainly to group all objects into several mutually exclusive clusters in order to achieve the maximum or minimum of an objective function. Data clustering, which is an NP-complete problem of finding groups in heterogeneous data by minimizing some measure of dissimilarity, is one of the fundamental tools in data mining. There are many methods applied in clustering analysis, like hierarchical clustering, partition-based clustering, density-based clustering, and artificial intelligencebased clustering. K-means is used as a popular clustering method due to its simplicity and high speed in clustering large datasets. However, K-means has two shortcomings: (1) dependency on the initial state and convergence to local optima and (2) global solutions of large problems cannot found with reasonable amount of computation effort. In order to overcome local optima problem lots of studies have been done in clustering, many methods for local optimization are based on the notion of a direction of a local descent at a given point. proposed a Hybrid Global Optimization (HGOP) based on a dynamical systems approach algorithm. In this paper, the author proposed the application of hybrid global optimization algorithm based on a dynamical systems approach and compared the propose HGOP with other algorithms in clustering, such as GAK, SA, TS, and ACO, by implementing them on several simulation and real datasets.",
               "Data mining is a field of study which lies under the knowledge engineering and knowledge discovery. Data mining is extracting useful knowledge from the large set of secondary data. The data mining techniques have been successfully applied in many different domains, such as breast-cancer detection in the biomedical sector, market basket analysis in the retail sector, prediction of future trends and credit scoring in the financial sector. Verbeke, Martens, Mues, and Baesens (2011) focuses on the use of data mining to predict customer churn. The Customer churn prediction models will aim to detect the customers with a high tendency in the market place. An accurate segmentation of the customer base allows a company to target the customers that are most likely to churn in a retention marketing campaign, which improves the efficient use of the limited resources for such a campaign. The author represents a fine and structured review of the churn prediction as a table. The author proposes the hybrid AntMiner+ and ALBA model for customer analysis and conclude the result is outperforms than existing methods."
          ],
          "paper_id": "21319a80-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "A survey: Ant Colony Optimization based recent research and implementation on several engineering domain"
     },
     {
          "head": {
               "n": "2.7.",
               "text": "Routing Algorithm",
               "type": "relatedwork"
          },
          "paragraphs": [
               "In the network routing, Ant-Net Routing using Ant Colony Optimization (ACO) technique provide a better result than others due to its real time computation and less control overhead. comparing all routing algorithms with ACO, concludes that ants are relatively small, can be piggybacked in data packets and more frequent transmission of ants may be possible in order to provide updates of routing information for solving link failures. Hence, using ACO for routing in dynamic network seems to be appropriate. Routing in ACO is achieved by transmitting ants rather than routing tables or by flooding LSPs. Even though it is noted that the size of an ant may vary in different systems/implementations, depending on their functions and applications, in general, the size of ants is relatively small, in the order of 6 bytes. proposed a ACO algorithm which aims at minimizing complexity in the nodes at the expenses of the optimality of the solution, it results to be particularly suitable in environments where fast communication establishment and minimum signaling overhead are requested. However, this proposal is optimal for a less number of nodes in the cluster and also not suitable for adhoc network. A fault tolerant routing protocol ) using greedy ACO routing mechanism may tend to choose single path. This routing achieves high packet delivery ratio and throughput whereas the packet loss on the link is not taken into consideration. The proposed RACO is restructured for considering the Packet loss of the link using additional traffic model and availability model for traffic free routing as well as avoiding frequent link failure nodes.",
               "Amilkar, analyzed the performance of ACO on various case studies in the TSP using a two stage approach and concluded the performance of ACO is optimal than existing for TSP. The two-stage approach will converge quickly for lesser nodes whereas it requires more convergence time, if number of nodes increases. All the above ACO based routing algorithms identify and apply all possible 'n' no of paths, which degrade the performance of multipath routing algorithm ( . The author concluded that the number of possible routes increases, the relative performance of multi-path routing also increases till 'k' number of paths and when it exceeds the limit, the performance will be degraded. Therefore to choose only 'k' path is an important consideration for implementing multi path routing and the optimal value of 'k', may change in practice. In order to avoid the traffic merging, and to allow only 'k' number of path, RLA algorithm along with ACO is proposed.",
               "Wireless sensor networks (WSNs) consist of a large number of autonomous and resource constrained sensor nodes which are equipped with sensing devices, wireless communication interfaces, limited processing and energy resources. The WSNs are used for distributed and cooperative sensing of physical phenomena and events of interests. The WSN is referred as a robotic network and/or as a sensor-actor network. The WSNs can be employed in a wide spectrum of applications in both civilian and military scenarios, which includes the environmental monitoring, surveillance for safety and security, automated health care, intelligent building control, traffic control, object tracking. The routing in WSN are still is an issue, proposes the ACO framework with the other SI technique ABC, in which, five main modules with additional sub modules are implemented. The main modules are: (i) mobile agents generation and management, (ii) routing information database (RID), (iii) agent structure, (iv) agent communications, and (v) packet forwarding. The main modules and sub-modules implements the architecture and the operations at the node router, the author concludes the hybrid ACO and ABC routing model is optimal in the WSN."
          ],
          "paper_id": "21319a80-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "A survey: Ant Colony Optimization based recent research and implementation on several engineering domain"
     },
     {
          "head": {
               "n": "3.",
               "text": "ACO implementation and performance evaluation",
               "type": "experiment"
          },
          "paragraphs": [
               "In this section, ACO is proposed for network routing, the ACO is optimally adapted for both wired and wireless routing as well as single path and multipath routing, so it is called as Single path and Multi path ACO (SMACO). Every node in the network can function as a source node, destination node, and/or intermediate node. be constructed based on the state transition rule and pheromone update policy. The following random proportional rule is applied as State transition rule: for destination D, at node i, the probability of selecting a neighbor j is prob?D; i; j? ? Fun?TD; i; j; g? if ; j 2 N; ?2? where TD is the pheromone value corresponding to neighbor j at node i and 0 < TD < 1 is the local heuristic value of the link (i, j) / or node j. 0 < g < 1. is the value can represent neighbor's information (i.e., neighbors queue delay, battery's remaining energy, processing power, link's signal-to-noise ratio, link's bandwidth, bit-error rate, etc.). Fun (TD, i, j, g) is a function in TD and g (this function value is high when TD and g are high). N is the set of all feasible neighbor nodes defined by the ant's information and the routing constraints (i.e., the guarantee of loop free). Assuming that at a given moment N1-N8, N2-N7, N3-N6, N8-N3, N7-N1 N1-N8, N2-N7, N3-N6, N8-N3, N7-N1, N1-N6, N2-N8, N3-N7, N8-N1, N7-N2 Type 2 20 5 10 N1-N20, N2-N19, N3-N18 N1-N20, N2-N19, N3-N18, N4-N17, N5-N16 N1-N20, N2-N19, N3-N18, N4-N17, N5-N16, N6-N15, N7-N14, N8-N13, N9-N12, N10-N11",
               "Type 3 50 10 30 N1-N50, N2-N49, N3-N48 N1-N50, N2-N49, N3-N48, N4-N47, N5-N46 N1-N50, N2-N49, N3-N48, N4-N47, N5-N46, N6-N45, N7-N44, N8-N43, N9-N42, N10-N41 Type 4 75 15 45 N1-N75, N2-N74, N3-N73 N1-N75, N2-N74, N3-N73, N4-N72, N5-N71 N1-N75, N2-N74, N3-N73, N4-N72, N5-N71, N6-N70, N7-N69, N8-N68, N9-N67, N10-N66",
               "Type 5 100 20 80 N1-N100, N2-N99, N3-N98 N1-N100, N2-N99, N3-N98, N4-N97, N5-N96 N1-N100, N2-N99, N3-N98, N4-N97, N5-N96, N6-N95, N7-N94, N8-N93, N9-N92, N10-N91",
               "Type 6 200 40 160 N1-N200, N2-N199, N3-N198",
               "N1-N200, N2-N199, N3-N198, N4-N197, N5-N196",
               "N1-N200, N2-N199, N3-N198, N4-N197, N5-N196, N6-N195, N7-N194, N8-N193, N9-N192, N10-N191 in time m1 ants have used the first bridge and m2 the second one, the probability p1 for an ant to choose the first bridge is: ",
               "where T(r, s) is the pheromone deposited in the path between 'r' and 's', g(r, s) is the corresponding heuristic value which is the inverse of length of the particular path. b is a parameter which determines the relative importance of pheromone versus distance (b > 0). The pheromone update policy is as follows:",
               "T?r; s? ?1 ? a? T?r; s? ? X ?1 ? a? T?r; s?;",
               "where, L is the length of tour, a is the pheromone decay parameter which is lies between '0 and 1'. The pheromone values of each entry in the table can be initialized to equal values, thus providing nonbiased search for the best path. If some information about the best path is available, the pheromone values of the entry can be set to closer values to the optimum, thus, speed up the algorithm. The detailed proposed algorithm is given below:",
               "End-for (4.1) //For Single Path Routing For k := 1 to m do Sort the routing table based on pheromone values { Computes the Response Complexity (C r ) of particular path where rtt s -standard RTT (Round Trip Time), rtt a -actual RTT Delete the path having negative response complexity Choose the best path based on availability and priority } End-for (4.2) //For Multi Path Routing //In this compute Compound Probability k := 1 to m do Sort the routing table based on pheromone values { Computes the Response Complexity (C r ) of particular path The proposed ACO is implemented in Network Simulator 2 (NS2). The performance is tested in a variety of design and topology of network which include wired, wireless; in variety of network design which based on number of nodes; various load condition of network which is defined as normal load, medium load and heavy load; and using various transport protocol such TCP and UDP. show the design of type 1 wired network, the   shows the comparison of packet loss in proposed and existing routing protocol. shows the comparison of routing packet size of each routing protocol. In which the ACO has lesser packet size which reduces the routing overhead and avoids traffic due to control packet. The packet size of SMACO is slight higher than ACO due to two more two structures are introduced in the SMACO which occupy 8bits each. Therefore the implementation not requires any control overhead. The higher the routing packet size may increase the routing overhead and involves unnecessary traffic due to control packets, whereas the objectives of this thesis are to obtain reduced packet losses and response time, which is satisfied using SMACO. "
          ],
          "paper_id": "21319a80-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "A survey: Ant Colony Optimization based recent research and implementation on several engineering domain"
     },
     {
          "head": {
               "n": "5.",
               "text": "Conclusion",
               "type": "conclusion"
          },
          "paragraphs": [
               "ACO is implemented in always all engineering applications like continuous casting of steel, data reconciliation and parameter estimation in dynamic systems, gaming theory, In-Core Fuel Management Optimization in Nuclear Engineering, target tracking problem in signal processing, design of automatic material handling devices, Mathematical and kinetic modeling of bio-film reactor, optimization of a rail vehicle floor sandwich panel, software design, Vehicle routing design, Quadratic Assignation problem, mutation problem. The various level of experimental in the computer network using ACO as routing protocol shows ) that the ACO outperforms than the existing research methodologies. A minute redefinition, updation and or modification of the procedural steps of ACO also will raise the performance dramatically. The ACO remains open many research issues and the ACO are optimally suit many engineering domains."
          ],
          "paper_id": "21319a80-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "A survey: Ant Colony Optimization based recent research and implementation on several engineering domain"
     }
]