[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "JSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org."
          ],
          "paper_id": "213d0c30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "A Theory of Competition Among Pressure Groups for Political Influence"
     },
     {
          "head": {
               "text": "II. POLITICAL INFLUENCE FUNCTIONS",
               "type": "abstract"
          },
          "paragraphs": [
               "The basic assumption of the analysis is that taxes, sub regulations, and other political instruments are used to r welfare of more influential pressure groups. Groups compete within the context of rules that translate expenditures on political pressure into political influence and access to political resources. These rules may be embodied in political constitutions and other political procedures, including perhaps \"rules\" about the use of force to seize power.",
               "To simplify the analysis without any significant loss in generality, I assume that the utility of each person is measured by his real full income, and that full incomes can be added to measure aggregate income or aggregate output.3 Full income is a better measure of utility than market income because it depends on the time spent at leisure and other nonmarket activities. Envy and altruism are excluded by the assumption that full income depends only on own commodities.",
               "Assume initially only two homogeneous groups in the society, s and t. Since identical persons must have the same income, Zs and -i can measure the full income of each member of s and t prior to government redistribution, and Z, and Zt can measure their incomes after redistribution, so that (1) Rs = Z8-Z? and Rt = Z?-Zt are the redistributions to each s and away from each t.",
               "All political activities that raise the income of a group will be considered a subsidy to that group, and all activities that lower incomes will be considered a tax. The amount raised by all taxes on t can be written as",
               "where nt is the number of m each member. The function F corporates the deadweight cos of taxes on hours worked, investments, and other taxpayer choices. Since these costs tend to increase as the rate of taxation increases (see Harberger for a good discussion), (3) F(Rt) ?Rt, F' < 1, and F\" ? O.",
               "F(Rt) = Rt, F' = 1, and F\" = 0 when taxes do not disto that is, when \"lump sum\" taxes are used.",
               "The subsidy to each member of s is determined from",
               "where ns is the number of members and R member. G is the cost of providing Rs and incorporates the deadweight costs from the distorting effects of subsidies on hours worked, investments, and other choices by recipients. The properties of G are (5) G(Rs) >RS, G'> 1, and G\"?' O.",
               "G(Rs) = Rs, G' = 1, and G\" = 0 when subsidies do not distort behavior; that is, when \"lump sum\" grants are used. Equation gives the budget equation between the amount paid in taxes and the amount received as subsidies, a relation that has a major effect on the competition for political influence. Note that the budget equation doe not state that subsidies (nsRs) equal taxes (ntRt) because deadweigh costs reduce subsidies below taxes. Very different methods have been used to choose legislatures and government officials, to limit the powers of heads of state, and to provide for political succession. All political systems, however, including dictatorial as well as democratic systems, have been subject to pressures from special interest groups that try to use influence to enhance their welfare. I shall not try to model how different political systems translate the activities of pressure groups into political influence. Instead, I deal with the end product of such a translation, called \"influence functions,\" that relate subsidies and taxes to the pressures exerted by all groups and to other variables. Since only weak restrictions are imposed on these functions, the basic implications of the analysis should be applicable to widely different political systems, including nondemocratic systems, although, of course, the influence of particular groups is often sensitive to the characteristics of a political system. Even though and others4 have identified selfish pressure groups with democratic capitalism, I believe that pressure groups of workers, managers, intellectuals, etc. have an incentive to be more rather than less active under democratic and other forms of socialism because a larger fraction of resources is controlled by the State under socialism than under capitalism.",
               "The Similarly, the amount available to subsidize s is determined by an influence function that also depends on political pressures and other variables:",
               "(7) nsG(Rs) = Is(psptx).",
               "The political budget equation in (4) clearly implies that these influence functions cannot be independent because increased influence of s that raises its subsidy must be financed by increased taxes on t, and hence must lower the influence of t. That is, Equality between the amount raised in taxes and the amount spent on subsidies implies that aggregate influence is zero: increased influence of some groups decreases the influence of others by equal amounts. Therefore, the political game modeled in this paper is zero-sum in influence and negative-sum in taxes and subsidies because of deadweight costs. Differentiation of equation  Therefore, if, say, increased pressure by t raises its influence (and thereby lowers its taxes), increased pressure by t would lower the influence (and subsidy) of s:",
               "Moreover, since Its = I't, if an increase in pt raises the marginal product of ps (if It > 0), then an increase in ps would lower the absolute value of the marginal effect of pt on Is (for then Is < 0 and Is > 0). Note also that if some characteristics of a group, such as the occupation or ages of members, raise its influence, these characteristics would lower the influence of the other group."
          ],
          "paper_id": "213d0c30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "A Theory of Competition Among Pressure Groups for Political Influence"
     },
     {
          "head": {
               "text": "III. COMPETITION AMONG PRESSURE GROUPS",
               "type": "abstract"
          },
          "paragraphs": [
               "If Rt > 0 and Rs > 0, s would be considered the winner, an loser from the political \"game\" because s is subsidized and t is taxed.",
               "The identity of winners and losers and the amounts won and lost are rigidly determined by the nature of a political syst are also affected by the political activities of each group. Losers need not passively accept their fate, but can trim their losses and the gains to winners by lobbying, threats, disobedience, migration, and other kinds of political pressure to raise their influence. Groups compete for political influence by spending time, energy, and money on the production of political pressure. To model this competition, I assume that each group has a function relating its production of pressure to various inputs: The sign of the first term is determined by whether there are increasing or decreasing returns to the scale of expenditures. The second term tends to be negative because of free riding: each person wants to shirk his obligations and impose the cost of producing pressure on other members (see the pioneering study by Olson ). Free riding can be partially controlled by policing behavior, punishing deviant members with ostracism, intimidation, and fines, and by implementing rules for sharing benefits and costs that reduce the incentive to shirk (see, e.g., , and Tideman and",
               "Tullock ). In essence, free riding raises the cost of producing pressure. Therefore, total expenditures on the production of pressure equals the sum of expenditures on direct political activity and on the control of free riding.",
               "The full incomes of each member of s and t net of expenditures on political activities, including expenditures to control free riding, are defined by (13) Zs = ZO + Rs-as, and Zt = Z?-Rt-at. and these conditions take account of all expenditures to control free riding. A group would be politically active only if additional pressure raises its influence. The inequalities in (10) imply that pressure by each group reduces the influence of the other group, and thereby partially or fully offsets the effect of pressure by the other group. The influence and pressure production functions permit a straightforward translation of the optimality conditions for s and t given by equation into political market equilibrium conditions determining expenditures and pressures by both groups. To simplify the analysis, I assume that each group acts as if the pressure exerted by the other group is unaffected by its behavior.5 Then (15) dRs 1 afs aps m8 = Is m 1 da8 nsG' 6pP bms bas G' and using equation These conditions can be solved for equilibrium values of at, and ps and Pt. They can also be used to derive the effect o optimal pressure by one group of a given change in the pres the other group (see the Mathematical Appendix). Rising dead losses from taxes and subsidies (F\" < 0 and G\" > 0) cause the op pressure by one group to increase when pressure by the other is (see the discussion in the next section). \"Complementarity\" in influence function of s between s and t (Ist > 0) also increas optimal pressure by s when pressure by t is raised because ad pressure by s would then be more effective. However, such \" mentarity\" reduces the optimal pressure by t when pressure b raised because the negative effect on Is of additional pressure reduced.",
               "Comparative static properties of the political equilibrium will be derived graphically, with rigorous proofs given in the Mathematical",
               "Appendix. assumes that the reaction curves of both s and t 5. Cournot-Nash models of competition among pressure groups are also considered by , briefly by , and by Findlay and Wellisz .",
               "6. Second-order conditions insuring that (15) provides an optimal value of a, and (16) an optimal value of at are considered in the Mathematical Appendix. Sufficient conditions are I, < 0, I't > 0, P'm and Ptm < 0, G\" > 0, and F\" < 0. This straightforward result applies equally to improved efficiency and will be stated as PROPOSITION 1. A group that becomes more efficient at producing political pressure would be able to reduce its taxes or raise its subsidy.",
               "If an increase in the efficiency of producing pressure of both s and t shifted the reaction curve of s upward and that of t to the right, the equilibrium pressures of both groups would increase (say from eo to e2). The influence of either group, however, and hence taxes and subsidies, might not change much, if at all, because the increased pressure by t would offset the increased pressure by s. Recall that the political budget equation implies that both groups cannot increase their influence because aggregate influence is zero (see equation ). This illustrates an important corollary to Proposition 1 that has been neglected in discussions of pressure groups.",
               "COROLLARY. The political effectiveness of a group is mainly determined not by its absolute efficiency-e.g., its absolute skill at of an increase in the size of a group on its influence depends on the effects on efficiency, subsidies, and deadweight costs. To determine this, it is necessary to consider how deadweight costs affect pressure, taxes, and subsidies."
          ],
          "paper_id": "213d0c30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "A Theory of Competition Among Pressure Groups for Political Influence"
     },
     {
          "head": {
               "text": "IV. DEADWEIGHT COSTS AND REDISTRIBUTION",
               "type": "abstract"
          },
          "paragraphs": [
               "An increase in the marginal deadweight cost of taxes (a red in F' in equation ) raises the pressure exerted by taxpayers essentially because a reduction in taxes then has a smaller (adverse) effect on the revenue from taxation. On the other hand, an increase in the marginal deadweight cost of subsidies (an increase in G' in equation ) reduces the pressure exerted by recipients because a given increase in the subsidy then requires a larger increase in tax revenue. Hence an exogenous increase in the deadweight cost of both taxes and subsidies would shift the reaction curves of t and s to the right and downward, respectively, and change the equilibrium position from eo to e3 in . Either the equilibrium pressure of t must increase, or the pressure of s must decrease, or both. However, the following proposition holds, regardless of the exact effects on pres- The cost of many programs, such as agricultural price supports or oil entitlements, has often seemed distressingly large. Yet this proposition implies that politically successful programs are \"cheap\" relative to the millions of programs that are too costly to muster enough political support,9 where \"cheap\" and \"expensive\" refer to marginal deadweight costs, not to the size of taxes and subsidies.",
               "Since deadweight costs encourage pressure by taxpayers and discourage pressure by recipients, taxpayers have an \"intrinsic\" advantage in influencing political outcomes. For, combine equations and  If s and t were the same size (ns = nt) equally efficient at produci pressure (ps = pt when ms = mt and ns = nt), and equally importa in the influence function (Is = -Is whenPs = Pt), then (17) would imply that (18) dRs/das -G' when ps = Pt.",
               "The intrinsic advantage of taxpayers is measured by the righthand side of and increases as deadweight costs of taxes and subsidies increase-as F' falls and G' rises. There is no advantage with lump sum taxes and subsidies because then F' = G' = 1. Subsidized groups can overcome their intrinsic disadvantage with an optimal size, efficiency at producing pressure, success at converting pressure into influence, or with characteristics that raise their influence. Indeed, the presumption must be that heavily subsidized groups, such as sugar growers and dairy farmers in the United States, not only can redistribute with relatively low deadweight cost, but also can overcome their intrinsic disadvantage with political appeal and efficiency.",
               "Proposition 2 implies some \"tyranny of the status quo\" because the political sector would not interfere much with the private distribution of income even when groups benefiting from interference are better organized politically than groups harmed, as long as they are not much better organized. Consequently, the importance of the private status quo does not imply that politicians are lackeys of the rich, and is even consistent with the poor being more effective politically.",
               "This tyranny of the status quo is not the same, however, as laissez faire because the political sector would protect the status quo against many shocks and changes in the private sector. Suppose that an industry (autos) pays much higher wages than are available to its employees elsewhere (because they have invested in industry-specific capital) until unexpected competition from imports (Japan) reduces equilibrium wages in the industry below those available elsewhere.",
               "If government assistance were not forthcoming, workers would leave the industry and suffer a large reduction in earnings.",
               "Tariffs or quotas on these imports might raise earnings by much more than the loss in efficiency. For example, if earnings initially were 50 percent higher than available elsewhere, and if they would become 5 percent lower, a complete banning of imports would cost society only 10 percent (5/50) of the subsidy to workers (neglecting the consumer surplus from the increased consumption of autos induced by the lower price of imports). These workers may be able to exert influence and elicit political support because the deadweight cost of doing so is cheap relative to those of other programs.",
               "A well-known maxim of economics states that \"sunk costs are sunk,\" that individuals look only to the future as they allocate labor and other resources. Without government assistance, even large investments in industry-specific capital would not deter exit from the industry if imports reduced earnings below those available elsewhere.",
               "\"Sunk costs are not sunk\" in the political sector, however, because investments in human or physical capital specific to a firm, industry, or even region reduce the short-run elasticity of supply, and the deadweight costs of \"distortions\" are lower when supply (and demand) is less elastic. Many persons have been annoyed by the recent political support to Chrysler because the earnings of their workers had been so high. My analysis suggests that annoying or not, this may be precisely the reason why Chrysler has been supported. Political protection against changes in the private sector is likely to be incomplete and temporary. Incomplete because the marginal deadweight cost of protection rises as the degree of protection increases; temporary because supply (and demand) becomes more elastic over time as specific investments depreciate. Therefore, one explanation for periodic efforts at deregulation, such as the recent deregulation of airlines and securities markets, and to a lesser extent of trucking, is that deadweight costs rise as the duration of regulations increases. A study by Jarrell indicates that the deregulation of the securities market appears to have been induced by the growth of large institutional traders with elastic demands.",
               "Economists have traditionally explained political behavior not by the power of interest groups but by market \"failure.\" Governments produce public goods, reduce externalities, and overcome other failures. Although these political activities raise rather than lower aggregate efficiency, they can be readily incorporated into the previous analysis of competition among pressure groups for political influence.",
               "Activities that benefit all groups are opposed by none, and may be actively supported by pressure from some of the groups. More challenging to the analysis are activities that also raise efficiency, but harm some groups (say t) who may exert pressure in opposition. The \"tax\" on t would still finance the \"subsidy\" to s according to the political budget equation in (4), except that now efficiency would be raised because nR, > ntRt. If efficiency were also raised at the margin, that is, if nsdR, > ntdRt, subsidized groups have the intrinsic advantage in affecting political outcomes, for equation implies that s has the intrinsic advantage when F' > G', which is the necessary and sufficient condition for an increase in the subsidy to raise efficiency.10",
               "Subsidized groups with an intrinsic advantage exert more pressure than taxed groups of the same size, efficiency, and political appeal. Since political policies strongly supported by pressure from subsidized groups are likely to win out in the competition against other policies, those policies raising efficiency are likely to win, unless the groups harmed offset their intrinsic disadvantage with efficient production of pressure or in other ways. This result can be stated as a corollary to Proposition 2:",
               "COROLLARY. Political policies that raise efficiency are more likely to be adopted than policies that lower efficiency.",
               "This corollary indicates that the model in this paper of competition among political pressure groups to enhance their own welfare does not neglect market failures. That is, the model does not emphasize political redistribution of income at the expense of political increases in efficiency, even though groups do not cooperate and side payments are not permitted. Therefore, an analysis of noncooperative competition among pressure groups can unify the view that governments correct market failures and what has seemed to be a contrary view that governments favor the politically powerful.",
               "Since an increase in the number of persons taxed reduces the tax required on each person to obtain a given revenue and thereby reduces the marginal (and total) deadweight cost of taxation, an increase in the number of taxpayers would reduce their production of pressure (see ). This is why a group would prefer its subsidy to be financed by small taxes on many persons, even when that does not reduce the political efficiency of the taxed groups.11 The optimal size of a subsidized group is smaller than its most efficient size because an increase in the number of members reduces the net income per member if efficiency does not significantly increase.12 These results can be stated as PROPOSITION 3. Politically successful groups tend to be small relative to the size of the groups taxed to pay their subsidies.",
               "Proposition 3 appears to be consistent with the evidence for agriculture in different countries: agriculture is often heavily subsidized when a small sector, as in Japan, Israel, or the United States; and heavily taxed when a large sector, as in Poland, China, Thailand, or Nigeria (see Peterson , and especially the evidence for Africa in Bates ). Proposition 3 and this evidence for agriculture are contrary to the frequent view that small groups are at a disadvantage politically because they do not have many votes. Section VI argues that voting and majorities are not the fundamental determinants of political influence even in democracies. I have taken as given the method used to subsidize or tax each group, although usually many methods are possible, and the political sector must choose among them. Does competition among pressure groups as modeled in this paper imply that the most efficient method is used? To simplify the discussion of this question, assume that one method of taxation or subsidization is uniformly more efficient than other methods: that F* > F and G* < G, and F*' > F' and G*' < G', for all Rt and R, where F and G refer to any other method.13 If influence functions were independent of the tax method in the sense that tax revenue is the same with different methods when pressures by s and t are given,14 then replacement of a less efficient by a more efficient tax reduces the optimal pressure by t because the marginal 12. Assume that G has a constant elasticity (O > 1) with respect to Rs, Is a constant elasticity ('y < 1) with respect to ps, and that Ps has a constant elasticity (a) with respect to ms and does not directly depend on ns (no free riding). Equation (15) then implies that the equilibrium values of R, and a, change by the same proportion, = to (a'y -1)/(O -ay), as n, increases. Therefore, if a ? 1, both R, and as, and hence the net income per member, would fall as the number of members increased (even without free riding). However, if a > 1 because of economies of scale, net income per member would rise as ns increased if a > 1/,y (without free riding).",
               "13. Note that no method may be uniformly most efficient because methods with relatively large fixed (collection?) costs and small effects on incentives are not efficient at low tax or subsidy levels, and may be efficient at high levels. This point has been stressed in correspondence from Geoffrey Brennan and James Buchanan; see also .",
               "14. An alternative assumption with similar implications is that taxes (Rt) rather than tax revenue would be the same with different methods when pressures are given. Therefore, both t and s would lobby and otherwise exert political pressure in favor of the most efficient method of taxing t (assuming that the method of subsidizing is unaffected) because both groups are better off with the efficient method. This important result can be If all subsidy methods also yield the same tax revenue when pressures are given, replacement of a less efficient by a more efficient subsidy would raise the subsidy to s at the initial equilibrium. If the marginal loss at the initial equilibrium were larger with the more efficient than with the less efficient method (it may not be), the optimal pressure by s would be reduced, and t as well as s would be made better off by the more efficient method. Both groups would then favor efficient methods of subsidizing s (assuming that the method of taxing t does not become less efficient). However, t would be made worse off by more efficient subsidies if they induced greater pressure by s. 15",
               "Consequently, noncooperative competition among pressure groups for political influence sometimes, but not necessarily always, favors efficient subsidies. This conclusion may mollify persons who believe that inefficient taxes and subsidies are often used; for example, that a steeply progressive income tax is an inefficient provider of revenue, the inflation tax should be replaced with consumption or other more efficient taxes, or aid to farmers and the railroad industry would be provided more efficiently by direct subsidies rather than by restrictions on acreage or on competition from trucks.",
               "Yet a progressive income tax may harm the rich as well as raise revenue, and direct subsidies to farmers encourage entry that can dissipate the gain to established farmers. Indeed, Bruce Gardner has shown nicely that acreage restrictions are more efficient than output subsidies at raising the incomes of established farmers when the supply of farmers is elastic.",
               "Still another example is the evidence that public enterprises are less efficient than private enterprises producing the same products . If different methods of subsidizing s yielded the same subsidy rather than the same tax revenue for given pressure by s and t, pressure by s would always increase when a more efficient subsidy replaced a less efficient subsidy. Although the subsidy would also increase, tax revenue might decrease, and hence the welfare of t increase, because more efficient methods yield a larger subsidy from a given revenue.",
               "(evidence from many studies is ably reviewed by Public enterprises often subsidize employees,16 customers, or suppliers, as well as produce various products. If public ownership is an efficient way to subsidize these groups, replacement of public by seemingly more efficient private enterprises could lower rather than raise aggregate efficiency because less efficient subsidies must be used. Consequently, public enterprises may only appear to be less Influence Indifference Curves 16. For example, public sanitation workers and public transit workers appar are better paid than private workers (see Edwards and Edwards and Pa ).",
               "by economizing on political expenditures. As point e* in this figure indicates, Pareto optimality is attained when one group (t in the figure) does not produce any pressure.",
               "Cooperation among pressure groups is necessary to prevent the wasteful expenditures on political pressure that result from the competition for influence. Various laws and political rules may well be the result of cooperation to reduce political expenditures, including restrictions on campaign contributions and the outside earnings of Congressmen, the regulation and monitoring of lobbying organizations, and legislative and executive rules of thumb that anticipate (and thereby reduce) the production of pressure by various groups. Cooperation is difficult, however, because each group wants other groups to reduce their pressure and tries to evade restrictions on its own efforts."
          ],
          "paper_id": "213d0c30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "A Theory of Competition Among Pressure Groups for Political Influence"
     },
     {
          "head": {
               "text": "V. MANY PRESSURE GROUPS",
               "type": "abstract"
          },
          "paragraphs": [
               "In all societies virtually an unlimited number of pressure groups could form to lobby for political aid to their members, categorized by occupation, industry, income, sex, age, height, consumption, and other characteristics. Even the United States, however, has only several thousand active pressure groups . The previous analysis indicated that taxed groups are likely to be active when the deadweight cost of taxes is significant, whereas subsidized groups are likely to be active when deadweight costs are relatively small (perhaps because most of the gains are not dissipated by competitors). Moreover, active groups control free riding relatively easily, partly because their members are affected by the taxes or subsidies in similar and more easily identifiable ways. In addition, active subsidized groups are sufficiently large to take advantage of scale economies, but are not large relative to the groups harmed by their activities. I believe that these conditions, far more than the social significance of production relations emphasized by Marx, explains the prominence in political life of economic pressure groups;17 that is, of groups lobbying for subsidies to or reduced taxes on the occupations, industries, incomes, or consumptions of their members.",
               "The previous sections consider competition between two homogeneous pressure groups, one taxed and the other subsidized. The taxed group might try to reduce taxes but would not seek a separate subsidy financed by taxes on the subsidized group because deadweight costs raise the political effectiveness of its pressure to reduce taxes above that of its pressure to elicit a subsidy.18 Therefore, under these conditions, each person might be taxed or subsidized but not both. Actually, however, most persons are both taxed and subsidized in various ways, and are members of several, sometimes overlapping, pressure groups that lobby to reduce different taxes, and also of several that lobby to raise different subsidies. For example, a person might be joined with others in the same occupation or city to lobby for subsidies, and with somewhat different persons having similar consumption or income to lobby for reduced taxes.",
               "Subsidizing and taxing the same person may be socially inefficient because his welfare could be maintained by equal reductions in both, while aggregate output would be increased by the saving in deadweight costs from reduced taxes and subsidies. Therefore, if everyone were both taxed and subsidized, equal dollar reductions in all taxes and subsidies would make everyone better off. I argued in the previous section that certain laws and political rules are evidence of cooperation by pressure groups to reduce their expenditures on political activities because competition among pressure groups results in excessive expenditures. Likewise, propositions to limit total taxes and philosophies that limit subsidies might be interpreted as cooperative efforts to reduce inefficient \"cross-hauling\" (to use transportation terminology) of taxes and subsidies.",
               "Revenue raised from taxes on the ith group is determined from the influence function, where Rti is a vector of the taxes paid by the ni members, Fi determines the deadweight loss from taxes, P1, . . ., Pq are the pressures exerted by the q taxed groups, Pq+1, ... ., Pv are the pressures by the v -q subsidized groups, and x are other determinants of influence. Similarly, the subsidy available to the jth group is determined from the influence function, (20) -njGj(Rsj) = Isj(pl ... , Pq, Pq+1 .. ~Pv j= ,..,-q, where R81 is the vector of subsidies to the n1 mem mines the deadweight loss of the subsidy. Altho greatly affect which groups gain from political act influence functions cannot be independent because the total revenue from taxes must equal the total amount spent on subsidies:",
               "Therefore, the aggr",
               "The Cournot-Nash assumption th by other groups is unaffected by i many than with two groups because each then tends to have a small effect on any other group. Pressure is exerted until the benefits from lower taxes or higher subsidies are no larger than the cost of producing additional pressure. Even with the assumption that pressure is increased by an active group until the additional income of the group equals its additional cost, heterogeneity affects the equilibrium production of pressure by raising the cost of controlling free riding.",
               "Moreover, heterogeneous groups may not maximize their incomes because more influential members may be better off at other pressure levels. However, to simplify the discussion, I assume that even heterogeneous groups do maximize their incomes. Then the equilibrium conditions for all successful groups are similar to equations  Equations , , and (24), and the production functions for pressure determine equilibrium levels of pressure and political expenditure by all v groups-inactive groups exert no pressure. The comparative statics are similar to those derived earlier for two groups (see Appendix to Becker ): pressure tends to be greater by more '), by groups with intrinsically more influence, and by subsidized groups whose benefits are financed by a small tax on many persons.",
               "These equations also imply extensive political general equilibrium reactions to changes in the behavior of any group. Suppose, for example, that group j becomes more efficient, raises its pressure, and thereby increases its subsidy financed by additional taxes on active groups h and i. They would be induced to exert greater pressure be- The ratio of the marginal deadweight costs from subsidizing or taxing active groups equals the ratio of their marginal political effectiveness.",
               "The optimal tax literature, which generalizes Ramsey pricing to include welfare evaluations of the distribution of income, implies that the ratio of marginal deadweight costs equals the ratio of marginal \"social worths.\" My analysis comes to a similar conclusion for active pressure groups after replacing the normative concept of \"worth\" with the behavioral concept of political effectiveness. Note, however, that the ratio of marginal deadweight costs between an active pressure group and an inactive group is less than the ratio of their marginal political effectiveness because the effectiveness of an inactive group is less than its deadweight loss."
          ],
          "paper_id": "213d0c30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "A Theory of Competition Among Pressure Groups for Political Influence"
     },
     {
          "head": {
               "text": "VI. VOTING AND INFLUENCE",
               "type": "abstract"
          },
          "paragraphs": [
               "Theories of rational politics usually build on the given political preferences of voters, be they theories of the median voter This content downloaded from 203.10.91.86 on Thu, 17 Nov 2016 05:32:50 UTC All use subject to http://about.jstor.org/terms , constitutional consent , or cooperative political games . I too claim to have presented a theory of rational political",
               "behavior, yet have hardly mentioned voting. This neglect is not accidental because I believe that voter preferences are frequently not a crucial independent force in political behavior. These \"preferences\"",
               "can be manipulated and created through the information and misinformation provided by interested pressure groups, who raise their political influence partly by changing the revealed \"preferences\" of enough voters and politicians.",
               "Although choices in the private sector are also affected by advertising and other selling activities, rational individuals become reasonably well informed about most private decisions because they and their families usually bear the main consequences of their mistakes. The incentive to become well informed about political issues is weaker because each individual has only a minor effect on political outcomes decided by the majority (or by similar rules). Hence the average person knows far more about supermarket prices or the performance of cars than about import quotas or public wages. Although rational political behavior has appeared to be contradicted by widespread voter ignorance and apathy, the opposite conclusion is justified because rational voters do not invest much in political information (see Downs and Becker ).",
               "To be sure, members of pressure groups have incentives to free ride that are similar to the incentives of voters to remain uninformed.",
               "However, some pressure groups can limit free riding because they are relatively small and homogeneous, and do not reach decisions with majority-type rules: informed or more affected members may acquire much greater influence than others. Most important, only groups that are relatively efficient at limiting free riding become politically powerful.",
               "In effect, the analysis in this paper assumes that pressure groups can \"purchase\" favorable votes with lobbying and other political activities when a majority or plurality of votes is required for political success. The available empirical evidence does suggest a strong positive effect of campaign expenditures on the number of favorable votes (see and Jacobson ). If votes can be \"purchased\" from outsiders almost as cheaply as they can be obtained from members, cooperation among pressure groups to form a majority coalition would not be necessary. Indeed, many small independent pressure groups in the United States, such as the Sierra Club or sugar growers, do manage to acquire substantial influence. Simple cooperative voting games where the majority controls political outcomes have empty cores because min free to bid for votes, form majority coalitions, and win games. Since this is a comment on the relevance of these political behavior rather than evidence of political instab studies have modeled the political game differently. For an interesting series of papers, Aumann and Kurz (see, abandon the core as a solution concept-they use the Shap sanyi value-and limit the capacity of the majority to ext sources from the minority. In an insightful paper Telser that core solutions may exist when the winning coalition its proportional share of the cost of public goods.",
               "My approach departs more radically from the cooperative game tradition by not explicitly modeling coalition formation, by dropping the unrealistic assumptions that the preferences of voters are fixed and that all votes have the same \"price,'* and by emphasizing the importance of the following: deadweight costs of taxes and subsidies, free riding and other costs of organizing pressure groups, and the capacity of \"losers\" to limit the political gains of \"winners.\" Implicitly, coalitions are formed in my analysis through expenditures by pressure groups to affect the revealed preferences of voters. However, the \"cost\" of a vote is not the same to all pressure groups or for all voters because some groups are more efficient at \"buying\" votes, and some voters are more easily persuaded. I believe that the issues stressed in my approach and neglected by most of the literature on cooperative voting games are crucial to understanding actual political systems, including nondemocratic ones, although an explicit modeling of coalition formation would surely add to the power of the approach.",
               "I have little to say about the productivity of different kinds of political pressure in affecting public opinion, voting, and influence. Presumably, pressure groups can more readily promote interests believed to contribute to defense, nationalism, conservation, health, and other popular goals, and persons who contribute directly, such as doctors and military officers, often can elicit political support.",
               "The ignorance of voters also explains the importance of political form-including political rhetoric, the attachment to ideologies (see ), endurance during long campaigns, and an \"honest\" face-because voters with little direct knowledge about matters of substance must rely on crude proxies. Moreover, research findings that oppose the interests of powerful pressure groups frequently have little political impact because they are offset by the dissemination of selected information and by other appeals to public by policies raising efficiency tend to be more influential than groups harmed (see Section IV).",
               "I have assumed that influence functions depend only on the characteristics of and the pressures exerted by political groups, and not on taxes and subsidies, the number of persons in each group, the distribution of income, or other variables. The ignorance of voters not only helps determine the influence of different characteristics and pressure, but may also make influence depend on other variables as well. For example, influence may depend on subsidies if voters mistakenly believe that certain subsidies (minimum wages or oil entitlements?) contribute to desired goals rather than to the incomes of particular groups. If influence functions were affected by taxes, subsidies, and other policies, the analysis in this paper might have to be significantly modified, including the conclusion that efficient taxes tend to dominate inefficient taxes (Proposition 4), or that policies raising efficiency tend to have greater political support than policies lowering efficiency (Corollary to Proposition 3).",
               "On the other hand, systematic and persistent differences in voting behavior among persons differing by income, education, age, and other characteristics may indicate that I have exaggerated the fragility of these preferences and the ease of \"purchasing\" votes (Sam Peltzman has argued this in an oral communication). Yet even small groups may be able to obtain enough votes by convincing many of the persons unaffected and some of those harmed to support policies that favor these groups, without altering the tendency for persons harmed to be more opposed than persons unaffected, or the latter to be more opposed than persons aided. Unfortunately, these brief and inadequate remarks on the interaction between voter ignorance and competition among pressure groups must suffice for the present."
          ],
          "paper_id": "213d0c30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "A Theory of Competition Among Pressure Groups for Political Influence"
     },
     {
          "head": {
               "text": "VII. SUMMARY AND CONCLUSIONS",
               "type": "conclusion"
          },
          "paragraphs": [
               "This paper presents a theory of the political redistribution of income and of other public policies that builds on competition among pressure groups for political favors. Active groups produce pressure to raise their political influence, where all influences are jointly de-19. Note the insightful comments of Simon Newcomb in 1886: \" . . . One cent per year out of each inhabitant would make an annual income of $500,000. By expending a fraction of profit the proposers of policy A could make the country resound with appeals in their favor.. . Thus year after year every man in public life would hear what would seem to be the unanimous voice of public opinion on the side opposed to the public interests\" [p. termined by the pressures produced by all groups. The budget equation between the total amount raised in tax total amount available for subsidies implies that the su fluences is zero, which has a significant effect on the among pressure groups.",
               "Each group is assumed to maximize the income of its members under the simplifying (Cournot-Nash) assumption that additional pressure does not affect political expenditures of other groups. Equilibrium expenditures on pressure and equilibrium incomes of all groups are determined from these maximizing conditions, and from the political budget equation. I show that political equilibrium depends on the efficiency of each group in producing pressure, the effect of additional pressure on their influence, the number of persons in different groups, and the deadweight costs of taxes and subsidies.",
               "Efficiency in producing pressure is partly determined by the cost of controlling free riding among members. Greater control over free riding raises the optimal pressure by a group and thus increases its subsidy or reduces its taxes. Efficiency is also determined by the size of a group, not only because size affects free riding, but also because small groups may not be able to take advantage of scale economies in the production of pressure.",
               "Perhaps the most important variables in the analysis are the deadweight costs of taxes and subsidies that result from their effects on the allocation of time between work and \"leisure,\" investments in human and nonhuman capital, consumption of different goods, and other behavior. Deadweight costs generally rise at an increasing rate as taxes and subsidies increase. An increase in the deadweight cost of a subsidy discourages pressure by the subsidized group because a given revenue from taxes then yields a smaller subsidy. An increase in the deadweight cost of a tax, on the other hand, encourages pressure by taxpayers because a given reduction in their taxes then has a smaller effect on the amount available as a subsidy. Consequently, deadweight costs give taxpayers an intrinsic advantage in the competition for influence. Groups that receive large subsidies presumably have managed to offset their intrinsic disadvantage by efficiency, an optimal size, or easy access to political influence.",
               "Since deadweight costs to taxpayers fall as the tax per person falls, the opposition of taxpayers to subsidies decreases as the number of taxpayers increases. Therefore, groups can more readily obtain subsidies when they are small relative to the number of taxpayers.",
               "This may well explain why farmers in rich countries and urban dwellers in poor countries are politically successful. All groups favor and lobby for efficient taxes (taxes with lower deadweight costs) because these improve the welfare of subsidized as well as taxed groups, since taxpayers would produce less pressure.",
               "Efficient methods of subsidization raise subsidies and benefit recipients, but would harm taxpayers, unless recipients are induced to produce less pressure by a sufficiently rapid increase in their deadweight costs as their subsidy increases.",
               "The analysis in this paper is relevant not only to taxes and subsidies that redistribute income-including regulations and quotas as well as explicit taxes and subsidies-but also to policies that raise efficiency by the production of public goods and the curtailment of other market failures. Policies that raise efficiency are likely to win out in the competition for influence because they produce gains rather than deadweight costs, so that groups benefited have the intrinsic advantage compared to groups harmed. Consequently, this analysis unifies the view that governments correct market failures with the view that they favor the politically powerful by showing that both are produced by competition among pressure groups for political favors.",
               "Although numerous models of the political sector have been developed, successful modeling has been an elusive goal. I believe that the model of competition among pressure groups presented in this paper represents progress toward that goal; yet I recognize that progress has been obtained at the expense of various simplifying assumptions that should be modified. These include a neglect of voting, bureaucrats, politicians, and political parties. I partly justified the neglect of voting and the explicit formation of coalitions by arguing that even small groups may acquire enough votes by changing the opinions and preferences of voters because few voters have much incentive to be well informed.",
               "Politicians and bureaucrats are assumed to carry out the political allocations resulting from the competition among pressure groups. Just as managers of firms are hired to further the interests of owners, so too are politicians and bureaucrats assumed to be hired to further the collective interests of pressure groups, who fire or repudiate them by elections and impeachment when they deviate excessively from these interests. However, just as managers acquire additional power when ownership and control are separated, bureaucrats and politicians may have significant political power (see Niskanen The second-order conditions to ensure that equations and give income-maximizing values of a, and at are I_ s+(I pSmM) IPXM is C\""
          ],
          "paper_id": "213d0c30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "A Theory of Competition Among Pressure Groups for Political Influence"
     }
]