[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Designing agents that can cooperate with other agents as a team, without prior coordination or explicit communication , is becoming more desirable as autonomous agents become more prevalent. In this paper we examine an aspect of the problem of leading teammates in an ad hoc teamwork setting, where the designed ad hoc agents lead the other teammates to a desired behavior that maximizes team utility. Specifically, we consider the problem of leading a flock of agents to a desired orientation using a subset of ad hoc agents. We examine the problem theoretically, and set bounds on the extent of influence the ad hoc agents can have on the team when the agents are stationary. We use these results to examine the complicated problem of orienting a stationary team to a desired orientation using a set of non-stationary ad hoc agents. We then provide an empirical evaluation of the suggested solution using our custom-designed simulator FlockSim."
          ],
          "paper_id": "21448640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Ad Hoc Teamwork for Leading a Flock"
     },
     {
          "head": {
               "n": "1.",
               "text": "INTRODUCTION",
               "type": "introduction"
          },
          "paragraphs": [
               "The growing use of agents in various cooperative domains has emphasized the importance of designing agents capable of reasoning about ad hoc teamwork . Such agents can cooperate within a team without using explicit communication or previously coordinating behaviors among teammates. One aspect of ad hoc teamwork involves leading teammates. Consider a case in which we want to influence a given team of agents to alter their actions in order to maximize the team utility. One way of doing so is by adding agents to the team in order to lead them to perform the desired actions. While previous research on leading teammates in ad hoc settings concentrated on a game theoretic analysis of this problem , in this work we consider a more practical aspect of the problem by concentrating on flocking agents.",
               "Flocking is an emergent behavior that can be found in different species in nature including flocks of birds, schools of fish, and swarms of insects. In each of these cases the animals follow a simple local behavior rule that results in a stable, well defined, group behavior. Research on flocking behavior can be found in various disciplines, for example in physics , graphics , biology , and distributed control theory . The main focus of each of these research directions is to characterize the emergent behavior. In this paper we introduce the problem of leading a team of flocking agents in ad hoc teamwork settings. In this case, we are given a team of flocking agents following a known, well defined rule characterizing their flocking behavior, and we wish to examine to what extent it is possible to influence the team. Specifically, the question addressed in this paper is: is it possible for one or more agents to lead the team to a desired orientation, and if so -what is the most efficient way of doing so?",
               "The ad hoc teamwork perspective of this problem is highlighted by two facts. Firstly, we do not explicitly control the behavior of the flocking agents, thus we can only try to influence them implicitly using the behavior of the ad hoc agents (which appear to be identical to the flocking agents). Secondly, all agents -both flocking and ad hoc -act as one team, and their only desire is to optimize team utility. The ad hoc agents cannot communicate with the flocking agents, but they can coordinate their actions among themselves.",
               "The challenge of designing ad hoc agents in such a dynamic system is twofold: the action space is continuous and the set of optimal solutions is not discrete. We therefore analyze the system in two steps. First, we examine the problem of leading a team of stationary flocking agents, i.e., the agents are aligned in a formation and the ad hoc agents attempt to influence only their orientations while all of the agents maintain their current positions. In the second stage, we use these results for establishing the desired behavior when the ad hoc agents can move.",
               "One of the main contributions of this paper is the problem definition provided in Section 2, as it contributes a specification of the flocking problem as a new scenario for studying ad hoc teamwork. Another major contribution of this paper is an initial theoretical and empirical analysis of the problem. Some foundational results that apply to all flocking scenarios are presented in Section 3. The analysis for stationary ad hoc agents is presented in Section 4, while the analysis for non-stationary ad hoc agents is presented in Section 5. We also describe our empirical evaluation using our customdesigned simulator FlockSim 1 in Section 5. Section 6 situates this research in the literature, and Section 7 concludes. Under our flocking model, the global orientation of agent ai at time step t + 1,i(t + 1), is set to be the average orientation of all agents in Ni(t) (including itself) at time t. Formally,",
               "In this work we introduce a flocking model inspired by . In our model, n homogeneous agents inhabit some environment where each agent ai moves with some velocity vi. Velocity vi is not a function of time and hence remains constant for each agent over time. At each time step t, each agent ai has a position pi(t) = (xi(t), yi(t)) in the environment and an orientationi(t). Note that pi(t) andi(t) are dependent on the time t and can be different for each agent ai. Each agent's position pi(t) at time t is updated after its orientation is updated, such that xi(t) = xi(t ? 1) + vi cos(i(t)) and yi(t) = yi(t ? 1) ? vi sin(i(t)).",
               "We let Ni(t) be the set of ni(t)n agents (including agent ai) at time t which are visible to agent ai. An agent is visible to agent ai if its position is located within a visibility cone of anglecentered on orientationi(t) and extending from agent ai for an unlimited distance (see for an example). We say that angledefines the visibility cone for each agent, and that this visibility cone defines each agent's neighborhood (i.e., the area in which the agent can see other agents). For example, assume an agent ajNi(t) is in ai's neighborhood and hence a neighbor of ai.",
               "Agent aj's position pj(t) = (xj(t), yj(t)) in the environment at time t is located at anglej(i) with respect to agent ai's position pi(t) = (xi(t), yi(t)) and orientationi(t). Agent aj is in ai's neighborhood at time t if anglej(i) is less than or equal to We must use Equation 1 instead of merely taking the average orientation of all agents because of the special cases handled by Algorithm 1 (e.g. The average of 350",
               "? and 10",
               "? is 180",
               "? , but by Algorithm 1 it is 0",
               "? , as desired). Throughout this paper, we restricti(t) to be within . Likewise, the difference between the orientations of two agents is always within [?,] since a difference of+ ? is equivalent to a difference of ? ?in the opposite direction.",
               "The n homogeneous agents that comprise the flock consist of k ad hoc agents and m flocking agents, where k + m = n. The ad hoc agents {a0, . . . , a k?1 } are agents whose behavior we can control, while the flocking agents {a k , . . . , aN?1} are agents that we cannot directly control but that we know calculate their orientation according to Equation 1. In this paper, we make the simplification that although we can have many flocking agents, they all must have the same position p(t) in the environment. At each time step t, the number of ad hoc agents inside ai's neighborhood is denoted by ki(t) and the number of flocking agents inside the neighborhood is denoted by mi(t), where ki(t) + mi(t) = ni(t) (the total number of agents in ai's neighborhood). For simplicity, we use the visibility cone approach discussed above to define each agent's neighborhood. It should be noted, however, that this is not the exact approach real birds use to determine which neighboring birds influence their flight. For example, starlings are believed to consider the seven nearest birds in their flock as their neighborhood when performing orientation updates . However, it is generally accepted that birds do have a 'blind' angle behind them such that any neighboring birds within this 'blind' area are not considered when performing orientation updates . This 'blind' area was the motivation for our visibility cone approach.",
               "We define the Agent Flock Orientation Manipulation Problem as follows: Given a target orientation* and a team of n homogeneous agents {a0, . . . , an?1}, where the flocking agents {a k , . . . an?1} calculate their orientation based on Equation 1, determine whether the ad hoc agents can influence the flocking agents to align to* , and if so, find the planthat does so with minimum cost c().",
               "During each time step, the ad hoc agents first orient to their desired orientations based on some plan. Next, the flocking agents update their orientations based on the orientations of all the agents in their neighborhoods (using Equation 1). Finally, the positions of all the agents are updated.",
               "An x-step plan specifies the orientations that each ad hoc agent {a0, a1, . . . a k?1 } will align to at each time step when given exactly x time steps in which the agents have to act. The x-step plan is denoted byx = (",
               "j=k For each plan, performance error decreases when more time steps are available such that E(0)E(1)E(2). . .E(ะก). Performance error never increases as more time steps are available because the optimal behavior given one additional time step is to either influence the same as with one fewer time step (and obtain the same performance error) or influence at least one flocking agent to orient itself closer to* (and obtain lower performance error). The cost of an x-step planx is defined as",
               "The first lemma we present in this section relates to the maximal amount the ki(t) ad hoc agents can influence the mi(t) flocking agents in a single time step.",
               "Lemma 1. The ki(t) ad hoc agents can influence the mi(t) flocking agents to turn in a particular direction by any amount less than or equal to",
               "radians in one time step.",
               "Proof. When the difference betweenj(t) andi(t) is less than(or greater than, in which case the difference is less thanin the opposite direction), then by Equation 1 where w1 is a weight that can be set to emphasize the importance of lesser time steps, x is a scalar representing the size of the planx, and w2 is a weight that can be set to emphasize the importance of lower performance error. At the extremes, setting w1 >> w2 encourages finding reasonably low performance error in as few steps as possible, while setting w2 >> w1 encourages minimizing performance error using as many steps as are needed.",
               "An optimal plan* is one with minimal cost c(* ). The optimal number of time steps |x| for a task is the x at which c(x) is minimal. Likewise, the optimal cost |c()| is equal to c(|x| ).",
               "In this work, we set w1 to a moderate number and set w2 to. With these settings for w1 and w2 we obtain the least-step plan in which all flocking agents orient to* , if such a plan exists. If such a plan does not exist, then we obtain a plan with low performance error that uses as few steps as possible.",
               "When the difference betweenj(t) andi(t) is equal to, by Equation 1"
          ],
          "paper_id": "21448640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Ad Hoc Teamwork for Leading a Flock"
     },
     {
          "head": {
               "n": "3.",
               "text": "GENERAL FLOCKING THEOREMS",
               "type": "introduction"
          },
          "paragraphs": [
               "In this paper we establish the building blocks towards examining a fully dynamic system of agents in which most agents base their behavior on the current behavior of neighboring agents and a few agents are controlled by our algorithms. However, the agents controlled by our algorithms do not appear any different to the other agents, and hence the other agents do not recognize that these agents are controlled by a different algorithm.",
               "In this section, we present lemmas that are general in nature and will apply to both the stationary and non-stationary ad hoc agent cases examined in the later sections of this paper. In particular, in this section we consider the case in which there are ki(t) ad hoc agents and mi(t) flocking agents, where all mi(t) flocking agents are located at the same position pi(t) with identical orientationsi(t) (see for an example).",
               "However, it is impossible to guarantee that the flocking agents turn in a particular direction when the difference betweenj(t) andi(t) is equal to. Hence, in this case the ad hoc agents setj(t) such that the difference betweenj(t) andi(t) is? ? or+ ?. When the ad hoc agents do this, directionality can be guaranteed and",
               "The second lemma we present in this section states that all ki(t) ad hoc agents in a flocking agent's visibility cone can adopt the exact same orientation. We show that no extra influence can be obtained by some of the ad hoc agents adopting different orientations than the other ad hoc agents. Lemma 2. When ki(t) ad hoc agents work together to influence mi(t) flocking agents to align the team to some, it suffices to consider only algorithms that choose at each time step just one orientation for all of the ad hoc agents to adopt."
          ],
          "paper_id": "21448640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Ad Hoc Teamwork for Leading a Flock"
     },
     {
          "head": {
               "text": "a1",
               "type": "introduction"
          },
          "paragraphs": [
               "Flocking agents a4, a5"
          ],
          "paper_id": "21448640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Ad Hoc Teamwork for Leading a Flock"
     },
     {
          "head": {
               "text": "Position pi",
               "type": "introduction"
          },
          "paragraphs": [
               "Proof. Assume an algorithm makes the ad hoc agents adopt orientations0(t), . . . ,k i (t)?1 (t), where some of these orientations may differ. Then, by Equation 1, the orientation of the flocking agents is ",
               "Now, assume the ad hoc agents adopt an anglethat is the average of0(t), . . . ,k i (t)?1 (t). Then by Equation 1, the new orientation is",
               "Sinceis the average of0(t), . . . ,k i (t)?1 (t),",
               "Visibility cone",
               "Therefore, for every algorithm assigning different orientations, there is some algorithm assigning the same orientation, which concludes the proof. "
          ],
          "paper_id": "21448640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Ad Hoc Teamwork for Leading a Flock"
     },
     {
          "head": {
               "n": "4.",
               "text": "STATIONARY AGENTS",
               "type": "introduction"
          },
          "paragraphs": [
               "In this section we consider the case in which there are mi(t) flocking agents located at a single position pi with identical initial orientations and ki(t) ad hoc agents located at various arbitrary locations. Each agent ai has velocity vi = 0. This means that although an agent's orientation may change, its position will remain constant. An example is provided in .",
               "respect to agent ai's position pi(t) = (xi(t), yi(t)) and orientationi(t).",
               "The first lemma in this section puts a bound on the maximal amount the flocking agents can be influenced to turn and still have the same set of ad hoc agents and flocking agents within the flocking agents' visibility cone. ",
               "Ad hoc agents ? ?) radians in one time step and still have the same mi(t) flocking agents and ki(t) ad hoc agents within the flocking agents' neighborhood."
          ],
          "paper_id": "21448640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Ad Hoc Teamwork for Leading a Flock"
     },
     {
          "head": {
               "text": "a1 a5 a4",
               "type": "introduction"
          },
          "paragraphs": [
               "Flocking agents",
               "Proof. In order for all the ki(t) agents to remain in the neighborhood of all mi(t) agents at time t + 1, it is necessary for the amount the mi(t) flocking agents turn by",
               "? ?)) plus the location of the current edge of the flocking agents' visibility cone (i(t) ?2",
               "Figure 3: An example with two flocking agents (a 6 and a 7 ) located at the same position with identical initial orientations, four ad hoc agents (a 0 , a 1 , a 2 , and a 3 ) located at different locations within the visibility cone of the flocking agents, and two ad hoc agents (a 4 and a 5 ) located at different locations outside the current visibility cone of the flocking agents.",
               ") to be less than or equal to the orientation of the position of the ad hoc agents with respect to the position of the flocking agents (j(i) +i(t)). Hence,",
               "As the flocking agents are influenced to turn towards* , different ad hoc agents become available to influence the flocking agents. This is because some ad hoc agents may no longer be within the flocking agents' visibility cone, while other ad hoc agents may enter the visibility cone. Hence, at each time step the ad hoc agents must consider the trade-off between moving the flocking agents maximally towardswhen mi(t) flocking agents and ki(t) ad hoc agents are in each flocking agents' neighborhood at time t + 1.",
               "If ",
               "? and keeping (or moving) ad hoc agents within the flocking agents' visibility cone for future time steps.",
               "In this section, we introduce some new terminology. A border agent is an ad hoc agent that is located within the visibility cone of the flocking agents, on the edge of the visibility cone that is farther away from the target. A border influence orientation is a flocking agent orientation at which an ad hoc agent is a border agent. Clearly for each ad hoc agent, there are exactly two possible border influence orientations -one in which the border agent is located on the left hand side of the flocking agents' visibility cone and one in which the border agent is located on the right hand side of the visibility cone. See for an example with a border agent.",
               "Throughout this section, recall thatdenotes the angle of the flocking agent ai's visibility cone. Additionally, remember that an ad hoc agent aj's location pj(t) = (xj(t), yj(t)) in the environment at time t is located at anglej(i) with",
               "?? in this case, the left side of Equation 4 is less than or equal to the right side.",
               "The second lemma in this section sets a bound on the maximum number of time steps needed for the ad hoc agents to influence the flocking agents to reach* when* is reachable.",
               "Lemma 4. The ki(t) ad hoc agents can influence the mi(t) flocking agents to align the team to* within",
               ",)",
               "time steps when* is reachable (i.e. the difference betweeni(t) and* is less than or equal to (Z ? 1)",
               "? ? on each of the first Z ? 2 time steps. Additionally, by Lemma 3, ki(t) ad hoc agents can influence mi(t) flocking agents to turn byj(i) +i(t) ?i(t + 1) + (",
               "on the Z ? 1 time step and still have have mi(t) flocking agents and ki(t) ad hoc agents in each flocking agents' neighborhood. Finally, by Lemma 1 ki(t) ad hoc agents can influence mi(t) flocking agents to turn by any amount less than or equal to",
               "? ? on the last time step.",
               "Influencing as described above must force the mi(t) flocking agents to align to* ; in other words, we must show that",
               "In this case, the left of Equation 6 becomes",
               "leading to a contradiction.",
               "By definition we know that> (Z ? 2)",
               "? ? and2, so the left side of Equation 5 simplifies to 3+j(i) +i(t) ?i(t + 1) + 2Z?2 such that the left side of Equation 5 is greater than or equal to the right side.",
               "The following theorem states that it is impossible to influence the flocking agents to orient themselves to* (assuming it is reachable) in fewer than Z time steps. Remember that Lemma 4 showed that ki(t) ad hoc agents can influence mi(t) flocking agents to align the team to* in Z time steps when* is reachable.",
               "When determining how the ad hoc agents should orient themselves to optimally influence the flocking agents, we use a forward search approach (see ). Specifically, beginning at the initial flocking orientation, we consider each possible border influence orientation. If the border influence orientation is reachable from the initial flocking orientation, then we consider each possible border influence orientation from this point. If the border influence orientation is not reachable from the initial flocking orientation, then we turn to the farthest reachable point and then determine if the border influence orientation is now reachable (and repeat this process until the border influence orientation is reachable). We repeat this process until the target is within reach, and we select the plan that reaches the target in the fewest number of steps. ,)",
               "time steps are needed for the ki(t) ad hoc agents to influence the mi(t) flocking agents to align the team to* ."
          ],
          "paper_id": "21448640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Ad Hoc Teamwork for Leading a Flock"
     },
     {
          "head": {
               "text": "a3",
               "type": "introduction"
          },
          "paragraphs": [
               "Proof. Assume, towards contradiction, that there exists an algorithm in which ki(t) ad hoc agents influence mi(t) flocking agents to align the team to* (when alignment is possible) in Z< Z time steps. By Lemmas 1, 3, and 4, ki(t) ad hoc agents can influence mi(t) flocking agents to turn ",
               "? ? on time step Z. Hence, : An example of the possible subsequent flocking agent orientations for a given initial orientation. The ad hoc agents are labelled with a 0 , a 1 , and a 2 , while the flocking agent is labelled with a 3 . Note that turning to border agent a 2 is not possible in the first time step.",
               "when alignment of the team to* can be achieved in Ztime steps. By Lemmas 1 and 3,j(i) +i(t) ?i(t + 1) +",
               "? ? so the left side of Equation 6 becomes",
               "A forward search such as this requires checking 2 k possible combinations of the number of ad hoc agents influencing the flocking agents at each time step. Consider the case where there are three ad hoc agents. The following eight combinations of targets covers all possible combinations:",
               "By convention, agent a0 will be oriented farther from the target than agent a1, which will be oriented farther from the target than agent a2, and so on. See for an example with two ad hoc agents and one flocking agent.",
               "Algorithm 2 uses such a forward search approach to calculate and return the number of steps needed to reachInitial Setup Algorithm 2 plan, steps = calcPlan() 1: for each possible ad hoc agent combination do 2: currentFSeq, currentAHPlanempty list 3: currentinitFOrient 4: for each borderTarget in this ad hoc agent combination do 5:",
               "targetReachablefalse : Example with two ad hoc agents (a 0 and a 1 ) and one flocking agent (a 2 ). On step 1, the flocking agent turns to have a 0 as a border agent. Then on step 2, the flocking agent turns as much as possible towards* . Finally, on step 3 the flocking agent turns to* ."
          ],
          "paper_id": "21448640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Ad Hoc Teamwork for Leading a Flock"
     },
     {
          "head": {
               "text": "6:",
               "type": "introduction"
          },
          "paragraphs": [
               "while targetReachable == falsecurrentFSeq.size() < maxStepsbestFSeq.size() > currentFSeq.size() do "
          ],
          "paper_id": "21448640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Ad Hoc Teamwork for Leading a Flock"
     },
     {
          "head": {
               "text": "13:",
               "type": "introduction"
          },
          "paragraphs": [
               "targetReachablefalse and the necessary orientations for each of the ad hoc agents for each of these steps. Throughout the algorithm, element.get(x) returns the 0-indexed x item in element (where element is a list object), element.add(y) adds item y to the end of element, and element.size() returns the number of items contained in element. The variables used throughout Algorithm 2 are defined in . Remember that although the ki(t) ad hoc agents are located at many arbitrary locations, the mi(t) flocking agents are located at a single position pi and begin with identical orientations."
          ],
          "paper_id": "21448640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Ad Hoc Teamwork for Leading a Flock"
     },
     {
          "head": {
               "text": "14:",
               "type": "introduction"
          },
          "paragraphs": [
               "if the orientation the flocking agents should be oriented towards on the next time step targetReachable whether target is reachable from current (line 6), and necessary ad hoc orientations are added to the currentAHPlan and targets are added to the currentFSeq until it is reachable or the plan size becomes larger than maxSteps. The currentFSeq and currentAHPlan become the bestFSeq and bestAHPlan (lines 25-27) only if they use less steps to reach* than the current bestFSeq and bestAHPlan. Line 25 will not be reached until all border orientation targets for a particular set of ad hoc agent combinations have been considered and* has been reached or the plan size becomes larger than maxSteps. Hence, since the best possible ad hoc agent combinations are guaranteed to be considered and the number of steps required will not be larger than maxSteps, we are guaranteed that the bestAHPlan that is returned by Algorithm 2 is the least-step plan possible. Algorithm 2 has been implemented and tested in our customdesigned simulator FlockSim. Results from experiments using FlockSim are given in Section 5.",
               "In the worst case, line 1 will be executed 2 numAH times, line 4 will execute numAH + 1 times, and line 6 will execute maxSteps times. Hence, lines 7-24 are executed at most (2 numAH )(numAH + 1)(maxSteps) times."
          ],
          "paper_id": "21448640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Ad Hoc Teamwork for Leading a Flock"
     },
     {
          "head": {
               "n": "5.",
               "text": "NON-STATIONARY AD HOC AGENTS",
               "type": "introduction"
          },
          "paragraphs": [
               "Theorem 6. Given* and assuming the mi(t) flocking agents are influenced only by the ki(t) ad hoc agents and the mi(t) flocking agents at time t, then if* is reachable, the ad hoc agents are guaranteed to lead the flocking agents to* in the least number of time steps possible when the ad hoc agents determine their plan based on Algorithm 2 and the number of steps required is not larger than maxSteps.",
               "Proof. There are exactly 2 numAH possible ad hoc agent combinations. Hence, by line 1, Algorithm 2 is guaranteed to consider each possible ad hoc agent combination.",
               "Each border influence orientation target is considered until it is reachable or the plan size becomes larger than maxSteps In this section we consider the case in which there are mi(t) flocking agents that are all located at position pi with identical initial orientations. These flocking agents will remain at position pi forever, but may change orientation if influenced by at least one ad hoc agent. In order to facilitate this, there are ad hoc agents located at arbitrary locations in the environment that can each travel with some constant velocity.",
               "In the stationary ad hoc agents section, the main decision for each ad hoc agent was whether to influence the flocking agents to turn maximally towards* or to influence the flocking agents to turn such that one of the ad hoc agents becomes a border agent. However, determining exactly how non-stationary ad hoc agents should behave is a more difficult problem. Hence, in this preliminary work we consider some heuristic approaches for how non-stationary ad hoc agents should behave.",
               "In the stationary ad hoc agents case, it did not matter how the ad hoc agents that were not within any flocking agent visibility cones behaved because they had no influence over any flocking agents. However, non-stationary ad hoc agents travel in the direction they are facing, so it does matter what orientation they face even when they are not within the visibility cone of any flocking agents. Hence, in this work we present two heuristic behaviors for ad hoc agents that are not within the visibility cone of any flocking agents.",
               "Towards Flocking Agent Orient towards the position of the flocking agent.",
               "Towards Visibility Cone Orient towards the closest point on the flocking agents' visibility cone from the ad hoc agent's current position.",
               "instead use a simpler, more efficient heuristic approach that finds an orientation close to the exact orientation that would be found by the binary search such that the ad hoc agent is still within the flocking agents' visibility cone after moving. Non-stationary ad hoc agents clearly have more influence than stationary ad hoc agents. In some situations, convergence of the flocking agents to* is able to occur quicker. In other situations, non-stationary ad hoc agents are able to lead the flocking agents to converge to* in cases where stationary ad hoc agents would be unable to. There are situations in which an ad hoc agent can travel into the flocking agent's visibility cone and influence when it would have been unable to influence if it were stationary. In fact, stationary flocking agents can always be influenced to reach* eventually when non-stationary ad hoc agents are utilized."
          ],
          "paper_id": "21448640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Ad Hoc Teamwork for Leading a Flock"
     },
     {
          "head": {
               "text": "Empirical Evaluation",
               "type": "experiment"
          },
          "paragraphs": [
               "The performance of each of these behaviors is studied empirically later in this section and reported on in . Although one of these behaviors must currently be chosen by the user for each trial, the optimal behavior likely consists of some combination of these behaviors and perhaps other behaviors. The exact situations in which each behavior should be utilized have not yet been determined. However, there are some situations where each behavior may be best. Moving towards the visibility cone may be ideal when no ad hoc agents are currently in the visibility cone to influence the flocking agent, as the flocking agent will not be able to be influenced until at least one ad hoc agent moves within its' visibility cone. On the other hand, moving towards the flocking agent may be ideal when there are ad hoc agents currently within the flocking agents' visibility cone, as moving closer to the flocking agent now will decrease the number of time steps required for the ad hoc agent to enter the flocking agents' visibility cone in future time steps.",
               "The general behavior for non-stationary ad hoc agents that are inside a flocking agent's visibility cone is similar to the behavior of stationary ad hoc agents. Specifically, the non-stationary ad hoc agents will either influence the flocking agents to turn maximally or they will influence the flocking agents to turn such that an ad hoc agent is at the edge of the visibility cone (and hence a border agent). The main difference between the stationary ad hoc agents behavior and the non-stationary ad hoc agents behavior is that now the border agent must be on the edge of the visibility cone after updating its location. There are exactly two orientations at which a non-stationary ad hoc agent can orient and be a border agent. One of these orientations results in the ad hoc agent becoming a border agent on the left hand side of the visibility cone, while the other orientation results in the ad hoc agent becoming a border agent on the right hand side of the visibility cone. There must be exactly two orientations at which a non-stationary ad hoc agent can orient and be a border agent because any other orientations will result in either the flocking agents being influenced to turn farther and the ad hoc agent no longer moving enough to move into the visibility cone or in the flocking agents not being influenced to turn as much and the ad hoc agent being too far inside the visibility cone to be a border agent. We could find the exact orientation at which a non-stationary ad hoc agent can orient and be a border agent by performing a binary search for the exact orientation. However, we All of the heuristic behaviors discussed in this section have been implemented and tested in FlockSim. Earlier in this section we presented two heuristic behaviors for ad hoc agents that are located outside of the flocking agents' visibility cone. Now we examine each of these behaviors in FlockSim, and study is there a significant difference in the number of steps required for the flocking agents to orient to* with each heuristic behavior and (2) how well do our ad hoc agents perform when compared with the naive method used by others (e.g. ) in which the controllable agents orient towards* such that the flock slowly converges to* ? : Results obtained using FlockSim on three different team configurations over 1000 trials.",
               "The results of our experiments are presented in . For these experiment, v = 50 for the ad hoc agents,= 90",
               "? , the initial flocking orientation was 90",
               "? , and the ad hoc agents and flocking agents were placed randomly in a 950 by 500 environment. Each of the runs within the three possible team configurations used the same randomization seed. maxSteps was set to 100, such that no trials stopped due to the plan size exceeding maxSteps. When run with teams composed of one to four non-stationary ad hoc agents and one to four stationary flocking agents on a Dell Precision-360 desktop computer, an optimal plan is found in 0.00368103 seconds on average.",
               "As clearly seen in , Towards Visibility Cone performs better than Towards Flocking Agent in all the configurations utilizing ad hoc agents. In order to determine whether there is a significant difference in the number of steps required for the flocking agents to orient to* , we ran a Student's t-test on the step counts from the 1000 runs for each pair of heuristic behaviors. For each of the three pairs, we found the difference to be statistically significant at p = 0.05. Towards Visibility Cone likely performed better because getting into the visibility cone faster allows the ad hoc agent to influence the flocking agent sooner. also clearly shows that our ad hoc agent algorithms perform significantly better than the naive method in which the controllable agents orient towards* . Our ad hoc agent algorithms performed better because we purposely orient the ad hoc agents past* in order to orient the flocking agents exactly to* quickly. It is important to note that in this experiment we relaxed the definition of 'reaching'* for the naive method. Due to the way in which the naive method slowly converges, under our strict definition of 'reaching', the naive methods would very rarely converge."
          ],
          "paper_id": "21448640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Ad Hoc Teamwork for Leading a Flock"
     },
     {
          "head": {
               "n": "6.",
               "text": "RELATED WORK",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Although there has been much work in the field of multiagent teamwork, there has been relatively little work towards getting agents to collaborate towards a common goal without pre-coordination. Most prior multiagent teamwork research requires explicit coordination protocols or communication protocols (e.g. SharedPlans, STEAM, and GPGP) . However, our work is different in that we do not assume that any protocol is known by all agents.",
               "Han, Li and Guo study how one agent can influence the direction in which an entire flock of agents is moving . Similarly to our work, in their work each agent follows a simple control rule based on its neighbors. However, unlike our work they only consider one ad hoc agent with unlimited, non-constant velocity. This allows their ad hoc agent to move to any position in the environment within one time step, which is unrealistic.",
               "Reynolds introduced the original flocking model when he presented three flocking behaviors -collision avoidance, velocity matching, and flock centering . His work was focused on creating graphical models that looked and behaved like real flocks, and hence did not consider adding controllable agents to the flock like we do.",
               "Vicsek et al. considered just the flock centering aspect of Reynolds' model . Hence, they use a model where all of the particles move at a constant velocity and adopt the average direction of the particles in their neighborhood. However, like Reynolds' work, they were only concerned with simulating flock behavior and not with adding controllable agents to the flock. Jadbabaie, Lin, and Morse build on Vicsek et al.'s work . They use a simpler direction update than Vicsek et al. and they show that a flock with a controllable agent will eventually converge to the controllable agent's heading. Like us, they show that a controllable agent can be used to influence the behavior of the other agents in a flock. However, they are only concerned with getting the flock to converge eventually, whereas we attempt to do so as quickly as possible. Su, Wang, and Lin also present work that is concerned with using a controllable agent to make the flock converge eventually .",
               "Jones et al. perform an empirical study of dynamically formed teams of heterogeneous robots in a multirobot treasure hunt domain . They assume that all of the robots know they are working as a team and that all of the robots can communicate with one another, whereas in our work we do not assume that the teammates realize they are working on a team with the ad hoc agents.",
               "In this paper, we consider the problem of leading a flock of agents to a desired orientation using a subset of ad hoc agents. This paper's major contributions are (1) a specification for the flocking problem as a new scenario for studying ad hoc teamwork and (2) an initial theoretical and empirical analysis of this problem. We first set bounds on the extent of influence the ad hoc agents can have on the team when all the agents are stationary, and then we subsequently examine the more complicated problem of orienting a stationary team using a set of non-stationary ad hoc agents.",
               "Although we begin to consider the non-stationary ad hoc agent case in this work, it is just an initial step towards solving the general case of non-stationary ad hoc and flocking agents. As such, we plan to extend the work presented here towards this general case in the near future. Additionally, as this paper introduces flocking from the ad hoc perspective, there are many exciting directions for future work, such as exploring different neighborhood models, and determining if there is an optimal behavior for non-stationary ad hoc agents that are outside the flocking agents' visibility cone."
          ],
          "paper_id": "21448640-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Ad Hoc Teamwork for Leading a Flock"
     }
]