[
     {
          "head": {
               "text": "Overview",
               "type": "introduction"
          },
          "paragraphs": [
               "(1) Small-world networks and decentralized search Stylized models expose basic patterns. Identifying the patterns in large-scale data.",
               "(2) A problem that is less well understood at a large scale:",
               "diffusion and cascading behavior in social networks",
               "The way in which new practices, ideas, and behaviors spread through social networks like epidemics. Models from discrete probability, data from on-line communities, open questions in relating them.",
               "(3) Privacy and anonymity in on-line data.",
               "The perils in using anonymized social network data. Attacks on anonymized networks using small identifiable subgraphs."
          ],
          "paper_id": "2176e0e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Algorithmic Models for Social Network Phenomena"
     },
     {
          "head": {
               "text": "Small-World Networks",
               "type": "introduction"
          },
          "paragraphs": [
               "Milgram's small-world experiment Choose a target in Boston, starters in Nebraska.",
               "A letter begins at each starter, must be passed between personal acquaintances until target is reached. Six steps on average ?six degrees of separation.",
               "Routing in a (social) network: When is local information sufficient? Variation on network model of .",
               "Add edges to lattice: u links to v with probability d(u, v ) ?. In HP Labs, groups defined by sub-trees of hierarchy. Links scaled as g ?3/4 ."
          ],
          "paper_id": "2176e0e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Algorithmic Models for Social Network Phenomena"
     },
     {
          "head": {
               "text": "Geographic Data: LiveJournal",
               "type": "introduction"
          },
          "paragraphs": [
               "Liben-Nowell, Kumar, Novak, Raghavan, Tomkins (2005) studied LiveJournal, an on-line blogging community with friendship links.",
               "Large-scale social network with geographical embedding: 500,000 members with U.S. Zip codes, 4 million links.",
               "Analyzed how friendship probability decreases with distance.",
               "Difficulty: non-uniform population density makes simple lattice models hard to apply. Rank-based friendship: rank of w with respect to v is number of people",
               "Decentralized search with (essentially) arbitrary population density, when link probability proportional to rank Generalization of lattice result (diff. from set systems).",
               "Punchline: LiveJournal friendships approximate 1/rank."
          ],
          "paper_id": "2176e0e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Algorithmic Models for Social Network Phenomena"
     },
     {
          "head": {
               "text": "Jon Kleinberg Algorithmic Models for Social Network Phenomena",
               "type": "modelling"
          },
          "paragraphs": [
               "LiveJournal: Rank-Based Friendship Generalization of lattice result (diff. from set systems).",
               "Punchline: LiveJournal friendships approximate 1/rank."
          ],
          "paper_id": "2176e0e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Algorithmic Models for Social Network Phenomena"
     },
     {
          "head": {
               "text": "Diffusion Curves",
               "type": "modelling"
          },
          "paragraphs": [
               "Basis for models: Probability of adopting new behavior depends on number of friends who have adopted. Prob. of adoption If we can \"seed\" the new behavior at k nodes, and want to maximize the eventual spread, whom should we choose?",
               "Computational complexity depends on diffusion curves. Highly inapproximable with critical mass. With diminishing returns: constant-factor approximation Jon Kleinberg Algorithmic Models for Social Network Phenomena"
          ],
          "paper_id": "2176e0e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Algorithmic Models for Social Network Phenomena"
     },
     {
          "head": {
               "text": "Diffusion Curves",
               "type": "modelling"
          },
          "paragraphs": [
               "Probability of joining a community when k friends are already members "
          ],
          "paper_id": "2176e0e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Algorithmic Models for Social Network Phenomena"
     },
     {
          "head": {
               "text": "Specifics of the Attack",
               "type": "modelling"
          },
          "paragraphs": [
               "First version of the attack: Create H on (2 +) log n nodes. Can compromise(log 2 n) targeted nodes. In experiments on 4.4 million-node LiveJournal graph, 7-node graph H can compromise 70 targeted nodes (and hence ? 2400 edge relations). Second version of the attack:",
               "Create H on clog n nodes. Can compromise ( 1 2 ?)clog n targeted nodes. Reconstruct from Gomory-Hu tree: break apart G along small cuts; find H as a \"contiguous\" piece. Passive attacks:",
               "In LiveJournal graph: with reasonable probability, you and 6 of your friends chosen at random can carry out the first attack, compromising about 10 users."
          ],
          "paper_id": "2176e0e0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Algorithmic Models for Social Network Phenomena"
     }
]