[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "1. INTRODUCTION"
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "2.2",
               "text": "Converting partitions to rankings",
               "type": "abstract"
          },
          "paragraphs": [
               "As noted before, a variety of Sybil defense schemes have been proposed, but each has been evaluated using different social networks and attack strategies by the Sybils. Therefore, it is not well understood how these different schemes compare against each other, or how a potential user of these schemes, such as a real-world social networking site, would select one scheme over another."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "2.1",
               "text": "The core of Sybil defense schemes",
               "type": "abstract"
          },
          "paragraphs": [
               "Even when viewing the schemes as graph partitioning algorithms, comparing the different Sybil defense schemes is not entirely straightforward. The output of each scheme depends on the setting of numerous parameters. At a high level, these parameters can be seen as making the partitioning between Sybils and non-Sybils either more restrictive or permissive, thereby trading false positives for false negatives. While the designers of the schemes offer rough guidelines Given the problem of comparing competing Sybil defense schemes, one approach would be to view the schemes as complete coherent proposals (i.e., treat them as black boxes, and compare them in real-world settings). Such an approach is straight-forward and would provide useful performance comparisons between a fixed configuration of schemes over a given set of social networks and attack strategies by the Sybils. However, it would not yield conclusive information on how a particular scheme would perform if either the given social network or the behavior of the attacker should change. It also does not allow us to derive any fundamental insights 1 Many Sybil defense schemes impose this requirement implicitly by assuming that the non-Sybil region of the network is fast mixing , meaning a random walk of length O(log N ) reaches a stationary distribution of nodes.  cause increasingly large partitions to be marked as Sybils, thereby inducing a ranking."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "text": "Algorithm",
               "type": "abstract"
          },
          "paragraphs": [
               "Ranking Cutoff Evaluation SybilGuard Non-Sybil region is fast mixing Random walk performed by each node Varying random walk length",
               "Whether or not walk intersection occurs Kleinberg network SybilLimit Non  for choosing the parameter values (e.g., set a parameter to O(log N ) where N is the number of network nodes), there can be considerable variation in the output from different parameter settings that follow the guidelines. Given the difficulty in selecting the right parameter settings, we would like to compare the schemes independent of the choice of their respective parameters.",
               "We studied the impact of changing parameters on the output of the Sybil and non-Sybil partitions. We observed that as the Sybil partition grows or shrinks in response to parameter changes, an ordering can be imposed on the nodes added or removed.",
               "2 That is, when the Sybil partition grows larger, new nodes are added to the partition without removing nodes previously classified as Sybils. Similarly, when the Sybil partition grows smaller, some nodes are removed from the partition without adding any nodes previously classified as non-Sybils. illustrates how different partitionings obtained by changing parameters can be converted into an ordering or ranking of nodes.",
               "Our observation suggests that one can view the Sybil defense schemes as implicitly ordering or ranking nodes in the network, while the parameter settings determine where the boundary between the partitions, called the cutoff point, lies. Changing the parameters slides the cutoff point along the ranking, but the resulting partitions uphold the observed ranking of nodes. Thus, we can compare the different schemes independently of their parameters by simply comparing their relative rankings of the nodes. the partitioning algorithm, how this partitioning induces a ranking of nodes, and how the algorithm parameters determine a cutoff. We also describe the assumptions the schemes make about their input environment (i.e., the structure of non-Sybil and Sybil topologies), and briefly describe the networks that these schemes were evaluated upon. A more detailed description of how these schemes map into our model is included in the Appendices.",
               "Although we only show how our model applies to four well-known schemes, we believe that it could be applied to other schemes as well. For example, a recent work proposes a Sybil-resilient distributed hash table routing protocol , by using social connections between users to build routing tables. The protocol relies on random walks much in the same manner as SybilGuard and SybilLimit, so we believe our analysis would apply to it as well. Similarly, Quercia et al. recently proposed a Sybil defense scheme that relies on a graph-theoretic metric called betweenness centrality to calculate the likelihood of a node being a Sybil. To apply our analysis, the centrality measure can be used directly to induce a ranking of the nodes."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "2.4",
               "text": "Rest of the paper",
               "type": "abstract"
          },
          "paragraphs": [
               "In this section, we have shown that existing Sybil defense schemes all work by inducing an implicit ranking of the nodes. We now take a closer look at these rankings, us-"
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "2.3",
               "text": "Reduction of existing schemes",
               "type": "abstract"
          },
          "paragraphs": [
               "We reduce each Sybil defense scheme into its component processes using the model presented in . At its core, each scheme contains an algorithm, which, given a trusted node and a network, produces a ranking of the nodes in the network relative to the trusted node. Then, depending on the setting of various parameter values, the scheme creates a cutoff, which is applied to the ranking and produces a Sybil/non-Sybil partitioning.",
               "The schemes that we examine in this paper are SybilGuard , SybilLimit , SybilInfer , and SumUp . For each of these Sybil defense schemes, identifies While we do not formally prove that all parameters of any Sybil defense scheme must induce an ordering, it is the case for all schemes, environments, and parameters we analyzed. Diagram showing the processes involved in a Sybil defense scheme. In brief, the scheme itself can be split into an algorithm, which when given a social network and a trusted node, produces a ranking. The parameters to the scheme are used to create a cutoff, which defines a Sybil/non-Sybil partitioning from the ranking. ing them to compare the schemes across a wide range of conditions. Our goal in the remaining sections is to better understand the ranking algorithms underlying existing Sybil defense schemes, and through this understanding, to provide a basis for answering the following questions:",
               "? Are the different Sybil defense schemes performing the core task of ranking nodes in the same way, or is each ranking unique? (Section 3)",
               "? Are there other (potentially better) ways to obtain these node rankings? (Section 4)",
               "The results of this experiment are shown in the top graph of . For clarity, we only show the mutual information between partitionings of SybilGuard and each of the other three schemes (the other pairs are similar). The x-axis denotes the size of the partition containing non-Sybils. For example, the x-axis value of 10 divides the ranking into two parts, one with the first 10 nodes in the ranking (marked as non-Sybils) and the other with the rest of the nodes (marked as Sybils). Thus, shows the mutual information between pairs of rankings at all possible cutoff points. shows that the mutual information metric is maximized at a partitioning of size 256. Interestingly, it falls off sharply before and after this cutoff value. To understand this plot better, we investigated the strong correlation between the different node rankings at the partitioning size of 256 and found that the 256 members that each scheme assigned to the non-Sybil partition strongly corresponded to the half of the network in that contained the trusted node. This indicates that all schemes are biased towards ranking nodes in the local community around the trusted node higher than nodes outside of the community. However, there is little correlation between the ordering of nodes within the community, or the nodes outside of it, as the mutual information is low between pairs of rankings before and after this point."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "3.1.2",
               "text": "The common factor behind the rankings",
               "type": "abstract"
          },
          "paragraphs": [
               "? What structural properties of the social network determine how well the schemes work? (Section 5.1)",
               "? Are the schemes robust against the different possible Sybil attack strategies? (Section 5.2)"
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "3.",
               "text": "RANKINGS AND SYBIL DEFENSE",
               "type": "abstract"
          },
          "paragraphs": [
               "In this section, we develop a better understanding of the process by which Sybil defense schemes compute node rankings by comparing the rankings of the different schemes.",
               "One hypothesis that could explain our above observations is that the nodes are being ranked such that nodes well connected to the trusted node are more likely to be higher in the rankings. Since there are several nodes within the local community of the trusted node that are equally well connected, the ranking amongst these nodes is not strictly enforced, i.e., the different schemes rank these nodes differently. Similarly, several nodes outside the local community are equally"
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "paragraphs": [
               "We start by examining the node rankings generated by the schemes when run over a synthetic network topology, taken from and shown in . In brief, this network is constructed using the Brabsi-Albert preferential attachment model , and then rewired 3 to have two densely connected communities of 256 nodes each, connected by a small number of edges. We randomly selected a node in one of the communities as the trusted node and calculated the node rankings on this synthetic network for the four Sybil defense schemes previously discussed. We then examined how closely the various rankings matched. To compare the rankings, we use mutual information , which measures the similarity of two partitionings of a set. In brief, mutual information ranges between 0 and 1, where 0 represents no correlation between the partitionings, and 1 represents a perfect match. Partition at Node Rank poorly connected and so their relative ranking is not consistent across the different Sybil schemes. However, there is a sharp distinction between the connectivity of nodes inside and outside the local community, and so the former are ranked before the latter.",
               "To confirm this hypothesis, we used a well known metric called conductance for determining how closely a subset of nodes within a network are connected among themselves relative to the rest of the network. Conductance is a widely used metric for evaluating the quality of communities within large networks. In brief, the conductance of a set of nodes ranges between 0 and 1, with lower numbers indicating stronger communities.",
               "We plot the conductance of the non-Sybil subset in the bottom of and notice that there is a sharp inflection point in the conductance at 256 nodes for all schemes. This corresponds to the boundary between the two communities in our synthetic network topology. Adding nodes from another community sharply increases the conductance, so all schemes assign higher rankings to nodes from within the community around the trusted node than to nodes from outside the community. This helps explain why the partitions obtained from the rankings match very well when the cutoff is set at the inflection point.",
               "As we can see in Figures 5 and 6, the mutual information reveals a local cutoff where all rankings have strong correlation, and this cutoff is also characterized by a low conductance value. Taken together, our experiments show that all Sybil defense schemes are identifying a local community that surrounds the trusted node, but that the ranking of nodes they use to reach the local community (and that they use after this point) is not strongly correlated."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "abstract"
          },
          "paragraphNo": 8,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "3.3",
               "text": "Summary of observations",
               "type": "conclusion"
          },
          "paragraphs": [
               "We now summarize the findings from our comparison of the way in which various algorithms rank nodes:",
               "? The ranking of nodes is biased towards those which decrease conductance. Thus, nodes that are tightly connected around a trusted node (i.e., those that form subsets with lower conductance) are more likely to be ranked higher.",
               "? When there are multiple nodes that are similarly well connected to the trusted node (i.e., they form subsets with similar conductance) they are often ordered differently in different algorithms."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "3.2",
               "text": "Rankings in real-world networks",
               "type": "conclusion"
          },
          "paragraphs": [
               "In this section, we verify that the results we found for our synthetic network also hold in real-world networks. First, we wish to check that nodes are ranked in a biased manner, such that nodes from the trusted node's local community rank higher than any other nodes. Second, we wish to test if the point at which all Sybil defense schemes agree corresponds to a trough in the conductance value, indicating the boundary of the community around the trusted node.",
               "To do show this, we repeat the experiment above for two real world networks: Facebook, consisting of the social network between Rice University graduate students taken from Facebook , and Astrophysics, consisting of the coauthorship network between astrophysicists . Details on these datasets are provided in .",
               "? When the trusted node is located in a densely connected community of nodes, with a clear boundary between this community and the rest of the network, the nodes in the local community around the trusted node are ranked before others."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "4.",
               "text": "APPLYING COMMUNITY DETECTION",
               "type": "conclusion"
          },
          "paragraphs": [
               "In the previous section, we observed that all Sybil defense schemes work by identifying nodes in the local community around a given trusted node and ranking them as more trustworthy than those outside. In this section, we examine whether algorithms that are explicitly designed to detect communities, called community detection algorithms , can be used for Sybil defense in the same manner as existing schemes. Our goal is to investigate the potential for leveraging existing literature in community detection to defend against Sybils. To this end, we first select an off-the-shelf community detection algorithm and generate a node ranking from the algorithm. We then compare its node ranking with those of existing Sybil defense schemes, to determine if it is able to defend against Sybils with similar accuracy."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "text": "Network Nodes Links",
               "type": "conclusion"
          },
          "paragraphs": [
               "Avg. degree YouTube 446,181 1,728,938 7.7 Astrophysicists 14,845 119,652 16 Advogato 5,264 43,027 16 Facebook 514 3,313 13 : Statistics of datasets used in our evaluation."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "4.1",
               "text": "Community detection",
               "type": "conclusion"
          },
          "paragraphs": [
               "Community detection in networks is a well studied and mature field. There are numerous approaches that use different mechanisms in order to detect communities and different metrics to evaluate the quality of communities. Below, we give a brief overview of how community detection schemes work.",
               "In this paper, we focus on local community detection schemes , which do not require a global view of the network. Most of the local approaches work by starting with one (or more ) seed nodes and greedily adding neighboring nodes until a sufficiently strong community is found. For example, Mislove's algorithm iteratively adds nodes that improve the the normalized conductance (a metric closely related to conductance) at each step, and stops when the conductance metric reaches an inflection point. For a detailed survey of local community detection algorithms, we refer the reader to the recent survey paper by Fortunato , which discusses numerous algorithms for community detection.",
               "As there is a large body of work on community detection, we could theoretically utilize any of these algorithms as the ranking algorithm. For the evaluation presented in this section, we selected Mislove's algorithm , but with the conductance metric from Section 3.1.2. We chose this algorithm as it is conceptually easy to understand, since it greedily minimizes conductance. However, our decision is not fundamental, and there may be other algorithms that perform better (especially since different community detection algorithms have been shown to perform better on different networks ). Rather, our goal here is simply to investigate how well off-the-shelf community detection algorithms are able to find Sybils.",
               "In order to use community detection to find Sybils, we need to generate a node ranking in the same manner as the other schemes. To do so, we run Mislove's community detection algorithm and record the node that it iteratively adds at each step to minimize conductance. Note that we modify the algorithm to not stop once a local trough is found; instead we allow it to continue running until all of the nodes have been added. This results in a node ranking that we can use to compare against the other schemes. scheme was proposed. This required us to split our evaluation results in two separate sections; one for SybilGuard, SybilLimit, and SybilInfer and another for SumUp. The split is necessary because SumUp was originally evaluated for its ability to limit the number of votes Sybil identities can place, and not for its ability to accurately detect Sybil nodes. Thus, the experimental settings for evaluating SumUp are quite different from those of the other schemes, necessitating a separate evaluation.",
               "A summary of the data sets that we use in the evaluation is shown in . In addition to the datasets from the previous section, we examine YouTube, consisting of the social network of users in YouTube , and Advogato, consisting of the trust network between free software developers."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "4.2.1",
               "text": "Measuring Sybil detection accuracy",
               "type": "conclusion"
          },
          "paragraphs": [
               "In order to measure the accuracy of the various schemes at identifying Sybils, we need a way to compute how often a scheme ranks Sybil nodes towards the bottom of the ranking. To do so, we use the metric Area under the Receiver Operating Characteristic (ROC) curve or A. In brief, this metric represents the probability that a Sybil defense scheme ranks a randomly selected Sybil node lower than a randomly selected non-Sybil node . Therefore, the Ametric takes on values between 0 and 1: A value of 0.5 represents a random ranking, with higher values indicating a better ranking and 1 representing a perfect non-Sybil/Sybil ranking. Values below 0.5 indicate an inverse ranking, or one where Sybils tend to be ranked higher than non-Sybils. A very useful property of this metric is that it is defined independent of the number of Sybil and non-Sybil nodes, as well as the cutoff value, so it is comparable across different experimental setups and schemes."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "4.2",
               "text": "Evaluating Sybil detection",
               "type": "experiment"
          },
          "paragraphs": [
               "We now evaluate the community detection algorithm against our existing Sybil defense schemes. When comparing against each of the Sybil defense schemes, we used experimental settings similar to those described in the paper in which the Our decision to focus on local community detection algorithms, as opposed to global ones, is due to the fact that they work in a similar manner as existing Sybil defense schemes by not assuming a global view. However, it has been shown that different global community detection algorithms have many of the same properties as local ones , indicating that our results would likely hold for global algorithms as well. We leave this to future work.",
               "For comparing SybilGuard, SybilLimit, and SybilInfer to the community detection algorithm, we use the same experimental methodology as the most recent proposal, SybilInfer. Specifically, we use a 1,000 node scale-free topology for the non-Sybil part of the network. Among this set of nonSybil nodes, a small fraction (10%) of the nodes are compromised by an adversary and become Sybil nodes. These 100 malicious nodes are chosen uniformly at random. These nodes then introduce additional Sybil identities into the network, which form a scale free topology among themselves using the same parameters as non-Sybil region. We vary the number of introduced nodes from 30 to 1,000, and average the results over 100 experimental runs.",
               "We present the results of this experiment in . We make two important observations: First, SybilInfer and community detection perform well, with improving accuracy as more Sybils are added. The reason for this increase is that the Sybil region becomes larger and, therefore, easier distinguish from the non-Sybil region. Second, both SybilGuard and SybilLimit perform less well than the other two schemes. This effect is because the number of Sybil nodes added is lower than the bound enforced by these two schemes, as was observed in the evaluation on SybilInfer . In more detail, the Sybil region is connected to the non-Sybil region by 789 attack edges on the average; SybilGuard and SybilLimit ensure that no more that O(log N ) nodes will be accepted per attack edge, where N is the number of nodes in the network. Since we only add a maximum of 1,000 Sybil nodes, neither of these schemes marks many nodes as Sybils.",
               "We now evaluate these schemes on a real-world social network. Specifically, we repeat this experiment on the Facebook graduate student network from before. This network has similar density as the synthetic network, but is only half the size. The results of this experiment are presented in . As we can see, the community detection algorithm performs favorably compared to the explicit Sybil defense schemes, and all become more accurate as more Sybils are added. A careful reader may note that the absolute accuracy of all schemes (community detection included) is significantly lower than that observed above in . The underlying reason for this lower performance is a structural characteristic of the Facebook network that makes it inherently harder to distinguish Sybils from non-Sybils. We explore this limitation in greater detail in Section 5.",
               "vote collector (i.e., the trusted node). In order to apply community detection, we replace the process that determines the voting envelope with a community detection algorithm, pick the community with the lowest conductance value to be the envelope, and unconditionally accept all votes from nodes within this envelope. For nodes outside the envelope, we assign all other links to have capacity one, and we collect their votes if they can find a path with weight to any node within the envelope. This difference is necessary since we don't assign weights to links within the envelope, as SumUp does.",
               "We evaluate and compare the community detection scheme against SumUp on three different datasets: Advogato, Astrophysics, and YouTube. We follow the same methodology used in the original SumUp evaluation : for each network, we inject 100 attack edges by inserting 10 Sybil nodes with links to 10 other uniformly randomly chosen non-Sybil nodes. In order to cast bogus votes, each Sybil node is further attached to a large number of Sybil identities by a single link each. As in the original evaluation, we randomly select a vote collector and randomly choose a subset of non-Sybils as voters. We plot the average statistics over five experimental runs for both SumUp and the community detection algorithm.",
               "To evaluate the accuracy of these schemes, we must define a new metric. This is because SumUp does not classify all nodes as Sybil or non-Sybil (needed for A), but rather, only those nodes which issue votes. Since subsets of both the nonSybil and Sybil nodes are issuing votes, ideally, the scheme would only count the non-Sybil votes. Thus, our metric should penalize the under counting of non-Sybil votes, as well as the counting of any Sybil votes. The metric we define, vote accuracy, is expressed as the number of non-Sybil votes counted divided by the sum of the number of non-Sybil votes issued and the number of Sybil votes counted. Vote accuracy ranges between 0 and 1, where higher values represent better performance. presents the results of this experiment, as we vary the number of non-Sybil voters (Sybils try to vote as "
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "text": "0.8",
               "type": "experiment"
          },
          "paragraphs": [
               "Recall that SumUp provides a Sybil-resilient voting service. To do so, SumUp defines a voting envelope wherein the links are assigned a capacity so that all votes from within the envelope can be collected. Outside this envelope, votes are only collected if the voter can find an path with capacity to the often as they can). The most salient result is that the accuracy for SumUp varies widely across the three networks; this is a direct result of using the envelope technique. In certain networks, one or more of the Sybil nodes is accepted into the envelope, and a large number of malicious votes are cast. The results for the community detection algorithm are significantly more stable, producing useful results once the number of non-Sybil voters rises above 1%."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "4.3",
               "text": "Implications",
               "type": "experiment"
          },
          "paragraphs": [
               "We began this section by observing that, since all Sybil defense schemes appeared to be identifying local communities, explicit community detection algorithms may be able to defend against Sybils as well. It is interesting to note-even without changing the experimental setup under which existing schemes were evaluated-our simple community detection algorithm gives comparable results to existing schemes.",
               "Our results have both positive and negative implications for future designers of Sybil defense schemes.",
               "On the positive side, our results demonstrate that there is a opportunity to leverage the large body of existing work on community detection algorithms for Sybil defense . Prior work on community detection provides a readily available source of sophisticated graph analysis algorithms around which researchers could improve existing schemes and design new approaches. On the negative side, relying on community detection for performing Sybil defense fundamentally limits the ability of these schemes to find Sybils in many real-world graphs. We explore these limitations in the next section. 5.1 Impact of social network structure"
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "5.",
               "text": "LIMITATIONS OF SYBIL DEFENSE",
               "type": "experiment"
          },
          "paragraphs": [
               "In the previous sections, we showed that Sybil defense schemes work by effectively identifying nodes within tightlyknit communities around a given trusted node as more trustworthy than those farther away. In this section, we investigate the limitations of relying on community structure of the social network to find Sybils. More specifically, we explore how the structure of the social network impacts the performance of Sybil defense schemes and how attackers with knowledge of the structure of the social network can leverage it to launch more efficient Sybil attacks.",
               "Since social network-based Sybil defense schemes use the structure of social networks to distinguish the Sybil nodes from the non-Sybil nodes, we begin by asking the following question: Are there networks where it is hard to tell these two types of nodes apart? In other words, could there be networks where the non-Sybil nodes look like Sybils or where it would be easy for Sybil nodes to masquerade as non-Sybils?",
               "Intuitively, one would expect networks where the nonSybil region is comprised of multiple, small, tightly-knit communities that are interconnected sparsely to be more vulnerable to Sybil attacks. In such networks, nodes within one community might mistake non-Sybil nodes in another community for Sybils, due to limited connectivity between the communities. Furthermore, an attacker can easily disguise Sybil nodes as just another community in the network by establishing a small number of carefully targeted links to the community containing the trusted node. Next, we verify this intuition using experiments over synthetic and real-world social networks where the non-Sybil nodes have different community structures and the Sybil nodes use different attack strategies.",
               "We first examine the sensitivity of Sybil defense schemes to the structure of the non-Sybil region. As in Sections 3 and 4, we analyze synthetic networks and then show that the results from these simple cases apply to real-world networks as well.",
               "We first generate a Brabsi-Albert random synthetic network with 512 nodes and initial degree m = 8. This results in a random power-law network with approximately 3,900 links, and without any community structure. We then iteratively generate a series of networks by rewiring five links in same manner as in Section 3 (resulting in a network), then rewiring five more links (resulting in another network), and so on, until only five links remain between the two communities of 256 nodes each (resulting in a final network). The output is a series of networks that all have the same number of nodes, number of links, and degree distribution, but are increasing in the level of community structure that they exhibit. gives a illustration of the initial, intermediate, and final networks.",
               "We use this series of networks to evaluate how well Sybil defense schemes perform on networks with increasing amounts of community structure. To do so, we treat each of these networks as the non-Sybil region, and we randomly attach a Sybil region of 256 nodes using 40 links. We then evaluate how well the existing schemes are able to detect Sybils by using the Ametric. The result of this experi- Figure 11: Accuracy of Sybil defense schemes on synthetic networks with increasing community structure induced by rewiring. With high levels of community structure, the accuracy of all schemes eventually falls to close to random."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "text": "Nodes",
               "type": "experiment"
          },
          "paragraphs": [
               "Links Modularity Facebook undergrad 1,208 43,043 0.278 Advogato 5,264 43,027 0.318 Wikipedia votes 7,066 100,736 0.350 URV email 1,133 5,451 0.504 Astrophysicists 14,845 119,652 0.621 Facebook grad 514 3,313 0.644 High-energy physics 8,638 24,806 0.690 Relativity 4,158 13,422 0.790 : Size and modularity of the real-world datasets used in our evaluation. We assume all the graphs to be undirected and use the largest connected component. ment for the final 16 networks are shown in . It can clearly be seen that the Sybil defense schemes perform much better in the networks with less community structure than in those with more community structure. In fact, when there is a high level of community structure, the Sybil defense schemes perform close to what would be expected with a random ranking (indicated by a Avalue of 0.5). Thus, the effectiveness of these schemes is very sensitive to the level of community structure present in the non-Sybil region of the network.",
               "Next, we examine whether this observation holds in realworld networks. To do so, we collected a set of real-world networks that have varying levels of community structure, shown in . In order to measure the level of community structure present in the networks, we use the wellknown metric modularity . In brief, modularity ranges between -1 and 1, with 0 representing no more community structure than a random graph. Strongly positive values indicate significant community structure and strongly negative values indicate less community structure than a random graph. As can be observed in the table, these eight networks have modularity value ranging from 0.28 to 0.79, indicating moderate to strong levels of community structure.",
               "We conducted a similar experiment to the one above, treating these networks as the non-Sybil region, attaching a Sybil region, and evaluating the accuracy of Sybil defense. However, since these networks are of very different scales, we created a power-law Sybil region for each network with onequarter the number of Sybils as there are non-Sybils, and attached these Sybil regions to the non-Sybils randomly with a number links equal to 5% of the links between non-Sybil nodes.",
               "The results of this experiment are shown in . We observe a clear trend: As the level of community structure increases, evidenced by increasing modularity, the performance of the Sybil defense schemes falls close to random. In fact, a correlation coefficient of -0.81 is observed between the modularity value and the Ametric, demonstrating that increasing levels of community structure are strongly anticorrelated with the ability to distinguish Sybils. This poor accuracy also corresponds well with recent work that has suggested that many real-world networks may not be as fast-mixing as was previously thought. Thus, as observed above for synthetic networks, Sybil defense schemes are extremely sensitive to the level of community structure present in real-world networks as well.  with various levels of community structure. Significantly worse performance is observed as the level of community structure increases."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 19,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "5.2",
               "text": "Resilience to targeted Sybil attacks",
               "type": "experiment"
          },
          "paragraphs": [
               "We now examine the sensitivity of Sybil defense schemes to Sybil attacks that leverage knowledge of the structure of the social network to establish links to a targeted subset of nodes in the network. Recall that all schemes assume that the Sybil nodes are allowed to create only a bounded number of links to non-Sybils. When evaluating the schemes, the authors of these schemes assume that the attacker establishes these links to random nodes in the network. We now explore how this one aspect of the attack model (random link placement to non-Sybils) can affect the performance of Sybil defense schemes by allowing the Sybils a level of control over where those links are placed. As before, we first examine the behavior using synthetic networks and then examine real-world networks.",
               "To create the synthetic network, we use the methodology from Section 5.1, with rewiring done until only 40 links remain between the two communities of 256 nodes each. We then create a series of scenarios where we increasingly allow the Sybils more control over where their links to non-Sybils are placed. Specifically, instead of requiring the Sybil links to be placed randomly over the entire non-Sybil region, we allow the Sybils to place these links randomly among the k nodes closest to the trusted node, where closeness is defined by the ranking given by the community detection algorithm used in Section 4. In all cases, the number of Sybil-to-nonSybil links remains the same. Thus, as k is reduced, the Sybils are allowed to target their links closer to the trusted node. We then calculate the accuracy of the Sybil defense schemes. An illustration of these networks is shown in . presents the results of this experiment. We see a decrease in accuracy as the Sybils are allowed to place their links closer to the trusted node. This is a result of the Sybil nodes being placed higher in the Sybil defense scheme's ranking, and therefore being less likely to be detected. From this simple experiment, it is clear that the performance of Sybil defense schemes is highly dependent on the attack model, depending (for example) on not just upon the number of links the attacker can form, but on how well those links can be targeted.",
               "We then repeat the same experiment using the Facebook graduate student network. The results of this experiment are shown in , and are even more striking than the previous experiment. As the attackers are allowed more control over link placement (i.e., as k is reduced), the accuracy first falls to no better than random, before dropping significantly below 0.5. This indicates that the Sybil defense schemes are ranking Sybils significantly higher than nonSybils, meaning the schemes are admitting Sybils and blocking non-Sybils. The reason for this is the strong community structure present in the Facebook network combined with the stronger attack model: as the Sybils target their links more carefully, they appear as part of the trusted node's local community and are therefore more highly ranked.  : Accuracy of Sybil defense schemes on the Facebook network when Sybils are allowed to target their links among the closest k nodes to the trusted node. As the Sybils place their links closer, all schemes begin ranking Sybil nodes higher than non-Sybils (as evidenced by the Abelow 0.5)."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 20,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "5.3",
               "text": "Implications",
               "type": "experiment"
          },
          "paragraphs": [
               "vate the need for Sybil defense schemes to be evaluated on a wider range of social networks and attack models. Our findings also point to a need to develop Sybil defense schemes that work by leveraging different network features (or additional information beyond the network structure) than existing schemes, allowing Sybil defense to be effective where now it is not.",
               "In this section, we explored how the performance of Sybil defense schemes is affected by the structure of the social network and by the ability of the attacker to exploit the structure of the social network to launch targeted attacks. Based on our understanding of how Sybil defense schemes work, we hypothesized that networks with well-defined community structure would be more vulnerable to Sybil attacks. We verified our hypothesis by demonstrating that, as the non-Sybil region contains more significant community structure, the detection accuracy of all schemes falls significantly and the schemes are vulnerable to targeted Sybil attacks. Our analysis reveals fundamental limitations of existing Sybil defense schemes that arise out of their reliance on community structure in the network. Our list of limitations is by no means exhaustive; other vulnerabilities of relying on community detection exist. For example, a recent study has shown that identifying communities reliably in a wide range of real-world networks is a notoriously difficult task .",
               "We hope that, by pointing out these limitations, we moti- In this paper, we have taken the first steps towards developing a deeper understanding of how the numerous proposed social network-based Sybil defense schemes work. We found that, despite their considerable differences, all Sybil defense schemes rely on identifying communities in the social network. Unfortunately, we also discovered that this reliance on community detection makes the schemes fundamentally vulnerable to Sybil attacks when operating over networks where the non-Sybil nodes form strong communities."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 21,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "6.",
               "text": "CONCLUDING DISCUSSION",
               "type": "experiment"
          },
          "paragraphs": [
               "In light of these negative results, we look for alternative approaches to Sybil defense that could be deployed in practice. In this section, we first focus our discussion on additional challenges that arise when deploying social networkbased Sybil defense schemes in practice. We then discuss two ways to improve Sybil defenses moving forward. We present our discussion points as questions and answers. Are links in social networks hard to form? All the Sybil defense schemes discussed in this paper make the assumption that Sybils can only form a certain number of links to non-Sybils. However, it remains an open question whether this is true in any online social network of today; it is clear that, at least in some social networks, the assumption does not hold . Are Sybils necessarily bad? In all of the Sybil defense schemes, it is assumed that the presence of Sybils is evidence of misbehavior, and as such, no non-Sybil should interact with a Sybil. However, there are legitimate reasons why a user might wish to create multiple identities. For example, users may wish to partition their identity into one that is used to interact with co-workers, and another that is used to interact with friends and family (e.g., the multiple email addresses that many people use today). Users posting videos to YouTube may wish to post under pseudonyms in order to avoid revealing their real-world identity while still using a personal account to rate videos and post comments.",
               "Since the mere presence of users with multiple accounts is not necessarily indicative of misbehavior, what we should be concerned with is not necessarily the presence of Sybils, but, rather, the use of Sybils for misbehavior. Detecting Sybils and simply excluding them from a system is only one particularly draconian way of accomplishing this."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 22,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "n": "7.",
               "text": "REFERENCES",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Should Sybil defenses move towards Sybil tolerance? Instead of explicitly identifying Sybils like SybilGuard, SybilLimit, and SybilInfer, a system could aim to instead just prevent Sybils from gaining access to extra privileges. SumUp, for example, attempts to limit the votes coming from Sybil nodes by limiting the effect of votes from potential Sybil regions. Instead of explicitly identifying nodes, the protocol seeks to limit their ability to disproportionally affect the resulting vote count. As a result, the system does not try to prevent users from creating multiple identities, but rather, ensures that by doing so, they are unable to gain any additional privileges. We believe that building Sybil tolerance into applications may require more effort, and is clearly less general than identifying Sybils, but allows application designers to sidestep the arms race of locating Sybils in the social network."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 23,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "text": "Should Sybil defenses leverage more information?",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Given the inherent limitations of relying solely on the social network in order to defend against Sybils, an attractive way to improve on these schemes is to give Sybil defense schemes additional information. As a simple example, suppose a Sybil defense scheme were given a list of nodes, one in each of the different communities within the network, who were either known to be Sybils, or known to be non-Sybils. In this case, it is clear that this additional information could be used by community detection algorithms to accurately differentiate between communities containing Sybil and nonSybil nodes. In contrast, current Sybil defense schemes are given only a single trusted node as input and consequently, they perform poorly.",
               "As another example, recent work has suggested that activity between users may be a better predictor of the strength of the social link between them . These studies indicate that even in networks where users accept friend requests from arbitrary sources, users engage in shared activity (e.g., exchanging messages) with only a limited subset of their friends. Thus, having additional information about user activity could help weed out weak social connections, including links from Sybil nodes.",
               "Finally, for all of the work that has focused on social network-based Sybil defenses, it is unclear how far we are from having these ideas applied to actual deployed systems. However, as digital identities become more important, it is clear that the potential for fraud, deception, and other misbehavior will increase, thereby necessitating Sybil defenses. Understanding the benefits, limitations, and tradeoffs associated with alternative approaches to Sybil defense is an important step towards making this happen. makes the same assumptions about the network as SybilGuard. Partitioning algorithm: SybilLimit performs O(m) independent random walks of length O(log n) from each node. Two conditions must be satisfied for the trusted node to mark a suspect as a non-Sybil. The first condition-called the intersection condition-requires that the last edge of one of the random walks of the trusted node and the suspect must intersect. The second condition-called the balance condition-limits the number of non-Sybils per attack edge. Each tail of a random walk is assigned a \"load\" that is not allowed to exceed a given threshold; the load is incremented each time the trusted node marks another suspect as a nonSybil. Node ranking by partitioning algorithm: SybilLimit has two primary parameters for controlling the number of nodes marked as non-Sybil in the network-the number of random walks from each node and the length of these walks. As these parameters are increased, greater numbers of nodes are marked as non-Sybil. Similar to SybilGuard, we infer a ranking based on the order in which nodes are marked as non-Sybil. Determining cutoff: Similar to SybilGuard, SybilLimit relies on an estimation procedure to find length of random walk and the number of random walk required. These two parameters impose a cutoff."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 24,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "text": "APPENDIX A. ANALYSIS OF SYBILGUARD",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Assumed social network topology: SybilGuard assumes that the non-Sybil region is fast mixing , meaning that after O(log n) hops (where n is the number of nonSybils), the probability distribution of the last node on a random walk reaches the stationary distribution. SybilGuard assumes that the entire network (the Sybil region combined with the non-Sybil region) is not fast mixing. Partitioning algorithm: SybilGuard uses constrained random walk for marking nodes as non-Sybil or Sybil. It marks a suspect node as non-Sybil if the random walk from the trusted node and the suspect intersect, otherwise the suspect is marked as a Sybil. Node ranking by partitioning algorithm: In order to generate a ranking, we conduct random walks from the trusted node. We start with a walk length 1 and increase it to k, where k is the length of the random walk such that all nodes in the network are marked as non-Sybil. The order in which nodes are marked as non-Sybil in these increasingly long random walks imposes a ranking. In the rare case when all the nodes in the network are not marked as nonSybil using a single random seed and a long walk length, we conduct a series of random walks with different random seeds to induce a ranking for the remaining nodes. Determining cutoff: SybilGuard uses O(n log n) random walks to gather samples from the non-Sybil region of n nodes. For a social network with O(log n) mixing time, based on the birthday paradox, two non-Sybil nodes withn samples from the non-Sybil region will have an intersection with high probability. SybilGuard relies on an estimation procedure for determining the appropriate length of the random walk, and consequently, the cutoff value.",
               "Assumed social network topology: SybilInfer makes the same assumption as SybilGuard. SybilInfer also makes a further assumption that the modified random walks are fast mixing in real social networks. Partitioning algorithm: SybilInfer performs multiple random walks from each node to sample nodes from the non-Sybil region. It further uses a Bayesian inference technique to determine the probability of any node in the system being marked as non-Sybil. Node ranking by partitioning algorithm: Since SybilInfer assigns each node a probability of being a non-Sybil, the nodes can be ranked based on this probability. We conduct 30 runs of SybilInfer with different random seeds, and use the average probability over all the runs to determine the final ranking of the nodes. Determining cutoff: SybilInfer partitions the nodes based on a threshold value for the probability of a node being nonSybil."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 25,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "text": "D. ANALYSIS OF SUMUP",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Assumed social network topology: SumUp assumes that the min-cut between the vote collector (i.e., the trusted node) and non-Sybil nodes occurs at the collector, and that the min-cut between Sybils and the non-Sybils occurs at the attack edges. Partitioning algorithm: SumUp partitions nodes based on whether their vote is accepted or not. Nodes whose votes are accepted are treated as non-Sybils, whereas nodes whose votes are subject to capacity constraints are treated as Sybils. Node ranking by partitioning algorithm: SumUp decides whether a vote will be collected or not by defining a voting envelope within which all votes are collected and outside of which votes are constrained to one per link out of the envelope. The size of the voting envelope is controlled by the parameter Cmax, which is the maximum number of votes that can be collected by the trusted node. In order to rank nodes, we increase Cmax from 1 to k, where k is the value for which the voting envelope contains the entire network. The order in which these nodes are added to the voting envelope induces a ranking. Determining cutoff: Cmax determines the size of the voting envelope and serves as the cut-off parameter."
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 26,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     },
     {
          "head": {
               "text": "B. ANALYSIS OF SYBILLIMIT",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Assumed social network topology: SybilLimit "
          ],
          "paper_id": "217dbeb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 27,
          "fromPaper": "An Analysis of Social Network-Based Sybil Defenses"
     }
]