[
     {
          "head": {
               "text": "Figure 1: Explicit and Implicit Social Relationships",
               "type": "introduction"
          },
          "paragraphs": [
               "The remainder of this paper is organized as follows. Section 2 introduces previous methods that are related to this work. Section 3 details one popular matrix factorization method in the literature. Section 4 presents how to incorporate implicit social information. The results of an empirical analysis are presented in Section 5, followed by the conclusion in Section 6."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "2.",
               "text": "RELATED WORK",
               "type": "relatedwork"
          },
          "paragraphs": [
               "that was launched in 2005). Lacking of social recommendation data greatly limits the impact and utilization of social recommendation methods.",
               "Fortunately, in case that we do not have explicit social information, we can always compute a set of implicit social information for each user. We summarize the relationships between users' explicit social information and implicit social information in a toy example illustrated in . In this figure, users within the blue solid circle represent explicit social connections of user ui, while users within the purple dashed circle represent this user's implicit social information, which is calculated using some similarity metrics.",
               "Thus, in this paper, based on the example shown in , we are interested in exploring the following two research problems:",
               "In this section, we review several popular approaches for recommender systems in the literature, including: (1) traditional recommender systems, especially matrix factorization based methods, and (2) social recommendation methods."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "2.1",
               "text": "Traditional Recommender Systems",
               "type": "relatedwork"
          },
          "paragraphs": [
               "1. Can we take advantages of implicit social information in case we do not have explicit social connection information?",
               "2. When the explicit social information is available, can the performance of using implicit social information outperform that of using explicit social information?",
               "In order to answer the questions, in this paper, we conduct comprehensive experiments on three datasets: the MovieLens and EachMovie datasets, which do not have explicit social information, as well as the Douban dataset, which has a social network in addition to the user-item rating matrix. Based on our analysis, we have the following conclusions:",
               "? When explicit social information is unavailable: -In the absence of explicit user social information, we find that using implicit user social information (i.e., the most similar users), can also improve the recommendation qualities under the matrix factorization framework.",
               "-Besides the most similar users, for each user, the list of most dissimilar users is another ideal source to further improve recommender systems.",
               "-We extend the idea of computing implicit user social information, and conclude that the implicit Traditional recommender systems normally only utilize the user-item rating information for recommendation. One of the the most popular techniques in recommender systems is collaborative filtering.",
               "Typically, collaborative filtering approaches include two types of methods: memory-based methods as well as modelbased approaches. Memory-based methods focus on using predefined similarity calculation functions to find similar users or items for generating predictions. Memory-based methods can be further classified as user-based and item-based approaches ] based on whether similar users or similar items are used.",
               "In contrast to the memory-based methods, the modelbased approaches use the observed ratings to train a predefined learning model. The ratings are then predicted via the trained model instead of directly manipulating the original rating database as the memory-based approaches . Algorithms in this category include but not limited to clustering model , the aspect models , the Bayesian hierarchical model , the ranking model , etc. Hofmann in proposed an algorithm based on a generalization of probabilistic latent semantic analysis to continuous-valued response variables. Kohrs et al. presented an algorithm for collaborative filtering based on hierarchical clustering, which tried to balance both robustness and accuracy of predictions, especially when few data were available. Recently, due to the effectiveness and efficiency in dealing with very large user-item rating matrices, several low-dimensional matrix factorization techniques have been proposed.",
               "Matrix factorization methods in recommender systems normally seek to factorize the user-item rating matrix into two low rank user-specific and item-specific matrices, and then utilize the factorized matrices to make further predictions. Low-rank matrix approximations based on minimizing the sum-squared errors can be easily solved using Singular Value Decomposition (SVD), and a simple and efficient Expectation Maximization (EM) algorithm for solving weighted lowrank approximation is proposed in . In , Srebro et al. proposed a matrix factorization method to constrain the norms of U and V instead of their dimensionality. Salakhutdinov et al. presented a probabilistic linear model with Gaussian observation noise in . The user and item latent factors can be learned by maximize the proposed probabilistic likelyhood function. The proposed method is very effective and efficient, and this method is essentially equivalent to the Regularized SVD method. In their following work proposed in , Salakhutdinov et al. placed the GaussianWishart priors on the user and item hyperparameters, which can further improve the prediction accuracy. More recently, proposed several enhanced matrix factorization methods which illustrate promising results by incorporating heterogeneous information. In , the authors discussed the possibility to improve recommender systems using neighborhood information, which is quite related to our work. However, in this paper, we focus on very different aspect of recommender system, i.e., social recommendation. Moreover, we provide many additional insights that previous work ignored.",
               "in the research of recommender systems, their utilities are limited since these methods require using explicit user social information, which is not always available in most of the recommender systems. In , the idea of using implicit information is briefly introduced, however, many interesting problems are left unattended. In this paper, we present an comprehensive experimental study on implicit social recommendation which provides many useful insights to current social recommendation techniques."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "3.",
               "text": "MATRIX FACTORIZATION",
               "type": "relatedwork"
          },
          "paragraphs": [
               "In this subsection, we review one popular matrix factorization method that is widely studied in the literature.",
               "Considering an mn matrix R describing m users' ratings on n items, a low-rank matrix factorization approach seeks to approximate the frequency matrix R by a multiplication",
               "The matrix R in the real-world is usually very sparse since most of the users only visited a few Web sites. Traditionally, the Regularized Singular Value Decomposition (RSVD) method is employed to estimate a matrix R by minimizing"
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "2.2",
               "text": "Social Recommendation",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The above mentioned traditional recommendation techniques are all based on working on the user-item rating matrix, and ignore the abundant relationships among users. Recently, due to the prevalence of Web 2.0 social networking sites, many researchers have started studying social recommender systems . Due to the nature of each method, the social recommendation techniques can also be classified into two types: memorybased and model-based .",
               "The memory-based methods normally directly or indirectly use the degree of social trust to represent the similarity between two users. In , a trust-aware method for recommender system is proposed. In this work, the collaborative filtering process is replaced by the reputation of users, which is computed by propagating trust. The degrees of trust are calculated to replace the similarity value between two users. The experiments on a large social recommendation dataset -Epinions, show that this work increases the coverage (number of ratings that are predictable) while not decreasing the accuracy (the error of predictions). In , two trust-aware methods are proposed to improve standard collaborative filtering methods. The experimental results indicate that the user trust information can help improve recommendation quality.",
               "More recently, by taking advantages of the effectiveness and efficiency of matrix factorization framework, several novel model-based methods have been proposed to enhance traditional matrix factorization methods by incorporating user social information. In , two Social Regularization methods have been proposed by constraining the matrix factorization objective function with user social regularization terms. Different with previous methods, the proposed methods are very general, they not only work with user trust relationships, but also perform well with user social friend relationships. The experimental analysis indicates that the proposed framework outperforms other state-of-the-art methods.",
               "Although the aforementioned matrix factorization based social recommendation methods move a nice step forward",
               "where ui and vj are column vectors with d values, Iij is the indicator function that is equal to 1 if user i rated item j and equal to 0 otherwise, and1,2 represent the regularization parameters. The optimization problem in Equation 1 minimizes the sum-of-squared-errors objective function with quadratic regularization terms. By adopting a simple stochastic gradient descent technique, for each observed rating rij, we have the following efficient updating rules to learn latent variables ui, vj :",
               "where ?ij = rij ? u T i vj, and1,2 are the learning rates.",
               "The Regularized SVD algorithm introduced in this section is both effective and efficient in solving the collaborative filtering problem and it is perhaps one of the most popular methods in collaborative filtering. In this paper, we use this approach as the baseline method."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "4.",
               "text": "INCORPORATING IMPLICIT SOCIAL IN-FORMATION",
               "type": "relatedwork"
          },
          "paragraphs": [
               "In this section, we first introduce a matrix factorizationbased social recommendation method proposed in the literature. Then we illustrate how to leverage the implicit user social information in the case that explicit user social information is not available. Finally, we demonstrate how to utilize dissimilar users as well as item social information to further improve recommender systems.",
               "Note that the main focus of this paper is designing a scientific experimental study to explore several interesting research problems by borrowing and extending previous social recommendation techniques. Developing brand new social recommendation techniques is out of the scope of this paper. Also, we will only briefly describe the techniques if they are borrowed from previous work.",
               "we adopt the most popular approach Pearson Correlation Coefficient (PCC) , which is defined as:"
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "4.1",
               "text": "Social Regularization",
               "type": "relatedwork"
          },
          "paragraphs": [
               "In , in order to model the social recommendation problems more accurately, a general social recommendation approach, Social Regularization (SR), is proposed.",
               "The objective function of this approach is formulated as:",
               "whereis the regularization parameter, s if indicates the similarity between user i and user f , and F + (i) represents user i's outlink friends.",
               "In this method, the social network information is employed in designing the social regularization term to constrain the matrix factorization objective function. The social regularization term also indirectly models the propagation of tastes. More specifically, if user i has a friend f and user f has a friend user g, this regularization term actually indirectly minimizes the distance between latent vectors ui and ug. The propagation of tastes will reach a harmonic status once the learning is converged.",
               "Similarly, for each observed rating rij , we have the following stochastic gradient descent updating rules to learn the latent parameters:",
               "where I(i) is a set of items that rated by user i, and ri represents the average rate of user i. From this definition, user similarity s if is ranging from , and a larger value means users i and f are more similar. We employ a mapping function f (x) = (x + 1)/2 to bound the range of PCC similarities into .",
               "Based on the PCC similarity, the computed Top-N similar users can then be injected into the objective function detailed in Equation 3."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "4.3",
               "text": "Dissimilar Users",
               "type": "relatedwork"
          },
          "paragraphs": [
               "So far in this paper, we only consider utilizing similar users to improve recommender systems. In the social regularization term",
               "F employed in Equation 3, if user i is similar to user f , the distance between latent vectors ui and u f will become closer since the similarity s if is a relatively large value.",
               "Motivated by the similar users, we can actually endow the social regularization term more modeling power if we also include the most dissimilar users. If user i is dissimilar with user f , the ideal property we want is to make the distance between ui and u f larger or in other words, maximize the distance between them. Inspired by the work in , we can easily achieve this property by turning the similarity s if = ?s if . Hence, in this case, the social regularization term",
               "where",
               "and F ? (i) represents user i's inlink friends."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "4.2",
               "text": "Implicit User Social Relationships",
               "type": "relatedwork"
          },
          "paragraphs": [
               "F will actually lead to make the distance between ui and u f larger. This is an ideal property we desire to include those dissimilar users.",
               "Hence, in this paper, in addition to the Top-N similar users, we also include the Top-N dissimilar users for each user. This will not change the objective function mentioned in Equation 3. It will only increase the size of the implicit social neighbors specified in the set F + (i) and change the signs of the similarity values for dissimilar users.",
               "As mentioned in Section 1, all the social recommendation approaches need to utilize the additional explicit user social information, which may limit the impact and utilization of these approaches. In this section, we seek an alterative way to compute implicit user social information once the explicit user social relationships are unavailable.",
               "The essence of social recommendation approaches lies in the additional explicit social information of each user. The information of these social friends can then be utilized to help model a user's taste more accurately. In the case of missing explicit social information, as shown in , we can always compute another set of Top-N similar users and then plug in those similar users to the aforementioned social recommendation matrix factorization framework.",
               "There are several methods we can borrow in the literature to compare the similarity between two users. In this paper,"
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "4.4",
               "text": "Item Social Relationships",
               "type": "relatedwork"
          },
          "paragraphs": [
               "In the original social recommendation problems, there are only social relationships among users due to the reason that normally, social network only refers to the social relationships between people.",
               "In this paper, since we define the implicit user social information as the similar or dissimilar users, we can naturally extend this idea to also take advantages of the implicit item social information, which can be found through the similar or dissimilar items.",
               "The Social Regularization method described in Section 4.1 is a very general approach, and it can be easily extended to incorporate the item social information. The objective function can be formulated as:",
               "For every observed rating rij , we have the following stochastic updating rules to learn the all the latent parameters:",
               "where Q + (j) represents item j's implicit social information (i.e., the Top-N items similar to item j and the Top-N items dissimilar to item j).",
               "The similarity between item j and item q can be calculated by the item-based PCC method:",
               "The unified model is constrained by four types of information: similar user regularization, dissimilar user regularization, similar item regularization and dissimilar item regularization. We use the aforementioned information to help better shape the user and item latent spaces, hence generate more accurate recommendation results."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "5.",
               "text": "EXPERIMENTAL ANALYSIS",
               "type": "experiment"
          },
          "paragraphs": [
               "where U (j) denotes a set of users that rated item j.",
               "Similarly, we have the following updating rules to learn the latent parameters:",
               "In this section, we conduct several experiments to compare different recommendation methods using implicit social information. Our experiments are intended to address the following questions:",
               "? When explicit social information is unavailable:",
               "1. Is implicit user social information effective in improving traditional matrix factorization methods?",
               "2. Can dissimilar users be used to further improve the recommendation quality?",
               "where 3. Can we also take advantages of implicit item social information in addition to the implicit user social information?",
               "4. What is the performance comparison on users with different observed ratings?",
               "? When explicit social information is available:"
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "4.5",
               "text": "A Unified Model",
               "type": "modelling"
          },
          "paragraphs": [
               "From Section 4.2 to Section 4.4, we demonstrate how to utilize implicit user social information, dissimilar users, and item social information, respectively. We can then design the following integrated model to take into account all the possible information that will potentially benefit the recommender systems:",
               "1. Can the performance of using implicit social information outperform that of using explicit social information?",
               "We use the popular Mean Absolute Error (MAE) and Root Mean Square Error (RMSE) metrics to measure the prediction quality of all the mentioned algorithms. MAE is defined as:",
               "U,V 1 2",
               "where rij denotes the rating user i gave to item j, rij denotes the related predicted rating, and N denotes the number of tested ratings. RMSE is defined as:",
               "j=1",
               "From the definitions, we can see that a smaller MAE or RMSE indicates a better performance. 7. SRi+?: this is the Social Regularization method using both implicit similar and dissimilar item information."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "8.",
               "text": "SR",
               "type": "modelling"
          },
          "paragraphs": [
               "u+? i+? : this is the final integrated model that using similar and dissimilar user information as well as similar and dissimilar item information. "
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "text": "Data Preparation.",
               "type": "modelling"
          },
          "paragraphs": [
               "For all the experiments conducted in this section, we utilize 80% as training data in both datasets. Training data 80%, for example, means we randomly select 80% of the ratings from the MovieLens or the EachMovie dataset as the training data to predict the remaining 20% of ratings."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "5.1",
               "text": "Without Explicit Social Information",
               "type": "modelling"
          },
          "paragraphs": [
               "Top-N Neighbors Generation."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "5.1.1",
               "text": "Description of Datasets",
               "type": "experiment"
          },
          "paragraphs": [
               "When the explicit social information is not available, we evaluate all the algorithms on two popular datasets: MovieLens 1 and EachMovie 2 . The MovieLens dataset we adopt in this paper is a relatively small dataset contains 100,000 user-item ratings (scale from 1 to 5) rated by 943 users on 1,642 items. The EachMovie data set is a relatively large dataset includes 74,424 users, 1,648 movies, and 2,811,718 ratings in the range from 0 to 5.",
               "Other statistics of these two datasets are summarized in , respectively.",
               "The methods we study in this paper also involve the calculation of the Top-N similar and Top-N dissimilar users or items. We adopt the following rules to generate Top-N similar and dissimilar users or items. In order to reduce the noises when computing the similarities using PCC method between two users i and f , we require that user i and user f should at least co-rated 10 items, otherwise, we will ignore user f when computing user i's Top-N similar or dissimilar neighbors, and vice versa. Furthermore, for all the similar neighbors, the similarity between two users should be greater than 0.75, while for all the dissimilar neighbors, the similarity between two users should be less than 0.25. The same rules are also adopted when calculating similar and dissimilar items."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "5.1.2",
               "text": "Performance Analysis",
               "type": "experiment"
          },
          "paragraphs": [
               "Parameter Settings.",
               "In this section, we will compare the following different methods described in this paper as well as some baseline methods.",
               "In order to fairly compare every method, we employ similar parameter settings for those common parameters adopted in all the approaches. In this paper, for RSVD, SR u+ , SR u+? , SRi+, SRi+? and SR u+?",
               "1. UserMean: this is a baseline method uses the mean value of every user to predict the missing values.",
               "2. ItemMean: this is a baseline method utilizes the mean value of every item to predict the missing values.",
               "i+? , we use the setting1 =2 = 0.01. At the same time, all the learning rates1 and2 are set to 0.005. For all the Social Regularization based methods,andare set to 0.015 in the MovieLens dataset, while in the EachMovie dataset, they are set to 0.001."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "text": "Performance Analysis.",
               "type": "experiment"
          },
          "paragraphs": [
               "3. RSVD: this is the Regularized SVD method. It is equivalent with the method proposed by Salakhutdinov and Minh in . The underlining distribution is assumed as Gaussian distribution. The details of this method are also introduced in Section 3.",
               "The experimental results using 10 and 50 dimensions to represent the latent factors in two different datasets are shown in , respectively. The percentages in the results are the improvements of our SR u+? 4. SR u+ : this is the Social Regularization method using implicit similar user information. The notation u in the superscript denotes that implicit user social information is used in this method, while the notation \"+\" indicates only similar users are included.",
               "i+? method over the corresponding approaches. In all our methods, the number of implicit user or item social neighbors are set to 10.",
               "The following summarizes the key conclusions we observe from the results:"
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "5.",
               "text": "SR",
               "type": "experiment"
          },
          "paragraphs": [
               "u+? : this is the Social Regularization method using both implicit similar and dissimilar user information. The notation \"?\" indicates dissimilar information is included.",
               "? We first notice that approach SR u+ outperforms the RSVD method, which only utilizes the user-item rating matrix. This observation coincides with our intuition that, at the absence of the explicit user social network, employing implicit user social information can help increase the recommendation quality.",
               "6. SRi+: this is the Social Regularization method using implicit similar item information. We use the subscript to describe item related information.",
               "? Secondly, besides the implicit user social information, the implicit item social information can also be used to improve the recommendation quality, as demonstrated by the method SRi+. Among SR u+ and SRi+, we observe that SRi+ generates better results than SR  items is probably more accurate than the calculation based on users.",
               "? Thirdly, another key observation we find through the experiments is that dissimilar user or item information can be used to further improve the recommender systems, as presented by the approaches SR u+? and SRi+?. They generate slightly better results than SR ? Fourthly, an integrated model SR u+? i+? demonstrates the best performance by incorporating all the useful implicit social information, including similar and dissimilar users as well as similar and dissimilar items. In general, the experimental results not only prove the effectiveness of incorporating implicit social information, but also demonstrate the flexibility of social regularization framework. In order to analyze the experiments thoroughly, in this section, we evaluate how different methods perform on different users based on how many ratings the users rated in the training datasets. We first group all the users in the training datasets based on the number of observed ratings, and then measure the prediction accuracies of different user groups. The experimental results conducted in both MovieLens and EachMovie datasets are illustrated in and The Douban dataset we study in this paper contains 129,490 unique users and 58,541 unique movies with 16,830,839 movie ratings. As to the social friend network, the total number of friend links between users is 1,692,952. The statistics of the Douban user-item rating matrix and social friend network are summarized in , respectively."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "5.2.2",
               "text": "Performance Analysis",
               "type": "experiment"
          },
          "paragraphs": [
               "We compare the following three methods using Douban datasets:",
               "1. SRexp: this is the social regularization method described in Equation 3, which utilizes the explicit social information in improving recommender systems.",
               "u+? i+? with implicit social information consistently outperforms the RSVD method in all the user groups. We also notice an interesting phenomenon, that is, the method SR u+? i+? performs much better than RSVD when more ratings are observed. Actually, when more ratings are observed for a user, the similarity calculation process will find more accurate similar or dissimilar neighbors for this user since we have more information to represent or interpret this user. Hence, it will perform better than RSVD especially when more ratings are observed.",
               "2. SRimp: this is the social regularization method that uses the implicit social information. Suppose that user ui has n explicit social connections in the Douban dataset, then we will choose the most similar n users as the implicit social connections in this method. This setting is employed to fairly compare the method SRimp with SRexp.",
               "3. SR top10"
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 19,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "5.2",
               "text": "With Explicit Social Information",
               "type": "experiment"
          },
          "paragraphs": [
               "imp : this is also a social regularization method uses implicit social information. Different with SRimp, for each user, we use the top-10 most similar users as the implicit connections."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 20,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "5.2.1",
               "text": "Description of Dataset",
               "type": "experiment"
          },
          "paragraphs": [
               "We use the Douban 3 dataset in this subsection since in addition to the user-item rating matrix, it also contains a social friend network between users.",
               "Douban is a Chinese Web 2.0 Web site providing user rating, review and recommendation services for movies, books and music. Users can assign 5-scale integer ratings (from 1 to 5) to movies, books and music. It also provides Facebooklike social networking services, which allows users to find 3 http://www.douban.com All the parameters of the above three methods are identical for fairly comparison.",
               "The results are summarized in . In this table, we evaluate three methods using different percentages of training data, i.e., 40% and 60%. From the results, we surprisedly find that for all the settings, the SRexp method performs slightly better than both SRimp and SR top10 imp approaches, which indicates that in recommender systems, using user-established explicit social connections are better than computer-generated implicit social information.",
               "In order to find out why using explicit social connections is more effective, we conduct the consistence analysis on very general matrix factorization framework is employed to incorporate different implicit social information. The experimental analysis suggests that similar user information, dissimilar user information, similar item information and dissimilar item information can be effectively used to improve recommender systems. Our work not only provides in-depth insights to social recommendation techniques, but also will greatly extend the impact of previous and upcoming social recommendation approaches. In order to answer the above questions, we evaluate the consistences based on the following metric, i.e., Root Mean Square Distance (RMSD). The definitions of user i are:"
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 21,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "7.",
               "text": "REFERENCES",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "where s ik is the similarity between user i and user k defined in Equation 6, si is the average social similarity of user i, while S(i) represents the list of social peers of user i.",
               "From the definitions, we can see that we are actually measuring in what extent a user's social similarity s if will deviate from his/her average social similarity si. If a user's social peer similarities all fall into a small range, then his/her RMSD will be relatively small, which indicates this user's social peers are very consistent with this user. If we observe a large RMSD value, then this user's social peers are relatively diverse. shows the analysis results of RMSD.",
               "We notice that the curves of these three social networks illustrate different patterns. The figure reveals that a very large portion of users in the generated two implicit networks have very small RMSD values, which implies that users' social peers are relatively more consistent in these two implicit social networks. The RMSD values in Douban explicit friend communities are relatively larger, which presents that users' social peers in this network are more diverse.",
               "Combining the results we obtain from , this observation actually suggests that social network with larger friend diversity is more effective in improving recommendation quality. This conclusion also coincides with the intuition we propose in Section 4.3, i.e., dissimilar users can also be utilized to improve recommender systems."
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 22,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     },
     {
          "head": {
               "n": "6.",
               "text": "CONCLUSION",
               "type": "conclusion"
          },
          "paragraphs": [
               "This paper studies a research problem on how to improve recommender systems using implicit social information. A"
          ],
          "paper_id": "21825290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 23,
          "fromPaper": "An Experimental Study on Implicit Social Recommendation"
     }
]