[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "This paper examines the differences of design between Chinese and western social media. Using a blandness in society of Fran?ois Jullien's interpretation approach, this paper analyzes the mainstream social media, found that both Chinese and western social media design concept have the characteristic of being \"as pleasing to the taste as new wine\" in terms of social communication; comparing to western social media, the Chinese social media have traces of being \"as bland as water\"."
          ],
          "paper_id": "218538c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Analyzing the Differences of Design between Chinese and Western Social Media"
     },
     {
          "head": {
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Social media can be considered as not only a product, but a medium. A majority of previous researches on social media focus on product attributes, product's usability and availability, description of usage scenarios, and the influence of product commercialization on users. These research methods and orientation regarding social media focus mainly on social product design, dissemination of users' information, or indirect expression of dependency of social media to social and cultural environment. However, studies from the perspective of the Chinese and western social thoughts differences have not yet been developed. In order to study the impact of the Chinese and western social thoughts on China's social media design concept, changing of research method should be implemented firstly, followed by definition of research scope.",
               "This paper selects the Chinese and western mainstream social media including Sina Weibo, WeChat and Facebook as the discussion objectives and concentrate its study in \"advertising creation\" and information framework related to page design. Starting from social media \"advertising creation\", this paper discusses differences in the Chinese and western social media design concepts from the perspective of product design framework and technique, as well as of page commercial interest and customer satisfaction.",
               "especially well to our relation with others . People in China communicate with each other more implicitly than those in western countries. \"The Sage is bland but never wearing\". As Mr. Qian Zhongshu said: \"A romantic person in China is still considered as a traditional guy in western courtiers and a frank person in China is still considered as an undemonstrative guy in western courtiers\" .",
               "In the study on the current Chinese Internet product from perspective of the Chinese and western cultures, Yuan believed that China's network products inspired and met entertainment needs of the audience by means of numerous and flashy contents and forms . The information was too much and complicated, and interaction with consumers lacked in display of information which was injected in an unidirectional manner. Peng also held the belief that a majority of the current Internet users in China were obviously in a passive position. The major attributors for user's passivity included socialized propagation mechanism, socialized interaction and group socialization environment."
          ],
          "paper_id": "218538c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Analyzing the Differences of Design between Chinese and Western Social Media"
     },
     {
          "head": {
               "text": "A. The Chinese and western social cultural difference",
               "type": "introduction"
          },
          "paragraphs": [
               "There are a lot of articles regarding the Chinese and western social cultural differences, which generally talk about philosophical basis of the Chinese and western culture. \"The Sage is bland but never wearing\"this statement applies"
          ],
          "paper_id": "218538c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Analyzing the Differences of Design between Chinese and Western Social Media"
     },
     {
          "head": {
               "text": "B. Analysis of the Chinese and western social media advertising",
               "type": "introduction"
          },
          "paragraphs": [
               "In China, Sina Weibo and WeChat are two representatives of social media which have the largest scale and conduct more exploration against business modes of information flow advertising. Li Xiaoling, Song Yurong, Wu Bin et al said in the study that ad types of Sina Weibo mainly included formal (banner) ad, recommendation ad, keyword search ad, Microblog talks and Microblog live broadcasting. Facebook has the major forms of advertising including right-hand ads, newsfeed, sponsored story, page posted ads, search bar and so on .",
               "In studies on the Chinese and western social media advertising, three common points can be found: the first comes to similar advertising model; secondly, online form of business users is similar. Thirdly, individual users comprise secondary media for advertising. They utilize number of fans to act as a secondary media on FB, twitter, Weibo and WeChat, implant and promote businesses advertising. There are two different points: firstly, There is no essential difference between part of advertising model in Weibo and WeChat and the ads in previous Internet portal; Secondly, the link for \"advertising\" is very hidden, and hints about \"advertising creation\" will generally not appear on user interface."
          ],
          "paper_id": "218538c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Analyzing the Differences of Design between Chinese and Western Social Media"
     },
     {
          "head": {
               "text": "Research questions approach",
               "type": "modelling"
          },
          "paragraphs": [
               "This paper is designed to investigate differences in social media design concepts between the Chinese and western countries, and takes interpretation of General Philosophy and the Chinese Thought from a French philosopher Jullien as the research approach. In addition, it analyzes the differences in social media design concepts between the Chinese and western countries with literature analysis method. To avoid product iteration of the object and prevent from influence of continually updated algorithm, this paper observes and collects pages from the same user, and selects new user account registered at the same time. The observation lasts 1 month. During this period, the users log in those four social media platforms in the same timeline and type of friends searched and added is similar. advertisement is the same as Sina Weibo and Wechat, the attitudes of the three are quite different. FB is inclined to the attitude of \"I tell you everything, and please make your own choice\". For example, after a newly registered user of FB adds his friends, the page of \"News Feed\" starts to show the advertisements of sponsored contents ( . On the right side of web-version Facebook, the panels of \"Recommended Homepage\" and \"Sponsored Story\" will also be shown. Besides, the link of \"advertising creation\" will be placed on the panel of sponsored story .",
               "\"Bland\" but \"never wearing\" social interaction"
          ],
          "paper_id": "218538c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Analyzing the Differences of Design between Chinese and Western Social Media"
     },
     {
          "head": {
               "text": "A. Interpretation of \"Blandness\"",
               "type": "modelling"
          },
          "paragraphs": [
               "Jullien believed that the Chinese intersect blandly, just as dealings with the Gentleman are as bland as water . In the study, he firstly quoted the Taoist view to explain that the social interaction advocated by Taoists was natural and sincere, not sophisticated. Secondly, he cited viewpoint of Confucius and combined with a short story in The Book of Rites to explain subtle interpersonal relationships in China. \"Blandness\" indeed appears in product designing of China's social media created by Weibo and WeChat. The design concept of WeChat is to establish the relationship among different people. As for newly registered users, WeChat interface only displays users added by users themselves. If a user takes no initiative to add an official account (such as FB fans page), he/she will not be interfered by ads that are released by this account. And users can unsubscribe any advertising recommended by wechat in moments( .",
               "In order to prevent users from ad interference, Weibo classifies the \"News feed\" into \" Moments\", \"Group Weibo\", \"Pet\" and other labeled communities. No ads will appear to \"Moments\", and there are ads appearing in other labeled communities (see . Therefore, upon comparison, Weibo overtops WeChat in terms of \"Blandness\". This difference is connected with the ideological difference between China and western countries. Western countries tend to \"tell you everything\" and let the customers make their own decisions. \"How to choose\" is an issue of user initiative, and the responsibility of social media is to list detailed pages with pictures and texts. Therefore, there is detailed illustration in the \"setting\" column of FB to explain why users can see the advertisements ( . Such design concept is like Descartes' pursuit for truth. Everything comes from deduction and discrimination. For Chinese people, it is not necessary to prove the existence of something by means of inference and accumulation. For this reason, users can seldom find explaining pages in Chinese social media such as \"moments; news feed; why you can see this advertisement\". This is one of the reasons why information pages can rarely be found in Chinese social media. Even though the way for Facebook (FB) to put"
          ],
          "paper_id": "218538c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Analyzing the Differences of Design between Chinese and Western Social Media"
     },
     {
          "head": {
               "text": "B. Interpretation of \"as pleasing as new wine\"",
               "type": "modelling"
          },
          "paragraphs": [
               "There is a saying, \"the friendship between villains is as pleasing as the taste of new wine\". New wine refers to sweet wine. Win-win situation means that both parties propose their own toasts and get their own benefits. One can do everything accords with the rules, as long as one does not merely focus on his own interests. Not being blind to all but one's own interests does not mean own can fight for their own interests. To obtain one's own interests, it is necessary to let the other party get -137",
               "\"sweet wine\".",
               ". Comparative Research on The Web Interface Design of Social Network Between China and Western Besed on Cultural Experience.",
               ". Analyzing the Commodi cation Process of Facebook Users and Their Non-Material Labors. Journal of Communication Research and Practice, 5(1), pp. 33-69, January 2015.",
               ". The chinese notion of \"blandness\" as a virtue: A preliminary outline. Philosophy East and West, 43(1), 107-111. , and the functions are similar as the \"advertising creation\" of FB. In western countries, \"feed\" means promotion and is a kind of advertisement. But in China, \"feed\" was not defined as a kind of advertisement (Wei Wuhui, 2016) for a long time. Therefore, for users, the \"feed\" used by Sino Weibo is not a clearly identified advertisement. Such advertisement will also be shown forcefully in the normal Weibo of users, which significantly mislead ignorant users. In addition, bloggers (who may also be the advertisers) can intentionally prohibit the reviews of ordinary users, and other users can only see positive reviews. Superficially, the design of such rules may not create much impact on ordinary users. Concerning the actual demand of users, such rules are not designed to meet the need of users."
          ],
          "paper_id": "218538c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Analyzing the Differences of Design between Chinese and Western Social Media"
     },
     {
          "head": {
               "text": "Conclusions",
               "type": "conclusion"
          },
          "paragraphs": [
               "The difference between the design concepts of China and western countries comes from the ideological difference of Chinese and western users for \"social intercourse\". In the capital economic environment of globalization, the \"sweet wine\" of social intercourse has become the commonality for the development of social media's design. Furthermore, products are being optimized by user-oriented design ideas, which have been used to coordinate the contradictions between customer need and commercialized development. Although the taste of sweet wine is attractive, there is no integrity and rigor. This also reflects the problem of privacy right confronted by social media in the process of development. The design thinking different from western social media lies in the blandness of social intercourse. Maybe, because Chinese people have never discussed the truth by means of discrimination since ancient times, the design thinking of Chinese social media has the spirit of \"blandness\". Only on the foundation of implication, modesty and prudence can product designers \"achieve\" reliable and righteous social media platform and provide users with the design and service they really need."
          ],
          "paper_id": "218538c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Analyzing the Differences of Design between Chinese and Western Social Media"
     }
]