[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "a r t i c l e i n f o a b s t r a c t Keywords: Clustering Transitivity Weighted networks In recent years, researchers have investigated a growing number of weighted networks where ties are differentiated according to their strength or capacity. Yet, most network measures do not take weights into consideration, and thus do not fully capture the richness of the information contained in the data. In this paper, we focus on a measure originally defined for unweighted networks: the global clustering coefficient. We propose a generalization of this coefficient that retains the information encoded in the weights of ties. We then undertake a comparative assessment by applying the standard and generalized coefficients to a number of network datasets."
          ],
          "paper_id": "21a45980-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Clustering in weighted networks"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "While a substantial body of recent research has investigated the topological features of a variety of networks ( , relatively little work has been conducted that moves beyond merely topological measures to take explicitly into account the heterogeneity of ties (or edges) connecting nodes (or vertices) ( ). In a number of real-world networks, ties are often associated with weights that differentiate them in terms of their strength, intensity or capacity ( . On the one hand, argued that the strength of social relationships in social networks is a function of their duration, emotional intensity, intimacy, and exchange of services. On the other, for non-social networks, weights often refer to the function performed by ties, e.g., the carbon flow (mg/m 2 /day) between species in food webs ( , the number of synapses and gap junctions in neural networks ( , or the amount of traffic flowing along connections in transportation networks ( ). In order to fully capture the richness of the data, it is therefore crucial that the measures used to study a network incorporate the weights of the ties.",
               "A measure that has long received much attention in both theoretical and empirical research is concerned with the degree to which nodes tend to cluster together. Evidence suggests that in most real-world networks, and especially social networks, nodes tend to cluster into densely connected groups ; ). In particular, the problem of network clustering can be investigated from a two-fold perspective. On the one hand, it involves determining whether and to what extent clustering is a property of a network or, alternatively, whether nodes tend to be members of tightly knit groups ( . On the other, it is concerned with the identification of the groups of nodes into which a network can be partitioned. This can be obtained, for example, by applying algorithms for community detection that assess and compare densities within and between groups , or by using the image matrix in blockmodeling for grouping nodes with the same or similar patterns of ties and uncovering connections between groups of nodes ( .",
               "In this paper, we focus our attention only on the problem of determining whether clustering is a property of a network. More specifically, to address this problem one may ask: If there are three nodes in a network, i, j, and k, and i is connected to j and k, how likely is it that j and k are also connected with each other? In realworld networks, empirical studies have shown that this likelihood tends to be greater than the probability of a tie randomly established between two nodes ( ). For social networks, scholars have investigated the mechanisms that are responsible for the increase in the probability that two people will be connected if they share a common acquaintance ). The nature of these mechanisms can be cognitive, as in the case of individuals' desire to maintain balance among ties with others , social, as in the case of third-part referral , or can be explained in other ways, such as in terms of focus constraints or the differing popularity among individuals . While clustering is likely to result from a combination of all these mechanisms, network studies have offered no conclusive theoretical explanation of its causes, nor have they concentrated as much on its underpinning processes as on the measures to formally detect its presence in real-world networks ( ).",
               "Traditionally, the two main measures developed for testing the tendency of nodes to cluster together into tightly knit groups are the local clustering coefficient ( ) and the global clustering coefficient . The local clustering coefficient is based on ego's network density or local density . For node i, this is measured as the fraction of the number of ties connecting i's neighbors over the total number of possible ties between i's neighbors. To create an overall local coefficient for the whole network, the individual fractions are averaged across all nodes.",
               "Despite its ability to capture the degree of social embeddedness that characterizes the nodes of a network, nonetheless the local clustering coefficient suffers from a number of limitations. First, in its original formulation, it does not take into consideration the weights of the ties in the network. As a result, the same value of the coefficient might be attributed to networks that share the same topology but differ in terms of how weights are distributed across ties and, as a result, may be characterized by different likelihoods to befriend the friends of one's friends. Second, the local clustering coefficient does not take into consideration the directionality of the ties connecting a node to its neighbors ( . Recently, there have been a number of attempts to extend the local clustering coefficient to the case of weighted networks ( ). However, the issue of directionality still remains mainly unresolved , thus making the coefficient suitable primarily for undirected networks.",
               "Moreover, the local clustering coefficient, even in its weighted version, is biased by correlations with nodes' degrees: a node with more neighbors is likely to be embedded in relatively fewer closed triplets, and therefore to have a smaller local clustering than a node connected to fewer neighbors ( ). An additional bias might stem from degree-degree correlations. When nodes preferentially connect to others with similar degree, local clustering is positively correlated with nodes' degree ( . Lack of comparability between values of clustering of nodes with different degrees thus makes the average value of local clustering sensitive with respect to how degrees are distributed across the whole network.",
               "Unlike the local clustering coefficient, the global clustering coefficient is based on transitivity, which is a measure used to detect the fraction of triplets that are closed in directed networks ( . It is not an average of individual fractions calculated for each node, and, as a result, it does not suffer from the same type of correlations with nodes' degrees as the local coefficient. Despite its merits, however, in its original formulation, the global coefficient applies only to networks where ties are unweighted. To address this limitation, and make the coefficient suitable also to networks where ties are weighted, researchers have typically introduced an arbitrary cut-off level of the weight, and then dichotomized the network by removing ties with weights that are below the cut-off, and then setting the weights of the remaining ties equal to one . The outcome of this procedure is a binary network consisting of ties that are either present (i.e., equal to 1) or absent (i.e., equal to 0) . For example, Doreian (1969) studied clustering in a weighted network by creating a series of binary networks from the original weighted network using different cut-offs. To address potential problems arising from the subjectivity inherent in the choice of the cut-off, a sensitivity analysis was conducted to assess the degree to which the value of clustering varies depending on the cut-off . However, this analysis tells us little about the original weighted network, apart from the fact that the value of clustering changes at different levels of the cut-off.",
               "In this paper, we focus on the global clustering coefficient, and propose a generalization that explicitly takes weights of ties into consideration and, for this reason, does not depend on a cut-off to dichotomize weighted networks. In what follows, we start by discussing the existing literature on the global clustering coefficient in undirected and unweighted networks. In Section 3, we propose our generalized measure of clustering. We then turn our attention to directed networks, and discuss the current literature on clustering in those networks. We extend our generalized measure of clustering to cover weighted and directed networks. In Section 5, we empirically test our proposed measure, and compare it with the standard one, by using a number of weighted network datasets. Finally, in Section 6 we summarize and discuss the main results."
          ],
          "paper_id": "21a45980-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Clustering in weighted networks"
     },
     {
          "head": {
               "n": "2.",
               "text": "Clustering coefficient",
               "type": "introduction"
          },
          "paragraphs": [
               "The global clustering coefficient is concerned with the density of triplets of nodes in a network. A triplet can be defined as three nodes that are connected by either two (open triplet) or three (closed triplet) ties. A triangle consists of three closed triplets, each centered on one node. The global clustering coefficient is defined as the number of closed triplets (or 3triangles) over the total number of triplets (both open and closed). The first attempt to measure the coefficient was made by . For an undirected network, they showed that the total number of triplets could be found by summing the non-diagonal cells of a squared binary matrix. The number of closed triplets could be found by summing the diagonal of a cubed matrix. For clarity, we will refer to the global clustering coefficient as the standard clustering coefficient C:",
               "where is the total number of triplets and 1 Node i's neighbor might be: (1) a node that has directed a tie toward i; (2) a node to which i has directed a tie; or (3) a node that has directed a tie toward i and, at the same time, has received a tie from i.",
               "is the subset of these triplets that are closed as a result of the addition of a third tie. The coefficient takes values between 0 and 1. In a completely connected network, C = 1 as all triplets are closed, whereas in a classical random network C0 as the network size grows. More specifically, in a classical random network, the probabilities that pairs of nodes have of being connected are, by definition, independent . Therefore, C is equal to the probability of a tie in these networks .",
               "A major limitation of the clustering coefficient is that it cannot be applied to weighted networks. As a result, the same outcome might be attributed to networks that differ in terms of distribution of weights and that, for this reason, might be characterized by different likelihoods of one's neighbors being connected with each other. This limitation could therefore bias the analysis of the network structure. In order to overcome this shortcoming, in the following section we will propose a generalization of the clustering coefficient that explicitly captures the richness of the weights attached to ties, while at the same time it produces the same results as the standard clustering coefficient when ties are unweighted. Methods for calculating the triplet value,. "
          ],
          "paper_id": "21a45980-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Clustering in weighted networks"
     },
     {
          "head": {
               "n": "3.",
               "text": "Generalized clustering coefficient",
               "type": "introduction"
          },
          "paragraphs": [
               "We can generalize the clustering coefficient, C, to take weights of ties into consideration, by rewriting Eq. (1) in terms of a triplet value,. To this end, it is vital to choose an appropriate method for defining the triplet value as this impacts on the value of the coefficient. The method should be chosen based on the research question, and should reflect the way in which the weights of ties are defined. First, the triplet value,, can be defined as the arithmetic mean of the weights of the ties that make up the triplet. This is the simplest method of calculating the triplet value. However, this method does not take into account differences between weights, and is not robust against extreme values of weights. Second,can be defined as the geometric mean of the weights of ties. This method overcomes some of the sensitivity issues of the arithmetic mean. A triplet made up of a tie with a low weight value and a tie with a high weight value will have a lower value when the geometric mean is used than would be the case if the arithmetic mean were used. Third,can be defined as the maximum or minimum value of the weights of the ties. These two methods, however, represent extreme ones. On the one hand, using the maximum weight makesinsensitive with respect to small weights. As a result, two triplets, one with a strong tie and a weak tie and the other with two strong ties, may well be assigned the same value. Conversely, using the minimum weight makesinsensitive with respect to large values of weights. In this case, two triplets, one consisting of a strong tie and weak tie and the other of two weak ties may well be assigned the same value. The advantages and shortcomings of each of these four methods should be evaluated based on the type of network dataset at hand. For example, in a network where the weights corresponds to the level of flow, and a weak tie would act as a bottleneck, the minimum method might be most appropriate to use. By contrast, when ties are weighted in terms of costs or time, it may be more suitable to apply the maximum method so as not to underestimate the values of triplets. highlights the differences between the methods for defining triplet values. We will explore them further at the end of Section 5.",
               "Formally, we propose to generalize the clustering coefficient as follows:",
               "total value of closed triplets total value of triplets = numerator are also part of the denominator. In a completely connected network, all triplets are closed as the third tie will always be present (e.g., between node j and node k in ). Therefore, the same triplets are part of both the numerator and denominator, and thus C= (1/1) = 1. To test whether C0 as the size of a classical random network increases or, more specifically, whether Cequals the probability that two randomly chosen nodes are connected with each other, we created a set of networks of different size, but with a fixed average degree. Since classical random networks are binary, we assigned to each tie a random weight between 1 and 10 to create weighted random networks. We applied the generalized clustering coefficient to these networks, and found that C0 as the network size increases. In particular, we found that Cis very close to the probability of a tie in classical random networks. 2 Furthermore, to assess sensitivity with respect to weights, we tested the generalized clustering coefficient on networks where the structure was kept invariant, but where the weights were randomly assigned to the ties. We found CC GT0 , where C GT0 is C calculated on networks dichotomized by setting equal to 1 all weights that are greater than 0. In this paper, we assume that weights can take on only positive values. Moreover, we will use the absolute values of weights without normalizing them (e.g., by dividing them by their maximum or average) as this would have no effect on the results of our analysis. This is due to the fact that in Eq. (2) the total value of closed triplets is divided by the total value of all triplets. In addition, our generalizied clustering coefficient is applicable primarily to networks in which weights are measured on a ratio scale. When weights are measured on an ordinal scale (e.g., in social networks where weights represent the ranks of different levels of friendship), special care should be taken when assessing the value of the coefficient, because the same differences between weights may not have the same meaning. In this case, it would be advisable to transform the ordinal scale into a ratio scale.",
               "To illustrate the applicability of the generalized clustering coefficient, shows two sample networks, each with six nodes and six weighted ties. In network a, the ties between the nodes that form the triangle have higher weights than the average tie weight in the network, whereas the reverse is true in network b.",
               "Both networks have the same clustering coefficient C GT0 when they are transformed by setting ties with weights greater than 0 toThe generalized clustering coefficient produces the same result as the standard version C when it is applied to a binary network. This is because all triplets have the same value (= 1), irrespective of the method used to calculate triplet values. In addition, the generalized coefficient has the same properties as C. It still ranges between 0 and 1 because neither numerator nor denominator of the fraction can be negative. Moreover, all weights that are part of the present:",
               "However, if, for example, the two sample networks represented social networks in which ties refer to friendship between individuals, we believe that it would not be accurate to claim that both these networks show the same tendency of one's friends to be friends themselves. Being friends refers to a social relationship that can be assessed by using the same criteria (duration, emotional intensity, intimacy, and exchange of services) that proposed for classifying tie weights. The generalized clustering coefficient helps highlight the difference between the two sample networks. More specifically, for networks a and b in , the generalized clustering coefficients obtained by using the geometric mean method (gm) for defining triplet values are, respectively: ",
               "The difference in values stems from the fact that the generalized clustering coefficient captures more information than C GT0 . In particular, the difference between (4a) and (4b) reflects the differences in tie weights in the two sample networks. If, for example, the tie weights in the sample networks were to represent duration, we might reasonably argue that the nodes in network a are investing more time on interactions with other nodes that are themselves connected than is the case with network b.",
               "Following , in our proposed generalization of the clustering coefficient we do not take into account the weight of the closing tie of a triplet. This is because the aim of the clustering coefficient is to assess the likelihood of the occurrence of a tie that closes a triplet, and not the strength of this tie. A triplet must be created prior to the closing tie. In other words, as networks evolve over time by the creation and removal of ties, clustering occurs when a triplet exists, and a newly created third tie closes the triplet. Nevertheless, when we observe a triangle in a cross-sectional network dataset, we do not know which of the three triplets that make up the triangle occurred in the first place. In effect, this means that the weight of the closing tie of a triplet is taken into account since it is part of the values of the other two triplets in the triangle."
          ],
          "paper_id": "21a45980-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Clustering in weighted networks"
     },
     {
          "head": {
               "n": "4.",
               "text": "Directed networks",
               "type": "introduction"
          },
          "paragraphs": [
               "In directed networks, connections between nodes are described as ties that originate from one node and point toward another ( . The weight of a tie directed from node i to node j is expressed as x ij . In a binary network, the weight of a present tie is set equal to 1, whereas the weight of an absent tie is 0. We define the triplet consisting of the two directed ties, x ji and x ik , as ji,ik , and the value of this triplet asji,ik .",
               "The standard clustering coefficient as stated in Eq. (1) cannot be applied to directed data. A more refined measure to calculate closure in directed networks is called transitivity, T (for a review, see . Transitivity produces the same results as the standard clustering coefficient if applied to an undirected network . It also shares the same properties. In fact, 0T1: in a completely connected network, we have: T = 1; in a classical random network, T0 as the network size grows. T takes the direction of the ties between nodes into consideration by using a more sophisticated definition of a triplet. A triplet centered on node i must have one incoming and one outgoing tie, i.e., x ki = x ij = 1 or x ji = x ik = 1, as shown by the solid lines in . termed triplets that do not fulfill the above condition as vacuous. These triplets are not part of the numerator nor of the denominator of the fraction in Eq. (1). More specifically, when we are dealing with directed data, there can be four basic configurations of a triplet around an individual node i: ij,ik , ij,ki , ji,ik , and ji,ki . The configurations ji,ki and ij,ik form, respectively, an in-and out-star, and therefore are vacuous and not part of the fraction in Eq. (1). Conversely, the configurations ij,ki and ji,ik are non-vacuous. These triplets can be either transitive or intransitive.",
               "Triplets defined according to form chains of nodes. These triplets have been termed 2-path as they form chains of two directed ties between three nodes . A triplet is transitive if a tie is present from the first node to the last node of the chain. For the two triplets shown in , transitivity would imply x kj = 1 and x jk = 1, respectively.",
               "Transitivity suffers from the same limitation as the standard clustering coefficient in that it cannot be applied to networks where the ties are weighted. To overcome this shortcoming, here we extend our proposed generalization also to directed and weighted networks by using the same definition of a triplet, , as in transitivity. The triplet value,, is calculated by using the same methods as stated in Section 3. This generalization produces the same results as transitivity if applied to binary directed networks, and the same results as the standard clustering coefficient if applied to binary and undirected networks. Moreover, it still ranges between 0 and 1. In a completely connected network, we would still obtain C= 1, whereas in a classical random network, C0 as the network size grows. In particular, once again we found that Capproximated the probability of a tie in a classical random network. To clarify which triplets are transitive and non-vacuous, illustrates configurations of triplets centered on node i. The first four rows show the basic configurations mentioned above. The remaining rows show configurations of triplets where ties are reciprocated. In these cases, each additional tie doubles the number of triplets. Moreover, the table shows which triplets are transitive under different conditions, and which triplet values should be included in the fraction of Eq. (2)."
          ],
          "paper_id": "21a45980-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Clustering in weighted networks"
     },
     {
          "head": {
               "n": "5.",
               "text": "Empirical test of the generalized clustering coefficient",
               "type": "introduction"
          },
          "paragraphs": [
               "We now test the proposed generalization of clustering on a number of network datasets. We also compare the generalized coefficient with the standard one measured with different cut-offs. 5 summarizes the empirical results. Triplets () and triplet values () in a directed network (i / = j / = k)."
          ],
          "paper_id": "21a45980-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Clustering in weighted networks"
     },
     {
          "head": {
               "text": "Denominator of Eq. (2)",
               "type": "introduction"
          },
          "paragraphs": [
               "Numerator of Eq. if w jk = 0, w kj = 0 i f w jk > 0, w kj = 0 i f w jk = 0, w kj > 0 i f w jk > 0, w kj > 0 Due to a large range of tie weights in the US airport network, we have divided the tie weights by 100,000. This operation has no impact on the generalised coefficient, but it enables us to conduct the sensitivity analysis (i.e., in the original dataset, the minimum tie weight is equal to 17, and therefore a sensitivity analysis with values of the cut-off lower than 17 would be meaningless).",
               "The first dataset we consider is Freeman's EIES networks ( , also used in . This dataset was collected in 1978 and contains three networks of researchers working on social network analysis. The first is an acquaintance network including 48 researchers, and in which relationships were recorded at the beginning of the study (time 1). The second network is similar, but the data were recorded at the end of the study (time 2). The third is a frequency matrix of the number of messages sent among 32 of the researchers that used an electronic communication tool. In the two acquaintance networks, all relationships have a weight between 0 and 4. 4 represents a close personal friend of the researcher's; 3 represents a friend; 2 represents a person the researcher has met; 1 represents a person the researcher has heard of, but not met; and 0 represents a person unknown to the researcher. In the frequency matrix, the average tie weight is 33.7 and the maximum weight is 559. The three networks are highly connected, with densities of 0.34, 0.40, and 0.46, respectively. They also exhibit a fairly large tendency toward clustering: C GT0 for the three networks is 0.7627, 0.8131, and 0.6386, respectively. When the proposed generalization of clustering is applied to the three networks, clustering increases. More specifically, C,gm takes the value of 0.7708, 0.8218, and 0.7332, respectively. Thus, for the acquaintance networks, clustering increases of 1.1%, whereas for the frequency matrix it shows a relatively higher increase of 14.8%. shows Freeman's third EIES network, in which the size of a node is proportional to the number of messages sent by the researcher, and the width of a tie between two nodes corresponds to the number of messages exchanged between the two researchers. As shown in the figure, all researchers at the center are connected with one another, whereas this is not the case for researchers located in the outer ring. Moreover, the strongest ties in the network tend to connect the researchers in the center with one another and with nodes at the periphery. This implies that stronger ties are more likely to be part of triangles than weaker ties. For example, Nick Mullins is strongly connected to Sue Freeman and Barry Wellman, who are in turn connected with each other. By contrast, Phipps Arabie is weakly connected to Ev Rogers and Carol Barner-Barry, who are not connected with each other. This tendency of strongly connected researchers to establish a tie with the same third party is responsible for the increased value of clustering when measured with our generalized coefficient.",
               "The second dataset is a network created from an online community ( ). This network dataset covers the period from April to October 2004. It includes 1899 nodes that represent students at the University of California, Irvine. During the observation period, students sent a total number of 59,835 online messages. A directed tie is established from one student to another if one or more messages have been sent from the former to the latter. The weight of a tie is defined as the number of messages sent. The maximum and average tie weight are 98 and 2.95, respectively. This network exhibits a density of 0.0056, and an average degree of 10.69. In this network, we found C GT0 = 0.0547 and C,gm = 0.0638. Thus, when the generalized coefficient is applied, there is an increase in clustering of 16.8%.",
               "The third dataset contains four organizational networks, two from a consulting company and two from a research team in a manufacturing company ( ). The consulting company had 46 employees that are the nodes in the first two networks. The ties in the first network are differentiated in terms of frequency of information or advice requests, whereas the ties in the second network are differentiated in terms of the value placed on the information or advice received. In both these networks, ties are weighted on a scale from 0 to 5. The company had offices both in Europe and in the US. The US employees were divided into two tightly knit groups, whereas this did not occur with the European employees. The other two networks are concerned with a research team in a manufacturing company. The nodes in these networks are the 77 employees. The ties in the first network are differentiated in terms of advice, whereas in the second network in terms of the employees' awareness of knowledge and skills. In both these networks, ties are weighted on a scale from 0 to 6. Moreover, for both networks, data collection took place after an organizational restructuring operation that combined four separate units in different European countries. The research team was partitioned into strong communities based on the employees' previous geographical location ( . Thus, focus constraint might have been partly responsible for a high value of clustering . All four networks do in fact exhibit a high clustering coefficient: C GT0 ranges between 0.6764 and 0.6932, and C,gm between 0.6857 and 0.7209. The data thus exhibit an average increase in clustering of 3.2% when the generalised coefficient is applied.",
               "The fourth dataset is a network of political support in the US ). The network includes 102 nodes that represent senators. Ties among senators reflect co-sponsorship of bills. This network has a density of 0.58 and an average degree of 59. As the network is well connected, it is difficult to draw conclusions from C GT0 . We found: C GT0 = 0.7219. Weights of ties represent the number of bills that the connected senators have co-sponsored. The average tie weight is 2.68 and the maximum weight is 29. The large difference between the mean and the maximum weights signals that many of the ties are relatively weak. This is an indication that a cut-off higher than zero might be more appropriate for dichotomizing the network. In , we list C GTX calculated using different values X of the cut-off. When we applied the generalized coefficient, we found: C,gm = 0.7639. This represents an increase in clustering of 5.8%. This increase in clustering is likely to be influenced by the fact that party membership and ideologies place a constraint on the existence and strength of ties among senators. In particular, senators belonging to different parties are likely to cosponsor a limited number of bills, which inevitably affects the total value of closed triplets connecting senators from different parties.",
               "The fifth dataset is the neural network of the Caenorhabditis elegans worm. This network was studied in . The network contains 306 nodes that represent neurons. A tie joins two neurons if they are connected by either a synapse or a gap junction. The weight of a tie represents the number of these synapses and gap junctions. The average tie weight is 3.74, and the maximum tie weight is 70. The density is 0.0253 and the average degree is 7.7. We found: C GT0 = 0.1843, and C,gm = 0.2210. Thus, the generalized coefficient is 19.9% higher than the standard one.",
               "The sixth dataset is the network of the 500 busiest commercial airports in the United States ( . In this network, two airports are connected if a flight was scheduled between them in 2002. The weight of a tie between two airports corresponds to the number of seats available on the scheduled flights. Although air transportation networks are directed by nature, they are also highly symmetric ( ). Therefore, we analyse this network as an undirected one. On average, each airport is connected to 11.92 other airports (i.e., density is 0.0239). For the average route, 152,320 seats were scheduled. In this network, the standard and generalised clustering coefficients were well above the randomly expected value: C GT0 = 0.3514 and C,gm = 0.5066. The generalised coefficient is 44.16% larger than the standard one. This suggests that airports with busy routes are part of transitive triplets.",
               "A number of observations are now in order. First, for all the networks, the standard clustering coefficient, C GTX , generally decreases as the value X of the cut-off increases. However, the rate of decrease differs considerably among the networks. Moreover, for each network, there is variation in the rate of decrease between different values of the cut-off. Despite an average decreasing trend, we also found that, in certain networks, the clustering coefficient increases in correspondence of increasing levels of the cut-off. In addition, the reliability of the results when large cutoffs are used should be questioned, for in the networks there remain only few triplets and triangles when those cut-offs are used. Thus, these findings from a sensitivity analysis of the standard clustering coefficient do not lend themselves to unequivocal interpretation.",
               "Second, there are variations in the values of the generalized clustering coefficient, C, when different methods for defining the triplet valueare used. For most of the networks, the highest Cis obtained when the minimum method is used, whereas the lowest outcome is obtained when the maximum method is used. Given two triplets with the same average weight, the minimum method assigns a lower value to the triplet with a higher dispersion of weights than to the triplet with a lower dispersion. The reverse is true for the maximum method. Since, for most networks, the minimum (maximum) method produces the highest (lowest) value of clustering, the triplets consisting of ties with a lower (higher) variation in weight are more likely to be closed (open) than the triplets with a larger (lower) variation. This means that triplets consisting of two ties with approximately the same weight are likely to be closed. Third, for all networks, the generalized clustering coefficient is higher than the standard coefficient. When networks are dichotomized by setting ties with weights greater than 0 to present, the standard clustering coefficient can be used as a benchmark for the generalized one. As shown by simulations in Section 3, when the weights are reshuffled among the ties, CC GT0 . Thus, by comparing Cwith C GT0 , we can assess whether strong triplets are more likely to be closed than weak triplets. More specifically, if the generalized clustering coefficient is significantly higher than the standard clustering coefficient, strong triplets are more likely to be closed than weak ones, whereas if the reverse were the case, weak triplets would be more likely to be closed than strong ones."
          ],
          "paper_id": "21a45980-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Clustering in weighted networks"
     },
     {
          "head": {
               "n": "6.",
               "text": "Conclusions and discussion",
               "type": "conclusion"
          },
          "paragraphs": [
               "Relationships among unique people are unique. We live in an increasingly connected world with an increasing number of contacts to whom we relate in different ways, with different frequencies, and for different reasons. Each social relationship bears a special meaning to us, and it would be overly simplistic and grossly unfair to treat every contact in the same manner. Therefore, it is important to capture differences among relationships when mapping and studying social networks. In particular, social network measures should reflect the richness of the information that the weights of relationships convey. However, despite the fact that there are a large number of network datasets where the weights of the relationships are recorded (see Section 5, but also ), only a limited number of measures take weights into account (among others, ). Therefore, most measures can only be calculated on network data that are binary.",
               "Among the measures that suffer from this shortcoming is the clustering coefficient. In this paper, we focused on this measure, and offered a generalization that takes the weight of ties explicitly into account by attaching a value to each triplet. The standard coefficient divides the number of closed triplets by the total number of triplets, whereas the generalized coefficient divides the total value of the closed triplets by the total value of all triplets. In particular, the generalized clustering coefficient produces the same result as the standard coefficient when applied to a binary network.",
               "We measured and compared the standard and generalized clustering coefficients on a number of network datasets where the weights of ties are recorded. First, we found that the value of the standard coefficient generally decreases as the value of the cut-off increases. However, as the rate of decrease varies across datasets, it is difficult to interpret this result. Second, we found that there were differences among the outcomes when different methods for defining the triplet value were used. The generalized coefficient based on the minimum method yielded mostly the highest value, whereas when the maximum method was used, the lowest outcome was generally attained. This suggests that similarity in tie weights in a triplet increases the chance of closure of that triplet. Third, we found that, in all social networks studied, the value of the generalized coefficient was greater than the value of the standard one. These findings thus provide support in favour of claim that in social networks strong ties are more likely to be part of transitive triplets than weak ones.",
               "Being able to produce values of clustering that are positively affected by the tendency of strong ties to be part of transitive triplets is a distinct property of our method as well as an advantage over alternative methods for applying binary measures to weighted networks. For example, we adopted Ahnert et al.'s (2007) method for converting a weighted network into an ensamble of binary networks, and calculated the average standard clustering coefficient on these networks. Drawing on Freeman's third EIES network (see ), we produced 1000 binary networks in which the probability of a tie was obtained by dividing its weight by the maximum weight in the network. The average standard clustering coefficient found on this ensamble is 0.1288. This value is not only much lower than the one found with our method (i.e., 0.7332), but also lower than the value obtained with C GT0 (i.e., 0.6386). 11 Thus, despite the fact that, as suggested by , in Freeman's third EIES network, strong ties tend to be part of transitive triplets, the results obtained by using Ahnert et al.'s method would in fact suggest the opposite.",
               "Our generalized clustering coefficient is consistent with the local weighted clustering coefficient proposed by . For example, in the US airport network, both measures produce values that are higher than the values of the corresponding binary measures. However, the weighted local clustering coefficient is inevitably biased by the fact that it builds explicitly on the local binary coefficient. This is likely to constrain the measure in two ways. First, as the binary measure, the weighted one is not applicable to directed networks. Second, it still suffers from negative correlation between the degree of nodes and their likelihood of being embedded in closed triplets. For example, in the US airport network, we found a negative correlation of -0.24 between node degree and weighted local clustering. Unlike our global measure, the weighted local clustering coefficient is therefore affected by the way degrees are distributed across the nodes in a network.",
               "One of the advantages of the generalized clustering coefficient is also a limitation. Unlike what is normally done with the standard clustering coefficient, our measure does not require ties in weighted networks to be transformed. This becomes an issue when all possible ties within a network are assigned a weight, even a very small one. In these circumstances, the network is fully connected, and the generalized clustering coefficient is 1. The standard clustering coefficient does not have this shortcoming as ties with a small weight are set to absent and, therefore, the network does not become fully connected. An example of a weighted, fully connected network is a network consisting of cities, where the ties between cities are assigned a weight that reflects the distance between the two connected cities. Here, all possible ties are present and assigned a weight. The standard clustering coefficient overcomes this issue by setting weak relations, i.e., those characterized by long distances, to absent. A possible solution when applying the generalized coefficient, which does not normally transform the data, is to carry out precisely this transformation and filter the data by setting weak relations, with distances smaller than a fixed cutoff, to absent. However, the suitability and appropriateness of this solution depends on the data, the context in which the data were collected, and the research question.",
               "More generally, researchers should operationalize variables with care when dealing with research questions concerned with tie weights. conducted a comparative analysis of four criteria for defining tie weights. They found that emotional intensity was a better indicator of strength of friendship than the other three criteria. Researchers should choose the appropriate measures of tie strength depending on the nature of the nodes and ties and, more generally, on the context of the research setting. In addition, the scale of the weights should be carefully defined. The scale should be consistent with the chosen criteria. For example, a typical network question often used in studies of advice networks is:",
               "Please indicate how often you have turned to this person for information or advice on work-related topics in the past three months.",
               "with the ordinal scale: 0 (Do not know this person); 1 (Never); 2 (Seldom); 3 (Sometimes); 4 (Often); 5 (Very Often). In this case, answers are inevitably subject to the bias that comes from the dif-ferent ways in which different people assess duration and define the meaning of the time-related scale. One way to overcome this problem is to transform the ordinal scale into a ratio scale that describes reality more consistently across people. For example, a more appropriate scale for the above network question could be: 0 (Never); 1 (Once); 3 (Monthly); 6 (Fortnightly); 12 (Weekly). In turn, this scale, when compared to the former, is likely to yield a network dataset that is richer in information, more robust against potential inaccuracies emanating from subjective judgments, and more suitable to investigations that rely on generalized measures, such as our proposed clustering coefficient."
          ],
          "paper_id": "21a45980-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Clustering in weighted networks"
     }
]