[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "The use of terms such as \"Engineering Systems\", \"System of systems\" and others have been coming into greater use over the past decade to denote systems of importance but with implied higher complexity than for the term systems alone. This paper searches for a useful taxonomy or classification scheme for complex Systems. There are two aspects to this problem: 1) distinguishing between Engineering Systems (the term we use) and other Systems, and 2) differentiating among Engineering Systems. Engineering Systems are found to be differentiated from other complex systems by being human-designed and having both significant human complexity as well as significant technical complexity. As far as differentiating among various engineering systems, it is suggested that functional type is the most useful attribute for classification differentiation. Information, energy, value and mass acted upon by various processes are the foundation concepts underlying the technical types."
          ],
          "paper_id": "21caa630-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Complex System Classification"
     },
     {
          "head": {
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "There are three inter-related reasons for attempting a classification study of complex systems. First, academic activity indicates interest in forming a field of study and by analogy with other fields, a classification framework has often been a major step forward, and a significant accelerator of development of the field. Second, the development of a framework for classification of complex systems may help delineate the \"intellectual boundaries\" of engineering systems. The differentiation of ES from other complex systems is most important to fulfill this purpose. Such delineation is significant academically to differentiate Systems (or Engineering Systems) from traditional engineering departments, business schools and other areas while recognizing that such boundaries will be open and blurred as are those defining other fields. The third, and perhaps most important, reason for attempting to classify complex systems is to contribute to the engineering and design of such systems. Achievement of this goal could be facilitated by differentiation between different classes of ES. As the modern world relentlessly evolves towards a highly interactive and interdependent complex set of complex systems, improvement of the ability to design such systems is becoming crucial."
          ],
          "paper_id": "21caa630-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Complex System Classification"
     },
     {
          "head": {
               "text": "Approach",
               "type": "modelling"
          },
          "paragraphs": [
               "The first step in this study was to develop a \"test bed\" list of complex systems. The second step was to use the list to assess the utility of prior classification frameworks, and then to extend them and develop new ones. shows schematically the overall approach. Observation of existing ES"
          ],
          "paper_id": "21caa630-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Complex System Classification"
     },
     {
          "head": {
               "text": "Figure 1. Approach for finding a classification of Engineering Systems",
               "type": "modelling"
          },
          "paragraphs": [
               "In order to explore promising classification schemes for Engineering Systems, a topdown and a bottom-up strategy were simultaneously pursued. The top-down strategy consisted of surveying past suggestions for a classification of complex Engineering Systems, generically considering the attributes of Engineering Systems and the kinds of processes that they are involved in, as well as suggesting a meaningful classification scheme based on systems theory. The bottom-up approach consists of qualitatively and quantitatively assessing a wide variety of system attributes for each entry in the test bed list of Engineering Systems to learn about the systems.",
               "A set of criteria for determining whether a given classification framework is useful has been developed in order to evaluate possible classification frameworks. The first criterion is that the framework be able to differentiate among systems on our list and separate them into distinct groupings. In addition, valuable classification schemes would help by defining categories where different engineering methods and approaches are most useful. A useful framework would also possibly help define potential fundamental issues and principles of importance in various categories suggested by the framework. Finally, a useful scheme might suggest the most viable modeling and representation techniques to apply in different categories."
          ],
          "paper_id": "21caa630-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Complex System Classification"
     },
     {
          "head": {
               "text": "Selected Specific Engineering Systems",
               "type": "modelling"
          },
          "paragraphs": [
               "The need for a \"test bed\" set of engineering systems led first to finding (not surprisingly) that no list was known. Since the approach described in the previous section involves actual \"bottom-up\" observation of engineering systems (as well as application of \"topdown\" theory and speculation), specific instances of engineering systems are required. In this regard, the prior argument of Miller that concrete examples of complex systems are necessary in order to support the development of quantitative approaches is also relevant. Such a specific list culled from an earlier and longer list (Magee and ) is given in which also contains specific complex systems judged not to be Engineering Systems. Focus on specific instances sharpened the decision process on inclusion whereas generic concepts are suggestions for a possible category in a classification framework. As shown in above, systems not designed by humans are labeled \"natural,\" and are not included in the ES list-the first sorting principle. However, some of these systems are interesting for comparison in \"bottom-up\" observations as they may give valuable insight to different categories and strategies for Engineering Systems. In addition, a number of the specific Engineering Systems included in the list incorporate natural \"components or subsystems\".",
               "The second and third sorting principles demonstrated in are the technical complexity and human complexity (management or social dimension) of the system. For each instance to be specific enough to examine these points, the system boundaries must be defined. In general for this list, all software, artifacts, natural \"components\", processes, personnel and organizations involved in delivering the product, purpose or service of the system is included. In entries listed \"as a system\" (e.g., the Boeing 777 example), the named systems only include the software, hardware, and procedures used in the actual product. For many of these same items, if one includes the development teams that design the product and/or the manufacturing systems that make it, the entries would move from the right hand column to left hand one in . This is demonstrated by the two different entries for the Intel Pentium V. The \"Intel Pentium V System\" includes the development Organizations and Manufacturing Plants, personnel, and processes as \"components\" whereas the \"Intel Pentium V as a system\" does not.",
               "Many systems are unambiguously separated into Engineering Systems or \"other interesting Systems\" using this framework. The entries in the ES list typically contain many thousands of non-repeating artifact, process or algorithm components as well as several multi-level human organizations as \"components\". Many of the entries in the Other Interesting Systems list are not human designed and the remainder typically has either very low technical or organizational/social complexity.",
               "It is also now possible to recognize areas where this differentiation is controversial. A single airplane with a pilot is not an engineering system by this framework because of the lack of the organizational or social component/complexity. However, with a very complex airplane many may disagree. Similarly, we assume that use of a complex technical system (such as information systems, weapon systems etc.) without an organizational responsibility for development or production of the system does not impart sufficient technical complexity to consider complex systems such as an Air Force Command System or the Boston Public Library to be engineering systems. Thus, one could make a third list in addition to the binary pair shown in with the third category containing controversial systems. However, such considerations are not further addressed here as they do not affect the further use of the test bed for the purposes of the remainder of this paper. An important point, however, is to recognize that a system can always be viewed as a subsystem from a higher level so that most of the examples in can be further expanded or contracted but in keeping with the spirit of this paper remain engineering systems only if sufficient technical and social complexity is retained in a system created by human activity."
          ],
          "paper_id": "21caa630-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Complex System Classification"
     },
     {
          "head": {
               "text": "Classification Frameworks",
               "type": "modelling"
          },
          "paragraphs": [
               "Top-Down Frameworks In this section, the \"test bed\"-the ES systems list presented in -is used to assess various classification frameworks using the criteria outlined previously. The frameworks of potential interest come largely from past work generally starting with the General Systems Theory ideas of the 1950's (W. Ashby 1963), (Bertalanffy 1968), ), (Hubka, Eder 1988), (Froncois 1997).",
               "The first system classification scheme is due to Bertalanffy (Bertalanffy 1968) who extended Boulding's work ). These frameworks were suggested as part of their efforts on \"General System Theories\" in the 1950's. The list as presented by Bertalanffy had a strong orientation towards his discipline of biology, and is summarized in the left side of below. Miller later described various levels of living systems and this is shown on the right hand side of . In each of these lists, each successive item increases in complexity, and to some degree incorporates the preceding entries. In addition, Bertalanffy suggests the \"theories and models\" useful in each level of his hierarchy. Although this is the kind of utility desired, both of these frameworks fail the first criterion as they do not differentiate among the systems of interest. All of the \"test bed systems\" are similar combinations of the last three levels in both hierarchies and then only if we assume complex human-designed systems are included in these categories.",
               "A second early framework was proposed by Paynter (Paynter 1960) where he considered four system types:",
               "1. Services and utilities-water supply, electric power generation, communication 2. Structures-buildings, houses, bridges 3. Instruments-clocks, computers 4. Vehicles-submarines, aircraft, spacecraft, ships, automobiles",
               "It is clear from this that Paynter was interested in a very broad range of systems. Although some of the systems listed in can be fit into his scheme, most are poorly described by the categories and most are simultaneously in two or more of the categories. Moreover, inclusion of manufacturing systems, product development systems and markets in (sometimes as \"components\") indicates-not surprisingly-that Paynter was also not considering Engineering Systems as broadly as defined here.",
               "A third more fully developed approach from within the European Systems Engineering tradition is due to V. Hubka . Hubka considers a variety of possible bases for classification including function, branch of the economy, type of operand, physical principles of importance, product use, production method, materials, etc. shows Hubka's overall depiction of Technical Processes, the environment and the human along with the \"Technical System\". All of his classification discussion focuses on the Technical System. This framework therefore also fails our first criterion as it does not differentiate among or really address our systems of interest-all have significant interwoven technical and human/social complexity. "
          ],
          "paper_id": "21caa630-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Complex System Classification"
     },
     {
          "head": {
               "text": "Bottom Up Analysis",
               "type": "modelling"
          },
          "paragraphs": [
               "In summary, prior classification schemes did not consider ES by the definition in this paper and also fail to usefully separate them from one another. Nonetheless, many prior suggestions of attributes of systems can be used to examine (bottom-up) if these attributes can be a basis for useful characterization and classification.",
               "The attributes considered are shown in , along with the literature sources suggesting the importance of the attribute. The third column in the table gives the basis for the qualitative assessment used in characterizing the test bed list. These are further defined in the legend starting below . See Branch of Economy (Hubka, Eder 1988) See Realm ) See Legend for : Degree of Complexity: Complexity is related to the amount of information needed to describe the system and is also a function of the number of (unique) elements in the system as well as the number and nature of their interconnections. shows the specific comparator adopted here. By this measuring scale, all ES in the test bed list turn out to be at the highest complexity (level IV) which confirms that our list as intended addresses complex systems. Branch of Economy: what part of the economic system does the ES belong to? shows the breakdown adopted here. Realm of Existence: is the system only present in \"thought\" or does it manifest itself in the physical world, i.e. in some way connected to matter or energy? (All of the test bed list of ES are real, i.e., have physical aspects.) Origin: is the system naturally occurring without human intervention or is its existence the result of a deliberate or accidental process involving human design and implementation? (All ES are artificial, that is, involve human intervention.)",
               "Boundary: is there any exchange of matter, energy, or information across the system boundary? (All ES are open.)",
               "Time Dependence: is the system time invariant, i.e. do any of the system's states change with time or do any of the system's properties change with time?",
               "The system is time varying if some system properties or system elements or interrelationships change over time System States: are the system states continuous (e.g. temperature) or are they discrete (e.g. \"on\" or \"off\") or a mix of both (hybrid)? Few system modeling techniques are good for hybrid systems, usually one finds techniques for dealing with continuous systems or finite state machines (\"automata\"). (All ES are hybrid.) Human Involvement/System Control: some systems require constant involvement of a human operator, autonomous systems do not need human operators or guidance during operations, mixed systems have elements at least partially controlled by humans and autonomous elements. (All ES are mixed.) Human Wants: On the highest level, the purpose of all engineering is to fulfill human wants so all engineering systems have been designed (over a complex series of designs and redesign that resemble evolution) to fulfill human wants.",
               "The system attribute associated with this is defined by the Human Wants categories shown in . , where q is the state vector. The system is considered time-invariant as long as the entries in the matrices A, B, C, D are constant. is the ownership or control of the specific system in question. This attribute is given in , where six classes of ownership/control are defined."
          ],
          "paper_id": "21caa630-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Complex System Classification"
     },
     {
          "head": {
               "text": "Table 7. Ownership/Control Attribute of Engineering Systems",
               "type": "modelling"
          },
          "paragraphs": [
               "SFP: Single, private, for-profit ownership and control of the system MFP: Multiple, private, for-profit entities in control SNFP: Single, not-for-profit controller MNFP Multiple not-for-profit control GOV: Governmental control COMB: Complex combinations of 1 through 5",
               "Functional Type: a potentially important classification scheme is due to , Hubka (Hubka, Eder 1988) and van ). An example of classification by functional types due to van Wyk is shown below in . It is a three-by-three matrix consisting of 3 outputs (or operands) and three \"types\" of manipulators. From the analysis just completed, seven of the eleven attributes in are useful in the characterization of ES (differentiation from other systems) but not in classification (differentiation among ES). All ES are complex, real, open, artificial, dynamic, hybrid (system states are both continuous and discrete) and have mixed control (have both autonomous and human-in-the-loop elements or subsystems). It is suggested that these characteristics can serve to strengthen our definition and understanding of Engineering Systems.",
               "From the same analysis, there remain 4 attributes which differ among the ES in and these will be explored individually starting in the next paragraph. However, it is important to recognize that all four attributes (Human Wants, Functional Type, Economy Branch and ownership) essentially involve external descriptors of the systems rather than internal differentiators. The possible internal differentiators such as complexity and system states are -at least in the metrics used here-indistinguishable. This largely arises because of the current limitations in quantifying such internal variables for specific ES (see Magee and for preliminary attempts) and may also arise due to the recursive nature of the systems concept preventing meaningful differentiation among systems that have similar internal features. shows the ES from listed according to the four attributes that give some differentiation. In , the ES are shown separated according to Human Wants (given in ) as it comes closest to being able to pass the first criteria of differentiating among the ES. Hubka's somewhat similar grouping is not as effective partly because it does not consider service as opposed to manufacturing industries and does not cover all human wants as demonstrated in the large number of cases in with no Economy Branch . The ownership differentiation is also fairly strong but is shown simply as an additional attribute. The separation by Human Wants still leaves a significant number of systems classified as for multiple human Wants. Among those classified, the largest groupings are for Transportation, Communication, Security and Health. In the multiple use category, many of the systems are markets, software, and other IT tools, all of which support meeting multiple human needs. shows van Wyk's nine categories from for each system in the second column. We should note that almost all of the ES transform, transport and store energy to some extent (all information is accompanied by at least a minimum amount of energy). In addition, almost all also process (transform), and store information. Thus, in column 2, the essential functional categories are identified and listed. The essential functions are those necessary to serve the basic human need(s). For more than 1/2 of the ES, a single essential function can be identified. However, for a large number there seem to be at least two major functional types that describe the Engineering System. For some very complex systems such as the Tokyo Metropolitan Area and the U.S. Aerospace Industry, at least three functional types describe the system basic functions.",
               "Despite these difficulties, Functional Type as originally expounded by Hubka, Pahl and Beitz, and van Wyk appears to be the only technical attribute able to differentiate among ES. Moreover, it is the only one of the 4 \"differentiating attributes\" that can go beyond the first criteria for assessing usefulness of classification schemes. Differences in modeling and important differences in modularity and other design characteristics are suggested for functional types by the work of Whitney ( ) who has shown some significant distinctions between systems that have either information or energy as their major operand.",
               "Thus, functional type appears useful for classification. However, as shown in , the systems are not simply separated by this attribute. This is partly because the ES come from a broader and larger-scale set of systems than those originally of interest to van Wyk. The ultimate ambition is to find a complete set of functions, i.e. an essential set that is sufficient to describe any Engineering System. An initial attempt is made here by first broadening the list of manipulators beyond the three in to include market and control systems. In addition, the three outputs are also broadened to include value (or money). Thus, following Object Process Methodology (Dori 2001), we have the following operators on objects:",
               "-Transformation Systems (1): transform objects into new objects -Distribution Systems (2): provide transportation, i.e. change the location of objects -Storage Systems (3): act as buffers in the network and hold/house objects over time -Market Systems (4): allow for the exchange of objects mainly via the Value layer -Control Systems (5): seek to drive objects from some actual state to a desired state",
               "We distinguish the following operands:",
               "-Matter (M) physical objects, including organisms that exist unconditionally -Energy (E): Stored work that can be used to power a process in the future -Information (I): Anything that can be considered an informational object -Value (Monetary) (V): Monetary and intrinsic value object used for exchange This Object Process Model thus effectively expands the classification scheme of to that shown in . In this expanded 5 x 4 classification matrix, selected complex systems from the test bed list are assigned to a particular cell of this Engineering Systems Classification Matrix. ."
          ],
          "paper_id": "21caa630-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Complex System Classification"
     },
     {
          "head": {
               "text": "Process/Operand",
               "type": "modelling"
          },
          "paragraphs": [
               "Matter (M)",
               "The entries in the columns of the first row of correspond to the primary operand classes that an Engineering System can operate on. An operand is the object that is being affected or that results from the primary process that is enabled by the Engineering System. Examples of operands for the four classes are:"
          ],
          "paper_id": "21caa630-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Complex System Classification"
     },
     {
          "head": {
               "text": "Matter:",
               "type": "modelling"
          },
          "paragraphs": [
               "packages, vehicles, crude oil, animals, plants, water, memorabilia Energy:",
               "potential, electrical, kinetic, thermal, nuclear Information: news reports, email, TV shows, voice conversations, books (content), bits Value: stocks, bonds, cash, inventory, loans, credit, currencies, options",
               "Use of this expanded matrix introduces tighter definitions but more categories (20 vs. 9) than by following . The benefit of doing so is demonstrated by the single entry in for the Health Care System of France vs. the three functional type entries listed for this ES in . However, such reductions are not general and for systems such as the Tokyo Metropolitan Area and China's Three Gorge Dam, multi-functional classification is probably inescapable.",
               "The object-process view of Engineering Systems raises a number of questions. One is whether the set of proposed fundamental functions is complete and unique. The examples in seem to indicate the usefulness of the set, but cannot prove its exhaustiveness. Another valid issue is how this view ties back to the fulfillment of human wants and needs. Each of the Engineering Systems has a particular purpose and helps meet human wants and needs in concert with other Engineering Systems. The functional classification is fundamentally a separate model and is potentially useful in describing (and designing) systems having a variety of purposes."
          ],
          "paper_id": "21caa630-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Complex System Classification"
     },
     {
          "head": {
               "text": "Concluding Remarks",
               "type": "modelling"
          },
          "paragraphs": [
               "This paper has reviewed a number of proposed classification schemes from the literature and has attempted to assess their applicability to a test bed list of Engineering Systems. We have augmented the proposed classification schemes using object-process methodology to essentially extend the functional type classification schemes originally suggested by others , . Fundamentally this corresponds to a functional classification of Engineering Systems by specifying the operand on which they primarily operate as well as their function with that operand.",
               "There are three additional issues about which further discussion and work will be valuable. The first is the question of agreement as to the difference between Engineering Systems (or other special complex systems such as \"Systems of systems\") and other complex systems. In this paper, it is suggested that the three attributes that make systems \"Engineering Systems\" are: human designed for a purpose, high degree of human complexity and a high technical complexity. All of these criteria are in agreement with the specific systems considered in this paper but a wider consensus would be valuable in improving communication about this important subject. An alternative has not been suggested that is capable of delineating these fields because of the multi-faceted and quantification difficulties associated with complexity.",
               "The second issue involves the clarification of all significant system attributes. This paper has shown that classification of Engineering Systems only makes sense if we consider specific system attributes. There are potentially many more attributes of systems than were discussed in this paper. Work will have to be done to see if any other attributes of Engineering Systems are considered to be important. A logical area for fruitful interaction would be economic classification schemes such as standard industrial classification (NAIC).",
               "The third issue that particularly needs work if substantial progress is to made in understanding engineering systems is quantitative systems analysis. In order to determine the actual usefulness of the functional classification suggested here, extensive study of quantitative attributes is needed. Such quantification has occurred for all successful classification schemes. Mendeleyev measured atomic masses and counted valence electrons, Linnaeus measured animal sizes, catalogued their anatomical features and assembled them into species, Ashby (Ashby, ) made various cross-plots of material properties such as density, elastic modulus, strength, cost, and particularly ratios of material properties which allow clear classification of complex material systems. Such an approach and its potential value for engineering systems was outlined in the previous paper ). However, obtaining sufficient data to begin to mimic for engineering systems the classification approach for materials properties awaits much further definitional and other measurement work. Many years and numerous contributors did this important kind of quantification and measurement work before the key contribution of Ashby and Jones could be useful."
          ],
          "paper_id": "21caa630-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Complex System Classification"
     }
]