[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "2 Current and New Directions Computational social choice is an exciting interdis-ciplinary field at the intersection of computer science and social choice theory. In this article, I discuss some current and new directions in the field. This is an accompanying paper of my IJCAI 2016 Early Career Spotlight invited talk."
          ],
          "paper_id": "21cc05c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Computational Social Choice: Some Current and New Directions"
     },
     {
          "head": {
               "n": "1",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Computational Social Choice (COMSOC) is a multidisciplinary research field that combines ideas, models, tools, and techniques from both traditional social choice theory as well as computer science. On one side is classical social choice theory that involves a formal and axiomatic approach towards the problem of achieving socially optimal, fair, or stable outcomes by aggregating agents' preferences in a suitable manner. Representative social choice settings include voting and allocation problems. Since many multi-agent settings within computer science such as ranking systems, crowdsourcing, cloud computing, and two-sided matching markets involve similar concerns, social choice theory has provided a groundswell of ideas to model strategic scenarios in mult-agent settings and formalize fairness and welfare. On the other hand, there are many important problems in social choice that require computational consideration to build scalable systems. Computer science with its toolkit of optimization techniques, tradeoff analysis, and algorithm design is ideal to tackle such problems.",
               "The symbiosis between computer science and social choice theory is well-documented . AI researchers have been at the forefront of many such developments. As computational social choice matures as a field, flagship handbooks and textbooks have recently been published. The purpose of this short paper is to mention some current and new trends with COMSOC. The list is very much a personalized perspective on a rich and active field. This is an accompanying paper of my IJCAI 2016 Early Career Spotlight invited talk. The directions I will mention are some I have been working on with colleagues in recent years.",
               "The most well-studied settings in COMSOC include deterministic voting rules selecting a single winning candidate, or mechanisms to divide a set of goods between agents. Recent research tries to go beyond some of these settings. For instance, there has been further progress on randomized voting rules rather than deterministic, on voting rules that select a committee rather than a single winner, and on mechanisms that allocate chores rather than goods. Other approaches include dropping the assumption that agents will act sincerely in settings such as resource allocation and considering computational aspects of strategic behaviour. Finally, reasoning about uncertain preferences in multi-agent settings is another promising direction."
          ],
          "paper_id": "21cc05c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Computational Social Choice: Some Current and New Directions"
     },
     {
          "head": {
               "n": "2.1",
               "text": "Randomized Voting",
               "type": "introduction"
          },
          "paragraphs": [
               "A major focus within computational social choice has been on computational and axiomatic aspects of deterministic voting rules. In many of the papers, if multiple candidates are short-listed as winners, then a lexicographic tie-breaking rule is assumed to return a unique candidate. In the past few years, there has been refreshed focus on randomized voting rules that return a probability distribution over alternative instead of single deterministic alternative . Randomized voting rules can also be viewed as deterministic fractional voting rules in which the probability of a candidate is its fractional share. Randomization may be a mechanism to escape from various impossibility results .",
               "When the outcomes may be probabilistic, the design space of interesting voting rules becomes much richer. Similarly, standard properties and goals such as participation incentive, strategyproofness, and Pareto optimality need to be generalized to the randomized settings. Often, the properties can be generalized to randomized settings in a number of interesting ways. There has been a flurry of new work in randomized voting on questions such as which axioms can be simultaneously satisfied or are incompatible, as well as the computational complexity of computing outcomes. A case in point is work on the maximal lottery rule that can be viewed as the right way to return a 'randomized Condorcet winner' . Other interesting new randomized voting rules that have been recently proposed that are fairer or less manipulable than deterministic voting rules."
          ],
          "paper_id": "21cc05c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Computational Social Choice: Some Current and New Directions"
     },
     {
          "head": {
               "n": "2.2",
               "text": "Multi-winner Voting",
               "type": "introduction"
          },
          "paragraphs": [
               "There has also been a surge in new research in multi-winner voting or what is also referred to as committee voting. In the single-winner voting, agents can compactly express preferences over all possible outcomes since the set of outcomes coincides with the set of candidates. In multi-winner voting, the number of possible outcomes can be exponential in the number of candidates. Hence, new computational issues arise with respect to succinct and expressive representation of agent preferences as well as computing optimal multiwinner outcomes. Multi-winner voting can be seen more generally within the umbrella of voting in combinatorial domains .",
               "Compared to single-winner voting, axiomatic aspects of multi-winner voting are also relatively less explored . For example, recently we have been examining a very simple setting in which each agent approves a subset of candidates and based on these approvals, a specified number of candidates are selected . For this particular setting, we proposed a reasonable property called strong justified representation that captures a fairness goal about which agents should have how many approved candidates in the winning set. We showed that the axiomatic property characterizes an interesting voting rule called proportional approval voting (PAV) (see e.g., ). The field has a number of under-explored areas and there is potential to generalize rules and characterizations for single-winner settings to those multi-winner voting (see e.g., ) as well as to formalize the right axioms for specific multi-winner voting application domains and devise efficient algorithms for rules that satisfy those axioms (see e.g., ).",
               "Cake-cutting setting is a versatile mathematical model for allocation of a heterogeneous divisible good among multiple agents. Its main application is fair scheduling, resource allocation, and conflict resolution ]. In the past few years, many of the new developments in algorithmic aspects of cake cutting have been due to AI researchers. For a recent survey on the topic, see or .",
               "A major goal in the field is finding protocols that use minimal number of queries to compute a fair allocation. It has been open for years whether there exists an envy-free protocol for more than three agents that uses bounded number of queries. Recently, we showed that there exists a bounded envy-free protocol for the case of four agents and even for any number of agents . It will be interesting to see if some of the new techniques used in the protocols can be applied for other fairness concepts. Now that we have shown there exists a bounded envy-free protocol, it also opens the door for finding optimal bounds. The lower bound query complexity of envy-free cake cutting is far from well-understood with only a few results ."
          ],
          "paper_id": "21cc05c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Computational Social Choice: Some Current and New Directions"
     },
     {
          "head": {
               "n": "2.3",
               "text": "Strategyproof Peer Selection",
               "type": "introduction"
          },
          "paragraphs": [
               "Peer Selection refers to the setting in which the set of voters (agents) and candidates coincide and a subset of agents are to be selected based on peer evaluations. Although standard voting rules can directly be applied to obtain a suitable outcome, such rules may give incentive to agents to misreport their valuations so as to have a better chance of being selected themselves. A challenge in this domain is to construct rules that are strategyproof and also perform well in identifying the 'best' agents. Although the problem is a fundamental one, it has been formally studied only in recent years . Developments within AI include an interesting randomized rule called Credible Subset that is strategyproof and performs well if each agent reviews a few other agents . We proposed a new rule called Dollar Partition that combines a natural agent partitioning approach with the 'sharing a Dollar' mechanism of de Clippel et al. . Strategyproof peer selection is still an under-developed area and there is scope for further axiomatic, algorithmic, experimental, and analytical work.",
               "Fair and efficient allocation of indivisible items has become one of the most active areas in COMSOC. In most of the literature, it is assumed that the items are goods for which the agents have positive utility . Some of the algorithms that are designed to work for allocation of goods may work for allocation of chores as well especially when preferences are ordinal. However, in general there are no reductions from allocation to chores to goods or vice versa. Compared to goods, the literature on fair allocation of chores is relatively under-developed. A case in point is that there has been exciting progress on approximation of max-min share fair allocations for goods . It will be interesting to see whether similar approximation bounds can be achieved for allocation of chores . Just like the allocation of indivisible items, cake cutting in the case where agents have negative utilities is less explored as well ]. Finally, allocating combinations of goods and chores is an even more general problem."
          ],
          "paper_id": "21cc05c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Computational Social Choice: Some Current and New Directions"
     },
     {
          "head": {
               "n": "2.6",
               "text": "Strategic Aspects in Fair Allocation",
               "type": "introduction"
          },
          "paragraphs": [
               "Computation complexity of manipulating voting rules is one of the most widely studied problem in COMSOC. There has been progress on looking at similar issues for well-known allocation rules. Relevant questions include the complexity of computing a best response; Nash equilibrium, or Stackelberg strategy as well conditions under which the rules are strategyproof. These questions have recently been studied for prominent allocation rules such as Fischer market allocation , sequential allocation , probabilistic serial , adjusted winner , scoring-based welfare maximizing rules , as well as cake cutting pro-tocols . Other related directions include quantifying the quality of equilibria under prominent allocation rules , understanding the tradeoffs between different fairness and strategic properties as well as devising rules with better strategic properties. Apart from strategic aspects in fair allocation, another promising direction is to minimally modify allocation settings (such as by adding or deleting items) so as allow for fair allocations ]."
          ],
          "paper_id": "21cc05c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Computational Social Choice: Some Current and New Directions"
     },
     {
          "head": {
               "n": "2.7",
               "text": "Matching and Coalition Formation with Uncertain Preferences",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Matching markets constitute a versatile formal model for matching agents to other agents as well as agents to resources. Much of the work on algorithmic and strategic aspects of matching markets assume that the preferences of the agents are deterministic . Dealing with uncertainty is a central concern in AI and uncertainty could arise because of limited communication or information. Therefore, it will be interesting to explore resource allocation and matching with uncertain preferences. Similar work has already been done in voting (see e.g., ). The uncertainty in the preferences can be captured and represented in a number of natural ways. In these settings with uncertainty, it will be interesting to identify outcomes that are most likely to be efficient, stable or fair. Uncertain preferences are also relatively less explored in other coalition and team formation models such as hedonic games ."
          ],
          "paper_id": "21cc05c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Computational Social Choice: Some Current and New Directions"
     },
     {
          "head": {
               "n": "3",
               "text": "Conclusions",
               "type": "conclusion"
          },
          "paragraphs": [
               "Computational social choice is an exciting field with a number of fundamental problems than cut across various disciplines. In this paper, I have highlighted some developments and trends in the field. For the interested reader, I would recommend recents books by and Rothe that provide a useful window into the field."
          ],
          "paper_id": "21cc05c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Computational Social Choice: Some Current and New Directions"
     }
]