[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "This paper studies the problem of spreading a product (an idea, cultural fad or technology) among agents in a social network. An agent obtains the product with a probability that depends on the spreading rate of the product as well as on the behavior of the agent's neighbors. This paper shows, using a mean field approach, that there exists a threshold for the spreading rate that determines whether the product spreads and becomes persistent or it does not spread and vanishes. This threshold depends crucially on the connectivity distribution of the network and on the mechanism of diffusion. for valuable comments and suggestions. I also acknowledge the participants' contributions at seminars and conferences where the paper has been presented,"
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "n": "1",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Introducing a new product, technology or idea in the market is an issue of major socialeconomic relevance. Innovations do not necessarily spread at once, but often spread gradually through social and geographic networks. In fact, many products promote rather easily in a social system through a domino effect. In a first stage a few innovators adopt the product, and this makes more likely that their neighbors do the same, then their neighbors' neighbors and so forth. One possible explanation for this phenomenon is that individuals' opinion heavily depends on the opinion of their interpersonal ties. Indeed, most products spread more efficiently due to \"consumer-to-consumer dialogue\" since these communication channels are more trusted and have greater effectiveness than mass media advertisements.",
               "Another feature that favors diffusion is the coordination effect. In fact, there are many cases where in order to exploit the benefits of your product, you have to coordinate in your decision with your neighbors. A recent example is that of the mobile phones. They became popular in the mid 90's and, at present, almost every individual possesses a phone, which is considered as an essential commodity in developed countries. Apart from the intrinsic advantages that the new product might provide to its users, the fast spreading of it in the population is reinforced by more subtle aspects, such as fashion and benefits from coordinating in the decision with your contacts. Traditional marketing is being replaced by new strategies in which the product is turned into \"epidemics\" where consumers do the marketing themselves. This phenomenon shares common features with the contagion of an infectious disease in a population. The aim of this paper is to generalize existing epidemic models in order to accommodate them to describe diffusion in social and economic contexts.",
               "In particular, we address the following question: How does the spreading pattern depend on the properties of the social network and on the diffusion (or contagion) mechanism?",
               "We consider a large population with a complex pattern of interaction among agents. In fact, the population is described as a network structure where individuals (nodes) interact exclusively with a fixed group of neighbors (nodes with whom they are directly linked).",
               "Traditionally, the study of networks has been a topic of graph theory. Graph theory, however, has concentrated in small networks with a high degree of regularity. This paper, however, focuses on the large-scale statistical properties of the network instead of on the properties of single vertices. For instance, the number of edges a node has -the connectivity of the node-is characterized by a distribution function P (k), which gives the probability that a randomly selected node has exactly k edges. We assume that the precise topology of the network is unknown and thus it is considered as a \"random ensemble\". These networks are referred as \"random networks\". The seminal papers on random networks developed by , define a random graph by a group of N nodes such that every pair of nodes is connected with a certain probability p > 0. The graphs generated in this manner have a binomial connectivity distribution which tends to a Poisson distribution, as the size of the population tends to infinity. Hence, this distribution has its peak at the average connectivity. In other words, the majority of nodes have a similar connectivity.",
               "Recent studies, however, show that most large complex networks are characterized by a connectivity distribution different to a Poisson distribution (e.g., ; ). For instance, the world wide web, Internet or the network of human sexual contacts, among others, have a power-law connectivity distribution, i.e. P (k) ? k ?whereranges between 2 and 3. This implies that each node has a statistically significant probability of having a very large number of connections compared to the average connectivity which generates an extreme heterogeneity in the connectivity of agents. Such random networks are called scale-free. In this paper we focus on generalized random networks. These networks are random, in the sense that the link formation process is still determined in a stochastically independent fashion across nodes.",
               "However, the underlying connectivity distribution is allowed to be arbitrary. Therefore, the \"Erdos and Renyi \" (Poisson) random networks, as well as the scale-free (power-law) random networks simply become particular cases of this general setup. Although this work attempts to be of general applicability, we pay special attention to the differential properties of Poisson and scale-free networks, due to their long tradition in the literature on social networks.",
               "We therefore consider agents are connected by means of a generalized random network. Each agent, classified as either an \"active\" or a \"potential\" consumer, is represented by a node in the network. The transition from a potential to an active consumer depends on the intrinsic properties of the product as well as on the number and behavior of neighbors. Conversely, an active consumer becomes potential at an exogenously given rate. This reflects the idea that the technology in question is subject to a decay, obsolescence or breakdown. Therefore, with a certain probability, independent of the behavior of neighbors, an agent may need to replace the product and hence may become a potential consumer again.",
               "The framework considered in this work is closely related to the so-called \"susceptibleinfected-susceptible\" (SIS) model, commonly used in epidemiology. Some paradigmatic examples that are described using the SIS model are the diffusion of sexually transmitted diseases in a sexual contact network or the spreading of a computer virus via Internet (e.g., ). Each agent is represented by a node and can be either \"healthy\" or \"infected\". In each time step a healthy node is infected at a certain rate if it is directly connected to at least one infected agent. Conversely, an infected agent is cured at another certain rate. This paper extends the SIS model by introducing a richer framework to reflect local dependencies or neighborhood effects. Unlike epidemiological models, where contagion events between pairs of individuals are independent, the effect that a single infected neighbor has on a given node depends critically on the states of the node's other neighbors. The SIS model considers the contagion of a disease as a linear function of the absolute number of infected neighbors, whereas the present model allows for non-linear mechanisms. Indeed, we could consider a concave mechanism where adding more active consumers in the neighborhood of an agent increases the chances that the agent becomes active, but with a decreasing marginal impact. Furthermore, the intensity of each interaction could depend on the total number of interactions. In other words, the more neighbors an agent has, the less significant any one of them becomes. Consequently, the contagion mechanism is not necessarily expressed in terms of the absolute number of a node's neighbors adopting the product, but could instead depend on the corresponding fraction of the neighborhood. One of the objectives of this work is to account for the differences in the results as we vary the mechanism of diffusion.",
               "The theoretical results of our model are derived using the so-called mean field theory. This approach is commonly used in physics and biology since it provides a reasonable guide of the qualitative behavior of complex systems. Heuristically, it is a continuous time system where all decisions happen for certain at a rate proportional to the mean. Moreover, it simplifies the description of the exact contagion process by substituting local variables of the dynamics by their global mean values.",
               "We show, using the mean field theory, that there exists a threshold for the degree of contagion (or spreading rate) of the product, such that, above the threshold the technology spreads and becomes persistent. This threshold depends crucially on two features: the mechanism of diffusion and the connectivity distribution of agents in the population. We also show that, when the contagion of the product only depends on the absolute number of active consumers among neighbors (i.e. the effect of the size of the neighborhood is absent), then networks with a higher variance have lower thresholds. Consequently, the diffusion of the product is easier and greater in scale-free networks than in Poisson networks, as expected from the recent empirical results (e.g., ). In contrast, if the intensity of each interaction decreases in parallel with the number of neighbors, i.e. , the contagion of the product depends on the relative proportion of active consumers among neighbors, the results change significantly. In particular, if the probability that an individual becomes active is proportional to the fraction of neighboring active consumers, the threshold coincides for all networks. Finally, for concave diffusion functions there always exists a continuous transition from the absence to the existence of diffusion, whereas for some particular non-concave diffusion functions, a phase transition or hysteresis phenomenon occurs.",
               "The formal framework considered in this paper is close to the literature on epidemiology and complex systems, mentioned above, where the mean field theory is often used. The inspiration for this work, however, comes mainly from the literature on social and economic networks. Recent instances of this literature show that the pattern of interaction between individuals is crucial in determining the nature of outcomes. A wide number of papers have focused on the analysis of lattices; that is, regular networks in which all players have the same number of direct connections (e.g., . One step beyond comes from Morris (2000) who has developed techniques to study coordination games in general networks, and from Calv-Armengol and Jackson (2004) who deal with the diffusion of information on job opportunities in a population. The present paper shares a flavour with Morris (2000) and Calv-Armengol and Jackson but introduces important novelties. First, we study very general contagion mechanisms characterized by the fact that the transition from one individual state to the other (active to potential consumer and vice versa) is stochastic and asymmetric. Second, we consider complex random networks rather than networks with a deterministic geometric form.",
               "The paper is organized as follows. The model is contained in Section 2. Section 3 introduces the mean field theory. The main results of the paper are presented in Section 4. Then, we introduce some stylized examples in Section 5. Further results are considered in Section 6 and in Section 7 we run some simulations of the original dynamics in order to test the validity of the results based on the mean field theory. Finally, Section 8 concludes. Some proofs have been relegated to an Appendix."
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "n": "2",
               "text": "The model 2.1 Generalized random networks",
               "type": "modelling"
          },
          "paragraphs": [
               "Let N = {1, 2, ..., i, ...n} be a finite but large set of agents. Assume agents communicate one with another through certain channels which determine the social system. More precisely, each agent interacts only with her fixed group of neighbors which represents her personal and professional contacts. Let K i ? N be the set of neighbors of player i and let k i be its cardinality which is referred as her connectivity from here onwards. We assume that the network is undirected, i.e., if a node i is connected to j then j is connected to i as well. Assume that the pattern of interactions between agents is complex. Moreover, the network structure has a high degree of randomness and thus can only be described by its large-scale statistical",
               "properties. Denote by P (k) to the connectivity distribution of the network, i.e. the fraction of agents in the population that have exactly k direct neighbors. Equivalently, P (k) is the probability that an agent chosen uniformly at random has connectivity k. Throughout this paper, the network is characterized by being \"random\" and having a connectivity distribution P (k) which is exogenously given. More precisely we consider a so-called generalized random network. These networks extend the Erdos-Renyi random graphs by incorporating the property of non-Poisson connectivity distributions. Formally, consider any connectivity distribution P (k) defined on N . LetN,P be the collection of networks defined on N that display the degree distribution P (k). Then, a generalized random network is simply a statistical ensemble in which every network inN,P is selected with equal probability. One of the aims of this work is to explicitly account for the influence of P (k) in the spreading behavior of the product. For most of our results we will focus on the differential properties of the three following types of connectivity distributions:",
               "(i) Scale-free networks",
               "Scale-free networks are characterized by having a power-law connectivity distribution. In particular,",
               "whereranges between 2 and 3. This property implies that there exists a significant proportion of agents with large connectivity with respect to the average (denoted by hki).",
               "These are the \"hubs\" of the network.",
               "(ii) Homogeneous networks",
               "Homogeneous networks are such that all nodes have approximately the same connectivity.",
               "In particular,",
               "Note that, the variance of P (k) is approximately zero."
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "text": "(iii) Poisson networks",
               "type": "modelling"
          },
          "paragraphs": [
               "Poisson networks are characterized by having a Poisson connectivity distribution. In particular,",
               "It is straightforward to show that the variance in the connectivity of nodes for Poisson networks lies in between the variance of scale-free and homogeneous networks."
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "n": "2.2",
               "text": "The diffusion mechanism",
               "type": "modelling"
          },
          "paragraphs": [
               "Assume there is a new product in the market. We focus on its spreading among the population N . To do so, consider that an agent iN can only exist in two discrete states",
               ", where s i = 0 if i is a \"potential\" consumer and s i = 1 if i is an \"active\" consumer. A potential consumer is an agent that does not have the product but is susceptible For further details on generalized random networks the reader is referred to .",
               "of obtaining it if exposed to someone who does. An active consumer is an agent that has already adopted the product and so can influence her neighbors in favor of obtaining it.",
               "Consider a stochastic continuous time dynamics process as follows. At time t, the state of the system is a vector",
               "where s it = 0 if i is a potential consumer at time t whereas s it = 1 if i is an active consumer at time t. Assume i is a potential consumer at time t. She becomes an active consumer at a rate that depends crucially on: her connectivity k i , the number of neighbors that are active consumers at time t (a i hereafter) and the spreading rate (or degree of contagion) of the product, denoted by0. More precisely, the transition rate from potential to active consumer is given by a function F (, k i , a i ) that determines the properties of the mechanism of diffusion. We assume independence of the spreading rate effect and the effect that the behavior of neighbors has over the agent's decision. Thus,",
               "where f (k i , a i ), named as the diffusion function from here onwards, is a non-negative func-",
               "It is worth noting that, the connectivity of an agent is fixed throughout the dynamics. Instead, the number of active consumers among neighbors \"a i \" might change over time. We suppose that a necessary condition for the adoption of the product is that at least one neighbor has already adopted it. More precisely,",
               "Roughly speaking, the transition from a potential to an active consumer can be interpreted as follows. At a rateany given agent becomes aware of the existence of the product -e.g.",
               "through mass media advertisement-and considers the possibility of adopting it. The agent's final decision, however, depends crucially on her neighbors' behavior. More precisely, the agent responds to her neighbors current configuration by choosing an action according to some choice rule. The particular choice rule considered is characterized by f (k i , a i ).",
               "Conversely, consider agent iN is an active consumer at time t. Then, i becomes a potential consumer at some stochastically constant rate> 0 which indicates the rate at which the agent may need to replace the product because it is lost or deteriorated. Notice that, this transition is independent of her neighbors' behavior. It is implicit in this formulation that the cost of \"maintaining\" the product is approximately zero and thus agents never have incentives for getting rid of it. Finally, let us define the effective spreading rate of the product by=.",
               "For concreteness, we will now define formally what we mean by the mechanism of diffusion.",
               "A diffusion mechanism is a pair m = (, f ()) wheredenotes the effective spreading of the product and f () denotes the diffusion function.",
               "Notice that, since the transition rates only depend on the properties of the present state, the dynamics induced by the connectivity distribution P (k) and the diffusion mechanism m determines a continuous Markov chain over the space of possible states S n .",
               "The aim of this work is to analyze whether and how the product spreads in the population.",
               "Several questions raise as natural:",
               "? Is there prevalence of the product in the long-run of the dynamics?",
               "? Are small perturbations of the initial state in which there are no active consumers enough to converge to states with a positive fraction of active consumers?",
               "? Is there a discontinuity (or phase transition) in the long-run proportion of active consumers as we increase?",
               "In the next section, we partially respond to these question by describing when and how the product spreads in the population. The analytical results of the exact model are extremely complicated and thus will not be tackled in this paper. Nevertheless, to proceed, two complementary approaches can be considered. On the one hand, the analysis of the model can be simplified using the so-called mean field theory. This approach is described and studied in detail in the next section. On the other hand, we can simulate the dynamics in order to obtain numerical approximations of the results for the exact stochastic model. This second alternative will be tackled in Section 6 below."
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "n": "3",
               "text": "The mean field theory",
               "type": "modelling"
          },
          "paragraphs": [
               "The analytical study of this model can be undertaken in terms of a dynamical mean-field theory. Other reports show that mean-field approximations can be expected to give a reasonable guide to the qualitative behavior of complex dynamics. Before describing the theoretical framework, we will present some additional notation. Letk (t) be the relative density of active consumers at time t with connectivity k. Consequently,(t) = P k P (k)k (t) is the relative density of active consumers at time t. From here onwards, the state of the system at any given time t, will be characterized by the profile (k (t)) k1 . Denote by(t)",
               "to the probability that any given link points to an active consumer. Therefore, the probability that a potential agent with k links has exactly a neighboring active consumers is",
               "since this event follows a binomial distribution with parameters k and(t). Obviously, there is an approximation inherent in this formulation because we have assumed that(t) is the same for all vertices, when in general it too will be dependent on vertex connectivity and other local properties of the vertex. This is precisely the nature of a mean-field approximation.",
               "Consider a potential consumer with k neighbors and a active consumers among them at time t. She becomes an active consumer at a ratef(k, a). Thus, the transition rate from potential to active consumer for an agent with connectivity k is given by",
               "The dynamical mean-field equation can thus be written as,",
               "Roughly speaking, equation says the following: the variation of the relative density of active consumers with k links at time t equals the proportion of potential consumers with k neighbors at time t that become active consumers (i.e.",
               "proportion of active consumers with k neighbors at time t that become potential consumers",
               "Assume that the time scale of the dynamics is much smaller than the life-span of the agents in the population; therefore terms reflecting birth or death of individuals are not included.",
               "Moreover, several assumptions are implicit in equation (1). First, we assume the size of the population is large, i.e. n+. Second, we consider the so-called homogeneous mixing hypothesis. This implies, on the one hand, no correlation between the connectivity of connected agents and, on the other hand, an homogeneous distribution of initial adopters in the population. In addition, in each period, the only source of heterogeneity in the population considered is the connectivity of agents.",
               "After imposing the stationary condition",
               "valid for the behavior of the system at large times is,",
               "where",
               "The exact calculation offor general networks is a difficult task. However, we can calculate its value for the case of a random network, in which there are no correlations among the connectivities of different nodes. For this case, it is straightforward to see that,",
               "k where hki is the average connectivity of the network, i.e. hki = P k kP (k). The system formed by the equations and determine the stationary values forand (k ) k . To solve this system, we should simply replace equation (2) in equation and",
               "where",
               "The solutions of equation are the stationary values of. Note that, these values correspond to the set of fixed points of the function H(). Although the exact stationary values forare generally difficult to obtain, the main questions raised at the introduction of the paper can be answered by simply analyzing the shape of all the functions in the family",
               "Upon replacingin equation we also determine the stationary values (k ) k ."
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "n": "4",
               "text": "The main results",
               "type": "modelling"
          },
          "paragraphs": [
               "In what follows we will present the main results of the paper. For concreteness, we will define first the concepts of sustainable diffusion, positive diffusion and unique diffusion of the product.",
               "Given P (k) and m, we say that there is sustainable diffusion of the product if there exists a locally stable state of the mean field dynamics with a positive fraction of active consumers.",
               "The concept of stability required in this definition is the standard one. Roughly speaking, a state is stable if it is a stationary state of the dynamics resistant to small perturbations.",
               "Notice that, sustainable diffusion implies that, under certain initial conditions, the dynamics converges to a state with a positive fraction of active consumers. Next, we will define the concept of positive diffusion.",
               "Given P (k) and m, we say that there is positive diffusion of the product if, starting at any initial state0 6 = 0, the mean field dynamics converges to a stable state with a positive fraction of active consumers.",
               "Notice that, positive diffusion does not imply uniqueness of the non-null stable state. Thus, the long-run behavior of the dynamics can depend on the initial conditions. However, it implies that, if we slightly perturb the initial state with no active consumers, i.e. we introduce a \"small\" number of initial adopters, the dynamics leads towards a non-null stable state. Finally, the following definition addresses the global behavior of the dynamics.",
               "Given P (k) and m, we say that there is unique diffusion of the product if there exists a unique stable state of the mean field dynamics with a positive fraction of active consumers.",
               "In other words, in the case of unique diffusion, the long-run behavior of the dynamics does not depend on the initial conditions.",
               "It is straightforward to show that the following implications hold;",
               "unique diffusion ? positive diffusion ? sustainable diffusion",
               "Notice that, the existence of a non-null solution of equation implies the existence of a non-null stable state* of the dynamics, which also implies sustainable diffusion of the product.",
               "Letk () be a function that provides for every given value of the effective spreading rate0, the relative density of active consumers with connectivity k predicted in the long-run of the dynamics, when the initial state is taken to be infinitesimally close to the one with no active consumers. Moreover, let() = P k P (k)k () be the degree of diffusion function.",
               "The aim of this section is to describe in some detail the relationship between the connectivity distribution of the network P (k) and the mechanism of diffusion m with the spreading behavior of the product. It is straightforward to show that, given (A-1) the state with no active consumers (= 0) is stationary. Thus, to spread the product in the population there must be an initial shock of active consumers. This section analyzes a situation where the initial state of the dynamics is such that there is a \"small\" proportion of initial adopters, i.e.0 ? 0. One interpretation for this is that the firm interested in the diffusion of the product initially gives it \"for free\". It is reasonable to assume that the firm is going to choose a small number of initial adopters and then rely on the contagion process for the diffusion of it to a larger fraction of agents. Given the nature of the question, we will first focus on the concept of positive diffusion defined above. Unique and sustainable diffusion, will be studied later in the paper.  ). Specifically, in order to assess the existence or not of some positive prevalence, it is enough to consider what happens in a neighborhood with only one active agent. As highlighted above, this is merely a consequence of the fact that, for positive diffusion to occur, the state with no active consumers has to be unstable. Notice that, If>p then, in the long-run, the product spreads and becomes persistent in a fraction of the population. The degree of the diffusion, however, might depend on the initial conditions. If, on the contrary, we assumep then, if there is only a small fraction of initial adopters, in the long-run, the product will disappear from the market. In other words, we either never reach a state with a positive fraction of active consumers or, if we do, it must be because there is a sufficiently high \"stock\" of initial adopters.",
               "The following corollary is obtained directly from the above result.",
               "Corollary 2 If the transition rate from potential to active consumer is independent of the connectivity of the agent (i.e.",
               "One of the main conclusions obtained from Corollary 2 is that the threshold depends on the connectivity distribution P (k). In particular, it depends on the ratio between its first and second order moments. Therefore, if we compare two generalized random networks with the same average connectivity, the one with the highest variance has the lowest threshold. The reason for this is the following: the variance of the connectivity distribution P (k) is given",
               "Sincep is inversely proportional to the second order moment, if we compare two networks with the same average connectivity, the value of the variance determines the value of the threshold. As an illustration, consider the three types of networks introduced above -scale-free, homogeneous and Poisson-and assume they have the same average connectivity. Then it is straightforward to show that their thresholds are ranked as follows:",
               "since this is also the ordering of their corresponding variances. Note also that for scale-free networks, the variance of the connectivity tends to infinity when the size of the population becomes arbitrarily large (i.e.,",
               "words, no matter how small the spreading rate is, positive diffusion of the product in the population will always occur. The intuition behind this result is the following. In scale-free networks there is a significant proportion of hubs, i.e., nodes with very high connectivity compared to the average. These nodes play a crucial role for the spreading of the product since they easily adopt the product due to their high connectivity. Furthermore, if they are active consumers, they are capable of influencing a significant fraction of individuals in the population."
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "n": "5",
               "text": "Some stylized examples of diffusion mechanisms",
               "type": "modelling"
          },
          "paragraphs": [
               "In this section we present several stylized models that fit into the general setting introduced above."
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "n": "5.1",
               "text": "A model of diffusion with bounded rationality",
               "type": "modelling"
          },
          "paragraphs": [
               "Consider a population of agents N = {0, 1, ..., n}. As before, agents interact only with their fixed group of neighbors. The pattern of interaction among them is described through a social network where each node represents one agent and the connections among them are represented by links.",
               "Let x be a new technology. Assume that the cost incurred by an individual i in case of adopting x is randomly determined by e c i . For the sake of concreteness, suppose",
               "where C is the highest possible cost. Also assume that (e c j ) jN are i.i.d. Therefore (expost) the cost can be different across agents. For simplicity, assume that, once adopting the product, the cost of maintaining it is zero.",
               "Suppose that, if two players are neighbors, there is a pairwise interaction that can generate mutual payoffs. The common set of strategies is S = {0, 1} where s i = 1 means agents i is an active consumer whereas s i = 0 otherwise. For each pair of strategies s, s0S, the payoff earned by a player i choosing s when interacting with her partner j choosing s0 is b > 0 if both players are active consumers and zero otherwise. For the sake of concreteness assume b < C. ",
               "Consequently, i's rate of transition from potential to active consumer is the probability that agent i's cost is below her benefits, i.e.",
               "Note that, the reverse transition, i.e. from active to potential consumer, is never a best response of the player. Nevertheless, we assume that at a rate> 0 the product deteriorates and needs to be replaced. If this were the case, agents have to re-consider the possibility of adopting it or not.",
               "Observe that, here, the diffusion function only depends on the absolute number of active consumers among neighbors. In consequence, two agents with the same number of neighboring active consumers have the same probability of becoming active consumers and this is independent of their respective connectivities. In this case, the threshold for positive diffusion is equal to C b hki hk 2 i . Notice that the threshold not only depends on the connectivity properties of the network in the same way as shown in Corollary 2, but also on the two additional parameters introduced, i.e., C and b. This feature depends crucially on the specific context considered as illustrated through the alternative example presented below.",
               "Consider now the setting presented above and assume that the intensity of each interaction decreases with the total number of interactions. For simplicity, assume that i's benefit from interacting with an active consumer if he becomes active is given by b ki . Also here, overall benefits are computed as the sum of the benefits obtained from each bilateral interaction.",
               "Therefore, if we consider any potential consumer i with connectivity k i and with a i active consumers among her neighbors. Then, this agent will become an active consumer iff,",
               "Consequently, i's rate of transition from potential to active consumer is the probability that agent i's cost is below her benefits, i.e.",
               "As before, assume that at a rate> 0 an agent needs to replace the product because it is lost or deteriorated.",
               "Note that here the diffusion function depends both on the absolute number of active con- "
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "n": "5.2",
               "text": "Two testable models",
               "type": "modelling"
          },
          "paragraphs": [
               "We now introduce two simple examples that provide a sufficiently rich benchmark to run simulations of the stochastic dynamics.",
               "First, we consider the epidemic model introduced by .",
               "A potential consumer (susceptible agent) becomes active at a rateif there exists one active consumer in the neighborhood. Moreover, this rate increases linearly with the number of active consumers. Thus, the transition rate from potential to active for an agent with a active neighboring consumers is equal toa (independently on the agent's connectivity).",
               "Notice that, Pastor-Satorrs and Vespignani's model simply becomes a particular case (for f (k, a) = a) of the general setup presented in this paper and therefore we know its critical",
               "Secondly, we consider a model in which a potential consumer adopts the product with probability equal to the proportion of active consumer in the neighborhood. Specifically f (k, a) = a k . In this case, the critical spreading rate is equal to unity, i.e.,p = 1. As before, this is independent of what might be the underlying network (scale-free, Poisson, homogeneous, etc.)."
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "n": "6",
               "text": "Further results",
               "type": "modelling"
          },
          "paragraphs": [
               "Up to now we have analyzed whether there is or not prevalence of the product in the population when the initial state is \"close\" to the state with no active consumers. We now want to go one step beyond and study more general properties of the dynamics."
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "n": "6.1",
               "text": "Concave diffusion functions",
               "type": "modelling"
          },
          "paragraphs": [
               "In this section, we find conditions over the diffusion mechanisms that guarantee a unique long-run behavior of the dynamics. In other words, we analyze the convergence of the dynamics independently of initial conditions. Consider a diffusion function satisfying an additional assumption. For all k1, f (k, a) as a function of a is (weakly) concave. In other words, the following must hold:",
               "Hence, for any given agent, adding one more active consumer among her neighbors has an impact over her probability of obtaining the product, which is (weakly) decreasing with respect to the existing number of active consumers among her neighbors.",
               "The following proposition determines the threshold for unique diffusion of the product.",
               "Proposition 3 Given a network with connectivity distribution P (k), and a diffusion function f (k, a) satisfying (A-1) and (A-2) there exists a threshold for the effective spreading rateu = hki P k k 2 P (k)f (k,1) such that, there is unique diffusion of the product if and only if>u . Moreover, ifu the dynamics converge to the state with no active consumer.",
               "A detailed proof of Proposition 3 is presented in the Appendix. The sketch of the proof is the following. Assumption (A-2) implies H() is concave for all0 (this is proved in the Appendix). Thus, if dH() dc=0 > 1 there is a non-null stationary state which is globally stable.",
               "3 However, if",
               "is the unique stable state.Lets denote the threshold for sustainable diffusion. Note that, we obtain:",
               "As a consequence of this result we have the following corollaries.",
               "Corollary 4 Given a network with connectivity distribution P (k), and a diffusion function f (k, a) satisfying (A-1) and (A-2), then the degree of diffusion function() is continuous.",
               "The proof of this result is straightforward. Notice that, as aforementioned, for all0,",
               "as a function ofis increasing and continuous. This implies that, the solution of equation , i.e.(), as a function ofis also continuous, and by the same token the degree of diffusion function() is continuous as well.",
               "As an example, consider a diffusion function satisfying (A-1) and (A-2) and such that it is independent of the connectivity of agents (i.e.",
               "the degree of diffusion function for the three types of networks aforementioned -scale-free, homogeneous and Poisson-is continuous (see the graphs represented in ). Notice that, for low values ofthe degree of diffusion is higher for scale-free networks than for",
               "Poisson networks and higher for Poisson than for homogeneous networks.",
               "The proof of this result is attained by simply substituting f (k, a) = a k in the expression for : Degree of diffusion function for scale-free, homogeneous and Poisson networks Notice that, g,k () does not depend on k. Then, replacing g,k () in equation (5) the following holds:",
               "It can be easily shown that, equation has a unique non-null solution when> 1 which",
               ". Thus, after simple algebraic operations, the degree of diffusion is:",
               "It is worthwhile mentioning that, in this case, the degree of diffusion function does not depend on the connectivity distribution of the network (see )."
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "n": "6.2",
               "text": "Other diffusion functions: phase transition",
               "type": "modelling"
          },
          "paragraphs": [
               "Assume now that for all k1, f (k, a) as a function of a is (weakly) convex. The following must hold:",
               "Hence, for any given agent, adding one more active consumer among her neighbors has an impact over her probability of obtaining the product, which is (weakly) increasing with respect to the existing number of active consumers among her neighbors. ",
               "This contagion mechanism takes into account the relative density of active consumers among an agent's neighbors in a convex way. The threshold for positive diffusion in this case is equal to the average connectivity,p = hki (see Theorem 1). To study the threshold for unique",
               "and sustainable diffusion we will analyze the shape of the family of functions {H()}หก0 .",
               "Note that, in this case, function g,k () is equal to the expression,",
               "whereis a random variable that follows a binomial distribution with parameters, k.",
               "That is,? Bin(k,). Therefore, the following holds,",
               "and thus,",
               "The function H() in this case has the form,",
               "The shape of H() depends crucially on P (k). Therefore, for the sake of simplicity, we will focus on two specific types of networks: (i) a scale-free network with= 3, i.e. P (k)k ?3",
               "and (ii) an homogeneous network.",
               "It is straightforward to show that, if hki is sufficiently high (higher than 5) for both cases (i) and (ii) the family of functions {H()}หก0 exhibits the following pattern. For low values Note that, if {H()}หก0 is an S-shape family of functions, the following holds: positive diffusion ? unique diffusion and thusp =u .",
               "Moreover, there exists a threshold e(concavity threshold ) for the spreading rate such that, if",
               "This value is implicitly obtained by the expression H 00(0) = 0. After some simple algebraic operations we obtain the following expression,",
               "It is straightforward to show that, the two types of networks considered satisfy,",
               "This implies, in particular, that the threshold for positive diffusion is below the threshold for concavity, i.e.p < e. In other words, the function associated with the threshold for positive (or unique) diffusion, has an S-shape. Therefore, presents a graphical illustration of the way the thresholds are obtained.",
               "The main consequences of this result are the following:",
               "? Ifs <<p , there are two different (non-null) stationary states of the dynamics;",
               "an unstable state, denoted by* 1 and a stable state denoted by* 2 (see ). Two effects take place when the spreading rate becomes higher. On the one hand, the proportion of active consumers in the non-null stable state (* 2 ) increases. On the other hand, its basin of attraction also becomes larger.",
               "? There is a phase transition or discontinuity in the degree of diffusion function. In other words, when the spreading rateis \"slightly\" above the thresholdp , the degree of diffusion() is significantly positive.",
               "? The effect of varying the value of the spreading ratecan be analyzed using a different approach. Assume that the contagion dynamics has already reached a certain stable state. Where would the dynamics converge if there was an increase or decrease of the effective spreading rate? In other words, taking as initial condition the previously established stable state, what would be the new long-run prediction of the dynamics?",
               "As illustrated by the graph represented in , if the spreading rate increases (upward arrows in the then the long-run behavior of the dynamics would coincide with the one exhibited by function(), thus, having a discontinuity at=p .",
               "However, if the spreading rate decreases (downward arrows in the , the degree of diffusion will continue to be positive untilreaches the threshold for sustainable diffusions . The existence of two different thresholds depending on the direction of the spreading rate is a well-known occurrence, present in many other phenomena referred as hysteresis."
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "n": "7",
               "text": "Simulations",
               "type": "modelling"
          },
          "paragraphs": [
               "In this section we develop simulations to test the validity of the mean-field approximations used throughout the paper. We generate two different random networks in terms of their connectivity distributions: (i) a scale-free (specifically, P (k)k ?3 ) network (ii) a Poisson network. Both networks have a total of 1000 nodes and an average connectivity of approximately 9 neighbors per node. We consider the discrete version of the continuous dynamics used to derive the theoretical results. In this respect, we assume that, in every period one (and only one) agent is chosen to revise her \"strategy\". For the sake of concreteness, we have focused on testing the contents of the models in Section 5.2.",
               "All figures presented below have in common the following characteristics. We represent how the number of active consumers (n(t), ordinate) changes as a function of time (t periods, abscissa) at different values of the spreading rate. The data are the average of 100 simulations. For each simulation, the initial condition is randomly chosen such that individuals are active in round t = 1 with probability 0.01.",
               "In the first model of Section 5.2, we consider a diffusion function that depends linearly on the absolute number of active consumers in the neighborhood of an agent. Specifically, f (a) = a. We want to test if the threshold for the scale-free network tends to zero and if it is lower than the threshold for the Poisson network.",
               "The graph in represents how the number of active consumers changes over a total of 10 5 periods for the scale-free network at three different values of the spreading rate (= 0.05, 0.5 and 5; green, blue and red line, respectively). Observe that, as expected, the degree of diffusion is higher the higher the spreading rate is. Moreover, as the period increase, the number of active consumers increases as well. Also note that, for= 0.05 there is prevalence of the product in the long-run, thus this could indicate that, in this case, the threshold for positive diffusion tends to zero.",
               "The graph in represents how the number of active consumers changes over a total of 510 4 periods for the Poisson network at three different values of the spreading rate (= 0.05, 0.5 and 5; green, blue and red line, respectively). In contrast with the previous case, for= 0.05 there is no prevalence of the product in the long-run. This indicates that the threshold for positive diffusion in the Poisson network is above 0.05 and thus higher than for the scale-free network.",
               "These simulations also provide relevant information concerning the rate of convergence to the stationary state, an aspect of the dynamics that has not been addressed in the theoretical The threshold for positive diffusion is approximately at= 1, thus, in this case, \"close\" to the threshold obtained for the scale-free network."
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "n": "8",
               "text": "Conclusion",
               "type": "conclusion"
          },
          "paragraphs": [
               "The objective of this paper is to analyze how the diffusion of a new product or technology takes place on a social complex network. The network is characterized by one of its largescale statistical properties -the connectivity distribution-rather than by a specific geometric form (such as lines, circles, lattices and so forth). A wide class of diffusion dynamics (or mechanisms) has been considered. In all of them, the probability of agents adopting the product depends on the product's spreading rate and the behavior of the agents' closest neighbors.",
               "The main contribution of this paper is to characterize the diffusion threshold in terms of the properties of the network and the diffusion mechanism. One of the principal findings is that the threshold depends crucially on the network considered when the intensity of each interaction is assumed to be independent of the neighborhoods size. More specifically, the higher the variance in the connectivity distribution of the network, the lower the threshold.",
               "This implies, in particular, that scale-free networks are optimal for spreading the product in these contexts. In contrast with this result, if the diffusion mechanism considered is such that the intensity of each interaction is inversely proportional to the neighborhoods size, all networks have the same positive threshold. Finally, we also show that, for some particular diffusion mechanisms, there is a phase transition in the degree of the diffusion function. In other words, there is a discontinuity in the fraction of active consumers in the long-run of the dynamics as the spreading rate increases.",
               "The simulations presented in the last section of the paper show that the theoretical results, obtained using mean field approximations, provide a reasonable guide of the qualitative properties and long-run predictions of the diffusion dynamics."
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "n": "9",
               "text": "Appendix",
               "type": "conclusion"
          },
          "paragraphs": [
               "Proof of Theorem 1:",
               "Assumption (A-1) implies that= 0 is a stationary state of the dynamics (i.e. H(0) = 0).",
               "In addition, 0H()1 for all[0, 1] since g,k ()0. Therefore, given0, there exists a non-null stable state of the diffusion dynamics if and only if= 0 is unstable.",
               "Formally, this means that there must exist an> 0 such that,< H() for all(0,).",
               "Let us now calculate the exact value for the threshold.",
               "Recall that,",
               "Then, using equation  "
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "text": "a=0",
               "type": "conclusion"
          },
          "paragraphs": [
               "If= 0 is substituted in equation we obtain that,",
               "."
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "Diffusion in Complex Social Networks *"
     },
     {
          "head": {
               "text": "Proof of Proposition 3:",
               "type": "conclusion"
          },
          "paragraphs": [
               "It is straightforward to show that, for every given 01, H() as a function of, is increasing. That is,",
               "Let us show that, given0, assumption (A-2) implies H() is concave for all[0, 1].",
               "Notice that, "
          ],
          "paper_id": "21e1d7b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "Diffusion in Complex Social Networks *"
     }
]