[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "The rapid adoption of online social networks (OSN) across different stakeholders raises several interesting questions on different facets of its dynamics. Properly governed and designed OSN can play an important role in supporting different types of decision making (DM), as they provide their participants/stakeholders various forms of support, ranging from the instrumental to the emotional and informational. The synergy of these themes provides an innovative and unique perspective on the actual process of DM within OSN. We use online survey method to address the potential utilization of OSN as a support tool for the DM process. Our results indicate that OSN support and empower users in their decision making process specifically in three key phases that include Intelligence, Design and Choice. Our results also reveal that different types of users (observers, seekers and advisers) have significantly different participation styles, which in turn have an impact on the efficacy of the DM process. We discuss policy implications for OSN designers based on results from this study."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "The history of decision making (DM) research is long, rich and diverse. In terms of quantity, there is no shortage of frameworks, taxonomies, approaches and theories. Decision making is a complex field; it can involve the adoption of various technologies, in addition to the accommodation for different psychological perspectives of individuals. Over the years, the DM process has been extensively studied by researchers. These studies have resulted in several dominant DM perspectives.",
               "Before computer-mediated communication (CMC), people met and communicated with one another via face-to-face interactions. This was achieved by making social connections within different types of networks. A social network (e.g., ) is a social structure that consists of individuals who are interconnected with one another through common interests, beliefs and/or values. For an excellent introduction to social networks, the interested reader is referred to Wasserman and Faust . From the mid-nineties, social network research has evolved to include online social networks. The idea of building a community based upon a common interest is of great interest within social network research, with online social networks (OSN) as the primary focus. Researchers in this general area are interested in understanding and learning about OSN: How are they used, and how do they affect our societies and businesses? Given their varied nature, OSN are multifaceted, and researchers have explored various such facets over the past several years. We study DM in OSN.",
               "It is generally acknowledged that DM process comprises several phases (e.g., intelligence, design, choice, implementation, monitoring), and the decision makers themselves have different DM styles (e.g., rational, dependent, intuitive, spontaneous). Moreover, at any given point in time in OSN, a participant decision maker plays a specific role (e.g., adviser, seeker, observer). We study the dynamic among DM phases, DM styles, and decision maker roles in OSN. Specifically, the goals of this study include understanding (1) how OSN are used as a support tool for DM, (2) which DM phases are most used by OSN users for DM, (3) how different stakeholder participation styles influence the support for DM phases through OSN use, and (4) related policy implications for developers of OSN Web sites. To operationalize our study, we use online survey methodology to observe, elicit, and understand the problems and requirements of OSN support for decision-making. Our results have policy implications for both OSN participants and designers.",
               "The rest of the paper is organized as follows: We discuss necessary background and related literature in Section 2. In Section 3, we discuss our online survey as well as develop hypotheses that we then test using survey results. We conclude the paper with a brief discussion on the contributions as well as limitations of this study in Section 4."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "2.",
               "text": "Background and related literature",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Decision-making is a theoretical and practical concept that is affected by cognitive insights of the decision maker. The process through which people make decisions ranges from structured to the anarchical. We now discuss decision making and its phases as well as decisionmaking styles. We then follow this with a brief discussion on decisionmaking as it relates to online social networks (OSN)."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "2.1.",
               "text": "Decision-making (DM)",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Extant literature in this area includes a vast selection of decisionmaking models, frameworks and theories that work towards evaluation of the decision-making processes. While clear distinctions exist between different decision-making artifacts, there are two dominant views of decision-making. One view clearly supports rational decision making, where models are sequential, decisions are structured, processes are analytical and solutions are terminated in a definite environment. In the other view, decision making is defined as an anarchical process, where problems are unstructured, decisions are irrational and the environment is uncertain.",
               "Several variants and extensions of Simon's seminal theory of rational decision making have been proposed over the years. Many researchers followed Simon's view and even based further studies on Simon's rationality theory. For example, Mintzberg et al. extended the Simon model by adding additional phases to the initial process; Rowe and Boulgarides revised and modified the Simon model by adding an additional decision maker to the DM process. March proposed an anarchical view of the DM process with his theory of ambiguity and bounded rationality. Supporters of this perspective focus on a different set of aspects of decision making and argue that the analytical decision-making approach does not cover most of the aspects of real-life decisions. Cohen et al. view the DM process as a garbage can, where the solution does not have structure and choice, and alternatives can be retrieved at any point of the DM process.",
               "Simon's model is the most recognizable and acceptable among existing decision-making models, so much so that it serves as the foundation for decision-making research. Simon suggested that the decision-making process can be structured and ordered in three phases: intelligence, design, choice. Intelligence is where the decision maker collects information about the problem, and identifies its cause(s). The second phase is recognition and understanding of possible alternatives and consequences of the future decision. In the last phase -choiceidentified alternatives are narrowed down to the best utility option that leads to a decision maker's choice. summarizes the taxonomy of the three phases of DM process.",
               "Later, Huber and McDaniel extended this model by adding two other phases: implementation and monitoring. Implementation is when the decision is put into effect, and monitoring comprises the post-analysis activities that evaluate the implementation of that decision; feedback and possible adjustments are also used in the development of direction for future DM situations.",
               "Most published empirical research in this area has focused on aspects of the decision maker's mental abilities such as experience, knowledge, cognitive processes or factors that can influence the decision outcome. Chermack and Nimon posit that measuring or developing the specific indicators for decision-maker performance is extremely difficult, but that it is essential to have an instrument that can study the pattern of decision-making performance. One of these instruments was developed by Scott and Bruce to measure the DM style of an individual. DM style has been defined as \"a habitual pattern individuals use in decision-making\" , as cited in ). Five decision styles were identified, and are defined in behavioral terms: (1) rational DM style is characterized by a thorough search for, and logical evaluation of, alternatives, (2) intuitive DM style is characterized by a search for advice and direction from others, (3) avoidant DM style is characterized by individuals who attempt to avoid the decisionmaking process entirely , (4) spontaneous decision makers have a tendency to implement decisions immediately, and (5) dependent are individuals who constantly search for advice and depend on direction from others . The resulting instrument has been named the General Decision-Making Style (GDMS) ( ).",
               "The GDMS is designed to measure the participant's decision-making tendencies towards the decision process. Even in the original model, Scott and Bruce differentiate decision makers according to their style; later, after testing the model, they came to the conclusion that a decision maker can rely on more than one style, but that is unlikely in the case of opposing styles such as rational and spontaneous. Driver et al. agree with Scott and Bruce and conclude that the decision maker has a primary and a secondary decision-making style."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "2.2.",
               "text": "Decision-making style",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Decision-making style provides an understanding of decision-maker behavior that is taken for granted and unconsciously applied to decision making . To understand the decision maker's different styles it is important for the development of a decision model that can deal with individual behavior. Driver et al. argue that the main difference among DM styles occurs during information processing where the alternatives are identified. An influence on selection among alternative courses of action is recognized to be dependent on the decision maker's cognitive make-up .",
               "OSN have evolved from general friendship sites (i.e. Orkut, Facebook, Friendster, MySpace, and Classmates) to more specific userorientated sites. OSN have grown from a small niche group of youngsters to a significant fraction of Internet users who generate the highest user engagement rate . While some of the OSN focus on growing globally (e.g., Facebook, Youtube, Google Plus), others explicitly seek a specific audience . Examples of specific audience sites include Christianity.com and MyChurch.com, with these sites or similar ones targeting a particular demographic of participants. Others deliberately restrict access to selective individuals; an example is aSmallWorld.com which is said to be a network for elite only, where membership is strictly through invitation.",
               "There are dozens of OSN sites, each offering something unique to its members. There are plenty of groups and classifications for distinguishing the online social communities. The main criteria for classification are taken from human interaction with each other in an offline environment."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "2.3.1.",
               "text": "Decision-making process in online social networks",
               "type": "relatedwork"
          },
          "paragraphs": [
               "To understand how OSN can support the DM process, we go back to the origin of the decision-making theory, specifically to Simon's DM-process. OSN are capable of many things that can positively and negatively influence the decision makers. The main question is how OSN can attenuate or amplify the decision-making process. OSN are information portals, and consequently they influence human information processing, where cognitive biases introduce barriers to adequate decisions.",
               "People use OSN to support various phases of the DM process that fulfill the requirements to make a decision in a specific domain. OSN can attenuate or amplify the strengths and weaknesses of human information biases related to DM. This in turn can improve or disregard the decision-making process.",
               "The Internet and online communications are appealing to organizations not only as a low cost way of reaching an audience, but also for the individual thoughts, opinions and histories that are accessed through the global community of Internet users. There are an immeasurable Common operations in decision-making process. Adapted from: Malczewski ."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "text": "Intelligence",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Design Choice -Involves searching or scanning the environment for conditions calling for decisions -Involves inventing, developing, and analyzing a set of possible decision alternatives for the problem identified in the intelligence phase -Involves selecting a particular decision alternative from those available "
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "text": "Hypothesis 1: OSN support DM process Hypothesis 0: OSN do not support DM process",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Hypothesis 1A -OSN support the Intelligence phase of the DM process Hypothesis 0 -OSN do not support the Intelligence phase of the DM process. Hypothesis 1B -OSN support the Design phase of the DM process Hypothesis 0 -OSN do not support the Design phase of the decision-making process. Hypothesis 1C -OSN support the Choice phase of the decision-making process. Hypotheses 0 -OSN do not support the Choice phase of the DM process in order to solve a problem. Hypothesis 1D -OSN support the Implementation phase of the DM process.",
               "Hypothesis 0 -OSN do not support the Implementation phase of the DM process. Hypothesis 1E -OSN support the Monitoring phase of DM process.",
               "Hypothesis 0 -OSN do not support the Monitoring phase of the DM process number of online community sites that are different or similar to each other in terms of various technological features that support users and their practices. OSN sites have attracted millions of participants who have integrated those into their daily lives. Online social networking sites strive to fulfill the needs of participants through various means."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "2.3.2.",
               "text": "Users of online social networks",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Users in online communities are unique based on their participation style. OSN users are typified by their engagement levels in their participation communities. While some people may post message(s) every day or once per week, others just collect information or knowledge from already developed conversations .",
               "When the decision makers face a problem, they actively seek for information that can assist them. The process of DM through use of OSN can be explained in three steps.",
               "2. OSN, by providing information, support the phases of the DM process; this support can be evaluated by understanding the problem through using OSN (intelligence); development of alternatives/ determination of consequences of various courses of action (design); selection of an option/alternative/course of action and comparison of consequences to resolve the problem by using OSN (choice); identification of resources and implementing an alternative course-of-action to make a decision (implementation); and monitoring/evaluation of implemented decision using OSN (monitoring). 3. Following the phases of the DM process, by sequence or anarchy, is unimportant; the OSN supported DM process fulfills the decisionmaker requirements.",
               "1. The decision maker uses OSN to find information about decisions that can assist in the DM process. The information can be presented as the source of models, future choices, possible alternatives and consequences that come together with a decision.",
               "The DM process by the use of OSN requires a proper investigation in order to understand the effectiveness of OSN in the role of decision supporter and information provider. We develop and use a survey methodology to understand the dynamics of DM in OSN."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "3.",
               "text": "Online survey",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The primary focus of this survey is to identify how online social networks support the decision-making process. The data collected for this study consisted of responses on how social networking services (SNS) and associated systems enhance or attenuate the decision-making strengths, weaknesses, and biases. We use the responses from online survey for hypothesis testing for decision-making in OSN. The survey questions are designed and based on the instruments extracted from the literature review. We used a pilot test as the simulation test to identify any problems prior to the data collection process."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "Hypotheses to be tested",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The decision-making process can be regarded as a mental process that results in the selection of a course of action. We make our decisions based on a decision process that involves five phases (intelligence, design, choice, implementation and monitoring). When decision makers face a problem to be solved, they go through these five phases of DM process. In general, OSN are capable of providing support to the decision maker in the selection of the five phases of the decision-making process to solve a problem.",
               "The research question for Hypothesis 1: What are the phases that are most supported by OSN users?",
               "The research objective for Hypothesis 1: To compare each DM phase and its relationship to OSN use.",
               "H1-1-Hypothesis 1. Online Social Networks support the decision-making process.",
               "Explanation: Decision makers use OSN to support a certain DM process in order to solve a problem.",
               "H1-0-Hypothesis 0. Online Social Networks do not support the decision-making process.",
               "Explanation: Decision-makers do not necessarily use OSN to support a DM process to solve a problem. As discussed above, the decision-making process comprises five phases. To evaluate and test this hypothesis, and to identify the phases that are supported by decision makers through use of OSN, we divided the main hypothesis into five associated hypotheses ( .",
               "The second hypothesis tests the relationship between decision maker style (rational, dependent, intuitive and spontaneous) and phases of the decision-making process (intelligence, design, choice, implementation and monitoring). Decision makers who tend to follow a particular style can use OSN in a different manner that reflects the support function of OSN for the DM process. Decision-making style is an important indicator of decision maker behavior that uses OSN to solve a problem.",
               "The research question for Hypothesis 2: How do different decision maker styles influence the support function of OSN for DM process?",
               "The research objectives for Hypothesis 2: To explore how different decision maker styles influence the different phases of the decision-making process. Hypothesis 2: DM style of OSN users affects the decision-making process.",
               "Hypothesis 0: DM style of OSN users does not affect the decision-making process.",
               "Hypothesis 2A: Rational and dependent decision-makers tend to find support in most (N2) phases of the DM process, whereas spontaneous and avoidant tend to find support in fewer phases of the decision-making process by use of OSN.",
               "Hypothesis 0: Decision-makers of any style tend to find similar support in phases of the decision-making process by use of online social networks. There is no relationship between decision-making style and support for phases of the DM process by use of OSN. The null hypothesis is that the two variables, DM process and DM style, are independent. Hypothesis 2B: Spontaneous/intuitive and avoidant decision-makers will use OSN to support an intelligence and choice phase only.",
               "H2-1-Hypothesis 2. Decision-making style of OSN users affects the decision-making process. Explanation: The DM process followed is dependent on the decision-making style of the OSN user. Therefore, the supportive use of OSN for decision-making will be different for each style.",
               "H2-0-Hypothesis 0. Decision-making style of OSN users does not affect the decision-making process.",
               "Explanation: The support use of OSN is not influenced by the decision-maker style. The DM style is divided into five characteristics. According to Scott and Bruce , the decision maker can rely on more than one style. For the purpose of this study, two categories of DM style emerged: the first is rational and dependent and the second is spontaneous/intuitive and avoidant. presents Hypothesis 2 and its sub-hypotheses that relate to the previously stated categorization of DM styles.",
               "The third hypothesis tests the relationship between OSN users' participation roles and DM process phases.",
               "The research question for Hypothesis 3: Is there any difference in OSN participation roles towards the use of OSN as the support mechanism for the DM process?",
               "The research objective for Hypothesis 3: Compare OSN participation roles with the five phases of the DM process that a decision maker goes through in order to solve a problem.",
               "H3-1-Hypothesis 3. OSN participation role affects the decision-making process.",
               "Explanation: Diverse OSN participation roles will support the different phases or combination of phases of the decision-making process.",
               "H3-0-Hypothesis 0. OSN participation role does not affect the decision-making process.",
               "Explanation: OSN participation role and phases of the DM process are independent of each other. Therefore, the support function of OSN will not be affected by the participation role. The OSN participation role is split into three categories: Adviser, Seeker and Observer. For the purpose of this study, advisers and seekers were grouped together as active users of OSN and observers as passive users of OSN. lists the sub-hypotheses of Hypothesis 3 to test how the different groups of participation roles support the different phases of the DM process. The null hypothesis is that there is no relationship between participation role in the DM process with respect to any group or characteristic of participation roles."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "3.2.",
               "text": "Relevant instruments and literature",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Developed by Scott and Bruce , the GDMS instrument typifies individual differences in decision-making habits and practices. The 25 statements contain five items forming five different scales, each measuring a distinct behavioral approach to decision-making: spontaneous, rational, intuitive, dependent, and avoidant (see Appendix A). GDMS is used with the Likert scale to measure the scores that range from strongly disagree to strongly agree . Simon's model divides the decision-making process into three stages: intelligence, design and choice. Huber later extended this model by adding two other stages: implementation and monitoring. We consider this model to be a research instrument that can direct the researcher to how OSN supports each phase of the decision-making process."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "3.3.",
               "text": "Data collection",
               "type": "relatedwork"
          },
          "paragraphs": [
               "We administered the survey online and distributed a link to the survey via social media. The primary target population had a loose definition because the purpose of the study overall is exploratory, and therefore the opinion of individuals who use OSN for decision-making or for any other particular purpose is essential. The data collection period took five months. This period does not include design or pilot testing activities. 113 OSN users participated in completing the questionnaire and 73 completed responses were obtained; the response rate was 64.6%. It is important to note that out of 113 participants, 7 do not use OSN. Moreover, the response rate varied across different sections of the survey. shows the number of participants who answered/skipped questions for each section with the associated response rate. Seeker and Adviser tend to find support in most (N3) of the phases of the DM process Hypothesis 3B: Observers tend to skip some of the phases of the DM process Response rate for each section of the survey."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "text": "Sections",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Answered "
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "3.4.",
               "text": "Data analysis",
               "type": "relatedwork"
          },
          "paragraphs": [
               "3.4.1. Descriptive statistics A majority of participants were from 18 to 34 years of age, the gender distribution was slightly skewed to the female dominance -60% of participants, and men presented 40% of the sample size. The life stage was equally distributed between singles and 'in relationship' participants, 34% and 32% respectively, followed by 22% who were married. The majority of the typical respondents were full-time employed -67% of the sample size. More than 15 countries were represented, with 61% of respondents living in New Zealand.",
               "Most of the participants have used OSN sites for more than 3 years. The same distribution indicated that they are always logged on to social media or at least have access several times a day. On the question of 'how many OSN sites communities/groups are you member of?' -42.2% of respondents reported that they are members of 3 to 5 OSN sites and a similar percentage, 43.4%, reported that they use OSN for 75% personal purpose and 25% professional purpose.",
               "The survey data shows a weak indication of professional users; the main explanation is the age of participants with a range of 18-34 years. According to study on OSN and professional use, their sample presented that younger (20-35) professionals are more active users of social media for professional purpose than middle-aged professionals.",
               "With regard to participation style, 53% of respondents indicated that they are primarily observers, 31.3% are seekers and only 15.7% are advisers. The next question captured participation frequency, where results show that even with a small percentage of advisers, 24.1% of users provide advice at least once every few weeks, seek advice once in a few days -25.3%, and observe advice several times a day -44.6%. These results provide a good indication that users can admit the fact that they use OSN for seeking and providing information. These answers are supported by the next question, where users indicate that OSN are about information search, knowledge, news and entertainment: \"I use OSN because they allow me to\", and the most popular answers are: be informed and updated with current news -78.3%, find information -69.9%, find knowledge -57.8%, and find entertainment -56.6%.",
               "Among these different uses of OSN, we are interested in how OSN are useful in terms of observing, advising, seeking and solving issues and problems for decision-making. Most of the participants indicated that OSN are useful for seeking information and observing discussions with regard to particular issues. 39.8% of participants found OSN to be a good tool for seeking information for professional issues, consumer issues -39.8%, then educational issues -34.9%, and health issues -33.7%. As for using OSN to observe discussions, most of the participants also relate to consumer and professional issues -37.3%, health issues comprise the same percentage as for seeking information -33.7% and the new groups of concern are personal relationships -38.6%. Since the question allowed for multiple responses, the sum of frequencies does not equal 100%. A surprising aspect from these results is the high popularity in the use of OSN for seeking purpose and the high demand for seeking and observing professional issues. Even without statistical analysis, it can be seen that results contradict with the previous question where participants did not indicate 'professional' as the primary reason for using OSN. That shows the design of the questionnaire to be very important; participants cannot always realize who the users are without verbal elements of assistance . This question gave an opportunity for users to provide free response. One of the responses is indicted below:",
               "i m still young professional to advise smone on smth,while he can find a solution for an issue from a professional with considerably more exprnce than i ve got. When i advise,though, i do it out of my OWN experience. When u seek for an advise frm social ntwrks to solve a problem i believe u should be sure abt whom u asking, because faceless interaction gives little guarantees on credibility of the opinion",
               "This opinion expresses the concern with providing advice to others without being qualified to do so. The respondent is concerned with the quality of the provided information and subsequent results and makes a point that face-to-face advice is more valuable than interaction with OSN users. Section D captures the responses on OSN features and their relevance for DM. This section mainly serves the purpose of evaluating OSN features that are useful for DM. Features that received the highest relevant feedback are the ability of OSN to host forum conversations, tag people or links from other OSN providers, share photos, notification updates, join groups of similar interests, and search information by subject of interest or categories. Security settings are found to be the category with the highest percentage of extreme relevance for OSN users for the DM process. The high importance of security settings indicates that the main concern of OSN users is their privacy.",
               "We discuss Section E of this survey in the next section on statistical analysis, as this section is mainly oriented towards answering the study hypothesis.",
               "Section F, Decision-Making Style. The GDMS instrument was modified and users had to choose one option that suits their DM style. 51.3% of respondents refer to themselves as rational decision makers and 20.5% selected an intuitive DM style. This question can be biased, \"presumably truthful response\" , as cited in ) by information presentation and cognitive thinking; not everyone wants to admit that they are spontaneous or dependent decision makers.",
               "Section G enquires whether respondents think that OSN can have an effect on human cognitive biases. Questions in this section are purely informative and were not designed for any statistical purpose. One of the study goals is to explore the effect of biases and their user's awareness. Most of the responses fell towards the opinion that biases increase with OSN use. shows the response percentages for biases that people found to be the most affected with OSN use.",
               "The descriptive analysis of the survey helps build a profile of a typical user of the OSN service. For example, a user has used OSN for more than 3 years and is a member of 3-5 sites, has a habit of accessing the networks more than several times per day, but participates mainly in the evenings and most probably in a home environment. This user can be identified mainly as an observer, and uses OSN excessively for seeking information and knowledge for decision-making. The user is familiar with most of the OSN features and can use them according to their purpose and also understands the effect of biases that can influence the decision-making process."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "3.4.2.",
               "text": "Statistical analysis",
               "type": "relatedwork"
          },
          "paragraphs": [
               "We used appropriate statistical procedures that include chi-square and multivariate statistical analysis for hypotheses testing. The summary of the research questions, objectives, variables, hypotheses and statistical methods that are used in this data analysis is presented in .",
               "From the three above-stated hypotheses, we test the phases of the DM process and its relationship with the use of OSN, participation styles of OSN users and DM style. The data collected from Section D (Qs23-Qs29), Section F (Qs37), Section C (Qs17, Qs18) are used for statistical analysis to test these hypotheses. The sample size includes only participants who use OSN in their daily lives, with respondents being identified from Question 9 by those who answered \"yes\" to the question: \"Do you use Online Social Networks?\" The total response count for these participants is 93. The missing responses were recorded and statistically handled with SPSS 'missing values add-on module'. The missing values from all the questions were removed by using the 'listwise deletion' method. This is the most commonly used method for dealing with missing data and it introduces the least bias into the statistical analysis . We used listwise deletion on data that were included in hypotheses testing, and discarded cases with any missing variable values -only cases with complete records were included ."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "3.4.2.1.",
               "text": "Hypothesis 1",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Hypothesis 1: Online Social Networks support the decision-making process Hypothesis 0: Online Social Networks do not support the decisionmaking process Hypothesis 1 is divided into five sub-hypotheses that test how OSN supports each phase of the DM process. To show the statistical significance of these hypotheses, we chose the chi-square test as the non-parametric test. The chi-square tests the independence between variables . By using the chi-square test, this hypothesis testing examines the relationship between two variables (OSN users who support the phases of the DM process and OSN users who do not support the phases of the DM process). The research hypothesis states that the two variables are dependent or related. The null hypothesis is that the two variables are independent ."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "3.4.2.2.",
               "text": "Testing Hypothesis 1a",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Hypothesis 1a -Online Social Networks support the Intelligence phase of the decision-making process. Hypothesis 0 -Online Social Networks do not support Intelligence phase of the decision-making process.",
               "This hypothesis tests the relationship between OSN users and the intelligence phase of the DM process. We claim the existence of relationship between OSN users and support of an intelligence phase. Question 23 of the survey asked the respondents to choose the best option that reflects their participation style from three options: 'I use online social networks to help ME search for information to support decisionmaking'; 'I provide information on online social networks to support the decision-making of OTHERS'; 'I DO NOT use online social networks for understanding problems'. This question allows multiple responses only for the first two options. If the respondent chose 'I use online social networks to help me search for information to support decision-making' and/or 'I provide information on online social networks to support the decision-making of others', then the replies were combined and identified as supporters of the intelligence phase of the DM process as follows: 'Qs23Yes = Qs23(001) + qs23(002)' and labeled as 'I Do Use'. Respondents who answered 'I do not use online social networks for understanding of problems' were identified as non-supporters of the intelligence phase of the DM process in order to solve a problem and were labeled as 'I Do not Use'."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "text": "Percent",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Valid The frequency of supporters of the intelligence phase (72%) was found to be greater than non-supporters of the intelligence phase (28%). This difference was tested for significance using a Z-test for comparison of the two proportions. The results of the Z-test were found to be statistically significant (3.810; p b 0.05). Since p-value = 0.000 b 0.005 =, the null hypothesis is rejected. The result shows that users who use OSN to support the intelligence phase of the DM process have a greater weight compared to non-supporters of the intelligence phase. Under these terms the null hypothesis can be rejected and the conclusion can be drawn from this test that data support the research hypothesis. There is a relationship between OSN users and the intelligence phase of the DM process."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "3.4.2.3.",
               "text": "Testing Hypothesis 1b",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Hypothesis 1b -Online Social Networks support the Design phase of the decision-making process. Hypothesis 0 -Online Social Networks do not support the Design phase of the decision-making process.",
               "This hypothesis tests the relationship between OSN users and the design phase of the DM process. We claim the existence of a relationship between OSN users and the design phase (development of alternatives, determination of consequences). The design phase is divided into two parts, the first being when the decision maker uses OSN for the development of alternatives to resolve a problem "
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 19,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "text": "Percent",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Valid percent Cumulative percent A significant association was found between OSN users and support of the design phase (Question 24). By using OSN for the decision-making process, users support the process of development of alternatives in order to resolve a problem. The frequency of supporters of the design phase ?71% was found to be more than non-supporters ?29%. The result of the Z-test shows statistical significance (3.579; p b 0.000). X 2 (1) = 12.813, p b 0.05. Since p-value = 0.000 b 0.005 =, the null hypothesis is rejected. The second part of the design phase is the determination of consequences of already developed alternatives/courses of action (Question 25). The frequencies of OSN users that support the phase of determination of consequences (54%) were found to be insignificant to users of OSN who do not go through the same phase (46%). The result of the Z-test was found to be insignificant (0.808; p = 0.2095 N 0.000). X 2 (1) = 0.653, p N 0.05. Since p-value 0.2095 N 0.005 =, we fail to reject the null hypothesis.",
               "At the= 0.05 level of significance, there is not enough evidence to conclude that OSN users support the determination of consequences of various courses-of-action in order to solve a problem. Thus, the results do not support the general hypothesis and OSN does not support the second step of the design phase. This hypothesis tests the relationship between OSN users and the choice phase of the DM process. We claim the existence of a relationship between OSN users and the choice phase."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 20,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "text": "Percent",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Valid support the choice phase (71%) were found to be more than the users of OSN who do not support the choice phase (29%). The result of the Z-test was found to be significant (3.5795; p b 0.000). Under these terms the null hypothesis can be rejected and a conclusion can be drawn that there exists a relationship between OSN users and the choice phase of the decision-making process. Thus, the results support the general hypothesis that decision-makers use OSN to support the decision-making process."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 21,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "3.4.2.5.",
               "text": "Testing Hypothesis 1d",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Hypothesis 1d -Online social networks support the Implementation phase of the decision-making process. Hypothesis 0 -Online social networks do not support Implementation phase of the decision-making process.",
               "The implementation phase goes through two stages, first when the decision-maker uses OSN in order to find resources to implement an option/ alternative/course-of-action (Question 27) and the second when the decision-maker goes through an actual implementation of option/ alternative/course-of-action (Question 28)."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 22,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "text": "Percent",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Valid The frequencies of OSN users that support the identification of resources step (72%) were found to be more than the users of OSN who do not support it (28%). The result of the Z-test was found to be significant (3.810; p b 0.000). X 2 (1) = 14.520, p b 0.05. At the= 0.05 level of significance, there is enough evidence to conclude that OSN support the phase of the decision-making process where users can identify resources in order to implement an option/alternative/course-of-action to make a decision.",
               "The second part of the implementation phase is the actual implementation of an option/alternative/course-of-action with identified resources (Question 28). The frequencies of OSN users who support the second step of the implementation phase (49%) were found to not be different to the users of OSN who do not support it (51%). The result of the Z-test was found to be insignificant (0.11401; p = 0.454 N 0.000). X 2 (1) = 0.013, p = 0.9087 N 0.05. The hypothesis is not supported by this analysis and it can be claimed that OSN do not support an implementation of an option/course of action in order to make a decision."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 23,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "3.4.2.6.",
               "text": "Testing Hypothesis 1e",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Hypothesis 1e -Online social networks support the Monitoring phase of the decision-making process. Hypothesis 0e -Online social networks do not support Monitoring phase of the decision-making process."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 24,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "text": "Percent",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Valid OSN users who support the monitoring phase are compared to OSN users who do not monitor an implemented decision (Question 28). The frequencies of OSN users that support the monitoring phase (51%) were found to not be different to the users of OSN who do not support the monitoring phase (49%). out of seven chi-square tests showed statistically significant results. Statistical significance has been found in the intelligence phase, partially in the design phase, choice phase and partially in the implementation phase. shows the outcome for Hypothesis 1.",
               "1. Decision makers participate in OSN to gain an understanding of a problem in order to make a decision, and therefore OSN supports the intelligence phase of the DM process. 2. OSN support the first step of the design phase; where a decision maker can develop alternatives to resolve a problem. 3. OSN support the choice phase of the DM process. Decision makers are able to select an option/alternative/course-of-action to resolve the problem by using online social networks. 4. OSN support the first step of the implementation phase. OSN users are able to identify resources to implement an option/alternative/course-ofaction in order to make a decision. 5. OSN are not necessarily used for the monitoring phase of the decision-making process.",
               "Results from our statistical analysis show that OSN support most of the phases of the decision-making process. Therefore, hypothesis 1 cannot be rejected since decision makers make use of OSN to support certain phases of DM. It should be noted that some phases of the decision-making process fail to be supported by OSN. In particular, the second steps of the design and implementation phases are found to be insignificant (p-value N0.05).",
               "A possible explanation for this is that the second step of the implementation phase is a physical-based action that cannot be replaced with use of online social networks. When the decision is made and the human mind is set, the actual process of implementation of the chosen solution is done by a human in the offline world. In the example provided below, the basic process of decision-making shows why the implementation and monitoring phases are not supported by OSN.",
               "Intelligence: My 2 year old son has had a headache for the last two hours (OSN subject/problem search). Design: Nurofen or Panadol, Kids Cannot take Nurofen (Advice from OSN member). Choice: Take Panadol (based on OSN information and provided alternatives). Implementation: Physical action of taking Panadol (actual doing). Monitoring Results: Any symptoms of headache after taking a Panadol? (Physical state) 3.4.2.7. Testing Hypothesis 2 Hypothesis 2 tests the relationship between decision-maker style (rational, dependent, intuitive and spontaneous) and phases of the decision-making process (intelligence, design, choice, implementation and monitoring). Decision makers who tend to follow a particular style can use OSN in a different manner that can reflect the support function of OSN for the decision-making process. Decision-making style is an important indicator of decision-maker behavior that uses OSN in order to solve a problem.",
               "Hypothesis 2: Decision-making (DM) style of OSN users affects the decision-making process. Hypothesis 0: Decision-making (DM) style of OSN users does not affect the decision-making process.",
               "Hypothesis 2 states that two variables, DM process and DM style, are dependent or related. This is true if the observed counts for the categories of the variables in the sample are different from the expected counts. In this hypothesis, the chi-square test of independence was implemented to evaluate group differences between rational, dependent, spontaneous, intuitive and avoidant decision makers and their behavior towards the DM process. The null hypothesis is true if the observed counts in the sample are similar to the expected counts.",
               "Hypothesis 2 is divided into two sub-hypotheses, 2a and 2b; null hypothesis stays the same for both.",
               "Hypothesis 2a: Rational and dependent decision makers tend to find support in most (N2) phases of the decision-making process, whereas spontaneous and avoidant tend to find support in fewer (2) phases of the decision-making process by use of online social networks. Hypothesis 2b: Spontaneous/intuitive and avoidant decision makers will use OSN to support the intelligence and choice phase only. Hypothesis 0: Decision makers of any style tend to find similar support in phases of the decision-making process through use of online social networks. There is no relationship between decision-making style and support for phases of the DM process through use of OSN",
               "The data for this hypothesis testing are from the responses to Question 37, which identifies the decision-making style of OSN users and Questions 23-29 that identify how OSN support phases of the DM process.",
               "In Question 37, the participant could choose only one option from five decision-making styles. In order to perform a two-by-two chi-square test, the decision-making style variables were grouped into two categories: Rational and dependent decision-makers are grouped under statistical value = 1 and intuitive, spontaneous, avoidant decision-makers were grouped under statistical value = 0. The statistical operation in SPSS is: Qs37 = Qs37_Grouped .",
               "For Questions 23-29, the five variables that represent phases of the DM process were combined, and the expression used for SPSS analysis is: Qs23-29_Combined = Qs23 + qs24 + qs26 + qs28 + qs29."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 25,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "text": "Percent",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Valid It is important to note that the decision-making process itself might not have a sequence; OSN users can follow their own sequence, but the more phases they support, the higher their overall support value for the decision-making process. Decision makers who go through one or two phases of the DM process during the use of OSN are 'passive' supporters of the DM phases for problem solving (value for statistical analysis = 0) and users who find support in more than 2 phases of the DM process are 'active' supporters (value for statistical analysis = 1). The highest value of supported phases can be 5, and only in the case of the decision maker following all the phases of the DM process (from intelligence to implementation). The tables below show the statistical frequencies and operations for the discussed questions."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 26,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "text": "Percent",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Valid percent Cumulative percent",
               "Select the statement that best reflects your decision-making style. The probability of the chi-square test statistic (p = 0.426) is greater than the alpha level of significance of 0.05. The null hypothesis that \"The decision-making (DM) style of OSN users does not affect the decision-making process\" is not rejected. The hypothesis that \"The decision-making style of OSN users tends to affect the decision-making process\" is rejected. We conclude that there is no relationship between DM style and DM process.",
               "3.4.2.8. Testing Hypothesis 3 Hypothesis 3 tests OSN participation role with five phases of the decision-making process that a decision maker goes through in order to solve a problem (Question 18). ",
               "Seeker and Adviser find support in most (N3) of the phases of the DM process. Hypothesis 3b: Observers find support in b 2 phases of the DM process. Hypothesis 0: OSN participation role does not affect the DM process.",
               "The hypothesis states that the two variables (OSN participation role and DM process) are dependent or related. This is true if the observed counts for the categories of the variables in the sample are different from the expected counts. The null hypothesis is that the two variables are independent. This hypothesis is tested by three statistical tests: Chi-square test, t-test for independent samples and ANOVA; Chi-square is used to identify p-value of significance between the two variables, t-test for independence shows the mean difference between the two groups of participation roles and phases of DM processes, and ANOVA is used to justify the results for Hypotheses 3a and 3b.",
               "The Chi-square test examines the relationship between the OSN participation role variables (Seeker, Adviser and Observer) and the phases of the decision-making process (decision makers who follow more than 3 phases of the DM process are active supporters -statistical value-1, and decision makers who follow fewer than 2 phases of the DM process are passive supporters -statistical value-0).",
               "Seeker and Adviser are grouped together because they are identified to be frequent users of OSN, while observers tend to observe OSN without an actual contribution. Seeker & Adviser are recorded as 'Adviser & Seekers' (statistical value-1) Observers are identified as a separate group (statistical value-0) and recorded as 'Observers'. Questions 23-29 will follow identical grouping combinations as for Hypothesis 2.",
               "3.4.2.9. Statistical analysis -results The probability of the Chi-square test (p = 0.001) is less than the alpha level of significance of 0.005. The null hypothesis that differences in 'OSN participation role' are independent of differences in 'phases of DM process' is rejected. Therefore, the research hypothesis that OSN participation role tends to affect the DM process in order to solve a problem is supported by this analysis.",
               "Chi-square test between two variables: participation role and decision-making process. To test Hypotheses 3a and 3b, we used the Independent Sample Test and ANOVA. First, we discuss the process of Independent t-test and then ANOVA will complete the testing for Hypothesis 3. The Independent Sample t-test allows the comparison of means between OSN participation roles, and to identify whether there is a significant difference between two groups of participation roles in relation to support of phases of the DM process. The Independent Sample t-test is used to compare one categorical variable with two levels and one continuous variable. OSN participation role is a categorical variable with two levels -Advisers & Seekers and Observers (Qs18 _Recorded). The continuous variable is five phases of the DM process (Qs23_Qs24_Qs26_Qs28_Qs29_Combined). Two groups of participation role were tested on a scale of 5 phases of the DM process. Significance level = 0.00, p-value b 0.05 reject the null hypothesis."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 27,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "3.4.2.10.",
               "text": "Statistical output",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Advisers & Seekers (mean = 3.89, SD = 1.301) scored higher (t= ?4.207, p b 0.01) than Observers (mean = 2.48, SD = 1.724) on the measure of support in phases of the decision-making process. Mean score for Advisers & Seekers is higher than that for Observers, indicating that Advisers and Seekers support more phases of the decision-making process than Observers. The analysis supported our Hypotheses 3a and 3b.",
               "ANOVA test is used to compare scores on a continuous variable that is treated as parametric data (Participation Style) by the level of categorical data (phases of the DM process). The first variable is Participation Style. This is a categorical variable that indicates whether people are Observers, Seekers or Advisers. The second variable comprises scores from phases of the decision-making process. This inventory contains a measure of how many phases of the decision-making process are used by different styles of decision makers. Therefore the analysis of variances used here examines whether the three categories of participation role differ significantly from one another in their level of support of phases of the DM process.",
               "This test uses already organized variables that were used in Hypothesis 2, the phases of the decision-making process (Qs23_ Qs24_Qs26_Qs28_Qs29_Combined) and original variables from Question 18 (Participation Style). The average mean score for respondents who are Advisers is 3.85 (with a standard deviation of 0.899). The average mean score for respondents who display Seeker participation role is 3.91 (with a standard deviation of 1.509), and the average mean score for respondents who display Observer participation role is 2.48 (with a standard deviation of 1.724). Here we note that there is little difference in mean score between Advisers and Seeker and the respondents score higher than the Observers. The F-value statistic is 7.715. The significance level is p = 0.001. Since this is smaller than .01, we conclude that there is a significant difference for mean scores of phases of the decision-making process."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 28,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "3.4.2.11.",
               "text": "Analysis between subjects",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The Dunnett T3 tests for significance differences between mean scores of each of the possible pairs of categorical variables (e.g., Seeker and Observer is a pairing, as are Adviser and Observer, and Adviser and Seeker) to provide an overall picture of where the differences lie. In each row of the multiple comparison table, the possible pairings are presented with each level of the categorical variable.",
               "In the first row (Adviser): No significant difference between Adviser and Seeker respondents (p = 0.998, p N 0.05) and a significant difference between Adviser and Observer respondents (p = 0.002, p b 0.05).",
               "In the second row (Seeker): No significant difference between Seeker and Adviser respondents (p = 0.998, p N 0.05) (this information repeats information gained from the first row), and a significant difference between Seeker and Observer (p = 0.004, p b 0.05).",
               "In the third row (Observer): A significant difference between Observer and Adviser respondents (p = 0.002, p b 0.05), and a significant difference between Observer and Seeker (p = 0.004, p b 0.05) (this information repeats information from the first two rows).",
               "Therefore, using this information, we can conclude that Observer participation role respondents score significantly lower than Adviser and Seeker respondents on the measure of support for phases of the decision-making process. Phases of DM scores were calculated for the Adviser (mean = 3.85, SD = 0.899), Seeker (mean = 3.91, SD = 1.509), and the Observer group (mean = 2.48, SD = 1.687). The visual difference is presented on the graph that records the mean measure for each participation role.",
               "An analysis of variances indicated a significant difference between the groups on the measure of support/influence of the decision-making process F (2, 72) = 7.715, p b 0.01. A Dunnett T3 revealed that Observers scored significantly less than both Advisers (p b 0.05) and Seekers (p b 0.05) on the measure of support phases of the decision-making process. However, there were no significant differences between the Adviser and Seeker respondents (p N 0.05).",
               "Therefore this analysis supports the Hypotheses 3a and 3b and the null hypothesis is rejected.",
               "1. Participation role tends to affect the decision-making process. 2. Advisers and Seekers use OSN in more phases of the DM process in comparison to Observers. 3. Observers tend to skip most of the phases of the DM process. (Hypothesis 3b)",
               "Overall, Advisers and Seekers tend to support approximately four phases of the decision-making process, whereas Observers use OSN to support only two phases."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 29,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "n": "4.",
               "text": "Discussion and conclusion",
               "type": "conclusion"
          },
          "paragraphs": [
               "The primary focus of this study is to understand how OSN is used as a support tool for DM and which of its phases are most used by OSN users for DM. Our survey results show that most OSN users consider themselves as following the rational DM style. The main thoughts, discussions and considerations that took place in this study were bounded around the subject of the DM process and how it can be supported by the use of OSN. We now highlight the contribution of this research to the theoretical and practical world of DM and OSN.",
               "OSN support decision makers in the most well accepted phases of the DM process. Our results provide evidence that OSN provide support for intelligence (information search), design (model of alternatives and options), and choice phases. This finding is aligned with the original Simon model of the DM process. shows the support for DM in OSN based on our online survey in response to the research question: \"What are the phases of DM process that are supported by use of OSN?\"",
               "An explanation on the observation of partial support for phase such as implementation can be derived based on the theory of the cognitive process of the decision maker. In the real-world, decisions are made unconsciously in the mind of the decision maker. From the perspective of the decision maker there is no intention to admit the decision implementation, for example, by the textual impressions in OSN. Survey results showed partial statistical support that the implementation phase is supported by use of OSN. While the actual 'objective' of implementation was not supported, the understanding and identification of resources that are required for implementation of the decision showed statistical significance. From the discussion above, it is apparent that OSN are used as a support tool, which helps find relevant information, understand alternatives, options, choices and consequences; observe and share the DM process experience, identify necessary resources for implementation and evaluation of outcomes from taken decisions.",
               "Our analysis has not only provided evidence for OSN support in the DM process, but has also generated insights on how different participation styles of stakeholders influence the support of DM phases through use of OSN. The mean score of seekers and advisers on phases of DM are much higher than that of observers. Advisers (mean score 3.85) and seekers (mean score 3.91) find support in approximately four out of five phases of the DM process through use of OSN. Observers use only two out of five phases of the DM process (mean score 2.48). From a general understanding about types of DM style that have been provided in the literature, our results do not provide conclusive evidence that DM style has an influence on all phases of the decision-making process. However, the constantly changing world environment and speed of technology innovation have made access to information uncomplicated and undemanding; therefore the decision maker is exposed to different sources of information without an understanding of their effects. Regardless of their spontaneous, intuitive or avoidant style, the information database is readily available to the users, whereby through an easy search of the Internet they are able to make a decision while paying little attention to the phase of the DM process. The action of following the process might take as little as a minute to even years. OSN provide us the opportunity to find answers, interpretations, models and choices. The percentage allocation from the survey showed that dependent and rational decision makers are more willing to admit the fact that they use OSN in most of the phases of the DM process. As for avoidant, spontaneous and intuitive decision makers, when OSN users face a problem, they behave differently without following any particular sequence of DM phases.",
               "Little is known on how OSN should be designed in order to influence or support the decision-making process. Several research areas provide insights towards accomplishing a successful design that can generate revenue. However, the absence of theoretical guidance on how to contract a design for this specific purpose has resulted in the development of many features and tools that can irritate online users . This is especially salient in the case of DM where people are searching for Summary of the research questions, hypotheses, data analysis and variables."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 30,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "text": "Research questions Objectives Hypothesis Data analysis Variables",
               "type": "conclusion"
          },
          "paragraphs": [
               "What are the phases that are most supported by OSN users?",
               "To compare each of the five phases of DM process and its relationship with the use of OSN H.1 Online social networks support the decision-making process H.0 Online social networks do not support the decision-making process  concrete answers, where they can be easily irritated by useless website features.",
               "Rather than creating a virtual space without understanding or copying the design from successful sites, the hosted organization should appraise the decision-maker experience that supports the decisionmaking process through OSN and mirrors this requirements through the design of the website . argue that with the development of OSN infrastructure, some website features become more complex because the websites are aiming for complete advantage and ways to differentiate themselves from others. But complex website features do not always attract more users, and especially will not keep them for a long time; the goal of an OSN site is to ensure that users spend more time browsing around the topics, asking questions and participating in the discussions . OSN face a constant battle of attracting new visitors to their websites and maintaining or increasing the interest level of its members . In the case of OSN for DM, it is vital to attract experts who can provide quality and peer-reviewed information for DM.",
               "Hausman and Siekpe suggest that successful websites should consider the use of 3D graphics, the use of humor and innovative 'techno-savvy' tools. In the case of OSN for DM, the priority is to provide useful and instructive information by enabling the decision-maker to use it for all phases of the DM process. In addition to the identified features in and responses on relevance of these features from our online survey study, results show that decision makers are especially attracted to the search engines that help with information retrieval. Search engines are found to be one of the essential decision-support tools that can accommodate the decision maker's query.",
               "Although the factor of irritation has been mentioned before, some of the OSN participants demand the innovativeness that eventually helps website providers to keep their members. For example, in health OSN (HOSN), the body mass indicator (BMI) or symptom checker has its niche among health decision-makers. Most OSN users are familiar with the generic website functions for DM; the user behavioral intention to share or contribute to the networks is based on this environmental aspects. Results from our study indicate that users appreciate the opportunity to create personal profiles and the possibility of sharing photos or informational links.",
               "We now discuss some of the challenges and limitations that we encountered during this study. Use of online survey interface for distributing a questionnaire offers many advantages as well as some disadvantages that we had to face. The main limitations that have been exposed in this study are associated with sampling, response rate, and demographics.",
               "First is the sampling issue, with the main goal to target the users of OSN for DM. The responses from the online survey represented only the general public who use OSN in their everyday lives. The question that can be asked is whether these OSN participants are aware of their DM process by use of OSN and how they are different from experienced users of OSN for DM. The respondents were asked if they use OSN for DM, but there is no way to ensure that the participants actually support their DM by use of OSN or that they follow a rational decision making process.",
               "Second, there were two related problems, namely insufficient responses and a reasonably high drop-out rate for different questions. These two problems led to some missing data and thus reduced the qualified responses for analysis. This can be explained by the questionnaire taking approximately 30 min to complete, and the respondents may not have felt encouraged to complete it. There is a possibility that providing a reward for participants to participate could boost the response rate and prevent users from quitting the survey before its completion. The chance to win a prize or gift certificate, as reward for participation, however, could result in multiple responses by the same individuals and misrepresentation of background information. Outcome for Hypothesis 1."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 31,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "text": "Hypothesis 1a",
               "type": "conclusion"
          },
          "paragraphs": [
               "Intelligence phase -understanding of problem -Qs23",
               "Reject the null hypothesis Hypothesis 1b",
               "Design phase -development of alternatives -Qs24",
               "Reject the null hypothesis Hypothesis1b-2",
               "Design phase -determination of consequences -Qs25 Fail to reject the null hypothesis Hypothesis 1c",
               "Choice phase -select an option/alternative/course of action -Qs26",
               "Reject the null hypothesis Hypothesis 1d",
               "Implementation phase -identify resources -Qs27",
               "Reject the null hypothesis Hypothesis 1d-2 Implementation phase-implement an option -Qs28 Fail to reject the null hypothesis Hypothesis 1e",
               "Monitoring phase -monitor implemented decision -Qs29 Fail to reject the null hypothesis Support of DM process in OSN."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 32,
          "fromPaper": "Do online social networks support decision-making?"
     },
     {
          "head": {
               "text": "Decision making phases OSN (survey)",
               "type": "conclusion"
          },
          "paragraphs": [
               "Intelligence Identification of resources -supported Implementation of an option/alternative/ course of action -not supported Monitoring",
               "Not supported",
               "Another drawback of this online survey is the participant age; most of the respondents were between 18 and 35 years old. In this case, the explanation can be that professional people are busier and less likely to participate in a survey."
          ],
          "paper_id": "21e978d0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 33,
          "fromPaper": "Do online social networks support decision-making?"
     }
]