[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Complex systems have been studied by researchers from every discipline: biology, chemistry, physics, sociology, mathematics and economics and more. Depending upon the discipline, complex systems theory has accrued many flavors. We are after a formal representation , a model that can predict the outcome of a complex adaptive system (CAS). In this article, we look at the nature of complexity, then provide a perspective based on discrete event systems (DEVS) theory. We pin down many of the shared features between CAS and artificial systems. We begin with an overview of network science showing how adaptive behavior in these scale-free networks can lead to emergence through stigmergy in CAS. We also address how both self-organization and emergence interplay in a CAS. We then build a case for the view that stigmergic systems are a special case of CAS. We then discuss DEVS levels of systems specifications and present the dynamic structure extensions of DEVS formalism that lends itself to a study of CAS and in turn, stigmergy. Finally, we address the shortcomings and the limitation of current DEVS extensions and propose the required augmentation to model stigmergy and CAS."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "A natural system is not a monolithic system but a heterogeneous system made up of disparity and dissimilarity, devoid of any larger goal. The system just \"is.\" Examples of such systems include ant colonies, the biosphere, the brain, the immune system, the biological cell, businesses, communities, social systems, stock markets, etc. Such systems are adaptable systems where emergence and self-organization are factors that aid evolution. These systems are classified as complex adaptive systems. According to : \"CAS are systems that have a large number of components, often called agents that interact and adapt or learn.\"",
               "In this article, we investigate CAS by looking at the scale of components, interactions between the components, and emergent properties that are manifested by such CAS. We will attempt to understand some of the common underlying properties, address the adaptive nature of such complex systems and illustrate how resilience is an inherent property of CAS. CAS is occasionally modeled by means of agent-based models and complex network-based models. Multi-agent systems (MASs) is the area of research that deals with such study. However, CAS is fundamentally different from MAS in portraying features like self-similarity (scale-free), complexity, emergence and self-organization that are at a level above the interacting agents. A CAS is a complex, scalefree collectivity of interacting adaptive agents, characterized by high degree of adaptive capacity, giving them resilience in the face of perturbation. Indeed, designing an artificial CAS requires formal attention to these specific features. We will address these features and the formalisms needed to model CAS.",
               "The discipline of modeling originated to understand natural phenomena. By developing abstractions, we can manage the apparent complexity, reuse it and enable these complex phenomena in artificial systems to our advantage. The discipline of executing this model on a time base is \"simulation.\" The task of decoding the original structure from manifested behavior is the holy grail of the modeling and simulation enterprise ). The need for M & S to make progress in understanding CAS has been well acknowledged by . The task is to understand the gamut of rules that exist within and without a component and understand how the component deals with such multidimensional rules in an interactive environment. M & S is the only way one can understand, mimic and recreate a natural system. Most artificially modeled systems that exhibit complex adaptive behavior are driven by multiresolution bindings and interconnectivity at every level of system behavior. To understand life is to \"model\"; to adapt is to survive in an environment, where both survival and environment are loaded concepts based on the guiding discipline.",
               "Complexity is a phenomenon that is multivariable and multi-dimensional in a space-time continuum. Therefore, what we need is a framework that helps develop system structure and behavior in an abstract manner and that is component oriented so that the system can define its interactions based on the composition of a multi-level environment.",
               "Stigmergy, the study of indirect interaction between network components in a persistent environment, explains certain emergent properties of a system. The network components include both the environment and the agent and both are persistent, i.e. both are situated in a spacetime continuum and have memory. We take stigmergic systems to be a subset of CAS and argue that stigmergic behavior is an emergent phenomenon too. Ultimately, we are trying to get a handle on how to formalize the property of \"emergence.\"",
               "Discrete event abstraction has been studied at length by Bernard Zeigler throughout his illustrious career and his pioneering work on discrete event systems (DEVS) formalism in 1970s . As a student, his perspectives on CAS were influenced by Holland. Ziegler's approach to CAS has been through the quantization of continuous phenomena and how quantization leads to abstraction. Any CAS must operate within the constraints imposed by space, time, and resources on its information processing . Evidence from neuronal models and neuron processing architectures and from fast and frugal heuristics, provide further support to the centrality of discrete event abstraction in modeling CAS when the constraints of space, time and energy are taken into account. Zeigler stated that discrete event models are the right abstraction for capturing CAS structure and behavior . In this article, we take the discipline of modeling CAS forward, by looking at the emergence aspect of CAS. We introduce DEVS and demonstrate how recent extensions still fall a little short in modeling CAS.",
               "We first focus on the study of network science and how scale-free networks are inherently important to study complex interactions and hierarchical systems. In Section 3 we look at various types of interactions in a complex network. Section 4 we address the concepts of emergence and selforganization in detail and examine how a complex dynamic network facilitates such behavior. Section 5, a slight digression, provides an overview of DEVS theory. We return to the subject of dynamism in a complex adaptive network in Section 6 and show how DEVS theory is positioned to give modeling and simulation support to the subject. We describe various existing formal DEVS extensions that help model various features of stigmergy, emergence and CAS. Finally, in Section 7, we present some conclusions and pointers for future research."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "n": "2.1.",
               "text": "Overview",
               "type": "introduction"
          },
          "paragraphs": [
               "Complex networks are the backbone of complex systems and each complex system is a network of interactions among numerous network elements. Some networks are geometric or regular in 2D or 3D space and some have \"long range\" connections that are not spatial at all. Network topology or anatomy is important to characterize because structure affects function and vice versa. The dynamic nature of a network is one of the keys to understand complexity. Each network comes with peculiar set of properties and the manifested behavior of the components is bounded by the constraints the network imposes on them . Each network originates through a set of constraints between the nodes that govern how the links are formed. Such constraints, defined as rules, have totally different manifestations when we talk of social networks built by mutual friends, where the rules are dynamic and of a biological cell, where the DNA blueprint along with unchangeable laws of chemistry and physics govern and dictate all the reactions the cell participates in. classifies networks in complex systems along with three metrics that are used to compare them. The first metric, average path length (L) is used to measure the smallest number of edges connecting nodes A and B. In a fully connected graph, L equals 1. The maximal path length is called the network diameter (D). The degree (K) of a node A is the number of its connections or nearest neighbors. The second metric, the degree distribution P(k) is the probability distribution of the node degrees and shows their spread around the average degree. A neighborhood is the set of K nodes at distance 1 from node A. The third metric, the clustering coefficient (C) ) is the ratio of node A's neighborhood with all possible connections from A. The maximum value C is 1.",
               "We put more focus on the scale-free networks as they are the most complex of the three types. Such complexity is evident in various systems that exhibit scale-free behav- ",
               "Fully connected:",
               "Fully connected:",
               "Fully connected has the highest number of edges 2D, 3D-lattice and ring world:",
               ", 3D-lattice and ring world: low,",
               "2D, 3D-lattice and ring world: high, C $ 0.75 Small-world Same family of regular networks with few links breaking the 2D or 3D or ring-world lattice such that there is no loss in clustering, however reducing path length on a log-scale",
               "Scale-free Built on small-world networks with high vulnerability to targeted attacks. Their origin can be attributed to two properties: growth and preferential attachment Ecology, Internet, brain, biological cell, gene regulation, airline, citation, metabolic, power grid, language, economy",
               "High, C $ 0.75 for K ) 1 a Power law: a slow continuously decreasing curve implying that many small events coexist with few large events. Each power law has a unique degree exponent. P(k) $ K ?Y , where Y is the degree. In most of the networks, the number of nodes with exactly K links follows a power law, each with a unique degree exponent Y between 2 and 3. ior (shown in , column 3) ( . These systems evolve towards scale-free topology to become resilient and are sometimes classified as CAS due to the resulting behavior."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "n": "2.2.",
               "text": "Scale free networks",
               "type": "introduction"
          },
          "paragraphs": [
               "In most complex networks found in nature, the nodes are dynamic agents that extend themselves in an environment to build links with either the environment's objects or other agents. These agents are dynamic in the sense that they govern their interactions with their neighbors through a dynamic unpredictable environment. As nodes are added incrementally, a very important phenomenon occurs when the network reaches a critical state. It undergoes a state change wherein it becomes subjected to a new set of rules, i.e. it starts displaying a totally different behavior that it did not manifest initially. These fundamental shifts are known as \"giant component\" in mathematics , percolation or phase transition in physics, or simply a community in sociology . Critical state transitions impact the behavior of agents, which in turn impact the link structure and consequently, the network topology, bringing in new affordances and constraints altogether.",
               "In order to understand why critical state transition occurs, we ask the following: ) along with Barabsi offered quantitative evidence that clustering is present in social systems and is ubiquitous in nature, thereby making it a unique organic property of complex networks. Clustering coefficients measure the density of a particular cluster: it was found that a few links were sufficient to reduce the average separation of the nodes without making an impact on the clustering coefficient keeping it practically unchanged . The \"Six Degrees of Separation\" experiment ) is famous for describing such phenomenon in social networks. In a cluster, some nodes may act as a connector or a hub, i.e. nodes with an anomalously large number of links. Such hubs are present in every complex system, whether it be a financial system or a cellular network and is another fundamental property of complex networks. The formation of hubs and clustering in a dynamic network redefines the dynamic landscape of a complex system. In society, these are people with varied interests, who connect myriad fields, expertise and experience.",
               "Power law degree distributions are scale-free and most natural complex systems have power-law behavior . Each scale-free network has hubs that fundamentally define the network's dynamic topology. In mathematical terms, power law is a notion that a few large events carry most of the action. So, another question is:",
               "V. What makes a node or an agent evolve into a hub? I. How are the rules inside these agents triggered when \"critical state transition\" occurs? II. Does the agent already have an inherent capacity and does the presence of a conducive environment enforce the agent to manifest a totally different behavior? III. Does the agent learn new rules by active observation in an environment? IV. Do inherent capabilities make the agent vulnerable to external influence?",
               "These questions raise an understated assumption. That is, agents are a part of an interconnected network, the environment is a part of the network and the interactions exist between the agents and the environment. Defining boundaries is therefore rather problematic because weak links and non-linear interactions affect other agents and the environment in unpredictable ways. These are open systems, where agents are connected both directly and indirectly: CAS are open systems.",
               "A group of highly connected nodes is called a cluster. A network is composed of these clusters and weak ties connecting these clusters. Weak ties play a crucial role in network formation. It is only through these links that new information is acquired by the original network as the strong ties stay within the cluster . Society is made of many highly connected clusters connected together by weak ties. This came to be known as the small-world effect. Newman's work",
               "In order to answer this question, scientists looked at physics of atoms e.g. the emergence of magnet , is a phase transition from disorder to order. Wilson's theory of \"renormalization\" ) started with scale invariant behavior and assumed that at the critical point, the laws of physics become applicable in identical manner across all scales, from atoms to boxes containing millions of identical atoms, all acting in unison. He proved mathematically that at such an instant, power laws emerged bringing forth order from chaos. Power laws, as another organic property of complex networks, are patent signatures of self-organization in complex systems.",
               "All nodes are not equivalent. As nodes with their preferences and biases acquire links, their behavior seems to facilitate more link making, i.e. they start portraying affinity for new links. Eventually, they become hubs. Real networks are governed by two laws: growth and preferential attachment, i.e. the network is dynamic, links/nodes are dynamic (they can appear/disappear/rewire) and each link has a probability towards a high affinity node . This preferential attachment is a rule that governs how a network is formed in the first place, from individual nodes leading to a scale-free topology . Most complex networks of scientific and practical importance are scale-free, for example, metabolic network within cell (Jeong, Tombor, Albert, ), citation networks ), economic webs, language networks and many others.",
               "In most complex networks, each node has unique properties and behaviors that are apparent even if its connectivity is unknown. Interestingly, it is these intrinsic properties that partially define and decide what connectivity this node will eventually have in a competitive environment. This competition (may be linked to survival) in a heterogeneous system, decides winners and losers. The rate at which any node acquires connectivity, gaining edges to become a hub defines the new topology and its impact factor in the current network. This rate is the quantitative measure of node's ability to stay ahead of competition, called \"fitness.\" Preferential attachment is driven by the product of the node's fitness and the number of links it has. This fitness function allows a late-coming node (e.g. Google) in the network to impact old connectivity and reorganize the entire topology towards itself, making it a hub. Theoretically, a hub may form that can grab all the links in the existing network, such as in the phenomenon \"winner take all,\" and totally redefine the landscape to an extent that other node's behaviors do not matter. It destroys other hubs and makes a network star-like, i.e. the property of the complex network totally gets transformed . In an interconnected world, links represent survival and competition exists between nodes. In a stigmergic system, interaction is the very mechanism that defines this interconnectedness.",
               "Most real-world systems are generally resilient and their functionality is guaranteed by a highly interconnected complex network. Resilience in a scale free network is rooted in its topology . A significant fraction of nodes can be randomly removed without breaking the network apart when these nodes are not the hubs. Any targeted attack to these hubs can disintegrate the network and reduce it to independent clusters. Such inverse phase transition is evident in cascading network failures, distributed denial of service (DDoS) attacks, grid failures, avalanches, etc. where the load handled by a node is transferred to other neighboring nodes that are not prepared to take such load. Such a phenomenon is also known as self-organized criticality. Not understanding how the actions of one node affect other nodes can inadvertently make the network vulnerable by hitting the hub, leading to cascading failures and complete breakdown of the topology. In a globalized economy the strength of such links becomes more relevant as the supplier and the buyer are not competitors but partners sharing the burden of their respective networks. The financial crisis ) that began in 2007 is evidence how the failure of one large bank risked an entire global financial system. Several major banking institutions either failed, were acquired under duress, or were subject to government takeover. These included Lehman Brothers, Merrill Lynch, Fannie Mae, Freddie Mac, Washington Mutual, Wachovia, Citigroup and AIG .",
               "Diffusion and spreading in a complex network is described by a threshold model. Each node has a critical threshold that allows or prevents it from communicating the idea or message to the next neighbor. Intuitively, if a hub has a lower threshold, such messages are communicated far; the message is not censored and filtered. On the other hand, other nodes that have a higher threshold will prevent the spreading of the message. This distribution of critical threshold levels within the network nodes is a property of the network that explains phenomena such as virus spread, fire spread, and adoption of innovative ideas.",
               "Multi-tasking and concurrency is another inherent property of most complex systems, i.e. each entity continues to display its behavior in the network environment and affects it. Each network node whether simple or complex, is modular. Modularity is an essential property and a defining feature of a complex network wherein it is defined through a node's interface, what it brings to a network in qualitative terms. Each node brings value to the network to keep the network functional. Real networks are clearly scale-free and modular at the same time. Quantitatively, clustering coefficient measures modularity. However, as clusters are formed and hubs are born, the coefficient takes on an inverse behavior, i.e., as hubs emerge they reduce their number of links. Their role transforms from being a functional participant to a more structural role where they maintain links with other hubs to enable connectivity with other clusters, giving rise to weak links across a scale-free network . A hierarchy is born and it allows the evolution of these modules independently. Acquiring a status of hub entails change in its dynamic interface that now affords new links and messages to come across.",
               "Real-world networks are self-organized where independent actions of the constituent nodes and links lead to emergent behavior. The robustness of the laws governing the emergence of complex networks are not confined to a special class of systems but are rooted in the properties and behavior of the nodes guided by two basic conditions of incremental growth and preferential attachment, necessary for a scale-free topology. Adding two more questions to the list: V. What dynamics happen within a node that urges it to extend a link? VI. What transpires through when a link is formed between two nodes?",
               "This section raised some questions on the very foundation of a scale-free complex interactive system. How to determine the source of dynamism and how dynamism affects other nodes and shape the network landscape towards a self-reliant complex network, are issues that are further investigated ahead."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "Stigmergy as a complex adaptive system",
               "type": "introduction"
          },
          "paragraphs": [
               "In this section we take a look at different types of actions that impact the evolution of the network. We classify these actions into two broad categories, i.e., intra-actions and inter-actions.",
               "Intra-actions: These are the actions taken by the node internally, i.e., these actions impact the node itself first and may impact other nodes through various interactions this node participates in. These actions are initiated by the internal dynamics of the node.",
               "Inter-actions: These are the actions taken by the node in an external environment, i.e., these actions impact other nodes in the network. This impact to other nodes is communicated through various modes of communication as allowed by the environment or specified by the properties of the network. Such interactions have been further classified by as:",
               "a. Direct interactions: These interactions are point-topoint connections and the actions of one node directly affect other node and nobody else. b. Indirect interactions: These interactions are publishsubscribe phenomenon where a node publishes its actions (through specific messages) to a shared environment (acting as a persistent medium) and other nodes that are subscribed to this particular type of messages, becoming affected through the medium of exchange.",
               "In the real world, each of agent nodes and the environment is persistent, i.e. they have memory. In modeling complex dynamic systems, we must take memory of both the agents and the environment into account. If agents simply respond to a persistent environment and have a fixed set of rules devoid of any complex learning and/or memory apparatus, then agents are reactive. Stigmergic behavior can still occur in such an environment. However, for an agent to transform from a node to a hub, advanced learning and memory apparatus must be present and that can be triggered when critical state transition occurs. prove that the behavior of computational agents that make use of indirect interactions via the real world are richer than the behavior of agents that interact directly. Their proof is based on the result by : that the real world that is analog in nature may compute algorithmically incomputable functions. Persistence plays a crucial role in the definition of indirect interactions. Persistent Turing Machines (PTMs), equivalent to the Interactive Transition Systems (ITSs) model combines the constraints of computable transitions, as in Turing machines, with the extension to non-algorithmic, interactive processing associated with persistent state ).",
               "Stigmergy is a concept that describes how self-organization of nodes emerges in a persistent medium through an indirect communication. Self-organization is the interaction of a set of processes at a lower level of system to yield structures at a higher global level ). This does not imply that self-organization evolve into a hierarchical organization. For a hierarchy, i.e. a hub to appear, the self-organization must be coupled with other constructs such as scale-free nature of underlying network, coherent emergents, and upward as well as downward causations. This demarcates the boundary between a stigmergic system and a CAS. Self-organization leading to hierarchy has been observed in most natural CAS.",
               "Indirect interaction is crucial to any stigmergic system to occur in the first place. This kind of behavior was first observed in ant colonies by who was intrigued to learn how these virtually brainless creatures could create highly sophisticated messaging systems and build extremely complex architectural structures. According to Grass, complexity in a stigmergic system arises because the individuals interact not with each other but through an environment by making changes to the environment that have spatiotemporal character to them. These spatiotemporal functions in the environment impact other individuals and the causal node itself situated in the same environment. The creation of positive and negative feedback loops, amplification of fluctuations in the presence of multiple interactions shape both the individual and the environment ( ). An individual makes local changes in its environment that last long enough for other individuals to detect and be affected by them. Such behavior has also been researched in robotic MAS that display swarm behavior. One of the features of MAS and the contained autonomous agents within that exhibit indirect communication is the notion of \"decentralized\" control ( . Assumptions that all well-performing systems have \"leaders\" and centralized control are proven erroneous . Collective robotics is another case where stigmergic concepts are applied ( ). Similar work by acknowledges the fact that the fundamental decomposition of intelligent systems is not in the identification of individual processing producers that must interface with each other, but in the interactions that these producers have with the world through perception and action.",
               "The capacity to detect and be affected by changes in the environment as a result of an action of another node in a spatiotemporal manner is guided and simultaneously constrained by both the properties of a network and the internal structure of the node. The capacity \"to detect\" is a property analogous to preferential attachment and affinity. The capacity \"to be affected\" is a property analogous to the threshold model. The third property is \"to form weak links\" with other individuals separated by space and time.",
               "When a detector becomes active in such a hierarchy, the active detectors from the lower level that are connected to it can be omitted from the description. Emergence is thus a characteristic feature of detection hierarchies , p. 5). Such weak links in a stigmergic system are made possible through the persistent environment and the persistent initial state of the agents. These three properties are also central to any CAS. However, there are some CAS properties, such as scale-free nature, and the underlying network complexity that may or may not be portrayed by a stigmergic system. This makes a stigmergic system a special case of a CAS )."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "n": "4.",
               "text": "Emergence and self-organization",
               "type": "introduction"
          },
          "paragraphs": [
               "Emergence, a term coined by has gained widespread attention in the last two decades partly due to the analysis capabilities afforded by massive computational power and partly due to widespread complex systems in everyday use such as World Wide Web. Emergence has been a native of the land of \"complex systems\" and there are four schools of thought that study emergence, as summarized by Wolf and Holvoet (2005):",
               "1. Complex adaptive systems theory: Concept of macrolevel patterns arising from interacting agents. 2. Non-linear Dynamical Systems theory and Chaos theory:",
               "Concept of attractors that guide the system behavior. 3. The synergistic school: Concept of order parameter that influences which macro-level phenomena a system exhibits. 4. Far-from-equilibrium thermodynamics: Concept of dissipative structures and dynamical systems arising from far-from-equilibrium conditions.",
               "We focus mostly on the emergence as addressed in the complex adaptive systems literature."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "n": "4.1.",
               "text": "Strong and weak emergence",
               "type": "introduction"
          },
          "paragraphs": [
               "We begin with a definition of emergence as given in 3):",
               "A system exhibits emergence when there are coherent emergent at the macro-level that dynamically arise from the interactions between the parts at the micro-level. Such emergents are novel with respect to the individual parts of the system.",
               "Other definitions of emergence can be found in ). in their definition give significant importance to the detection of \"something.\" They also described how emergence is handled in a hierarchical complex system:",
               "We acknowledge that emergence is an observer phenomenon and would add that the emergence happens only at levels above the interacting agents, i.e. a hierarchy must be present to detect emergence. The observer is always at a higher level of perception to detect something emerging. Revisiting the ant colony example, an ant does not know that it is building a colony. It is the human observer or a higher animal or a detector agent that witness the existence of such structural functional affordances. While these affordances may be present in the environment that would result in the manifested behavior, an observer must be present to label such an \"affordance\" in an artificial system that selforganizes at the collective behavior at the level above it. In an artificial system, the notion of observer takes a stronghold as various observers can be defined at various levels of a hierarchical system that can detect the occurrence and variations in key indicators at specific levels of resolution to categorize as emergence. Another way to look at it is through the identification of such key indicators. These key indicators are not a part of the system they are meant to observe. Sometimes these indicators can be derived from the lower level constructs and sometimes they are beyond such deduction and are completely novel . This demarcation in detection capabilities was formalized by as L (n?1) and L n levels. L (n?1) is a level where individuals interact in a persistent environment. L n is a level above L (n?1) that observes these global collective properties of L (n?1) . Both L (n?1) and L n have their own grammar and representation. Obviously, if a pattern in a lower level L (n?1) is not formalized as a detector at L n then such pattern will fail to \"emerge\" at L n . This correlates with deducible emergence where two disjoint levels are linked by a computational process i.e. how L (n?1) and L n interact computationally. Alternatively, we as humans see what we are entrained to see through our rich set of experiences. If we are unable to identify a pattern, it is highly unlikely we will label it as such, i.e. we do not understand the grammar at L n ! The other viewpoint from Bonabeau and Dessalles (the second quote) is congruent with the nature of complex networks that explains how hubs are formed in the real world. To further analyze this congruence, one has to put the act of observing in the agent itself. When we design intelligent agents, we could also imbue them with the power to observe the collective whole. Such power of observing the collective impact of other agents indirectly is readily present in a stigmergic system where both the environment and the agents are persistent. Their actions are based on this persistence wherein the collectives have been realized in the environment in a spatiotemporal matrix. Alternatively, agents in a stigmergic environment need not be encoded with complex detection patterns. Just the presence of these agents in a stigmergic scale-free complex system fulfills the requirement of an observer within an agent. So, it can be argued that a stigmergic system provides a foundation for emergence to occur. Now, having both a stigmergic system and a sophisticated detector mechanism in an artificial agent, will make this agent more competitive to other agents due to its handling of additional percepts. As the emerging properties in the system continue to be detected, the relative strength of these properties can guide, in real-time, the role of this agent and various contingencies that are enforced in the environment as a result of change in an agent's behavior. From a performer at a specific level of system, on detection of emerging patterns, agents can become, an enabler, a hub. This is the rise of hierarchy in a self-organized manner as has been described in Barabsi's work and the coherent property ) mentioned in the first definition of emergence. This aspect of having the act of observation inside the agent is also congruent with ideas of strong and weak emergence by . Muller also added that in strong emergence, the observer has causal powers.",
               "The system displays strong emergence when the emergent behavior is irreducible to either the agent or the environment as both interact in a dynamic spatiotemporal manner. The emergent behavior also has a downward causation at lower levels ) changing the very nature of the network beneath it. This marks the rise of hierarchy and the critical state transition. In the case of weak emergence, the emergence phenomenon is reducible to its constituent components and effect of causality on lower-levels is questionable. Examples like the \"Game of Life\" and connectionist networks are examples of weak emergence where laws encoded in low-level rules result in high-level structures and patterns. Basic laws result in unexpected behavior that surprise us, that can be reduced to simple rules (albeit, with difficulty but possible) with no downward causation to impact low-level rules. A stigmergic system displays weak emergence when the agents do not develop hierarchy, i.e. do not become a hub and impact the topology. Ant behavior is example of weak emergence: an ant has basic rules but no ant becomes a hub. A stigmergic system displays both strong and weak emergence depending upon the role of observer in strong emergence. The collective behavior is manifested in the persistent dynamic environment that the agent is part of. The agent detects such changes and acts over them.",
               "Note the keywords: dynamical, adaptive, acquire, maintain, structure, and without external control. The context can easily be understood with respect to the scale-free network and their emerging topologies. acknowledge the identification of \"boundary\" of the system which relates to the modularity principle in scale-free networks.",
               "While both emergence and self-organization are dynamic properties of complex systems, the network's and the agent's robust internal properties together will decide if both of them are simultaneously portrayed by the system. Three cases arise , pp. 9-11):",
               "1. Self-organization without emergence. 2. Emergence without self-organization. 3. Emergence and self-organization together."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "n": "4.2.",
               "text": "Self-organization and emergence",
               "type": "introduction"
          },
          "paragraphs": [
               "We briefly discussed the formation of a hub in a stigmergic system. We now look at the concept of self-organization within the context of emergence, defined by Wolf and Holvoet (2005, p. 7) as: \"Self-organization is a dynamical and adaptive process where systems acquire and maintain structure themselves, without external control.\"",
               "The first case is easily understood by looking at classical multi-agent systems in which the entities self-assemble to do a particular task. Removal of an entity does not impact the performance of the task because of the adaptive nature of such assembly, as another node can replace the lost node: the system can continue to display the same behavior. There is no novelty in the global behavior, hence no emergence. The network may or may not be scale-free. Growth and decay are not properties of self-organization when considered in isolation. Self-organization is an adaptive collective behavior.",
               "The second case, emergence without self-organization, can be understood by an example of a stationary gas, in the realm of physics. A stationary process is time-translation invariant: a gas has a certain volume in space. This volume is its emergent property is novel and unique as a function of its atoms. A system can exhibit chaos that emerges from interaction of these atoms but no self-organization as they do not organize to perform a collective behavior.",
               "The third case, the most interesting one as far we are concerned, is found in natural systems where both the persistent environment and producing agents are present. In such a dynamical system, the agents can hierarchically self-organize and display adaptive emergent phenomena through their defined actions that result in dynamic scalefree topologies. Providing structure to such an emergent complex adaptive system apriori is almost impossible as the system structure itself is based on persistent nature of components, dynamic interactions and the resulting topology. As has been evident in evolution of scale-free networks that the hubs tend to reduce complexity , similar results by ) are present in complexity research that state \". . . self-organization increases statistical complexity, while emergence, generally speaking, reduces it\".",
               "Because these systems are intricately linked, they display non-linear behavior where a small perturbation can lead to a large effect due to amplification by positive or negative feedback loops. Network complexity can propagate to a large portion of network, triggering cascaded effects. When caught up in a positive feedback loop, the system will realign when it encounters a similar negative feedback loop. Consequently, in a self-organizing emergent system, the interplay of positive, negative feedback loops, amplifications, suppressions, taken all together as preferential attachment, thresholds and affinities, become a function of the environment and the agent taken together. In a complex adaptive self-organizing emergent system, the system continues to redefine the topology, display the emergent properties and refine the properties themselves. In fact, these properties may very well enable such self-organizing and emergent properties in the first place.",
               "1. Levels of systems specification: these describe how systems behave. 2. System specification formalisms: these incorporate various modeling styles, such as continuous or discrete.",
               "Systems theory distinguishes between system structure (how the system is constituted internally) and system behavior (how the system manifests externally). Understanding the system structure allows us to deduce its behavior. The internal structure of a system is laden with many concepts, such as:"
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "n": "5.",
               "text": "Discrete event systems (DEVS) theory and its variants",
               "type": "introduction"
          },
          "paragraphs": [
               "The Theory of Modeling and Simulation was first introduced in . Some notable extensions of the original DEVS formalism are fuzzy DEVS, dynamic structure DEVS, confluent DEVS, symbolic DEVS and real-time DEVS. DEVS concepts have been applied to almost every natural phenomenon, from simple state machines to non-linear systems to continuous systems to complex hybrid systems ( ). The depth of DEVS systems formalism was acknowledged by researchers like ) who established DEVS be the common denominator of all modeling formalisms due to its mathematical foundation and rigor (see ). For more details on each of the formalisms, see . DEVS theory is made up of two orthogonal concepts ( ): 1. State representation: different states the system may exist in. 2. Transition functions: mechanisms that allow moving from one state to another. 3. State to output functions: mechanisms that make system a producer in an environment. 4. Composition: capacity to form a larger system by coupling smaller systems. 5. Decomposition: capacity to decompose into smaller systems from a larger system. 6. Hierarchical construction: capacity to continue to portray composition. 7. Modular: capacity to have defined input and output interfaces to enable composition.",
               "Systems theory is closed under composition in that the structure and behavior of a composition of systems can be expressed in original system theory terms. This is the foundation of modular systems that have defined input and output interfaces through which all interaction with the environment occurs. Such modular systems are coupled together to form larger ones leading to hierarchical construction. . Formalism transformation graph.",
               "More detailed description of alternate system specification formalisms such Differential Equation System Specification (DESS), Discrete Time System Specification (DTSS), and Quantized Systems can be found in . While DESS and DTSS as their names suggest are self explanatory, quantized DEVS warrants a definition. Quantization is a process for representing and simulating continuous systems as an alternative to the more conventional time axis. It is built on threshold crossing model. While discretization leads to DTSS, quantization leads to discrete event systems. Using quantization to develop abstractions for CAS is also addressed in ). shows a mapping of various formalisms. As can be seen, the universality of DEVS formalism allows specification of hybrid systems.",
               "Having seen the scope of the DEVS formalism, we focus our attention on the DEVS formalism and levels of systems specifications. specific output trajectories. The black box system at Level 3 is an \"atomic\" component in DEVS parlance, capable of dealing with external inputs and that undergoes state transitions to produce external outputs. At Level 4 we have coupled and interactive systems that are connected using \"coupling\" relationships. The systems are coupled using ports and outputs of one system and are connected to inputs of another system. Such coupling allows composition and hierarchical construction. summarizes these levels."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "n": "5.2.",
               "text": "DEVS system components",
               "type": "introduction"
          },
          "paragraphs": [
               "Structurally hierarchical DEVS system is composed of three elements -atomic, coupled and associated couplings between the atomic and coupled components."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "n": "5.2.1.",
               "text": "Atomic component",
               "type": "introduction"
          },
          "paragraphs": [
               "An atomic parallel DEVS (parallelDEVS) M ( ) is specified by a 8-tuple",
               "The DEVS levels of systems specification has five levels. At the most basic level 0 is the observation frame that defines which inputs stimulate the system, what variables to measure and how to observe them over a time base. At this level we also think about the possible range of values the inputs may take. The observation also correlates the input trajectory with specific outputs the system produces. Such correlation between inputs and outputs is called an I/O pair linked over a time-base. A collection of such I/O pairs is called an I/O behavior at Level 1. It is entirely possible that two or more input trajectories may lead to the same output trajectory. At Level 1 we have all those trajectories collected and at Level 2 we distinguish them based on the initial state of the system when input is injected. The initial state determines a \"unique\" response to any input and is represented as an I/O function. At Level 2 we not only can define the initial state but also state transitions when the system responds to input trajectories. At Level 3 we have a system that has a state-space and characteristic functions that map specific input trajectories to set of sequential states",
               "external transition function Q = {(s, e): s e S, 0 6 e 6 ta(s)} state set including elapsed time",
               "There are no restrictions on the sizes of the sets, which typically are product sets, i.e., S = S 1 ? S 2 ? ? ? ? S n . In the case of the state set S, this formalizes multiple concurrent parts of a system, while it formalizes multiple input and output ports in the case of sets X and Y. The time base T is not mentioned explicitly and is continuous. For a discreteevent model described by an atomic-DEVS M, the behavior is uniquely determined by the initial total state (s 0 , e 0 ) e Q and is obtained by means of the following iterative simulation procedure (see ).",
               "At any given moment, a DEVS model is in state s e S. In the absence of external events, it remains in that state for a period of time defined by ta(s). When ta(s) expires, the model outputs the value k(s) through a port, and it then changes to a new state s 1 given by d int (s). This transition is called an internal transition and describes the intra-action defined in Section 3. Then, the process starts  Levels of systems specifications. Reproduced from ."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "text": "Level",
               "type": "introduction"
          },
          "paragraphs": [
               "Name System specification at this level , where s is the current state, e is the time elapsed since the last transition (external or internal), and x is the external event received. After an external transition, the model is re-scheduled and the process starts again (left gray arrow), setting the elapsed time e to 0. In the situation when the internal transition is about to happen and an external input is received, the d con (s, e, x) selects either d int or d ext . From a structure perspective, an atomic model is made of set of input ports and values specified as X M , a set of output ports and values as Y M , and a non-empty set of states S. From a behavior perspective, there are the d int ; d ext ; d con ; and k. To summarize: sigma holds the time remaining to the next internal transition. This is precisely the time-advance value to be produced by the time-advance function. In the absence of external events the system stays in the current state for the time given by sigma. The time advance function can take any real number between 0 and 1. A state for which ta(s) = 0 is called transient state. In contrast, if ta(s) = 1, then s is said to be a passive state, in which the system will remain perpetually unless an external event is received. ",
               "This formal description leads to development of hierarchical DEVS models where subcomponents can be either coupled or atomic with defined interface specifications . M1, M2, and M3 can be either an atomic model or a hierarchical coupled model. Understanding the dynamics of atomic and coupled DEVS system was essential to understand how DEVS and its extension, dynamic structure DEVS formally describes an adaptive system. It can now be seen that a DEVS system is a hierarchical complex dynamical system closed under coupling (similar to closed under composition) with modularity at its core. In its default description, while DEVS can specify a structurally static system, the formal atomic and coupled models cannot sufficiently describe the network dynamics and adaptive behavior as needed for natural and biological systems, especially when stigmergy and emergence are occurring together. However, in its current state, it certainly can describe weak emergence in isolation. Examples such as an avalanche or a sand-pile are emergent phenomena with no self-organization. To model hierarchical self-organization, it is imperative to have a variable structure capability ) that can reconfigure the component system both structurally and functionally. The structural capability is manifested externally, outside the component boundary, while the functional capability is manifested internally, within a component."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "n": "5.3.",
               "text": "Dynamic structure and multi-level DEVS",
               "type": "introduction"
          },
          "paragraphs": [
               "DEVS systems have a continuous time-base but their execution is event-based. A variable structure discrete event system adds a temporal nature to the structure of the system itself. The structure of a system can be dynamic at three levels:",
               "1. Component level: entire sub-structures are removed or added in a live system. 2. Connection level: interactions are reconfigured in a live system. 3. Interface level: interface of the component itself is subject to reconfiguration.",
               "The behavior of a system can be dynamic in four ways:",
               "1. State space. More technically, such dynamism must be traceable to the levels of system specification described in Section 5.1. provides the mapping of how dynamism is introduced at various levels. It shows what would be an outcome of such dynamic activity. The last column relates it to the list of questions we encountered in understanding the nature of scale-free networks.",
               "The dynamic structure outcomes have been adequately dealt with in our earlier work ), formally by , . Here we will discuss the formal undertaking of dynamic structure by and as the structural change is initiated from within the system components rather than a specialized component called Network Executive in Barros' DSDEVS. The first version is named as DynPDEVS. The underlying idea behind this DEVS extension is to interpret models as a set of models successively generating themselves by model transitions. Model and network transitions are introduced mapping the current state of a model into a set of models that the model belongs to. The formalism supports models that adapt their own interaction structure and their own behavior as a result of those interactions through a newly added transition function q a . The structural changes are induced bottom-up and are communicated through another newly defined transition function, q k . Specific types of input and output interfaces are introduced that communicate these structural changes to other models. This version refers to dynamic components and dynamic coupling in a live system.",
               "The second more advanced type is built on DynPDEVS and it introduced dynamic port interfaces. The ports X, and Y are part of the incarnations of model M. This is the most critical of capabilities requires for metamorphosis Introducing dynamism at various levels of system specifications."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "text": "Level",
               "type": "introduction"
          },
          "paragraphs": [
               "Name How dynamism is introduced Outcome Impact in a scale-free network of the component allowing plasticity , for example, in neuronal ensembles that add dendrites and axons to support the Hebbian hypothesis. A DEVS neuron with dynamic interfaces requires this capability of dynamic interfaces as it strengthens or weakens its connections with other neurons. The second version is named qDEVS. Formally, it is described as: An atomic qDEVS is a structure hm init , M, X sc , Y sc i with m init e M being the initial model, and m i e M be the ith incarnation, X sc and Y sc the ports to communicate structural changes, and M the least set with the following structure:",
               "M qDevs ? hM pDevs ; M pDevs ; s 0 ; q a ; q k i; where",
               "implied structural network changes A reflective, higher order network, a qNDEVS, is the structure qNDEVS = hn init , N, X sc , Y sc i with n init e N being the start configuration, X sc and Y sc the ports to communicate structural changes, and N the least set with the following structure:",
               "ML-DEVS is an extension of qDEVS and consists of Micro-DEVS (atomic) and Macro-DEVS (coupled). Let us look at Macro-DEVS first. A Macro-DEVS has structured input, output and state sets, X, Y and S respectively. An k output function produces output for the output ports and a set C of components is specified. A set of multi-coupling functions MC allows specification of value couplings. The state transition function d takes into account the current state, the components and multi-couplings to calculate the new state. A function p associates ports with each state. The structural change function sc defines the correlation between the set of components and multi-couplings for the current state. The downward causation is enabled by v down that couples Macro-DEVS' current state variables to the input ports of micro-DEVS. The downward activation is done by k down function that allows synchronous activation of micro-DEVS models in an event-based manner. The upward causation is enabled by the port transition function as all the available ports at micro-DEVS level are available at macro-DEVS level. The transition function d at Macro-DEVS accounts for any change in ports at the micro-DEVS in calculation of next Macro-DEVS state. A Macro-DEVS is defined as a structure:",
               "where",
               "where C set of components that are of type qDEVS MC set of multicouplings",
               "The value of q N preserves the state and the structure of models that belong to the \"old\" and the \"new\" composition of the network. A multicoupling mc i e MC in this formalism determines how the outputs are distributed from output to input ports. In regular DEVS (Section 5.1), if more than one input port is linked to an output port, the output values are cloned at all the inports. When the artifacts and messages are in real world and consumable physical objects, this may not be desirable. The standard strategy is useful when the information is to be broadcast. In natural systems, the capability warrants a function that selects the output port for consumable resources. A random selection strategy may very well be used in the MC function. For rigorous mathematical analysis of this formalism, see . The dynamic structure capability thus far defined by qDEVS is manifested externally in the topology. An atomic model can be reincarnated as a coupled model and hierarchy can emerge. However, the coupled component still acts as a container of other components without any state and behavior representation. Hubs cannot form without displaying a behavior. To alleviate this problem, state and transition functions are introduced at the coupled level in Multi-Level-DEVS (ML-DEVS) . p function that maps ports with each state s C set of sub-models which are of type Micro-DEVS or Macro-DEVS MC set of multi-couplings, {m|m: 2",
               "For more detailed mathematical analysis, see . The application of ML-DEVS has been in the areas of computational chemistry and biology. As a result, the formalism was designed to satisfy the needs of these disciplines where agents are essentially reactive. Micro-DEVS is a simplified version of parallelDEVS in which there is no d int and d con , but only d ext to account for external messages. This simplification is undesirable when the agent is proactive and adaptive with learning behavior. The agent's internal state is equally important and is much needed. Consequently, Micro-DEVS is unsuitable for modeling CAS. We recommend using the atomic qDEVS Features required for modeling scale-free CAS, capable of self-organization and emergence.  ). However, their atomic DEVS specification has to be integrated with Macro-DEVS to model the transformation of a node into a hierarchical node, i.e. a Hub."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "text": "ID Feature",
               "type": "introduction"
          },
          "paragraphs": [
               "Coming back to our discussion of CAS, let us now look at how the dynamic structure DEVS lends itself to describe a scale-free CAS. The feature list presented in list just some of the features that we identified and that can help in modeling CAS with DEVS. Our analysis is based on scale-free topologies and co-occurrence of self-organization and emergence in an interconnected network of persistent agents and persistent environments. We also established that a stigmergic system is a type of CAS so the features categorized as \"SG\" in are also applicable to CAS. The last column shows the state-of-the-art in modeling CAS and stigmergy using dynamic structure multi-level DEVS."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "n": "6.",
               "text": "DEVS for complex adaptive systems",
               "type": "introduction"
          },
          "paragraphs": [
               "All the feature requirements for stigmergy and some of the features of CAS are addressed by DEVS formalism. We can clearly see that clustering and strong emergence are the two properties that require augmentation to the current DEVS extensions. The clustering property specifically belongs to CAS and is not needed for modeling stigmergy. The current state of ML-DEVS is fully equipped to specify a stigmergic system except the partial solution provided for strong emergence. The current state of DEVS extensions is shown in . Augmentation of the strong emergence capability, i.e. embedding the observer functionality inside an agent model will formally specify \"Stigmergic-DEVS.\" Similarly, augmentation of the clustering capability, i.e. transformation of a node into a hub at both the structural and behavioral level, would specify CAS-DEVS. Since ML-DEVS is based on qDEVS, the ML-DEVS extension should be augmented to:",
               "1. Transform an atomic component to a cluster component: this requires addition and augmentation of new transition functions in a live system such that it performs a macro-role rather than a micro-role. This is related to rise in abstraction at the DEVS atomic level. Augmentation should result in an algorithm that transforms a node into a hierarchical node with Macro-DEVS behavior. 2. Strong emergence: this capability requires the agent to reconfigure its behavior based on its observation of the micro-and macro-patterns in a downward causal manner as designed by the designer of the artificial system."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "n": "6.1.",
               "text": "Discussion",
               "type": "introduction"
          },
          "paragraphs": [
               "The features listed in operate at various levels of abstractions and an implementation of these features at the appropriate level of abstraction yields the desired effect. Next, we associate these features with DEVS levels of system ). The presence of the same feature at different levels of DEVS specification implies that the feature needs to be implemented at all those levels. For example, feature A should be specified at levels 1, 2, 3 and 4 simultaneously to get the clustering effect. We introduced a \"coupling\" abstraction level in the coupled system at Level 4 to clearly mark the features that impact connectivity of atomic and coupled components. This may imply that there is an additional level of abstraction between the DEVS atomic and coupled components that formally specifies a dynamic coupling relation. The dynamic coupling relation has been described with reference to qDEVS and ML-DEVS. As can be seen from , a coupled system at Level 4 is mirroring the feature set of an atomic system at Level 3 with the exception of features of hierarchy (including containment) and environment persistence. This also reaffirms our thesis that a coupled model specification needs to have a behavior of its own and not just act as a container. Further, the coupling abstraction may also cater to features like clustering, topology, preferential attachment, growth and decay, interconnectivity and self-organization. This implies:",
               "emergence and the corresponding closure under coupling property in DEVS CAS formalism is left for future work."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "n": "7.",
               "text": "Conclusions",
               "type": "conclusion"
          },
          "paragraphs": [
               "1. That there may be a way to formally define a \"rich\" coupling specification that has above-mentioned aspects encoded. 2. That some of the behavior encoded in the nodes can become the behaviors of the networked system where the formal coupling specification manifests the properties of the complex network.",
               "Another important aspect warranting discussion is the closure under coupling property of complex systems. The DEVS levels of system specification are closed under coupling, i.e. the behavior of a coupled DEVS can be specified as an atomic DEVS. This property helps build hierarchical complex systems and the current DEVS formalism is positioned to support weak emergence, whereby the emergent behavior can be reduced to lower level behavior of the constituent components of the system. In order to display strong emergence, what is needed is an extension of \"closure under coupling\" property of CAS such that the novel emergent behavior that is irreducible to the constituent components can be accommodated. This implies that the new observed behaviors (or emergents) that are not part of the system (at Level L n?1 ) be made available as observers at a higher level of hierarchy at Level L n , become \"acquired\" behaviors at Level L n . Such acquired behavior should then reconfigure the Macro-DEVS behavior specification to incorporate the new abstraction and concepts as provided by the observers at L n . Formal analysis of strong Complexity is a multifaceted topic and each complex system has its own properties. However, some of the properties like high interconnectedness, large number of components, and adaptive behavior are present in most natural complex systems. We looked at the mechanism behind interconnectedness using network science that describes many natural systems in the light of power laws and selfsimilar scale-free topologies. Such scale-free topologies bring their own inherent properties to the complex system such that the entire system is subjected to the network's structural and functional affordances.",
               "It is largely unknown what makes a network evolve into a scale-free network, whether it is a top-down goal-driven phenomena or bottom-up causation or just an outcome of natural interactions. Two conditions have to be present for a network to evolve into a scale-free network: (1) incremental growth and (2) preferential attachment. We explored the notions of scale-free nature, strong and weak emergence, self-organization and stigmergic behavior in a complex adaptive system with persistent agents and persistent environment. We also related the concept of emergence to network science and presented arguments on how hubs and connectors are formed when a complex system is going through a critical phase. We argued that under any occurrence of both self-organized and emergent behavior together, the properties of scale-free network exist and one has to look at right level of abstraction in a multi-level system to witness the instance based interactions. We established that stigmergy displays strong emergence and is a specialized case of CAS. We also enumerated 18 properties of a CAS, 11 of which were properties of stigmergic systems.",
               "We presented a high level view of DEVS theory and how its formal rigor is able to specify complex hierarchical systems. We described variants of dynamic structure and multi-level DEVS, and mapped it to some of the identified properties of CAS and stigmergy. We detailed the adaptive nature of complex system with DEVS levels of systems specification and what it means to have dynamic adaptive behavior at different levels of a system. During the mapping process, we found that the following capabilities warrant formal attention to extend DEVS theory of complex systems to a theory of complex adaptive systems:",
               "1. How clusters are formed, hubs appear and evolve. 2. How multi-level self-organization occurs. 3. How strong emergence results in self-organization with an embedded observer capable of causal behavior at lower levels of hierarchy. 4. How formal attention to coupling specification may provide additional abstraction mechanisms to model dynamic interconnected environment. Abstraction levels of scale-free CAS features portraying self-organization and emergence."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     },
     {
          "head": {
               "text": "Level Name",
               "type": "conclusion"
          },
          "paragraphs": [
               "Features of scale-free CAS Finally, we recommended the augmentation of qDEVS as the foundation for Stigmergic-DEVS, and investigation of both qDEVS and ML-DEVS augmented together as a foundation for CAS-DEVS."
          ],
          "paper_id": "21f97e60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "Emergence in stigmergic and complex adaptive systems: A formal discrete event systems perspective"
     }
]