[
     {
          "head": {
               "text": "REPORTS",
               "type": "introduction"
          },
          "paragraphs": [
               "of network evolution are generic and which are specific to the cultural, organizational, and institutional context in question. We note that the methods we introduced here are generic and may be applied easily to a variety of other settings. We conclude by emphasizing that understanding tie formation and related processes in social networks requires longitudinal data on both social interactions and shared affiliations . With the appropriate data sets, theoretical conjectures can be tested directly, and conclusions previously based on cross-sectional data can be validated or qualified appropriately. . Network-level properties over time, for three choices of smoothing window t 0 30 days (dashes), 60 days (solid lines), and 90 days (dots). (A) Mean vertex degree bk?. (B) Fractional size of the largest component S. (C) Mean shortest path length in the largest component L. (D) Clustering coefficient C. , where r S is the Spearman rank correlation between individual degrees at day 61 and in subsequent approximations. z varies between 0 and 1 and measures the proportion of variance in degree ranks that cannot be predicted from the ranks in the initial network. data set except during natural spells of reduced activity, such as winter break . On the other hand, as illustrates, individual ranks change substantially over the duration of the data set. Analogous results apply to the concept of Bweak ties[ (13): The distribution of tie strength in the network is stable over time, and bridges are, on average, weaker than embedded ties Econsistent with (13)^. However, they do not retain their bridging function, or even remain weak, indefinitely."
          ],
          "paper_id": "21fb7a30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Empirical Analysis of an Evolving Social Network"
     },
     {
          "head": {
               "text": "References and Notes",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Our results suggest that conclusions relating differences in outcome measures such as status or performance to differences in individual network position should be treated with caution. Bridges, for example, may indeed facilitate diffusion of information across entire communities . However, their unstable nature suggests that they are not Bowned[ by particular individuals indefinitely; thus, whatever advantages they confer are also temporary. Furthermore, it is unclear to what extent individuals are capable of strategically manipulating their positions in a large network, even if that is their intention . Rather, it appears that individual-level decisions tend to Baverage out,[ yielding regularities that are simple functions of physical and social proximity. Sharing focal activities (10) and peers , for example, greatly increases the likelihood of individuals becoming connected, especially when these conditions apply simultaneously.",
               "It may be the case, of course, that the individuals in our population-mostly students and faculty-do not strategically manipulate their networks because they do not need to, not because it is impossible. Thus, our conclusions regarding the relation between local and global network dynamics may be specific to the particular environment that we have studied. Comparative studies of corporate or military networks could help illuminate which features"
          ],
          "paper_id": "21fb7a30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Empirical Analysis of an Evolving Social Network"
     }
]