[
     {
          "head": {
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "The game theoretical analysis of international environmental problems has received increasing attention in recent years. This is not surprising. Game theory analyzes the interaction between agents, formulates hypotheses about their behavior, and predicts the final outcome. Therefore, game theory is particularly suited to analyze the incentive structure of international environmental problems. Central questions which can be investigated with this method are: Under which conditions will an international environmental agreement (henceforth abbreviated IEA) be signed and ratified? On which reduction targets will the negotiators agree? How many and which countries will sign an IEA? Will the agreement be stable? Which measures may be used to stabilize an IEA?",
               "The game theoretical literature has provided many insights to these questions in recent years. In particular, it has provided many results which help to explain the difficulties of establishing effective and efficient cooperation. However, the game theoretical analysis of international environmental problems has also been criticized for abstracting from too many practical problems and being based on very specific assumptions. Therefore, it is argued that game theoretical analyses do not capture many important aspects of international pollution problems, derive no general results and are therefore illsuited for policy analyses and recommendations. This paper tries to qualify this critique by pointing out important results, how they have been obtained and which aspects have to be treated in future research. It proceeds in four steps. In a first step it explicitly lays out the fundamental assumptions underlying the analysis of international environmental problems (chapter 2). The need for cooperation and the problems of cooperation are defined. For simplicity the analysis will be restricted to global environmental problems. In a second step the paper summarizes important findings and adds some new insights which help to explain the difficulties of cooperation and discusses measures to establish cooperation. Chapter 3 looks at measures to avoid asymmetric welfare distributions and to enforce an IEA. Chapter 4 discusses policy instruments in global pollution control and chapter 5 summarizes the results on the formation of coalitions. In a third step, the results of chapters 3, 4 and 5 are critically reviewed. On the one hand, open issues with respect to the theoretical analysis are characterized. On the other hand, practical problems which are not covered by theory are mentioned and evaluated as to their effect to influence policy recommendations. In a fourth step, the theoretical results and the derived conclusions of chapters 3 to 5 are applied to the analysis of the Kyoto-Protocol (chapter 6). It is shown that the theoretical results are helpful in explaining and evaluating this IEA. briefly characterizes open issues for future research."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "n": "2.1",
               "text": "Theory",
               "type": "introduction"
          },
          "paragraphs": [
               "Let there be N countries, iI={1, ..., N}, and welfare of country i,i , comprise benefits from emissions,i (e i ), and damages caused by global emissions,i (e j ). We make the standard assumptions of strictly concave welfare functions comprising strictly concave benefit functions and strictly convex damage cost functions from emissions. That is, we assumei ",
               "On the one hand, emissions generate utility as an input in the production and consumption of goods . Alternatively, the benefit functions may be interpreted as the opportunity costs of abatement of countries (where lower emissions imply higher opportunity costs). On the other hand, emissions released by country i, e i , cause environmental damages in country i but also in the other countries. Equation assumes a global pollutant. That is, emissions disperse uniformly in the atmosphere (as this is the case for greenhouse gases) and therefore damages depend only on aggregate emissions,e j .",
               "If each government behaves non-cooperatively, it maximizes with respect to its own emissions, e i , considering only damages in its own country but not those in other countries. which follows from applying the implicit function rule to the equilibrium condition in .",
               "The interdependence between countries via the release of emissions is visualized in . , is defined by the intersection of the reaction functions. It is plausible to assume that this equilibrium reflects the status quo before an IEA is signed (status sine pacta).",
               "It is important to note that in the Nash equilibrium, though governments behave non-cooperatively, they reduce some emissions (namely, e e N max i i ? ) compared to a \"no-abatement policy\" where counto hold, where e i max represents the upper bound of emissions. That is, countries do not reduce any emissions. We abstract in this simple exposition from two facts. First, there might be a timelag between the time when benefits and damage costs accrue to agents. Second, global warming gases are stock pollutants (that is, damages depend on accumulated greenhouse gas emissions) rather than flow pollutants as assumed in . The simple framework seems to be justified since the qualitative results with respect to the incentive structure of countries to sign and comply with an IEA would not change in a more sophisticated model. For a similar assumption see Chander/ Tulkens/Van Ypersele/Willems (1999), Falkinger/Hackl/ and . try 1 would emit e 1 max and country 2 e 2 max . This is at least true as long as governments recognize damages at all, i.e.,i j e ( )> > 0 0 , as has been assumed in . If this were not the case, then a government?s optimal non-cooperative emission level would be e i max , i.e., e e i N i = max (see footnote 4)."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Figure 1: Non, Partial and Full Cooperative Abatement Policies",
               "type": "introduction"
          },
          "paragraphs": [
               "From a global point of view it would be advisable that governments cooperate. Each government should not only consider damages caused by its emissions in its own country but also those caused abroad. That is, governments should choose emissions according to (footnote 2 applies)"
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Fundamental Result",
               "type": "introduction"
          },
          "paragraphs": [
               "A full cooperative solution increases global welfare. That is, cooperation is group rational. Global emissions are lower than in the Nash equilibrium.",
               "Proof: See for instance Of course, between the \"non-cooperative\" (Nash-equilibrium) and the \"full cooperative\" outcome (global optimum) other, more pragmatic solutions are conceivable. Such \"partial cooperative\" solutions may call for modest emission reductions. They lead only to a partial internalization of global externalities. Aggregate emissions are generally higher than in the social optimum but lower than in the Nash equilibrium. Global welfare is generally lower than in the social optimum but higher than in the Nash equilibrium. Such pragmatic solutions will be discussed in chapter 4.",
               "According to Result 1 there is an incentive for countries to cooperate on global pollution control.",
               "Consequently, the question arises:"
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Fundamental Question",
               "type": "introduction"
          },
          "paragraphs": [
               "Why is cooperation so difficult?",
               "The difficulty arises because there is no supranational institution at the global level which can enforce cooperation. At least from a game theoretical perspective it is argued that international law -though it might provide a guidance of \"good conduct\" -is not binding. A party may accuse an other party for some wrong doing and might appeal to the The International Court of Justice. However, the Court can only deal with the matter if the accused party agrees to open a trial. Thus, in fact, the Court has no enforcement power."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Fundamental Assumption",
               "type": "introduction"
          },
          "paragraphs": [
               "There is no third party which can enforce cooperation at the global level. Therefore, 1) IEAs have to be signed voluntarily, 2) the parties must agree on the design of an IEA by consensus and 3) the enforcement of the treaty must be conducted by the parties themselves.",
               "In the light of this assumption the problem of cooperation can be structured in three respects."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Individual Rationality",
               "type": "introduction"
          },
          "paragraphs": [
               "Though global welfare increases through cooperation, it is nevertheless possible that countries may loose compared to the status quo if welfare functions are heterogeneous among countries. This is true for a full cooperative solution but may also hold for partial cooperative solutions as discussed in chapter 4. Individual rationality may be violated if a country has relatively low opportunity cost of abatement and puts a low value on environmental damages compared to the other countries. Such a country has to contribute relatively much to a full cooperative (or any other cost-efficient) abatement program S but benefits only little in the form of reduced damages. Such a case is shown in where e lies outside the ellipse formed by the indifference curves I N N 1 and I 2 (gray area) and where T indicates the efficient abatement path. "
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Result 1",
               "type": "introduction"
          },
          "paragraphs": [
               "If countries have heterogeneous welfare functions full or partial cooperation may not be individual rational.",
               "Proof: Follows by example. See for instance Finus (2000) chapters 9 and 11.",
               "Thus according to the Fundamental Assumption if an IEA is not individual rationally designed countries either do not accede to the agreement or will violate it. We conclude:"
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Conclusion 1 (based on Result 1)",
               "type": "conclusion"
          },
          "paragraphs": [
               "Since accession to an agreement is voluntary, treaties must be individually rational. Therefore treaties must either specify abatement targets which lead to a relatively symmetric welfare distribution or must be accompanied by some form of compensation.",
               "The problem of individual rationality is closely related to the problem of stability. It turns out that many instruments which are ideally suited to balance asymmetries are not self-enforcing. Therefore, a compensation mechanism which has to be judged as second-best on efficiency grounds may be preferable in the context of global pollution control (see chapter 3). Moreover, it might sometimes be necessary to implement an inefficient abatement policy which leads to a more symmetric welfare distribution than an efficient one (see chapter 4)."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Free-Rider Incentive",
               "type": "conclusion"
          },
          "paragraphs": [
               "There are two types of free-rider incentives from which IEAs suffer. The first type concerns the incentive for a country to remain a non-signatory and to benefit from the abatement efforts of the signatories to an IEA. For a given number of signatories and a given abatement program of the coalition it is always better to be a non-signatory than to be signatory. By definition of a pure public bad, all countries are (physically) affected by global emissions to the same extent (though their impact may be different and/or their impact may be evaluated differently). Since abatement costs increase with the reduction level, it is more costly being a signatory than a non-signatory. This type of free-rider incentive will be discussed in the context of coalition models in section 5.2.",
               "The second type of free-rider incentive refers to the fact that a signatory is always better off by violating an agreement than to comply with it. By taking a free-ride a country can reduce its abatement burden substantially, though environmental quality will only be affected marginally. Proof: Follows from totally differentating of and observing the signs of the second derivatives as given in footnote 1."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Result 2",
               "type": "conclusion"
          },
          "paragraphs": [
               "From Result 2 we conclude:"
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Conclusion 2 (based on Result 2)",
               "type": "conclusion"
          },
          "paragraphs": [
               "Due to the free-rider incentive partial and full cooperative abatement policies can only be effective if they are accompanied by threats to sanction the violation of a treaty. Far reaching and/or asymmetric emission reductions compared to the status quo can only be implemented if severe and credible threats to sanction non-compliance are available.",
               "Measures to neutralize the free-rider incentive will be considered in chapter 3. The main problem of these measures arises from the fact that it is not enough to threat to punish free-riding but that sanctions have to be credible (see section 3.2)."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Consensus",
               "type": "conclusion"
          },
          "paragraphs": [
               "Even if countries agree that something should be done to tackle global pollution, they usually disagree about 1) the extent of emission reduction, 2) the allocation of the abatement burden among signatories, 3) the amount of possible compensation payments as well as 4) the net donors and net receivers of such transfer payments. An agreement on the first two issues defines the gain from cooperation. An agreement on the second two points determines (given issues 1 and 2 have been settled) the distribution of the welfare gain. Of course, in the negotiation process leading to an IEA all issues are linked and are subject to strategic considerations by governments."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Conclusion 3 (based on discussion and assumptions)",
               "type": "conclusion"
          },
          "paragraphs": [
               "Since the accession to an IEA is voluntarily, the design of a treaty has to be agreed on consensus.",
               "Since the design of a treaty has an immediate implication on a country?s welfare, it will also affect the condition of individual rationality and the free-rider incentive. Consequently, one would expect that the design of an IEA would have attracted much attention in the game theoretical literature on international pollution control. Surprisingly, however, this is not the case. There are only a few articles which have investigated some aspects of the design of a treaty. These articles have studied the effect of exogenously given designs and bargaining rules on the stability of a treaty, on aggregate welfare and global emissions and on the equilibrium number of signatories (see chapter 5). Three reasons can be identified for this shortcoming. First, modeling the whole bargaining process leading to the design of a particular IEA endogenously is an extremely complex undertaking (see . Second, the pragmatic approach of"
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "n": "2.2",
               "text": "Empirical Findings",
               "type": "conclusion"
          },
          "paragraphs": [
               "The Fundamental Result as well as Results 1 and 2 are theoretical findings and therefore do not require empirical backing. Only the issue of consensus where there is no general result available requires support by some empirical evidence. Nevertheless, it would interesting to review the extent of 1) the gains of cooperation, 2) the asymmetries resulting from some cooperative abatement strategy and 3) the free-rider incentive. Due to lack of space, however, we only discuss the extent of freeriding and possible counter measures as well as the issue of consensus in this section. For the other two issues the interested reader is referred to Endres/Finus/Rundshagen (2000) and the literature cited there."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Free-Rider Incentive",
               "type": "conclusion"
          },
          "paragraphs": [
               "There are four points which have to be clarified: 1) Is the need for sanctions (Conclusion 2) only a (game-) theoretical argument or is there empirical evidence which supports this conclusion? 2) If there is a need for sanctions can sanctions be generally derived from international law or do they have to be specified within an IEA? 3) What are the possibilities to sanction non-compliance within an IEA and which are effective? 4) What does the empirical evidence tell us about the implementation and conduct of sanctions within IEAs in the past?",
               "Ad 1):",
               "Looking at the compliance record of past IEAs it is evident that non-compliance is not an exception but rather the rule. As Keohane (1995, p. 217) puts it: \"(...) compliance is not very adequate. I believe that every study that has looked hard to compliance has concluded (...) that compliance is spotty.\" In their prominent empirical study on compliance of IEAs Brown Weiss/Jacobson (1997, pp. 87) find severe instances of non-compliance for all IEAs covered by their study. Sand reports that no less than over 300 infractions of the CITES treaty have been revealed per year. Also the whaling convention was frequently breached by all important parties to the treaty (Heister 1997, p. 68). Thus, we clearly reject the assumption of Chayes/Chayes 1993, p. 187) that states comply with treaties because of their \"sense of obligation to conform their conduct to governing norms\". We conclude: There is a need for sanctions.",
               "testing the effect of a large number of different designs on the stability and equilibrium number of signatories and deducing general results by statistical interference hits natural boundaries even with computers. Third, bargaining theory has mainly be studied by scholars of cooperative game theory whereas stability aspects of contracts have been investigated by scholars of noncooperative game theory. This artificial barrier was not conducive to develop an integrated bargaining theory."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "Moreover, many IEAs also have a very poor compliance record with respect to reporting requirements . Since official monitoring in almost all IEAs relies exclusively on self-reporting of states, some suspicion with respect to the good official compliance records of some IEAs seems also justified (Ausubel/Victor 1992, pp. 23)."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 16,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Ad 2):",
               "type": "conclusion"
          },
          "paragraphs": [
               "There are basically two alternatives to deal with non-compliance. The first option is to settle the case by calling upon the International Court of Justice and thereby referring to international law. This option is not very promising for two reasons. First, as pointed out above, any party which is accused of some wrong doing must accept to open a trial. Thus, formally, the Court has no enforcement power. Second, leading scholars of international law hold the view that there are no legal options for parties to punish the breach of multilateral treaties (see the literature cited in Heister 1997, pp. 91 and 135). We conclude: Since most IEAs comprise of more than two countries, in particular those which deal with global environmental problems, as for instance global warming, only the second option to deal with the violation of a treaty within the institutions of an IEA is a feasible option."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Ad 3):",
               "type": "conclusion"
          },
          "paragraphs": [
               "Within the institutions of an IEA, again, two basic measures to enforce compliance are conceivable.",
               "The first measure, which we may call the \"soft option\", is to include a provision in a treaty which calls upon the establishment of an arbitration and dispute settlement committee once a party accuses an other of violating the spirit of an agreement. The second measure, which we may call the \"tough option\", is to explicitly specify punishment rules in a multilateral environmental treaty . That is, the severeness of the punishment in relation to the misconduct is laid out as well as who is to conduct the punishment. Again, we believe that only the second option is promising to have an impact on the enforcement of a contract at all. First, the arbitration and dispute settlement schemes as laid out in some modern IEAs work on a purely optional but not on a compulsory basis. (All parties including the accused party have to agree that a committee is set up to handle the case.) Second, as long as sanctions are not explicated, their deterrence potential is basically nil. We conclude: Sanctions should explicitly be laid down in an IEA to be effective."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Ad 4):",
               "type": "conclusion"
          },
          "paragraphs": [
               "Empirical evidence suggests that the tough option is not part of any IEA signed in the past. 8 Those few IEAs (e.g., the Montreal Protocol and the CITES-agreement) which contain sanctions refer to trade sanctions. However, those treaties only call upon the signatories to sanction non-signatories for not acceding to their treaty, but those sanctions are not used as a tool to penalize non-compliance of signatories ( None of the relevant surveys on the enforcement of international environmental treaties has found any provision for sanctions to penalize parties for non-compliance (Bergesen/ ; see also the survey articles of Birnie/Boyle 1992, chapter 4, 9",
               "Examples include for instance the \"Convention to Combat Desertification\" and the \"Convention on the Protection of the Marine Environment of the Baltic Sea\" .",
               "The observations reported under Ad 4) are puzzling since, by now, it should not only be academic but also public wisdom (though not to the extent as it has been laid out in the previous section) that there are gains from cooperation. However, these gains can only be realized if the free-rider incentive can be controlled. Three explanations for this observation come to mind: 1) Governments hesitate to endow an IEA secretariat with much enforcement power since this would restrict their sovereignty.",
               "2) A less friendly interpretation would be that signatories intend to violate the treaty by the time they deposit their signature. This strategy could be rational if the political gain from signing the agreement today is higher than the loss from violating the agreement tomorrow. 3) Tough punishment provisions face technical problems and difficulties of designing \"credible sanctions\" in a \"second-best world\". Soft punishment provisions allow at least to secure small gains from modest emission reductions. Which of the three explanations is (are) correct is an open question. The subsequent sections, however, lend support to the third explanation without denying the relevance of the other aspects."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 19,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Consensus",
               "type": "conclusion"
          },
          "paragraphs": [
               "The conclusion that the design of IEAs have to be agreed by consensus may be supported by three observations: 1) Sovereign states can not be forced to sign an agreement. De facto a government has the right to veto any issue it does not agree. Thus, agreements are based on the unanimity decision rule which is sometimes also called the least common denominator decision rule (SCD-decision rule).",
               "2)",
               "The unanimity decision rule is laid down in many IEAs (e.g., The Kyoto Protocol, Article 20).",
               "Amendments of a protocol have to be agreed by consensus. If no consensus can be reached, the amendments are only binding for those signatories which have signed the amendment protocol.",
               "Moreover, many important decision within the EU and the UNO are made by consensus.",
               "3) The struggle for consensus is evident by considering how long it takes from the recognition of an environmental problem, the commencement of negotiations leading to an IEA and the signature of an IEA.",
               "For instance, the negotiations of the CITES-agreement (Kyoto-Protocol) lasted already five years (six years)."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 20,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "n": "3.1",
               "text": "Two Frameworks of Modeling International Environmental Agreements",
               "type": "modelling"
          },
          "paragraphs": [
               "In the analysis of IEAs two approaches can be distinguished: reduced stage game models (RSG-models) and dynamic game models (DG-models)."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 21,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "RSG-Models",
               "type": "modelling"
          },
          "paragraphs": [
               "The RSG-models comprise three stages. In the first stage governments decided whether to accede to an IEA (signatory) or whether to behave as a singleton non-cooperatively (non-signatory). In the second stage governments decide on the level of emissions. Within the group of signatories emissions are chosen cooperatively so as to maximize aggregate welfare of the coalition. Towards non-signatories signatories behave non-cooperatively. Every non-signatory chooses its emission level non-coopera-"
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 22,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "This requires for instance that for an environmentally concerned voter it is more difficult to monitor compliance of an IEA than the accession to an IEA and that information is costly.",
               "tively so as to maximize its own welfare. In the third stage signatories decide how the welfare gain is distributed. In this stage possible asymmetries between the coalition members may be balanced via transfers.",
               "Since the time structure of the three stages is not explicitly modeled and since the behavior of the actors in the second and third stage is exogenously determined in the RSG-models, the three stages can be reduced to one stage (by backward induction). The equilibrium is determined by assuming that signatories and non-signatories immediately adjust to any change of this \"state\" in the game. A change of the state can be caused by either a signatory leaving the coalition or a non-signatory joining the coalition. How governments react depends on the equilibrium concept. The concept of internal&external stability assumes that governments reoptimize their strategies after a change of the state.",
               "That is, they choose their best reply to the new state. An equilibrium is a state in which no signatory has an incentive to leave the coalition and no non-signatory wants to accede to the coalition."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 23,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "The concept of the core defines an equilibrium if there is no alternative coalition in which a signatory would receive a higher payoff. Starting from a grand coalition (a coalition comprising all countries) it is assumed that once a signatory leaves the coalition, the entire coalition breaks apart into singletons which follow a retaliation strategy. The weakest threat entails all countries playing their Nash equilibrium stage game strategy (-core).",
               "The equilibrium in a RSG-game can be interpreted in two ways. First, if countries accede to an IEA, they comply with the rules. This interpretation is not in accordance with the empirical evidence reported in section 2.2. Second, non-compliance is immediately sanctioned via reoptimization such that no country can net a free-rider gain. This second interpretation leaves the conceptual design of the RSG-model untouched, however, the question arises how realistic are these models. Generally, one should expect that some time passes between free-riding, discovering the violation and taking actions.",
               "Hence, the RSG-models depict only the first type of free-rider incentive: non-signatories benefit from the abatement efforts of signatories. The second type of free-rider incentive of signing an IEA but not fulfilling its obligations is not captured by these models. Since the DG-models do not suffer from this defiency, the following discussion in this chapter will be based on a DG-framework. Only parts of the discussion of issue linkage (section 3.5) will refer to RSG-models which will be mentioned explicitly.",
               "Since most coalition models have used a RSG-framework, we report on these results in chapter 5 on the formation of IEAs. However, we restrict attention to the equilibrium concept of internal&external stability. The concept of the core will not be considered. First, the implicit threat to dissolve the entire"
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 24,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "That is, payoffs are received only once after the third stage. Thus, time is not explicitly modeled as in repeated games. See the discussion below."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 25,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "In the analysis of IEAs based on RSG-models only the concept of internal&external stability (e.g., and the concept of the core (e.g., Chander/Tulkens 1995 and 1997) have been applied. Other concepts which may be superior from a conceptional point of view as well as from the perspective of \"realistic modeling\" may be found in Bloch (1997) and . First results and an evaluation of these concepts in the context of IEAs may be found in Finus )."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 26,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "A formal definition is given in section 3.5.",
               "coalition in case of non-compliance or in case a signatory leaves the coalition is not credible. Second, models based on the core concept do not contribute much to the understanding of actual IEAs."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 27,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "DG-Models",
               "type": "modelling"
          },
          "paragraphs": [
               "The DG-models depict the relations between countries as an infinitely repeated game. IEAs are generally in force for a long period of time without specifying the termination of the contract. where each country has to meet its obligation in the consecutive years after the year of ratification. In case a violation is detected, this will be punished via sanctions. An IEA is stable if the threat to sanction non-compliance deters a country from free-riding. That is, in equilibrium sanctions are not carried out.",
               "For the subsequent discussion it will be helpful to formalize this idea with the help of a simple trigger strategy. Aspects which are not captured by this simple strategy will be considered separately in sec- Due to the above mentioned strong and non-credible threat a grand coalition with a globally optimal abatement profile is stable, provided a cleverly designed transfer scheme is implemented. In reality we neither observe grand coalitions, nor socially optimal abatement levels, letting alone unrestricted transfers. An exposition and discussion of the core-concept may be found in Finus (2000), ch. 13."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 28,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "An other possibility to model infinite games are differential and difference games (Basar/Olsder 1982 and de Zeeuw/van der . In contrast to repeated games, these games allow for the possibility that payoffs derived at some point in time depends on the payoffs received and actions taken in the past. Whereas differential games assume continues time, difference games assume discrete time intervals as in repeated games. The disadvantage of differential games is that -as in RSG-models -free-riding is irrelevant by definition since there is no time lag between free-riding and sanctions. The disadvantage of difference games is that they are difficult to solve and that not many general results are available as is the case of repeated games or differential games. For differential games in the international pollution context see, e.g., and ."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 29,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "This assumption is less unrealistic as it might seem at first glance. For the assumption of an infinite game it is not necessary that the game lasts until perpetuity, it suffices if the end of the game is not known with certainty. In other words, at each point in time there is a probability -though this might be very small -that the game continues. An extensive discussion of this assumption may be found in Finus (2000), chapter 5 and Finus/Tj?tta (1998), chapter 1. Of course, other assumptions about the dynamic structure of a repeated game are conceivable. However, also for this alternative assumptions the basic need for sanctions remains (Endres/Finus/Lobigs 2000).",
               "can be sustained as a subgame-perfect equilibrium provided the average payoff from complying exceeds the average payoff from free-riding and subsequently being punished. That is,",
               "holds where I I * ? is a subgroup of countries. Hence, provided countries discount time by a discount factor greater thani min , cooperation can be sustained. We calli min the \"minimum discount factor requirement\". The discount factor is defined byi",
               ", where p i is the (subjective) estimation of country i about the probability that the game continues and r i is the discount rate (see Gibbons 1992, p. 90 and Osborne/Rubinstein 1994, p. 135)."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 30,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "Conclusion 4 (based on demonstration)",
               "A government will comply with an agreement if the discounted welfare stream from compliance exceeds the welfare stream of free-riding in one period and subsequently being punished. An international environmental agreement is stable (subgame-perfect) if holds (for all signatories).",
               "Since in a dynamic game the number of equilibria is large, further details of the formation process have to be specified in order to derive the equilibrium coalition size and the design of a treaty. This will be done in chapters 4 and 5. In this chapter, however, we abstract from these aspects and concentrate on the factors which determine the stability of an agreement for a given set of countries I I * ? .",
               "Six factors are important:",
               "1) The harsher the expected punishment in case of non-compliance (low value ofi N in the example), the more likely it is that an agreement can be stabilized. However, it is not sufficient to put up severe threats to deter a country from free-riding. Threats must also be credible. Credibility has two dimensions: a strategic and technical dimension. The strategic aspect refers to which extent the punisher(s) and the punished player(s) are affected by punishments. This aspect of credibility will be defined in section 3.2. The technical aspect refers to the technical limitation of various threat strategies. In the example above we assumed that the punishers suspend the treaty once free-riding is discovered and return to the status quo emission level. Any emission level , theni N is indeed the lowest punishment payoff (harshest punishment), and no other (subgame-perfect) strategy could deliver a loweri min than in .",
               "Note that e e",
               "> is a necessary condition for to hold (since Simply speaking a subgame-perfect equilibrium is a strategy combination which is a Nash equilibrium for the rest of the game at each point in time. For a definition see , ch. 4 and the literature cited there."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 31,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "This definition stresses that an IEA can be approximated as an infinitely repeated game. By the time a country decides whether too comply it suffices if the end of the game is not known. That is, p i > 0 , though p i may be close to zero. See footnote 16.",
               ") which corresponds to the individual rationality constraint as derived in section 2.1.",
               "to hold in the remainder.",
               "Both aspects of credibility will be considered with respect to all issues treated in subsequent sections.",
               "2) The more a country can gain by violating the treaty (that is, the larger",
               ", the more difficult it is to stabilize an agreement. As mentioned already in the context of emission space (see Result 3), the more ambitious abatement targets are envisaged in an IEA, the higher will be (ceteris paribus) the free-rider incentive. Moreover, an asymmetric welfare distribution (where some countries receive a lowi * ) may also jeopardizes the stability of an agreement. Though, transfer payments can generally help to reduce the free-rider incentive, they face a bundle of problems as laid out in section 3.4. Alternative measures to balance asymmetries are issue linkage (section 3.5) and the choice of appropriate policy instruments to achieve an abatement target (chapter 4).",
               "3) The more frequently compliance is monitored, the higher are the chances for cooperation (see section 3.6 for a formal exposition). On the one hand, the transitory gains from free-riding are limited through frequent checks. On the other hand, punishment becomes a higher threat potential since the time between discovery of non-compliance and punishment is shortened.",
               "4) The lower the rate of detecting non-compliance, the less deterrent are threats of punishment and the more likely it is that a country will take a free-ride (see section 3.6 for a formal exposition).",
               "Points 3 and 4 are analyzed in section 3.6 under the heading of \"Monitoring\".",
               "5) The more governments discount time (high value of r i ), that is, the more they value short term success (gain from free-riding) against the long term gain from cooperation, the more difficult it is to enforce an IEA. In a polit-economic context, one should expect that short-term success (myopic behavior) is particularly important previous to elections . Hence, long-term commitments may be particularly jeopardized during election campaigns."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 32,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "6) Discounting will also depend on the estimation of agents about the uncertainty of future events, the general risk attitude of politicians, the evaluation of political stability in neighboring countries etc. Thus for instance civil war, social unrest or any kind of political instability has a negative effect on the stability of a treaty (via a low value of p i ).",
               "The factors mentioned under points 5 and 6 have an impact on the discount factor. Measures to influence the discount factor will be discussed in section 3.7."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 33,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Sanctions",
               "type": "modelling"
          },
          "paragraphs": [
               "Though the necessity of sanctions has been established, the basic idea of sanctions has been outlined and important factors determining the success of sanctions have been identified, it remains to clarify One can easily perceive that the discount rate changes over time and is particular high previous to elections. In the following we ignore this complication and follow the standard assumption in the literature by assuming as constant discount rate.",
               "the credibility of sanctions. This question is closely related to the concepts of an equilibrium in game theory. A convincing concept developed in recent years which captures the gist of the problems ",
               ". C 1 : There must be a punishment harsh enough to deter free-riding in case a country continuously violates the spirit of an agreement (retaliation). That is, the discounted average payoff from cheating,i F (best deviation payoff), and subsequently receiving the \"retaliation phase payoff\",i P 1 , must be lower than the average payoff in the cooperative phase,i * . This deters deviation in the first place. C 2 : However, the punishment should not be too harsh to provide the treaty violator with an incentive to go along with the punishment (repentance) so that all parties can return to \"normal terms\" as quickly as possible. Consequently, the punisher must find it more attractive to \"cooperate\" during his punishment instead of being punished for a long time as mentioned under C 1 .",
               "Therefore, the average continuation payoff if a player complies with his punishment,i P 2 , must be at least as high as when punishment is continued,i P 1 .",
               "C 3 : However, the punishment should also not be too weak since otherwise it would pay a government to violate the agreement and to subsequently demonstrate repentance with \"great regret\".",
               "That is, the discounted average payoff from cheating,i F , and subsequently receiving the \"repentance payoff\",i P 2 , must be lower than the average payoff in the cooperative phase,i * .",
               "C 4 : Governments conducting the punishment in case of the violation of a treaty should suffer no disadvantage. That is, there should be no room for a treaty violator to offer his potential punishers a deal to treat bygones as bygones, promising to resume cooperation. Such kind of renego-"
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 34,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "For an interpretation in the context of global environmental problems see Endres/Finus (1998a) and Finus/Rundshagen (1998b). We restrict attention here to the weak version of the concept. Strongly renegotiation-proof equilibria are discussed in Finus (2000), chapters 7 and 12.",
               "tiation would imply that the threat of punishment would loose its credibility in the first place and stability of an IEA would suffer. For this the payoff when conducting the punishment,j R , must be at least as high as in the cooperative phase,j * . Especially this last condition represents the central idea of the concept renegotiation-proofness and distinguishes it from that of subgameperfection.",
               "C A : The continuation punishment payoff of country i at the beginning of its repentance phase,",
               "is a linear combination of the repentance payoff,i R , and the cooperative continuation payoff,i * . Thus, the continuation punishment payoff rises as the punishment proceeds (providing an incentive to the punished player to accept the punishment).",
               "Conditions C 1 and C 3 are the typical conditions which deter free-riding via the threat of punishment.",
               "Conditions C 2 and C 4 restrict possible sanctions. In the light of the possibility that a signatory can leave an IEA (which is possible under most contracts after a government has given notice some time in advance to its decision), only moderate punishments are feasible. Though violations must be punished (otherwise violations pays and stability is jeopardized; see C 1 and C 3 ), the violator should have an incentive to remain in the IEA despite the (necessary) punishment (C 2 ). Thus, generally, a trigger strategy which calls upon the suspension of a treaty for ever is not renegotiation-proof. Because of C 2 , C 3 is a stronger requirement than C 1 . Hence, C 1 can be dropped. Condition C 4 is particularly important in an international context and ensures that a threat is credible.",
               "Of course, it is not difficult to satisfy each condition by itself, but to design a punishment code which satisfies all conditions simultaneously is a difficult task. For instance, by choosing a weak punishment it will not be difficult to convince a violator to remain in the IEA (C 2 is satisfied). Then, however, non-compliance may be encouraged in the future (C 1 and C 3 are violated). The above mentioned mediation procedure within most IEAs (soft option) is a punishment with such properties. In contrast, the threat to suspend an agreement or -in a wider context -to impose trade sanctions may deter freeriding (C 1 and C 3 are satisfied) but may also negatively affect the punishers (C 4 is violated). This is one of the main reasons why for instance trade embargoes have hardly been successful in the past."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 35,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "Solving C 2 , using [C A ], we derive",
               "The equivalence sign in C 4 holds because substituting",
               "For example some years ago the USA threaded China not to prolong its \"most favored nation status\" if it would not legally protect patent and copyrights. Since China knew that US trade heavily depends on exports to China, China disclosed the threat as empty and did not take serious actions. An other example is the (unsuccessful) grain embargo which was imposed on the former Soviet Union some years ago. US, New Zealand and Australian farmers lobbied at their governments to lift the embargo because of substantial profit losses.",
               "If we choose t i P such that becomes binding, then from C 2 and C A we have",
               "Substituting this into C 3 , we derive",
               "Taken together, the discount factor minimum requirement of country i is given by (Finus/Rundshagen",
               "If we compare with it is evident that the discount factor minimum requirement for a renegotiation-proof contract is generally higher than for a subgame-perfect contract. This is due to three rea-",
               "(see C 4 ) must be additionally satisfied. Second, note that generally. Thus, the second term in brackets in will usually be higher thani min in . Third, the first term in brackets constitutes an additionally restriction compared to .",
               "(The first term may be bigger than the second term in brackets.) Again, trivially, from e e",
               "There are two ways of interpreting . The first interpretation allows for a direct comparison of with as conducted in the previous paragraph: For a given e * (and a given number of participants),",
               "an \"optimal\" punishment code determinesi min . It reflects an optimal mix of punishment strategy ( e i ) and punishment time ( t i P ). As argued above, the optimal punishment time makes binding. The optimal punishment profile allocates the punishment duties such that is minimized. As long as countries have different payoff functions, this requires a complex allocation rule. Though from a theoretical point of view, it is straightforward to construct such optimal punishment profiles (see Finus/Rundshagen 1998b), in reality, several restrictions may cause the actuali min to be higher than in . This is discussed in the next section 3.3.",
               "A second interpretation, which is used for illustrative purposes below, is possible if the set of actual discount factors= ( , ..., ) 1 N is known (or an assumption is made about them ). Then with the help of , either all possible emission vectors or average payoff vectors which are renegotiationproof can be determined. These sets may be denoted by E *,and*,, respectively."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 36,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Result 3",
               "type": "modelling"
          },
          "paragraphs": [
               "For a given emission reduction target the minimum discount factor requirement for renegotiationproof strategies is at least as high as for subgame-perfect strategies i.e.,"
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 37,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "A typical assumption is that alli are close to one."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 38,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Conclusion 5 (based on Result 3)",
               "type": "conclusion"
          },
          "paragraphs": [
               "If threats have to be credible to deter free-riding, cooperation is more difficult to establish.",
               "It is easily checked that all factors which determine the stability of an IEA as discussed in section 3.2 in the context of a subgame-perfect trigger strategy apply to renegotiation-proof strategies as well."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 39,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Compensation Measures",
               "type": "conclusion"
          },
          "paragraphs": [
               "Those compensation measures which are directly targeted at their aim to balance asymmetric welfare distributions and which involve only small transaction costs should be given preference. However, compensation measures must be self-enforcing by themselves. That is, it must be ensured that donors and recipients fulfill their obligations."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 40,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "n": "3.3",
               "text": "Emissions",
               "type": "conclusion"
          },
          "paragraphs": [
               "If the abatement duties are chosen cleverly, asymmetric welfare implications can be avoided. Since the allocation of abatement burdens is immediately related to the choice of the environmental policy instrument, the \"asymmetry issue\" is discussed under the heading of \"Instruments in Global Pollution",
               "Control\" in chapter 4. In this section we therefore restrict attention to the role of emissions as a means",
               "to enforce an IEA.",
               "The use of emissions as means to sanction treaty violators implies that the punishers reduce their abatement efforts compared to their treaty obligations. However, since for global pollutants such a strategy also implies higher environmental damages in those countries which conduct the punishment, the violator has to increase his abatement efforts above the cooperative level during the repentance phase as compensation. Though from a theoretical point of view one cannot rule out the possibility that the simple strategy of temporarily suspending an agreement is renegotiation-proof, it is most likely that condition C 4 will be violated at least for some punishers. However, in reality even more severe limitations apply to sanctions via emissions.",
               "First, since it usually takes a long time to negotiate an IEA, implying high transaction costs, governments may be reluctant to suspend an IEA completely, taking into account that it might be very difficult to come to a new agreement in the future."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 41,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "The fact that also abatement costs of the punishers decrease by such a punishment constitutes a theoretical possibility that condition C 4 may, nevertheless, be satisfied. However, this requires that the violator reduces its emissions during the repentance phase sufficiently below Nash equilibrium levels, i.e., e . The same is true for the reoptimization strategy assumed in RSG-models. Since it was (by the definition of internal&external stability, see section 3.5) beneficial to include the violator in the treaty in the first place, exclusion ( N * ? 1 ) and reoptimization ( e *) after free-riding implies a welfare loss, i.e.,",
               "Second, in reality one should expect that instead of complex and differentiated punishment obligations simple punishments are employed (Finus/Rundshagen 1998a). The reason is that differentiation makes coordination of sanctions difficult, involves transaction costs, causes delay and might not be transparent to the parties.",
               "Third, in reality punishers have less flexibility regarding an increase in their emission releases as a means of sanctioning a violator. 1) Once abatement measures have been implemented, it might not be technically feasible to go back to the status quo. Particularly, most abatement measures involve some set up cost which would be \"sunk\" if signatories would change their environmental policy. 2) Such a change may take time rendering the threat potential to be rather low."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 42,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "In this context note the following dilemma: On the one hand, the more ambitious emission targets are realized over time, the higher becomes the free-rider incentive. On the other hand, the lower emissions are, the less credible is the threat to temporarily increase emissions as a reaction to a breach of an IEA (Finus 2000, ch. 12).",
               "Fourth, in reality the treaty violator has less flexibility regarding a reduction in emissions to show repentance. For technical reasons, this may either not be possible or at least it may require some time in reality. Again, there is a dilemma: the more a country has already reduced emissions, the more difficult it is to show repentance (Finus 2000, ch. 12).",
               "Fifth, even though international law does not allow to enforce an IEA, it may nevertheless be regarded as a \"codex of conduct\". According to international law, punishments should be subject to the principle of proportionality . This principle implies that violations can only be punished in proportion to the severeness of the misconduct. This imposes a restriction on the flexibility of punishments.",
               "All five restrictions imply either that in reality for a given emission target e * the discount factor requirements are rather high (first interpretation of ) or that for a given set of actual discount factors the set of equilibrium emission or payoff vectors is rather small (second interpretation of ). The second interpretation is illustrated for emissions in . All emissions tuples lying to the right of A 1 and to the left of A 2 are renegotiation-proof. The stronger the above restrictions are, the smaller will be the corridor of feasible and stable emission targets (line A 1 and A 2 move inward). Similarly, the higher the actual discount factors are, the smaller will be this corridor. Thus, high discount factors and punishment restrictions allow only for modest and rather symmetric emission reductions."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 43,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "For instance, changing the standards of catalytic converters of cars or the level of a fuel tax requires that governments pass a new law in parliament which is usually a time-consuming process in democracies."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 44,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "The set E *,(*,) shrinks with an increase of the actual discount factor. For discount factors close to one the set contains only the Nash equilibrium. That is,",
               "Emissions are a not very flexible tool for sanctions and therefore only limited suitable to be used as a strategic variable to enforce an IEA. If emissions are the only instrument to discipline free-riders, only modest and symmetric emissions reductions can be stabilized in an IEA.",
               "Despite the qualifications mentioned above, emission may play some role for disciplining free-riders and have two distinctive advantages: First, increasing emissions is in accordance with the principle of reciprocity. Each government will recognize that if it does not meet its reduction duties, other governments have the right to follow suit. Moreover, this kind of punishment does not jeopardize cooperation in other policy fields as may be the case under issue linkage (see section 3.5). Second, emissions can be used to sanction donor countries which is not possible via monetary and in-kind-transfers (see section 3.4). On the one hand recipient countries may punish donors (e.g., if they do not pay their promised transfers) and donors may punish each other (e.g., if they do not fulfill their obligations of contributing to a fund). However, punishment of countries with low environmental preferences is not very effective. By definition, these countries suffer less from an increase of emissions and are therefore less vulnerable to this kind of punishment. "
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 45,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Measures to Avoid Asymmetric Payoffs",
               "type": "conclusion"
          },
          "paragraphs": [
               "The classical role of transfers is to balance asymmetric payoffs. Transfers may help to meet the individual rationality constraint or to increase the stability of an IEA. Monetary transfers are an efficient instrument since they immediately target at the problem. Transfers can either be used directly between donors and recipients or they can be channeled via a fund. However, one main obstacle of transfers is the incentive problem between donor(s) and recipient(s). If the donor pays the transfers first, the recipient may take the money but may not deliver the promised emission reduction. If the recipient implements an environmental project first, the donor may not pay its promised transfers afterwards.",
               "To study this problem in more detail, we assume a dynamic context. Without loss of generality, we may assume a simultaneous move of donor and recipients."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 46,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "Consider first the effect of transfers on a recipient country i. To facilitate a direct comparison with the results derived in section 3.2, we assume that if a recipient takes a free-ride it does so with respect to transfers and emissions. In the supergame framework, including transfer, T,becomes( )(",
               "follows where j is a donor and k a recipient among the punishers. A quick comparison of and reveals: the minimum discount factor requirement for a recipient decreases through transfers. In case of free-riding, the temporary suspension of transfer payments allows for a harsh punishment. Moreover, by gradually increasing transfers to old levels, the treaty violator can be provided with an incentive to go along with the punishment and to remain in the treaty. This suspension is also responsible why it is easier for donors (countries j) to punish a free-rider renegotiation-proofly. The suspension implies automatically that donors are compensated. Since it is for recipient countries (countries k which comply) now more difficult to punish a free-rider, some of the transfers which have previously been paid to the free-rider i may be earmarked for these counties during the punishment phase of t i P periods. Taken together, transfers may help to stabilize an IEA on the side of the recipients.",
               "What about the effect of transfers on the side of the donors? Proceeding in the same way as done above, we derive at and reveals that the minimum discount factor requirement of donors (countries j) increases through transfers. Moreover, it is more difficult for other donor countries (countries l) to punish the free-rider renegotiation-proofly. Consequently form and it follows In a supergame framework where there is no obvious sequence of moves (Do the donor or the recipient countries move first?) one may well assume that on average all players move simultaneously. It is easily checked that all qualitative results derived below would also hold for sequential moves, irrespective of who is the first mover.",
               "that transfers can only stabilize an agreement if the actual discount factor of a donor country,j , is well above the minimum discount factorj min , i.e.,j j >> min . In other words, monetary transfers are only sensible if there is slack of enforcement power on the side of the donors which is transferred to recipients which face a lack of enforcement power.",
               "In-kind transfers are less efficient than monetary transfers since they only indirectly target at balancing asymmetries. In kind-transfers comprise for instance technological assistance and exchange between donors and recipients, the installation of scrubbers and of environmental friendly power plants in recipient countries through donors. Since the donors usually possess less information than recipients about the most productive investment in abatement technology, in-kind transfers may entail efficiency losses. Therefore, it might be helpful to have a central authority as for instance the GEF which coordinates transfers. Experts of GEF may decide together with local authorities in developing countries which projects are expected to generate the highest input-output ratio. Moreover, coordination has the advantage that donors do not compete for the same recipients.",
               "The advantage of in-kind transfers is that the free-rider incentive on the side of the donors and on the side of the recipients is less of a problem. This may explain why most transfers have been paid in the form of in-kind-transfers under the GEF. On the one hand, environmental projects, as for instance the construction of environmental power plants in developing countries by industrialized countries, can",
               "usually not be used for other purposes. Thus, enforcement on the side of the recipients is de facto automatically ensured. Moreover, the GEF constitutes de facto a cartel of donor countries which are equipped with additional enforcement power and which eases monitoring of the implementation of projects. On the other hand, recipient countries can wait until the project will have been realized before they will have to fulfill their part of the deal. Operation of the plant has to wait until the power plant has been built. Of course, also in-kind transfers are only sensible if there is slack of enforcement power on the side of the donors and a lack of enforcement power on the side of the recipients.",
               "In the literature three more problems of transfers have been mentioned, though their theoretical foundations are rather weak and the arguments are tainted with some ad hoc flavor (e.g., . Nevertheless, we like to mention them for completeness. In particular, these arguments have been the only explanations so far to rationalize the lack of transfers payments in international pollution control.",
               "First, transfers provide an incentive for governments to strategically misrepresent their preferences.",
               "Donors and recipients have an incentive to understate their environmental preferences and overstate their abatement costs. Donors try to convince other signatories that they should contribute only a small amount to an environmental fund if at all. Recipients try to convince other countries that they should generously be compensated if they are required to contribute to a joint abatement policy at all.",
               "Second, any transfer scheme must be based on some criteria which requires that the welfare implications of an abatement policy are estimated and publicly disclosed. Such a transparency, however, may not be in the interest of all governments since it limits their strategic behavior in the future."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 47,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "In particular, it seems that some of the arguments also apply to the design of IEAs in general.",
               "Third, governments may be skeptical of paying transfers since they fear that they may be judged as weak bargaining partners which may weaken their bargaining power with respect to other issues in the future."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 48,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Measure to Enforce Compliance",
               "type": "conclusion"
          },
          "paragraphs": [
               "From the discussion above it follows immediately that monetary transfers are only suitable to sanction recipient countries. Sanctions take the form of partial of complete suspension of transfers for some time. Though transfers are a flexible and efficient instrument to punish recipients renegotiationproofly, transfers are not suited to discipline donor countries. To the contrary, transfer increase the free-rider incentive of donors. Apart from not complying with the agreed abatement duties, a donor country has an incentive to delay or not to pay the promised transfers at all. Therefore, for donors other forms of sanctions are necessary. However, transfers may work as an auxiliary device. As mentioned above, since one of the main obstacles in the international context is to construct sanctions which do not harm the punishers as well (renegotiation-proof condition C 4 ), a global fund may be used as a \"fund for sanctions\". Similarly to the funds of unions, which are used to back up strikes by reducing the negative effect of strikes on their members (suspension of payment, layoff of workers etc.), an environmental fund may mitigate the negative effects of sanctions for the punishers. Thereby, the credibility of sanctions can be improved.",
               "In-kind transfers are less suited as punishment for recipients. Since these investments can not be retrieved in the short to mid run, they do not constitute a flexible instrument of sanctions. For the same reason as monetary transfers, in-kind transfer can not be used to discipline donors."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 49,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Treaty Obligations",
               "type": "conclusion"
          },
          "paragraphs": [
               "As demonstrated above, transfers can be conducive to cooperation in international pollution control in certain circumstances and if they are cleverly designed (global rationality). However, if other donors contribute their share to total transfer, a donor is better off by taking a free-ride (individual rationality). The importance of this problem is evident when recalling the large backlog of payments of major contributors to the UNO. The payment behavior of donors can only be influenced if sanctions were available to enforce payments. Since no IEA has a provision to discipline the donor countries, it",
               "is not surprising that transfers have not played an important role in international environmental protection yet. Of course, a global fund may temporarily alleviate this problem by ensuring regular payments to recipient countries. However, if the fund runs out of money it has to suspend transfers in the long run."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 50,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "This is evident by considering the maximization task of a donor country. From max (",
               "1 follows in (the interior) Nash equilibrium whereas global rationality would require "
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 51,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Conclusion 7 (based on discussion and demonstration)",
               "type": "conclusion"
          },
          "paragraphs": [
               "Monetary transfers are an efficient and flexible instrument to balance asymmetries and to stabilize an agreement if there is slack of enforcement power on the side of the donors and lack of enforcement power on the side of recipient countries. However, donors can not be disciplined via monetary transfers. In-kind transfers are less efficient than monetary transfer but suffer less from the incentive problem between donors and recipients. They are therefore better suited to balance asymmetries.",
               "However, in-kind transfers are not suited to enforce an IEA. Generally, for monetary and in-kind transfers there is the problem that transfers have to be stabilized within the coalition of donors."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 52,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "n": "3.5",
               "text": "Issue Linkage",
               "type": "conclusion"
          },
          "paragraphs": [
               "Issue linkage refers to the fact that, usually, relations between governments concern not only one policy issue but several issues. Governments may cooperate in the field of international pollution control, international defense and disarmament (e.g., being a member of the NATO), in the field of free-trade (e.g., being a member of GATT/WTO, European Union or ASEAN) and in the field of global pollution control (e.g., being members of the CITES agreement or the Montreal Protocol "
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 53,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Results",
               "type": "conclusion"
          },
          "paragraphs": [
               "The literature on DG-models typically assumes that two public good agreements are linked to each other where the incentive structure in each game is that of a prisoners?dilemmaprisoners?dilemma (Cesar/ ",
               "1 0",
               "must hold in the interconnected game (also called hyper-meta or tensor game) where k refers to the game, i to the player and s to the stage game strategy in a game. It is easy to see that is implied by and hence condition is less restrictive than . That is, strategies and payoffs which could not be sustained in the isolated game(s) may be sustained in the linked game. To allow for a direct comparison with our previous discussion, the above relations may also be expressed in terms of minimum discount factors. We have [",
               "where the left hand side term states the minimum discount factor requirements in the isolated games and the right hand side term that of the tensor game.",
               "From and is also evident that it is not important whether the isolated games are prisoners? dilemmas. The result is more general and basically applies to any game (e.g., global emission game)",
               "where there is a free-rider incentive and where cooperation generates a global welfare gain (non-constant sum games). Such a game may be called a social dilemma game."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 54,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Result 4 31",
               "type": "conclusion"
          },
          "paragraphs": [
               "In a DG-framework it is true that in an infinitely repeated social dilemma game with additive payoffs and a given number of signatories which are the same in both agreements the possibility of issue linkage either improves upon the chances that mutual cooperation can be sustained or leaves them unchanged.",
               "Thus issue linkage works like transfers. However, instead of monetary or in kind transfers, issues are exchanged in the form of barter. Consequently, like transfers, issue linkage can only balance slack and lack of enforcement power. However, whereas transfers may be used to balance enforcement power between countries, issue linkage aims at balancing enforcement power between issues (Finus 1997 and 2000, ch. 8 and Spagnoli 1996)."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 55,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "Though Cesar/de Zeeuw (1996) cover renegotiation-proof strategies, their proof is incomplete and only applies to prisoners?dilemmasprisoners?dilemmas. The subsequent discussion will show that the result applies to a broader class of games."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 56,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "In the Appendix we show that Result 4 also holds for renegotiation-proof strategies.",
               "Variations and extensions of Result 4 may be found in Folmer/van and van Mouche . One interesting variation is the following: Instead of studying the effect of issue linkage on the minimum discount factor requirements for a given s s An other implicit assumption to derive Result 4 is that utility functions of governments are separable.",
               "That is, though governments link and negotiate two issue together, they value the payoffs of each game independently. This is the standard assumption in the literature on issue linkage. However, a more natural assumption seems to be that governments evaluation of an issue depends also on other issues. In this case, the effect of issue linkage is less straightforward and relies on the shape of gov- indicate, however, that such a more general proof should be possible."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 57,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "Simply speaking a continuation strategy is a complete plan of stage game strategies at each point in time (see Eichberger 1993, pp. 220 and Finus 2000, ch. 4)."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 58,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "In the above derivation we assumed that payoffs in the linked game are additive where payoffs of each game receive equal weight. In van Mouche (2000) it is shown that Result 4 also applies to different weights and to any linear transformation of payoffs.",
               "The issue of non-separable objective functions has an important political implication. It suggests that if issues are complements, governments should delegate decision power on one or both issues to separate independent agencies. For instance, in Germany monetary policy is independently conducted by the central bank, economic competition is enforced by an antitrust agency and economic and fiscal policy is conducted by the government itself. Of course, a basic prerequisite for such an \"isolation strategy\" to be successful is that the delegation contract must be based on a long-term relationship between the government and the agencies. Otherwise, delegation is not credible and can always be reversed. In the example this long-term relationship is ensured by the constitution.",
               "In the environmental context one should expect for instance that all pollutants which are covered un- "
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 59,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "First results of the third question may be found in Finus (2000), ch. 8 and Spagnolo ).",
               "transfers and like in kind-transfer, there is no incentive problem between recipient and donors under issue linkage. Each country is a net recipient and a net donor with respect to one issue. Transfers are not exchanged between different agents but between issues. Therefore, issue linkage faces less of a free-rider problem than monetary transfers. Second, since each country is de facto a net donor with respect to one issues, there is a free-rider incentive within the group of countries which offer compensation with respect to the same issue. For this group as a whole it is rational to offer compensation, for a single country, however, it is rational to hold back its offer at least partially. This problem has not be recognized in the literature yet. The reason is simple. So far, all papers based on DG-models have ignored aspects of coalition formation."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 60,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Practical Problems",
               "type": "conclusion"
          },
          "paragraphs": [
               "In the context of multilateral agreements, issue linkage faces a bundle of problems which are not captured by the theoretical models. First and most important, in a multilateral context it will be difficult to design compensation deals. For many countries it is very likely that several issues are needed to balance asymmetric payoffs. This makes negotiations rather complex. One should expect that transaction costs of issue linkage increase more than proportionally with the number of signatories to an IEA. Therefore, it is not surprising that most examples of issue linkage concern bilateral agreements. Second, issue linkage only indirectly targets at balancing asymmetries and therefore is less efficient than monetary transfers. Third, punishing a free-rider extents to other issues which may violate the principle of proportional punishment. Fourth, generally negotiations leading to an IEA run over a long period of time and therefore involve high \"negotiation costs\". Therefore, one should expect that governments are cautious to use other issues for punishment since they fear that cooperation may be jeopardized on other issues. Fifth, designing punishment renegotiation-proofly is already complex with respect to one issue but will be even more complicated with respect to several issues (though Appendix 1 shows that from a theoretical point of view this is possible). Thus only simple punishments as for instance the temporary suspension of several agreements have a chance to be imposed in reality. However, since the voluntary signature of a package deal implies that all signatory benefit from the deal, the partial or complete suspension of several issues may also imply a welfare loss for at least some punishers. Thus, renegotiation-proof condition C 4 would be violated."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 61,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Results",
               "type": "conclusion"
          },
          "paragraphs": [
               "The higher stability rests on the fact that members often exhibit additionally a negative externality on outsiders. This increases the attractiveness to join a club good agreement. For instance, non-members of the European Union are not only denied the access to take part in tariff-free intra-trade within the Union, they also face stiff external tariffs at the border of the Union. Thus, apart form paying tariffs, the terms of trade of outsiders worsen through the European Union. From the RSG-literature on issue linkage three central results can be identified:"
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 62,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Result 5",
               "type": "conclusion"
          },
          "paragraphs": [
               "In "
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 63,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "For convenience we drop in the following the profitability condition which states that a signatory must receive more than in the Nash equilibrium, that is, if no coalition forms (see .",
               "In Definition 2 N * , e * , t * are the \"state variables\" and N * ? 1 , N * + 1, e *and t *indicate a deviation from this state which, according to the definition, should not be beneficial to any player in equilibrium. If a player accedes or leaves the equilibrium coalition, e *and t *are the reoptimization strategies. As mentioned in section 3.1, since the optimization procedure with respect to emissions and the design of the transfer scheme are exogenously defined in RSG-models, attention can be restricted to the number of signatories. Thus, we may drop the variables e and t in the following for convenience. Note that the functions A 1 and A 2 as a function of the number of participants are basically the same, except that A 2 involves one more signatory than A 1 . Typical curves found for an IEA are drawn in    . If the club good agreement provides the signatories of the IEA with an additional benefit, then curves A 1 and A 2 move upward and to the right and the number of participants in the linked agreement is larger than in the isolated IEA. The distance between A 1 (A 2 ) and A 1( A 2) is larger for a small number of participants and decreases (and may become negative) when the number of participants increases. The underlying forces are diminishing returns of holding a membership in the club good agreement which decrease in the number of participants. Therefore, though issue linkage may allow to expand the IEA-coalition, a grand coalition may not be possible.",
               "Exactly those forces which are responsible for part 2 of Result 5 may also be responsible for part IEA external stability as defined above is not really important for the determination of an equilibrium coalition, for a club good agreement it seems more natural to expect (by the very definition of excludability) that signatories may reject an application for accession to their agreement if this implies a lower welfare for them. In this case, part 3 of Result 5 is not only due to diminishing returns of holding a membership in the club good agreement but also due to strategic reasons of coalition formation."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 64,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Evaluation",
               "type": "experiment"
          },
          "paragraphs": [
               "The present RSG-models exhibit two crucial shortcomings. First, Result 5 has been mostly established via simulations. Though Finus/Rundshagen (1999) are the first who have derived all their results from general propositions, they also do not provide a full general characterization of the publicclub good package deal. That is, the question is: Under which general conditions can we expect part 1, 2 or 3 of Result 5 to hold? Second, RSG-models consider only the first type of free-rider incentive that non-signatories do not contribute to an IEA. However, the second type of free-rider incentive within the coalition is ignored. This shortcoming is particularly severe considering that there is an incentive for countries just to join the IEA in order not to be excluded from the benefits of the club good agreement. However, if the violation of a signatory is not associated with any negative consequences for the free-rider (as for instance in the Montreal Protocol and the CITES-agreement), it must be expected that the effectiveness of issue linkage will suffer. From a DG-model perspective it is also not all clear why internal stability of a club good agreement should be guaranteed by definition. Though it is rational for the members of the club group agreement as a whole to cooperate on R&D, R&D involves costs. Hence, a country has an incentive to spend little on R&D, to participate from efforts of other members and to hold back own research results. Thus, it seems of eminent importance that the For instance, consider the case of cooperation on R&D. On the one hand, cooperation reduces production costs and thereby increases profits of firms in signatory countries. These firms gain a competitive advantage over those firms located in non-signatory countries. On the other hand, the more countries sign the R&D agreement, the more will competition increase and profits shrink. At some participation rate, the latter effect dominates the former effect and the R&D agreement cannot be used anymore to stabilize an IEA.",
               "expansion of coalitions through issue linkage will be investigated in a DG-model framework in future research."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 65,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Practical Problems",
               "type": "experiment"
          },
          "paragraphs": [
               "In reality a package deal of a club and public good agreement faces a number of problems. First, it is hardly conceivable in reality that all countries belonging to an IEA are also accepted as members, say, of a large trade agreement or a defense pact. Since each agreement has different member states, those states which hold a simultaneous membership may not be able to convince other states to accept a member just for the sake of issue linkage. The Montreal Protocol and the CITES-agreement do not face this problem since the \"associated trade agreement\" did not exist before and was created in the course of the negotiations. Accordingly, the trade embargo extents only to those products which are directly related to CFCs. Second, the exclusion of a country from an agreement because it does not sign an IEA violates the principle of proportionality and reciprocity. Additionally, any measure which restricts trade (trade embargoes, fine-tariffs, exclusion from a custom union) could violate the terms of GATT/WTO (e.g., Lang 1996, pp. 265). Thus, there have been voices which question the legal basis for trade sanctions in the Montreal Protocol. Third, the threat to exclude a country from the club good agreement if it does not sign an IEA or, in an extended DG-framework, if it violates the terms of an agreement will generally not be credible. If it is beneficial for the club good members to offer a country a membership, such a punishment violates the renegotiation-proof strategy C 4 ."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 66,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Conclusion 8 (based on Results 4 and 5 and discussion)",
               "type": "conclusion"
          },
          "paragraphs": [
               "From For instance, though China would like to join the WTO and some governments support its application in order to stabilize relations to China in other policy fields, the USA have vetoed any such attempts so far.",
               "innovations to non-members. This is evident when considering the little success of export embargoes with respect to particular technologies to Iran and Iraq. Second, as mentioned above, there is a freerider incentive within the member states of providing adequate funding for research."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 67,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Effects on Stability",
               "type": "conclusion"
          },
          "paragraphs": [
               "The quality of the monitoring system is crucial for the stability of an IEA (see section 3.1). The higher the detection rate in case of non-compliance, k, 0 1k , the higher will be the stability of an IEA.",
               "That is, the lower will be the minimum discount factor requirement. Similarly, the smaller are the intervals, f, f={1, ...t}, in which monitoring checks are conducted, the lower will the minimum discount factor requirement. Considering f and k in the inequality system C 1 to C 4 gives (see Appendix ",
               "1 from which it is easy to see thati min decreases in k and increases in f. A low detection rate implies that free-riding may not be discovered and consequently may also not be punished. A low frequency of monitoring checks (high values of f) implies that free-riding is discovered with a relatively large time-lag. Consequently, the violator can net a free-rider gain for a longer period of time and punishment is delayed.",
               "In reality, there are several reasons why k will be smaller than one and why f may be bigger than 1.",
               "First, though scientists may identify the total amount of pollutants released to the atmosphere, it might be difficult to assign these emissions to single countries for technical reasons. There may remain some uncertainty about the exact amount of emissions each country releases. The problem is aggravated by the fact that non-compliance can only by punished if the breach can unambiguously be attributed to a party. Second, monitoring of most IEAs relies on self-reporting by countries which is usually rather spotty ). In particular developing countries and Eastern European countries often submit incomplete monitoring reports. Obviously, there is a general incentive problem to provide an IEA secretariat with \"true\" information. An obvious countermeasure would be to establish an independent monitoring institution. However, one should expect that governments will be reluctant to accept such external monitoring since they fear that this interferes with their sovereignty. Third, though almost complete and frequent monitoring were technically feasible, monitoring costs would probably exceed the gains from cooperation. Therefore, a monitoring system has to rely on not announced occasional spot checks, reflecting a compromise of a high detection rate, frequent monitoring and low monitoring costs."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 68,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Treaty Obligations",
               "type": "conclusion"
          },
          "paragraphs": [
               "Most IEAs contain a provision for national monitoring. Even though an international and independent monitoring would be preferable, national monitoring is a first step in the right direction. In particular the more national monitoring systems are linked to each other and the more effort is spend on formulating clear and transparent guidelines how to prepare a monitoring report, the higher will be the quality of the monitoring. Sometimes a monitoring reports are the only source for environmental groups and environmentally concerned voters to judge the fidelity of their government. The costs to obtain alternative information may often be prohibitively high. Thus, in a public choice context monitoring fosters the pressure on governments to take their treaty obligations seriously.",
               "Unfortunately, the incentive structure of monitoring is that of a social dilemma. That is, from a global point of view fostering the quality of the monitoring system increases the effectiveness of an IEA.",
               "From an individual perspective, however, each country faces a free-rider incentive since monitoring is costly. In fact, abstracting from other treaty obligations and considering monitoring only by itself, it seems most likely that the individual rationality constraint is violated. Every country has an interest that other countries are monitored. However, monitoring of its own performance is only associated with negative effects. At best at country can only prove that it should not be punished because it complied with the terms of the agreement. This may explain why it is so difficult to establish a well functioning national monitoring system, letting alone a international independent one."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 69,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Conclusion 9 (based on demonstration and discussion)",
               "type": "conclusion"
          },
          "paragraphs": [
               "The quality of the monitoring system is important for the stability of an agreement. An independent monitoring authority, frequent checks and a high detection rate are conducive to cooperation but are costly and difficult to establish. The establishment of a well functioning monitoring system is difficult since monitoring constitutes a social dilemma type of problem where the individual rationality constraint is most likely violated."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 70,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "n": "3.7",
               "text": "Discount Factors",
               "type": "conclusion"
          },
          "paragraphs": [
               "Points 3 and 4 in section 3.1 as well as the previous discussion made it clear that the stability of an agreement crucially depends on the actual discount factors by which governments discount the stream of net benefits accruing from an IEA. Though in game theory the discount factor is treated as an exogenous variable, from a policy point of view it is interesting to briefly review the factors influencing. As pointed out in point 5, section 3.1, the stability of an IEA may be jeopardized if politicians are interested in short-term success (high value of the discount rate r i ). Therefore, one could think of transferring national enforcement from the government to the bureaucracy which, by nature, is less dependent on election cycles. (See also section 3.5 on this point). A further measure could be to trans-"
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 71,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "National monitoring is required under the \"Convention on International Trade in Endangered Species of Wild Fauna and Flora\" (CITES, , the \"International Tropical Timber Agreement (ITTA, or the \"Convention on the Conservation of Antartic Marine Living Resources\" form (international) obligations of an IEA into national law. Since the interference into the judiciary involves high political costs in most democracies, opportunistic behavior of governments could be limited by such a measure.",
               "Moreover, it is usually assumed that there is an inverse relationship between the wealth of nations and the discount rate. Following this assumption fostering economic development in developing countries would lead that these governments discount time less and the prospects for cooperation would be brighter. Since, however, development projects are associated with high costs, one should expect that there are more efficient measures to influence the discount rate.",
               "According to point 6, section 3.1, discounting also depends on a) the evaluation of political stability "
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 72,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "n": "4.1",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "The previous sections abstracted how an abatement target is translated into policy. In this section we investigate how the choice of policy instruments affects individual rationality and stability of an IEA."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 73,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "Some IEAs have a provision to implement agreed abatement duties into national law as for instance the Waigani Convention (\"Convention to Ban the Importation into Forum Island Countries of Hazardous and Radioactive Wastes and to Control the Transboundary Movement and Management of Hazardous Wastes within the South Pacific Region\", . For details the interested reader is referred to Bergesen/Parmann (1997), p. , pp. 52.",
               "The discussion of their effect on the number of participants to an IEA is postponed until chapter 5 on coalition formation.",
               "Up to now market-based instruments have a played a minor role in international pollution control.",
               "Neither emissions charges nor emission permits are part of an IEA. In this respect the Kyoto-Protocol has to be judged as major hallmark in international pollution control. In article 17 it allows for the trade in emission quotas among Annex 1 countries. Moreover, in articles 3 and 4 the protocol mentions the possibility that Annex 1 countries may jointly hit their targets by setting up an emission bubble (Joint Implementation, JI). So far, however, the protocol has not been ratified by any signatory. The main obstacle is that the USA and the EU cannot agree on the extent of permit trading.",
               "In contrast, command and control instruments have played a dominant role in environmental protection. Frequently, uniform emission quotas are assigned to each signatory. A uniform emission quota requires from each signatory to reduce emissions by the same percentage from some base year.",
               "Economist have criticized quotas of being inefficient and recommended permits or taxes instead. The following sections will provide some evidence to explain this phenomenon. It is interesting to note that this evidence is not derived from a public choice (e.g., Schneider/Volkert 1999) but from a standard welfare economic framework in which some real world restrictions are considered. It turns out that distributional aspects and incentive issues explain the bulk of the phenomenon. In the following we distinguish between the general properties of an instrument and the properties of the bargaining process and equilibrium."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 74,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Emission Quotas",
               "type": "introduction"
          },
          "paragraphs": [
               "A uniform emission quota is generally inefficient. To see this not that efficiency follows from max ( )i i e subject toe e iwhich leads toemissions under the quota regime. As long as abatement cost functions and initial emissions differ across countries, marginal abatement costs will generally differ, characterizing an inefficient abatement allocation. However, a uniform emission quota leads to relatively symmetric distribution of welfare. Since the quota is directly related to initial emissions in the status quo, the The list of examples of uniform emission quotas is long and includes the \"Montreal Protocol on Substances that Deplete the Ozone Layer\" which specified an emission reduction of CFCs and halons by 20 percent based on 1986 emission levels which had to be accomplished by 1998. Uniform emission quotas are also part of the amendments signed in and in interests of all countries are more or less considered under a quota regime. Though countries contribute differently to a joint environmental policy, in relative terms they all contribute the same.",
               "For not \"too large\" emission reduction, the individual rationality constraint is met. This can be seen in where Q represents the abatement path under a quota regime. As long as r is small so that "
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 75,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Emission Charges",
               "type": "introduction"
          },
          "paragraphs": [
               "In the context of global pollutants only a uniform emission tax is efficient. A country?s industry performs max ( )",
               "follows in equilibrium and therefore efficiency",
               ") is ensured in the tax equilibrium. Since it is very unlikely that governments will hand over their tax sovereignty to an international body, an international tax seems unlikely. The tax receipt of a national tax may either remain in the country of origin or may be passed on to an international institution. The second possibility would involve large transfer payments even though that parts of the tax may be eventually redistributed. Due to the incentive problems mentioned in section 3.4 the second option will have only little chance to be realized. Therefore, we concentrate in the following on a national tax where the receipts remain in each country. In contrast to the quota, the welfare implications of a tax may be very uneven. Those countries with low marginal abatement costs and low marginal environmental damages (group 1) have to contribute much to joint abatement under a tax regime, however, their benefits in the form of lower damages are only small. Many developing countries will exhibit such a cost-benefit ratio. In contrast, countries with large marginal abatement costs and large marginal damages (group 2) will contribute only little to joint abatement but benefit on average much. Many industrialized countries may approximately exhibit such cost-benefit ratio. Since in the global context one has to expect that the number of countries belonging to group 1",
               "is not small, a tax leads to an asymmetric welfare distribution. Such a case is shown in where line T represents the (efficient) abatement path under a uniform tax regime. In the example their is no tax for which the individual rationality constraint of country 2 can be met."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 76,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Emission Permits",
               "type": "introduction"
          },
          "paragraphs": [
               "Permits may either be freely allocated or auctioned. Since auctioning implies large transfer payments to an international body, this option will be discarded in the following for the same reasons as men- Theoretically, it is always possible to construct an allocation rule such that the individual rationality constraint is met. However, in reality things are less straight forward. First, in order to compute the direction of trade and the welfare implications, one needs information on abatement costs and damage cost functions. Though information on abatement costs may be available, damage cost estimates are difficult to come about. For strategic reasons governments may \"hide\" this information. Second, since there is not only one allocation rule which meets the individual rationality constraint, governments will have different opinions about the \"most adequate\" allocation rule. For instance, industrialized countries will favor an allocation rule based on historical emission levels or GDP, developing countries will prefer an allocation rule based on per capita.",
               "An allocation rule which meets the individual rationality constraint for not \"too\" high emission reductions and which implies a relatively symmetric welfare distribution is a uniform tradable emissions quota (Endres/Finus 1999). Each country receives permits in proportion to emissions in the status quo, devalued by the same uniform percentage (grandfathering). This allocation has two advantages.",
               "First, it does not require information about abatement and damage costs since the above mentioned result is known. Second, even if trade does not take place and the tradable quota is de facto a fixed quota, the individual rational constraint is met. This may explain why the main global players under the Kyoto-Protocol have approximately settled for such an agreement (see chapter 6).",
               "In contrast to fixed quotas, there is an incentive problem under a tradable permit regime. If a country buys permits, then it can not be sure whether the seller reduces its emissions accordingly. By the same token, if a seller reduces its emission in advance to the deal, she cannot be sure whether the potential buyer will transfer the money. Hence, permits face the same incentive problem as monetary transfers.",
               "However, a permit transaction happens only once. Hence, it can not be neutralized on the side of the recipient (seller of permits) as this was possible for monetary transfer in a repeated game framework.",
               "Since other means of sanctions face other problems (see chapter 3), setting up a permit system is difficult in the global context."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 77,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "n": "4.3",
               "text": "Properties of the Bargaining Process and Equilibria",
               "type": "introduction"
          },
          "paragraphs": [
               "In this section we investigate the bargaining process if governments either negotiate on the level of 1) a uniform fixed emission quota, b) a uniform tradable emission quota or c) a uniform tax where the tax receipt remain in each country. Since according to Conclusion 3, an agreement must be based on consensus, it seems plausible to assume that countries agree on the smallest common denominator (SCD-decision rule; . That is, governments agree on that proposal which implies the smallest emission reduction."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 78,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Information Requirement",
               "type": "introduction"
          },
          "paragraphs": [
               "For the fixed quota it is sufficient if each country observes emissions in the status quo and of course knows its own net benefit function as given in . Information about the benefit and damage cost function of the other countries is not necessary. In contrast, under permit and tax regime a government has to know the benefit functions (opportunity cost of abatement) of the other countries to put Due to the transfers involved in permit trading, the welfare implications of a permit system can not be visualized in . ",
               "forward a proposal. Under the tax regime this necessary to estimate how the other countries adjust to a uniform tax. Under the permit regime this is necessary to compute the direction of permit trade and its welfare implications. Thus, the information requirement under the fixed quota is lower than under the two other regimes (Endres 1995)."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 79,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Strategic Behavior",
               "type": "introduction"
          },
          "paragraphs": [
               "Though the SCD-decision rule generally implies that aggregate emissions exceed globally optimal emissions, it has an distinctive advantage under the fixed and tradable quota regime. Under both regimes a country has no incentive to put forward a biased proposal. That is, the proposals constitute an equilibrium in dominant strategies (Endres/Finus 1998b and Endres/Finus 1999). Considering that strategic behavior would delay an agreement or render it impossible, the SCD-decision seems less inefficient at second thought.",
               "Under a tax regime \"truthtelling\" is only a dominant strategy if there is incomplete information. 49 That is, different from most economic problems where lack of information is a source for inefficiencies, her just the opposite applies. It turns out that for complete information the bottleneck country (the country which makes the smallest tax proposal) may have an incentive to bias its proposal downward so as to induce the other countries to \"overfulfill\" the agreement in their own interest after their signature (Endres/Finus 1998b). However, such a strategic proposal will not acceptable to the other countries and an agreement will fail."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 80,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Individual Rationality, Global Welfare and Emissions",
               "type": "introduction"
          },
          "paragraphs": [
               "Under the tradable and non-tradable quota regime the SCD-decision ensures that the individual rationality constraint is always met (Endres/Finus 1998b and 1999). In contrast, under a tax regime there may be no tax proposal, regardless how small it is, for which this condition can be met (see previous section). In e Q and e T are the bargaining equilibria under the fixed quota and the tax regime, respectively. The bargaining equilibria of all three regimes imply higher global welfare and lower emissions than in the Nash equilibrium, however, due to the SCD-decision rule (and as long as countries are not totally symmetric) globally optimal levels are nor achieved (Endres/Finus 1998b and 1999)."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 81,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "Under a tax regime a proposal, t i , follows from maximizing. See Endres/Finus (1999) for details."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 82,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "The idea is best explained by using a counter example. Assume governments were to agree on the arithmetic mean of the proposals. Then under the quota regime countries which like to see a high quota would bias its proposal upward, those which prefer a low emission reduction would bias its proposal downward."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 83,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "That is, it is assumed that a country has information about the benefit functions in the other countries but not about their damage costs."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 84,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Free-Rider Incentive",
               "type": "introduction"
          },
          "paragraphs": [
               "For symmetric welfare functions the free-rider incentive is small under all three regimes. For all three regimes emissions under an agreement are more or less the same across countries. Consequently, under the permit regime there will be not much trade. Therefore, the incentive problem of the exchange of permits also plays a minor role. However, for global problems one has to reckon with asymmetric welfare functions. In this case the incentive problem under a permit regime becomes important. Due to asymmetric welfare implications under the tax regime, the free-rider incentive is particular high for the bottleneck country (Finus/Rundshagen 1998a, b). In contrast, under the fixed quota regime a relatively symmetric welfare distribution implies that no country faces an extremely high free-rider incentive so that stability is less of a problem in a dynamic context."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 85,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Conclusion 11 (summarizing presentation of results and discussion)",
               "type": "conclusion"
          },
          "paragraphs": [
               "Under the fixed and tradable uniform quota regime welfare distribution is rather symmetric. For not \"too\" large emission reduction, in particular if the SCD-decision rule is applied, individual rationality is met for all countries. Under a tax regime individual rationality may be violated if countries exhibit heterogeneous interest. Compared to a fixed quota regime, a tradable quota regime has the disadvantage that a country requires more information to put forward a bargaining proposal. Moreover, the free-rider incentive which occurs if permits are traded is difficult to control in a global context.",
               "Compared to a fixed quota regime, a tax regime has the disadvantage that a country requires more information to put forward a bargaining proposal which, additionally, may be biased which leads to the break-down of the negotiations. Moreover, if countries have heterogeneous interests an asymmetric welfare distribution implies a high incentive for the bottleneck country to violate the agreed emission reduction targets."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 86,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "n": "5.1",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "In this section we summarize the main findings which have been derived from RSG-and DG-models . For the RSG-models we consider the concept of internal&external stability (see section 3.5), for the DG-models the concept of renegotiation-proofness (see section 3.2).",
               "Since these models are based on two different frameworks (see section 3.1), we discuss both approaches separately. The objective of both approaches is to investigate how many and which countries join an IEA, on which factors this depends and whether the coalition contributes to mitigate the global externality. Both approaches use specific functions. For the RSG-models we assume that the welfare functions are given by either of the three following functions: "
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 87,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "That is, the minimum discount factor requirement for this country is particular high."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 88,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "Both approaches consider only the possibility that signatories form one coalition. The possibility of the coexistence of several coalitions is ruled out by assumption. Concepts which allow for simultaneous coalitions are considered in Carraro/Moriconi (1997) and ).",
               "For the DG-model which we consider in section 5.3 we assume:",
               "i and j{1, ..., N}.",
               "Welfare function of type 1 and 4 are in accordance with the properties of the general welfare function "
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 89,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Result 6",
               "type": "introduction"
          },
          "paragraphs": [
               "Let b i =b j =b and c i =c j =c in and define=b/c, then for the functions in and , the externality problem is particularly distinct if 1) the number of countries, N, is large and 2) if the benefitcost ratio of emissionsis small. That is, for these parameter constellations the (relative) difference between the Nash equilibrium and the global optimum is large in terms of global emissions and global welfare.",
               "The first part of Result 6 reflects a typical problem of public goods: the own contribution to a public good is perceived to have only a marginal effect if the number of countries is large. This causes the underprovision of the public good \"clean environment\". The second part of Result 6 reflects the fact that if the benefit-cost ratio is large it is also not sensible from a global point of view to reduce emissions much. Therefore, the relative difference between the Nash equilibrium and the global optimum is small."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 90,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Conclusion 12 (based on Result 6)",
               "type": "conclusion"
          },
          "paragraphs": [
               "Cooperation is particularly attractive from a global point of view if environmental damages are high compared to opportunity costs of abatement and if many countries are involved in the exteranility problem (critical parameter constellations).",
               "We call the parameter constellations mentioned in Conclusion 12 the critical parameter constellations for reference reason. that is, the expansion of emissions by non-signatories if signatories reduce emissions."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 91,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Symmetric Countries",
               "type": "conclusion"
          },
          "paragraphs": [
               "Since the computation of a coalition equilibrium gets rather complex (in particular for welfare function of type 1) some papers have assumed symmetric countries. However, as the discussion of \"Heterogeneous Countries\" will show, most qualitative results are confirmed for asymmetric countries. In the case of symmetric countries transfers in the third stage are zero since all signatories receive the same payoff. For the three types of welfare functions in the equilibrium coalitions are given in ."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 92,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "Leakage effects have been studied by , Felder/Rutherford (1993) and Golombek/ Hagem/Hoel (1995) in the energy market. Energy conservation by \"green countries\" leads to a reduction of demand for crude oil. Consequently, energy prices drop. This in turn triggers higher demand of less environmental conscious countries which renders the environmental policy of green countries less effective. See also Bohm/ and on leakage effects and countervailing measures. , ch. 13. Assumption: Welfare functions as given in and symmetic countries (b i =b j =b and c i =c j =c).",
               "From the table it appears that welfare function of type 1 and the assumption of sequential moves is best suited to explain actual IEAs since the equilibrium number of signatories ranges from 2 to N, depending on the benefit-cost ratio. implies the following result."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 93,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Result 7",
               "type": "conclusion"
          },
          "paragraphs": [
               "The number of signatories is at least as high if countries choose their emissions sequentially than if they choose their emissions simultaneously.",
               "Moreover, based on , the following results can obtained ."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 94,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Result 8",
               "type": "conclusion"
          },
          "paragraphs": [
               "A coalition, though this may be small, generally increases individual and global welfare and reduces global pollution. The participation rate (number of coalition members in relation to the total number of countries) in the coalition decreases with the number of countries suffering from global pollution, N, and decreases (or remains unchanged) with the benefit-cost ratio of emissions,=b/c. A coalition mitigates the externality problem if the number of countries suffering from the externality is small and if the benefit-cost ratio is big. For the critical parameter values a coalition achieves only little.",
               "Result 7 confirms the conjecture that a coalition is more successful in tackling global pollution if they take possible leakage effects into consideration. In other words, it may not pay the coalition to be too enthusiastic about reducing emissions. It might be better to observe first the reaction of nonsignatories and then choose and optimal strategy. This is particularly true if the slope of the reaction function is big in absolute terms (close to one; see also Result 8). Then a sequential choice of emission levels substantially improves upon the prospects to form a large coalition since leakageeffects are better accounted for. However, as Result 8 indicates, large coalitions may not be necessarily superior to small coalitions."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 95,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "We use the phrasing \"is at least as high\" instead of \"greater\" in Result 7 since for welfare functions of type 2 there are no leakage effects.",
               "Result 8 confirms that it pays to seek partners in pollution control. However, whenever cooperation would be needed most, a coalition achieves only little. Though for the critical parameter values (implying steep reaction functions) many countries join an IEA, they have only a marginal positive effect on mitigating the externality problem. This paradox stresses that from the participation rate one cannot infer the success of an IEA. To the contrary: a small number of countries may achieve more than a large group. As a tendency, this conclusion is supported by the DG-models.",
               "According to Barrett (1994b) the depletion of the ozone layer may serve approximately as an example of a small benefit-cost ratio. Many countries joined the Protocol, though from Result 8 one should expect that the impact of the protocol is only small. An example of a higher benefit-cost ratio are greenhouse gases. Though only a relatively small number of countries signed the Kyoto-Protocol (38 out of roughly 200 countries), Result 8 suggests that its success will be more noticeable."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 96,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Heterogeneous Countries",
               "type": "conclusion"
          },
          "paragraphs": [
               "Heterogeneity can be modeled in many respects and results crucially depend on the specific assumptions. The coalition size depends on the nature and the degree of heterogeneity and how the gains of the coalition are distributed among its members. Nevertheless, we like to highlight four results."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 97,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "First, for welfare functions of type 1 it appears that the number of signatories is smaller for heterogeneous than for symmetric countries . This result conforms to intuition: for heterogeneous countries it is more difficult to form stable coalitions. This result is confirmed by Finus/Rundshagen (1998a) in a DG-model.",
               "Second, for welfare functions of type 1 and 2 and for the Stackelberg assumption Barrett (1997b) confirms via simulations that a coalition achieves only little whenever cooperation would be needed most. Thus Result 8 appears to carry over to heterogeneous countries as well, though one has to be cautious with general conclusions.",
               "Third, shows that countries with similar welfare functions form a coalition. If these coalitions act as one country, then several smaller coalitions may form larger coalitions. Of course, the assumption that several countries act as a single entity is rather \"heroic\". Nevertheless, the result indicates that an expansion of an IEA is best achieved if countries with similar interest sequentially form larger coalitions in a first step. Similar to the design of the Monetary European Union an expansion should wait until the economic and ecological fundamentals of potential signatories have converged to the those of the core countries.",
               "Fourth, show (using estimates of five world regions for abatement and damage cost functions of type 2, assuming simultaneous moves) that the coalition structure (membership) depends on the allocation rule of the gains of the coalition. For their data set the Shapley value leads to a coalition generating a higher global welfare than a coalition in which the 55",
               "The qualification \"generally\" in Result 8 is necessary for welfare functions of type 3 and simultaneous moves where there exists no \"true\" coalition except the Nash equilibrium.",
               "Nash bargaining solution is applied. Though this result does not allow to draw general conclusions, the finding supports our conjecture mentioned in section 2.1 that the design of an agreement has an impact on global efficiency."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 98,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "n": "5.3",
               "text": "DG-Models",
               "type": "modelling"
          },
          "paragraphs": [
               "Formation of coalitions in DG-models have been analyzed by Barrett (1994a, b), Finus/Rundshagen (1998a) and . Since Barrett assumes symmetric countries and St?hler considers only three countries, the following discussion will be based on Finus/Rundshagen. In contrast to RSGmodels, in DG-models both types of free-rider incentive are captured. Consequently, one should expect that stability poses more of a problem. However, in contrast to RSG-models, in DG-models there is also the possibility to punish free-riding. For the coalition the inequality system defined by the renegotiation-proof conditions C 1 to C 4 must hold for all signatories. Finus/Rundshagen assume welfare function , implying equal benefits but different damages in the N countries."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 99,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Grand Coalition",
               "type": "modelling"
          },
          "paragraphs": [
               "For a coalition comprising all countries the authors consider five different designs of a treaty: 1) a uniform emission reduction quota (SCD-decision rule), 2) a uniform emission reduction quota with an agreement on the median country proposal, 3) a uniform tax (SCD-decision rule), 4) a uniform tax with an agreement on the median country proposal and 5) a socially optimal tax. No transfers are assumed for the reasons presented in section 3.5.",
               "An agreement on the median country proposal implies a far higher emissions reduction than the SCDdecision rule. A socially optimal tax implies the highest emission reduction compared to all other treaty designs. The following result may be obtained."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 100,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Result 9",
               "type": "modelling"
          },
          "paragraphs": [
               "Irrespective of the treaty design, stability of a grand coalition is particularly jeopardized whenever the gains from cooperation would be great (critical parameter values; see Result 6). For global pollutants where the number of countries affected by the externality is large, neither the globally optimal emission reduction nor the median country proposal are stable. The likelihood that the smallest tax or quota proposals are stable is higher, though for global pollutants also very low. The stability of a quota proposal will generally be higher than that of a tax proposal.",
               "Once more the result emphasizes that demanding abatement targets, though they may advisable from a global point of view, have hardly a chance to be realized within an IEA. Due to the heterogeneity of countries only moderate abatement targets have a chance to be realized if at all. The Rio Declaration confirms this finding: it is has been signed by almost all countries but is at best a declaration of good intentions with no binding abatement obligations. The last statement in Result 9 confirms the findings in chapter 4, namely the superiority of the quota over the tax regime in terms of stability."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 101,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Sub-Coalition",
               "type": "modelling"
          },
          "paragraphs": [
               "Due to the pessimistic result obtained for a grand coalition, Finus/Rundshagen investigate the formation of sub-coalitions. The formation process may viewed as a sequential process. Countries with the highest environmental preferences are the initiators which seek partners in order to form an IEA.",
               "\"New\" countries are asked to submit a bargaining proposal. Based on this proposal the initiators decide whether they offer the new country membership. This decision is either taken by the unanimity rule or by majority. The reduction level with the coalition is decided according to the SCD-decision rule. The decision about the instrument (quota or tax) is decided according to the majority rule. All three decisions are taken simultaneously and are strategically related to each other. Four factors determine the equilibrium coalition size: First, additionally signatories imply less free-riders. Second, an agreement is more effective if the abatement burden is shouldered by more countries. Third, additional signatories may imply a lower environmental standard due to the SCD-decision rule. Fourth, though a tax may be more efficient, a quota may allow to form a larger coalition. As long as the first two effects dominate the third effect, a coalition is expanded. At the break-even point (coalition equilibrium), all three effects balance (beyond the break-even point the third effect is stronger than the first and second effect). Together with the fourth effect, this determines the equilibrium: the equilibrium number of signatories, the policy instrument and the abatement target chosen by the coalition."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 102,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Result 10",
               "type": "modelling"
          },
          "paragraphs": [
               "A sub-coalition may achieve more (in terms of emission reduction and global welfare) than a grand coalition. This is particularly true for the critical parameter values. This result does not only hold for the SCD-decision rule, but may also be true if one assumes that the grand coalition implements the highest emission reduction which is stable. As long as the number of countries affected by the externality is not very small, the coalition will agree on a uniform emission reduction quota.",
               "The advantage of sub-coalitions is that relatively homogenous countries form an IEA. Though also sub-coalitions have to agree on the smallest common denominator, they have to compromise less on ecological targets than the grand coalition. The members of the sub-coalition only offer membership if this is conducive to the overall success of the coalition. Result 10 suggests that it is not necessarily a good strategy to get all countries into the \"climate boat\" (as has been tried under the Montreal and the Kyoto Protocol). Smaller and regional coalitions may achieve more. This conclusion is in line with the findings of the RSG-models. The agreement on a uniform quota is due to its symmetric welfare distribution (see chapter 4). Consequently, larger coalitions are stable implying a higher welfare to signatories (and non-signatories alike). Though one can show that the initiators prefer a tax to a quota for a given number of countries and when abstracting from stability problems, the prospect of a larger and stable coalition also \"convinces\" these countries to agree on a quota. This result provides a rational why a uniform emission reduction has been so popular in the past."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 103,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Conclusion 12 (based on Results 6, 7, 8, 9 and 10 and discussion)",
               "type": "conclusion"
          },
          "paragraphs": [
               "Whenever cooperation would be needed most from a global point of view, coalitions achieve only little. In this case, though many countries accede to an IEA, the global externality will be reduced only little. Small coalitions of relatively homogenous countries may achieve more than bigger coalitions. Far reaching emission reductions and efficient abatement programs have hardly a chance to be realized in an IEA since they imply a high free-rider incentive which is difficult to control in a global context. A uniform emission reduction quota, though it is inefficient, implies a relatively symmetric welfare distribution and faces a smaller free-rider incentive than market-based instruments. Consequently, the stability of a coalition is higher which allows to form larger coalitions and to obtain larger global welfare gains. Therefore, it is very likely that countries agree on a quota in the negotiations leading to an IEA.",
               "Future research should pay attention to the effect 1) of the choice of the abatement target and the burden sharing rule and 2) the possibility of the simultaneous existence of several coalitions on the success of IEAs."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 104,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "n": "6.",
               "text": "The Kyoto-Protocol",
               "type": "conclusion"
          },
          "paragraphs": [
               "In this section we use the results and conclusions of the previous chapters to evaluate the KyotoProtocol. Only those issues of the protocol which can be related to the previous discussion will be treated."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 105,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Facts",
               "type": "conclusion"
          },
          "paragraphs": [
               "The protocol sets emission targets for 38 industrial countries (plus the EU as a whole entity "
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 106,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Evaluation",
               "type": "experiment"
          },
          "paragraphs": [
               "For the four major global players (USA, Canada, Japan and EU) the Kyoto-abatement targets imply roughly a uniform emission reduction quota based on status quo emissions in 1990. Thus, according to Conclusion 11 one should expect a rather symmetric welfare distribution even though the parties will not eventually agree on unrestricted permit trading. Given that countries agreed on the smallest common denominator, the individual rationality constraint would be met for all signatories. Whether the SCD-decision rule was actually applied in the negotiations leading to the Protocol is an open question. However, there are two facts supporting this conjecture. First, Article 20 to the protocol states that all amendments to the protocol should be made by consensus. Second, the negotiations leading to the signature of the Kyoto-Protocol took six years, stressing how difficult it was to find unanimous consensus (see section 2.2).",
               "The abatement targets for the global players must be judged as quite demanding. This is even more evident when the effective emission reductions and those computed to be socially optimal are considered. Effective emission reduction means that reductions are not expressed in terms of some base year (e.g., 1990 as under the Kyoto-Protocol) but compared to the \"business as usual\" scenario (BAU-scenario). According to B?hringer (1999) effective emission reductions are as follows: USA:",
               "27.5 percent, Canada: 27.5 percent, EU: 13.7 percent, Japan: 26 percent, Australia/New Zealand: 15.8 percent and the Former Soviet Union: -48.1 percent. Cost-benefit studies indicate that socially optimal global emission reduction would be roughly between 10-30 percent compared to BAU. 58 Thus one has to expect a high free-rider incentive for most countries (except Russia). Consequently, an efficient system of sanctions appears to be a basic prerequisite if the stability of the Kyoto-Protocol shall be ensured.",
               "According to the theoretical results the fact that developing countries did not accede to the Protocol may not be a disadvantage. First of all, the result is in line with the results obtained in section 5.2. If the benefit-cost ratio is \"not too small\" (as this has been assumed for the problem of global warming), only few countries will accede to an agreement. However, according to Result 8, such a small coalition will have an impact on reducing the externality. Also Result 10 confirms that smaller coalitions may achieve more than larger coalitions. Moreover, from Result 9 one can conclude that a grand coalition would not be stable anyway. A \"not too small\" benefit-cost ratio also implies that reaction functions are not very steep, implying that the leakage effect will only be moderate (section 5.2). This is even more true given the low perception of environmental damages in developing countries, implying (for welfare functions for which the standard assumptions hold (see and footnote 1), e.g., welfare functions of type 1 and 4 in and ) almost orthogonal reaction functions. However, extrapolating the past economic progress of countries like China, their population growth and their high emission per GDP ratio, leakage effects may become very large in the future. Therefore, it may be sensible to include some developing countries into the protocol at a later stage. However, without any direct or indirect transfer payments it will prove difficult to convince those countries to join the agreement."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 107,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Facts",
               "type": "experiment"
          },
          "paragraphs": [
               "a) The protocol allows Annex 1 countries to jointly hit their targets (Joint Implementation; abbreviated JI; Articles 3 and 4). However, the details of JI have not been settled yet. Moreover, a party may \"bank\" its emissions rights if its emissions in some commitment periods are less than assigned under the protocol (Article 3). b) Under Article 17 the protocol allows for emission trading among Annex 1B countries (nearly the same countries as Annex 1). However, the details of permit trading have not been agreed yet. Whereas the US favors unrestricted trade, the EU accepts only limited trading.",
               "c) Under Article 12 (Clean Development Mechanism; abbreviated CDM) of the protocol Annex 1 countries are allowed some flexibility to finance \"project activities resulting in certified emission reductions\" in developing countries, thereby reducing their abatement burdens. The purchased reductions must be additionally to \"any that would occur in the absence of the certified project activity\".",
               "The developed country is expected to cover the \"incremental costs\" of the project. The exact account-"
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 108,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "The BAU-scenario is a prediction how emissions increased if no actions would be taken and the economies grow at a steady path."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "experiment"
          },
          "paragraphNo": 109,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "See Endres/Finus/Rundshagen (2000) and the literature cited there.",
               "ing procedures have to be specified in future amendments to the protocol. d) The protocol allows each country to figure out how it translates its target into domestic policy. That is, there is no article requiring specific technological standards or harmonized measures."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "experiment"
          },
          "paragraphNo": 110,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Evaluation",
               "type": "experiment"
          },
          "paragraphs": [
               "Since according to marginal abatement costs under fixed Kyoto-quotas vary substantially between countries (USA: 43.7, Canada: 62.8 EU: 29.2, Japan: 81.8, Australia/New Zealand:",
               "20.7 and the Former Soviet Union: 0; unit: US/$ per ton of CO 2 -reduction), global abatement cost can be reduced through JI and permit trading. Since marginal abatement costs in developing countries are generally lower than in industrialized countries, also CDM contributes to reduce abatement costs.",
               "Moreover, emission banking allows some flexibility in the abatement path, so that each country can choose its optimal time path which also reduces abatement costs. By the same token, it has to be judged positively that no harmonized measures are proposed by the protocol.",
               "However, the question arises what JI is good for if there is a functioning permit system. Obviously, the founders of JI did not believe in the permit system. According to the discussion in section 3.5 on transfers and in particular on the permit system in chapter 4 their suspicion may not be unwarranted.",
               "Permit trading will be subject to high free-rider incentives (between sellers and buyers). However, the transparency and efficiency of emission trading may suffer from the coexistence of JI and the permit scheme. Probably the founders of JI had in mind that most transactions under JI will not be conducted in the form of monetary transfers but in the form of in-kind transfers or issue linkage. From sections 3.4 and 3.5 it is known that for in-kind transfers and issue linkage there is no incentive problem between donor (buyer) and recipient (seller). Though both instruments are less efficient than monetary transfers, JI may turn out to be an efficient second-best instrument.",
               "The problem of CDM is how to measure \"additional measures\". Since additional measures can only be determined via contra factual reasoning, it may happen that measures are certified which would have been undertaken by developing countries anyway. This may cause a crowding out of domestic through foreign investment. The fact that details of CDM await to be elaborated in future meetings, stresses the conceptional difficulties facing CDM. From an incentive point of view, however, the advantage of CDM is that transfers take the form of in-kind transfers. Thus transfers under CDM are less jeopardized by the free-rider incentive compared to monetary transfers as under the permit trading system (see section 3.4 and chapter 4).",
               "The problem of banking is that this may imply some temporary hot spots in the future if some countries simultaneously make use of this option. Moreover, a government may postpone emission reductions, promising to clear its account later. If governments act myopically or are not reelected, temporary deficits may become permanent.",
               "In the light of deficient monitoring (see point 5 below), non-harmonized measures may be difficult to monitor. From a practical point of view, harmonized measures (e.g., technical standards), though inefficient, may be easier to monitor and to evaluate with respect to their effect to serve the aims of the protocol."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 111,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Facts",
               "type": "experiment"
          },
          "paragraphs": [
               "The protocol covers not only CO 2 but also five other greenhouse gases (see footnote 35). All greenhouse gases and emission targets are expressed in CO 2 -equivalents. CO 2 -equivalents measure the global warming potential of a greenhouse gas."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 112,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Evaluation",
               "type": "experiment"
          },
          "paragraphs": [
               "On the one hand, the inclusion of five other greenhouse gases apart from CO 2 has to be judged positively. First, this regulation accounts for the fact that other greenhouse gases are also important contributors to global warming. Second, this avoids the danger that countries pursue an abatement strategy of reducing CO 2 at the expenses of expanding emissions of other greenhouse gases. Third, this allows for some flexibility in meeting the targets which reduces abatement costs. The conversion of greenhouse gases in CO 2 -equivalents (global warming potential) implies that countries can reduce those greenhouse gases where they faces the lowest abatement costs. Fourth, the conversion in CO 2 -equivalents provides a good basis for monitoring.",
               "On the other hand, according to section 3.5 on issue linkage if the various greenhouse gases are complements in a governmentsbjective function treating these greenhouse gases within different IEAs would have been better. However, negotiating six separate agreements would have implied higher transaction costs. Alternativally, some responsibility for environmental policy could be delegated from the government to independent national institutions to increase the stability of the treaty."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 113,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Facts",
               "type": "experiment"
          },
          "paragraphs": [
               "The protocol allows for carbon sinks (Article 3). That is, land and forestry practices which remove carbon emissions may be accounted for a country?s emission target. Carbon sinks may also be traded among Annex 1 states (Article 6). However, only the establishment of carbon sinks which are in addition to those \"that would otherwise occur\" are considered as tradable. The accounting procedures of carbon sinks have not been settled yet."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 114,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Evaluation",
               "type": "experiment"
          },
          "paragraphs": [
               "Carbon sinks may provide a low cost option for some countries and therefore help to reduce abatement costs. So far, however, sinks are ambiguously defined and therefore will be a challenge to measure and to monitor. In particular, it is difficult to define what constitutes \"additional carbon sinks\". As long as The Conference of the Parties has not finally agreed on the guidelines for the implementation, verification and reporting this provision may be a major loophole of the treaty."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 115,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Facts",
               "type": "experiment"
          },
          "paragraphs": [
               "Articles 5, 7 and 8 specify the monitoring procedures. Each party has to establish a national emission inventory system one year prior to the first commitment period . This includes an inventory of carbon sinks. The methodologies to estimate emissions as well as the conversion factor into global warming potentials are those agreed by \"The Conference of the Parties\". The report has to be submitted annually and will be reviewed by a panel for compliance. The panel experts are nominated by the parties to the protocol."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 116,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Evaluation",
               "type": "experiment"
          },
          "paragraphs": [
               "The clear and uniform guidelines how to prepare inventories have to be judged positively. It does not leave room for different interpretations and eases to identify violations of the treaty. However, this statement has to be qualified considering the composition of the expert panel. Independence of the panel would have been served better if not any signatory were automatically granted a seat in this panel. The frequency of the reports ensures that violations are swiftly detected. A major shortcoming is the fact that the inventory is not conducted by an independent scientific auditing panel reporting directly to the secretariat. In particular from countries which are undergoing a transition to a market economy reliable reports can hardly be expected. This problem may be a major obstacle for establishing an efficient emission trading scheme for which reliable certified emission reductions are a basic prerequisite. A similar problem faces CDM where not even national inventories will be available to the \"review panel\" of the Protocol. Taken together, monitoring is far from being perfect under the Kyoto-Protocol. These deficiencies will be a potential source of instability of the treaty and will provide many loopholes for cheating.",
               "An other issue (mentioned in section 3.6) concerns the (technical) problem of detecting non-compliance unambigiously which is a prerequiste for sanctions. This problem is less urgent in the context of global warming. 59 Presently, there are no technical options to reduce global warming gases. Hence from the different energy sources and energy consumption of a country one can more or less accurately interfere emission releases. Only the accounting of carbon sinks is difficult.",
               "In the light of the above mentioned problems and the unlikely event that the parties will agree on an international monitoring system, Nentjes/Zhang (1997) have proposed a two-step approach of implementing a permit system. They argue that in a first step only those countries which can provide a high-standard inventory should form a permit trading bubble. In a second step those countries which prove that they can comply with the criteria of the forerunners are allowed to join the permit club.",
               "Their approach basically resembles that of the establishment of the Monetary European Union. (Each prospective member has to prove that the four important indicators of his economy converge to the economical fundamentals of the monetary union members.) However, this approach implies that Russia and many Eastern European countries, which are expected to be potential permit sellers, would not be members of the first step and therefore efficiency gains from trading would be lost.",
               "An other open question related to monitoring is whether permit trade should be allowed between private and public entities across borders or only between governments. The first option has the advantage that it allows for a higher flexibility and hence ensures a higher efficiency. Moreover, the second option bears the danger that inefficient policies are implemented within a country undermining the 59 This problem is important for example in the Whaling Convention where it is difficult to monitor the catch of whales. From the stock of whales one cannot (unambigiously) infer on the catch due natural fluctions of the stock.",
               "performance of the tradable permit system. However, with respect to monitoring it is obvious that transactions at a country level are far easier to monitor than transactions under the first option. Thus,",
               "given the severe problems of monitoring, in a first step the second option appears preferable for the next couple of years ahead."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 117,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Facts",
               "type": "experiment"
          },
          "paragraphs": [
               "Article 11 states that developed countries should assist developing countries to pursue the goals of the protocol by monetary and in-kind transfers and by providing technological assistance."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 118,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Evaluation",
               "type": "experiment"
          },
          "paragraphs": [
               "This provision is standard in all modern IEAs and is basically only a statement of good intentions since no targets are mentioned at all. No signatory has an incentive to spend money on such measures, in particular since they do not have to fear any sanctions (see section 3.4, Conclusion 7). Instead they will use this money for CDM or permit trading if it will be established some time in the future."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 119,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Facts",
               "type": "experiment"
          },
          "paragraphs": [
               "Article 18 states that at the first session, The Conference of the Parties shall \"approve appropriate and effective procedures and mechanism to determine and to address cases of non-compliance , including through the development of an indicative list of consequences, taking into account the cause, type, degree and frequency of non-compliance.\" Any such measure \"shall be adopted by means of an amendment to this Protocol\". Article 20 states that amendments shall be reached by consensus and if this not possible, amendments become only binding for those parties which have ratified the amendment. Article 27 states that any party may withdraw \"from the agreement after three years from the date on which the Protocol has entered into force . Any such withdrawal shall take effect upon expiry of one year from the date of receipt by the Depository of the notification [...]\"."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 120,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Evaluation",
               "type": "experiment"
          },
          "paragraphs": [
               "The lack of any enforcement measure is the most important drawback of the Kyoto-Protocol. Given the demanding abatement targets agreed under the Protocol (see point 1 above) and due to the inherent instability of any transfer scheme (JI, CDM and permit trading) as identified above, this shortcoming is particular serious. Other factors associated with the problem of global warming make this shortcoming even more important. First, the effects of global warming as well as expected abatement costs are uncertain by their nature. Second, political stability in developing countries and some countries of the former Soviet Union is relatively low. Third, the problem of unemployment is on the top agenda of most governments in Europe, whereas environmental issues have become less important. Consequently, all these factors imply that governments discount time much which is a source of instability (see section 3.1 and 3.7). An other source of instability is the low rate of detecting non-compliance which has to be expected as a result of the shortcomings of the monitoring system as mentioned above. The only factor which may work in favor of the Protocol is the frequent monitoring through the expert panel based on the annual inventories submitted by the signatories.",
               "The fact that enforcement measures have to be established via amendments which have to be agreed upon by consensus does not leave room for much hope that such measures will be implemented in the future. Moreover, any party foreseeing that it might not be able to comply with its target has always the option not to ratify the amendment and therefore the sanction procedures will not apply to the free-rider.",
               "A general problem which arises from Article 27 is that even if sanction measures were established in the future, any non-complying party can withdraw from the treaty within one year. This unnecessarily short interval basically leaves not much leeway to design credible sanction procedures. It implies that possible sanctions may not endure longer than a few months and must be very soft so as not to induce a country from leaving the agreement (see section 3.2). It would definitely be conducive to the stability of the protocol to extend the opting-out clause to at least three years as it is common under most other IEAs."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 121,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "n": "7.",
               "text": "Conclusion",
               "type": "conclusion"
          },
          "paragraphs": [
               "The previous chapters have shown that game theory is a useful tool for analyzing global pollution problems. The difficulties of cooperation but also the measures to establish cooperation have been discussed. Due to the many results and the concise summaries in conclusions in previous chapters, we will not summaries this discussion here again. Instead, we will briefly discuss open issues and provide a guideline for future research.",
               "First, there remain some white spots on the theoretical research agenda. Some important issues which have not been covered in this article are incomplete information and the risk preferences of agents."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 122,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "From those issues which have been covered here, further research is particular important on issue linkage and coalition theory. Issue linkage should be investigated in a unifying and more general framework where also the internal free-rider incentive of coalitions should be captured. In coalition theory the effect of simultaneous coalitions, the choice of the abatement target and the burden sharing rule on the success of IEAs should be given a high priority on the agenda of future research.",
               "Second, the game theoretical research has so far almost exclusively focused on the analysis of international environmental problems, however, policy recommendations have played only a minor role in the literature. For example, it has been extensively laid out why IEAs face a stability problem and why only moderate abatement targets will be agreed upon in a treaty. However, recommendations how this problem may be mitigated are almost lacking.",
               "Third, only few attempts have been undertaken to relate the theoretical results to actual IEAs. For example, it has been laid out that threats to sanction non-compliance are necessary to stabilize an IEA.",
               "Moreover, it has been stressed that threats must be credible. However, how credible sanctions can be designed for practical purposes is an open question."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 123,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "For details see Endres/ , ch. 16.",
               "Fourth, the link between game theory and empirical research is very loose. There are only few articles in which cost-benefit analysis and game theory are linked. Of those few papers, however, most have analyzed only hypothetical abatement targets and not those which have actually been agreed upon by the parties."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 124,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "Fifth, the game theoretical analysis has assumed in the tradition of welfare economics that a government maximizes the welfare of its country (benevolent dictator). It thereby abstracts from the decision process within a country (black box) and from other polit-economic aspects. For instance, a government is assumed to behave opportunistically and to take a free-ride whenever the gains exceed the punishment. However, in a public choice context also reputation effects may play some role in influencing a government?s decision. On the one hand, this concerns reputation of a government towards its voters and on the other hand towards other governments."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 125,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "Thus taken together, the game theoretical analysis of international environmental problems, though it is a relatively young field of research, has generated many interesting insights. However, there still remains a large field for applied and empirical game theoretical research to be treated in the future."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 126,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "head": {
               "text": "Appendix 1",
               "type": "conclusion"
          },
          "paragraphs": [
               "We prove Result 4 for renegotiation-proof strategies. According to and in the text, omitting strategies for convenience  and . In the context of global warming and Welsch (1995) may be mentioned."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 127,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "Exceptions are for instance Finus/Tj?tta (1998) and ."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 128,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     },
     {
          "paragraphs": [
               "Hoel/ and are the first who have considered reputation effects. and Endres/Finus (1998c) look at the effect of environmental consciousness on the success of an IEA and the demand of environmental concerned voters that their government should reduce emissions unilaterally in order to give a good example to other countries. However, none of these papers use a proper public choice framework."
          ],
          "paper_id": "2229dd30-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "conclusion"
          },
          "paragraphNo": 129,
          "fromPaper": "Game Theory and International Environmental Co-operation: A Survey with an Application to the Kyoto-Protocol"
     }
]