[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Data mining is comprised of many data analysis techniques. Its basic objective is to discover the hidden and useful data pattern from very large set of data. Graph mining, which has gained much attention in the last few decades, is one of the novel approaches for mining the dataset represented by graph structure. Graph mining finds its applications in various problem domains, including: bioinformatics, chemical reactions, Program flow structures, computer networks, social networks etc. Different data mining approaches are used for mining the graph? based data and performing useful analysis on these mined data. In literature various graph mining approaches have been proposed. Each of these approaches is based on either classification; clustering or decision trees data mining techni q ues. In this study, we present a comprehensive review of various graph mining techni q ues. These different graph mining techni q ues have been critically evalnated in this study. This evalnation is based on different parameters. In our future work, we will provide our own classification based graph mining techni q ue which will efficiently and accurately perform mining on the graph structured data."
          ],
          "paper_id": "2231cc70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Graph Mining: A Survey of Graph Mining Techniques"
     },
     {
          "head": {
               "text": "I. INTRODUCTION",
               "type": "introduction"
          },
          "paragraphs": [
               "Over the last few years there has been a number of research work on data mining in seeking for better performance and innovation. One innovation includes mining from structured data, which is a new challenge. Since a structure is represented by proper relations and a graph can easily represent such relations, knowledge discovery from graph-structured data poses a general problem for mining from structured data. Some examples amenable to graph mining are finding typical web browsing patterns, identifying typical substructures of chemical compounds, finding typical subsequences of DNA and discovering diagnostic rules from patient history records .",
               "Graph mining techniques have been categorized into following groups. (1) Graph clustering; is the task of grouping the vertices of the graph into clusters taking into consideration the edge structure of the graph in such a way that there should be many edges within each cluster and relatively few between the clusters? Graph clustering in the sense of grouping the vertices of a given input graph into clusters graph clustering is based on unsupervised learning technique in which the classes are not known in prior to clustering. The graph clusters are formed based on some similarities in the underlying graph structured data graph. (2) Graph Classification; in graph classification the main task is to classify separate, individual graphs in a graph database into two or more categories/classes . Classification is based on supervised/semi supervised learning technique in which the classes of the data are defined in prior. (3) Sub graph mining; sub graph is a graph whose vertices and edges are subsets of another graph. The frequent sub graph mining problem is to produce the set of sub graphs occurring in at least some given threshold of the given n input example graphs .",
               "In this study we have provided comprehensive summary details of the different graph mining techniques. Each of these techniques has been outlined with their techniques details, their major research contributions along with the limitation of the proposed techniques. These techniques have been further criticall y evaluated.",
               "The rest of this paper is organized as follow: In section II the underlying terminologies used in graph theory is provided. In section III a detailed literature review is provided on the graph mining techniques proposed in the last few decades. Section IV focuses on the critical analysis of these different graph mining techniques, whose details are discussed in section II. This study will end with the conclusion of our work with some future directions in section V"
          ],
          "paper_id": "2231cc70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Graph Mining: A Survey of Graph Mining Techniques"
     },
     {
          "head": {
               "text": "II. BASIC GRAPH THEORY",
               "type": "introduction"
          },
          "paragraphs": [
               "A graph G is a pair of sets G = (V, E). V is the set of vertices and the number of vertices n = IVI is the order of the graph. The set E contains the edges of the graph. In an undirected graph, each edge is an unordered pair {v, w}. In a directed graph (also called a digraph in much literature), edges are ordered pairs. The vertices v and w are called the endpoints of the edge. The edge count lEI = m is the size of the graph. In a weighted graph, a weight functions (j) : E -? R is defined that assigns a weight on each edge. A graph is planar if it can be drawn in a plane without any of the edges crossing . The 978-1-4673-2430-4112/$31.00 ?2012 IEEE density of a graph G = (V, E) is defined as the ratio of the number of edges present in a graph to the maximum possible,",
               "A graph of density one is called complete . The adjacency matrix AG of a given graph G = (V, E) of order n is an n x n matrix AG = (a. C: ) where",
               "The length of a path is the number of edges on it, and the distance between v and u is the length of the shortest path connecting them in G. The distance from a vertex to itself is zero: the path from a vertex to itself is an empty edge sequence. A graph is connected if there exist paths between all pairs of vertices. If there are vertices that cannot be reached from others, the graph is disconnected. The minimum number of edges that would need to be removed from G in order to make it disconnected is the edge connectivity of the graph. A cycle is a simple path that begins and ends at the same vertex. A graph that contains no cycle is acyclic and is also called a forest. A connected forest is called a tree .",
               "A sub graph G S =(S, Es) of G=(V, E) is composed of a set of vertices s ? y and a set of edges Es? E such that {v, u} ? Es implies u, v E S; the graph G is a super graph of d. A connected acyclic sub graph that includes all vertices is called a spanning tree of the graph. A spanning tree has necessarily exactly n-l edges. If the edges are assigned weights, the spanning tree with smallest total weight is called the minimum spanning tree. Note that there may exist several minimum spanning trees that may even be edge disjoint .",
               "Two graphs Gi = (Vi> Ei) and Gj = (Y;, E) are isomorphic if there exists a bi-jective (one to one) mappingfVi?Y; (called an isomorphism) such that {u, v} E Ei; if and only if (j(v), itw)} E Ei? A bipartite graph is a graph where the vertex set V can be split in two sets A and B such that all edges lie between those two sets: if {u, v} E Ei, either v E A and wEB or v E Band W E A . A complete graph is a graph where every pair of distinct vertices is adjacent. A complete graph on n vertices is denoted by Kn (or sometimes by K(n) ) and The complete graph Kn of order n is a simple graph with n vertices in which every vertex is adjacent to every other is called clique."
          ],
          "paper_id": "2231cc70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Graph Mining: A Survey of Graph Mining Techniques"
     },
     {
          "head": {
               "text": "III. LITERATURE REVIEW",
               "type": "relatedwork"
          },
          "paragraphs": [
               "This section summarizes the different proposed graph mining algorithms with their major research contributions and limitations.",
               "In , Callut et al. have proposed a new technique called D-Walks. This technique can efficiently handle the semi? supervised classification issues associated with the graphs of large size. Their technique is based on the betweeness measures. The detail of betweeness can be found in . The D? wa lks can classify the unlabeled nodes of different types of graphs including directed or undirected graphs. This classification has a linear time complexity with respect to the (1) number of edges in the graphs, (2) the maximum walk length considered and (3) the number of classes . The unlabeled nodes of the graphs are predicted by comparing its betweeness measure with that of maximum betweeness measure. The technique proposed in has been implemented on the CORA database. Then different experiments have been performed using this database. All of these experiments showed that is more efficient and can accurately classify the unlabeled nodes of the graphs and outperforms the existing techniques available in the literature such as and . Their main achievement is to handle the graphs having large number of nodes and edges as compare to and techniques",
               "In , Kashima et al. have proposed a new method that can handle the classification problem of graphs that have extremely large no of nodes and edges. Their graph classification method is based on kernel method. The details of kernel methods can be found in . The method proposed in efficiently computes the inner product of two graphs to make a feature space for classifying the graphs. This technique takes an unknown graph as input and classifies the unknown graph into an appropriate class. Their proposed method calculates the similarity of two graphs based on nodes of the graphs and labels of the edges in the graphs. In graphs are classified into same group if their similarities are identical. The technique proposed in has been implemented for the prediction of properties of chemical compound using the mutag and PTC dataset. Then different experiments have been performed using these datasets. All of these experiments showed that is not as efficient as for mutag dataset but for PTC dataset it is more efficient then existing techniques available in the literature such as and .",
               "In , Dhillon et al. have presented an efficient and fast technique for graph clustering. This technique can handles graph having large number of nodes and very large number of edges. Their graph clustering technique is based on multilevel methods using weighted kernel K-means objective function as refinement algorithms .The details of weighted Kernel k-means objective function for multilevel methods can be found in . The technique proposed in does not restricts the size of the cluster be nearly equal as compared to existing graph clustering techniques available in literature. Furthermore, the graph clustering objective functions proposed in can be specialized for all phases of the algorithm according to situation. The technique proposed in has been implemented on the IMDB Movie dataset. The dataset has 1.2 million nodes and 7.6 million edges. Furthermore different experiments have been performed using this dataset. The proposed techniques compute 5000 cluster and 5000 eigenvectors which is impractical for the algorithm in due to requirements of main memory up to 25 GB. All of these experiments showed that is more efficient not only in memory consumption but also in running time compared to the existing techniques available such as . Their main achievement is to handle the graphs having large number of nodes and edges which is impractical to be handled in existing graph clustering techniques .",
               "In , Dias and Ochi have presented enhancement in the basic Genetic Algorithms (GAs). Their proposed technique can efficiently handle the issues of graph partitioning in large graph databases. The proposed different procedure as evolutionary steps for the improvement in the performance of the basic GA. The proposed modifications in to the basic GA algorithms do not alter the global acting of the basic technique for GA. Therefore these modifications are implemented as fittings to the Basic GA. The proposed procedures in modify the local search and other diversification procedures . The proposed procedures in are implemented in 7 different versions. The performance of the proposed algorithms was evaluated for different no of nodes in graph. The results established that the proposed algorithms produces high quality clusters while maintaining the same running time as compared to existing GA in the literature. The main contribution of the proposed procedures has good performance when the no of nodes are high as 500 nodes.",
               "In , Zhao et al have proposed a new technique for mining closed free tree in large graphs. Their technique is called CFFTree (Closed Frequent Free Tree). This technique efficiently mine frequent closed free tree in large graph database whose nodes are labeled. The technique proposed in can handle the issues of mining frequent free trees in large graph database which is NP complete the details of NP problem is found in . A tree t with no designated root is called a free tree and a free tree t is closed if no super tree of t that has the same frequency of t exists. The authors suggested that closed free trees are very few in graph but can maintain the same useful information as free trees. Furthermore, they established that the computational time of closed frequent free trees mining algorithm is polynomial and closed free trees are more efficient. The proposed efficient pruning methods such as safe labeling pruning , safe positioning pruning, auto-morphisim-based pruning and canonical mapping-based pruning the details of these methods can be found in to prune free trees that cannot generate closed free tree in order to tune the mining process of closed free trees. The technique proposed in has been implemented on the AIDS antiviral screen chemical compound from Development Therapeutics program in NCIINIH. Different experiments have been performed by using this database. All of these experiments proved that is more efficient and can accurately computes free trees compared to . While the proposed technique is the only technique developed for mining closed frequent free tree in time the paper was written. The main contribution of their proposed technique is working on the novel concept of closed frequent free trees mining and designing an algorithm for mining closed trees from graph databases.",
               "In , have proposed a new method for clustering of bi-partite graph. This technique is called Coring technique. The proposed technique can handle the issues of partitioning a large graph into small sub graphs. The nodes of the clustered sub graphs are strongly interconnected within graph and weakly connected to the nodes of other graphs. Their method is called coring method that can handle both weighted and unweighted graphs. The technique in can computes clusters that have a highly dense core region and encircled by lower density region. The proposed method in works in following steps Step 1: In this step, the coring method computes the density variation sequence . The method iteratively computes the minimum density D and set of nodes having minimum density M. The output of this step is sequence of D,s and M,s. Setp2: Following step 1, the coring method identify the core nodes . To identify the method calculates the rate of decrease/increase in value of minimum density. If the rate of increase/decrease in the D value is greater than the threshold and the sequence of M is also in some order then the nodes are identified as core nodes. Step 3: In this step, the coring method partition the graph nodes into clusters. The set of core nodes is the output to the next step.",
               "Step 4: it is the final step of this technique the core groups are expended into full clusters. The core nodes are the center of the clusters and the lower density nodes are encircles these core nodes. The technique proposed in "
          ],
          "paper_id": "2231cc70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Graph Mining: A Survey of Graph Mining Techniques"
     },
     {
          "head": {
               "text": "has been implemented on the microarray dataset containing 62 samples including 40 tumor and 22 normal colon tissues. Each sample consists of 2000",
               "type": "experiment"
          },
          "paragraphs": [
               "gene expressions database. The successfully cluster the tumor tissues and normal tissues in the database further the method was evaluated using image of size 200x300 and the efficiently cluster the core region from the image. The proposed method was also evaluated for introducing noise into the image. The method successfully clusters the core region. The main strength of the proposed work is that this method can efficiently be used for noisy data.",
               "In , Chen et at. have proposed a graph model that can efficiently handle the many to many correspondences problem among concepts in ontologies. Their proposed technique used weighted bi-partite graph to model ontologies. The similarity measure is computed for the all the edges using similarity measure techniques such as in . The proposed technique, assigns the similarity degree as weights of the edges in the graph. In the proposed technique, edges of the bi-partite graph having weight greater than the threshold are maintained other edges are purged. The uses graph partitioning technique to co-cluster the vertex of the graph as concept cluster for two ontologies. The concept cluster produced by in previous step contains all common concepts from ontologies. In next step the concept cluster is used to set up mappings among ontologies. The contribution of the proposed techniques is that many-to-many mapping can be establish among ontologies.",
               "In , Barber has proposed a new graph clustering mechanism for representing graph in the form of matrix. Their proposed technique extends the incidence matrix (showing joining vertex of graph as matrix) to clique matrix. The clique matrix shows that which nodes of the graph can fonn a clique. The clique matrix can be efficiently used for graph clustering. The proposed technique executes in the following steps: (1) in first step, it calculates the maximal clique. (2) In this step, the clustering is performed by as it identified the matrix with smallest no of columns. The size of the clique is controlled by using threshold parameter that controls how large the clique should be. Their technique is successfully applied to find the large well-connected group in social network and cluster gene? expression that exists in large population.",
               "The main contribution of the proposed work is the clique matrix notation for graphs.",
               "In , Kraus et at. have proposed a new algorithm for handling the graph clustering. Their algorithm is called semi supervised divisive hierarchical Graph clustering algorithm. Their proposed technique can effectively handle the problem of clustering with having no knowledge of the structure of underlying dataset. The authors proposed a hierarchical algorithm that incorporates background knowledge into the graph. The technique in is used with weighted undirected graph. The Euclidian distance between two adjacent nodes is calculated. To calculate the Euclidian distance fonnula is given below:",
               "and the ratio is computed by dividing the distance with average Euclidian distance of all the nodes in a graph. The must link indicates that two data item must be placed in same groups, and can-not links -two data item cannot be placed in same group, are identified. Links with less weight are removed to control the chaining effect of the nodes on the clusters. To propagate background knowledge in adjacent nodes the probability of the visiting nodes with some threshold steps are calculated for two nodes and neighborhood similarity is measured for the nodes. The proposed algorithm increases the weight of the edge if two nodes are similar else the weight of the edge is decrease. Afterward, nodes with small neighborhood are removed for creating clusters. Nodes having similar neighborhood values are cluster in same group. The main contribution of the proposed work is the including of background knowledge in the clustering process.",
               "In , Schenker et at. have proposed a graph model for classification of web documents. The proposed method is based on k-NN that successfully classifies unknown documents to its respective classes automatically. The experiments on is conducted which reveals that the graph based model for document classification computation time is parallel to other vector based k-NN model. The experiments showed that for small nodes up to 30 the classification time of the proposed technique is as efficient as vector based k-NN techniques but the technique in out perfonned vector based k-NN methods for large no of nodes both in perfonnance and accuracy.",
               "In T.Ozaki et al, have proposed a new method for sub graph mining in graph-structured database. Their method is called HSG. The algorithm proposed in is based frequent hyper clique patterns; which tries to find the dependencies among graph in the large. The method proposed in efficiently mine correlation in structured database. The authors proposed efficient pruning methods based on h-confidence measures and depth-first and breadth-depth search methods, the details of these methods can be found in . The technique proposed in has been implemented on the PTE and DTP _CM datasets. The efficiently mine frequent hyperclique patterns in these datasets in reasonable time. The main contribution of the proposed work is that introduces a new concept of hyperclique to mine correlation in graph databases and proposed an algorithm to mine frequent hyper clique patterns in large graph databases.",
               "In Fatta et ai, proposed a new method for sub graph mining in large graph database. The method is called distributed algorithm. Their algorithm is based on distributed peer to peer communication framework. The can handle to very high workload in distributed manner. The distributed algorithm proposed in efficiently mines sub graph in molecular compounds, the molecular compounds have very large trees and very large no of sub graph. The first partitioned the search space dynamically to partition a large tree. In the second step the distributes the portioned tree in peer-to-peer communication framework and in the last step the distributed algorithm uses load balancing and receiver initiated methods to execute the sub graph mining process in distributed environment. To further test the effectiveness of the proposed method. The proposed technique has been implemented on the DPT dataset. Then different experiments have been perfonned using this dataset. All of these experiments showed that is more efficient and can accurately mind sub graph in highly distributed and heterogeneous environment. The method proposed in also has been tested for fault tolerant and the results showed that the proposed method has handled the situation very efficiently. The main contribution of the proposed work is that it works in highly distributed and heterogeneous environment."
          ],
          "paper_id": "2231cc70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Graph Mining: A Survey of Graph Mining Techniques"
     },
     {
          "head": {
               "text": "IV. CRITICAL EVALUATION",
               "type": "experiment"
          },
          "paragraphs": [
               "In this section we comment about the techniques, critically. The critical evaluation is based on the observation of the following metrics: parameters, technique, method, implementation, features, comparison and efficiency. The details are shown in . According to the comparison in , the work in seems to be more efficient in computation time and memory usage during the clustering process than and for classification. The model in is capable of handling larger nodes than and for clustering in a large graph in efficiency and features. The results generated from the model is however more accurate than those in and for feature support. Thus the above discussion reveals that may be more accurate for noisy data and may be more efficient for larger graphs. Multi-level Kernel k-means Mutag, PTC Reduced chaining effect; Computes yes al similarity both on label and edges Dhillon el al Multi-level Kernel k-means IMDB Movie Memory efficient 25 minutes for 1.2 yes Efficient in running time million nodes and 7.6 million edges Dias and Genetic Algorithm C++ Tracked the performance of GA for 98 % for 500 nodes yes Ochi different type of graph Zhao el al. CFFfree C++,VS More efficient for graph with large no 10 to 1.5 free tree and yes of nodes closed Leel al. Coring Method MicroArray Efficiently clustered core region in yes dataset, image noisy data Chen el al. Bi-partite graph co-clustering yes Barber Clique matrix D1MACS Clique matrix notation for graphs. no Clustering based on clique matrix notations Kraus el al. SSHGCA MicroArray Including of background knowledge in yes dataset clustering process Schenker el K-NN Yahoo News More efficient and accurate for large Yes al. C++ size graph T. Ozaki el HSG PTE, DW_CM Mine correlation in graphs No al Java Fatta et al. Distributed Algorithm PTE, DW_CM Efticient; Distributed; Heterogeneous No Java"
          ],
          "paper_id": "2231cc70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Graph Mining: A Survey of Graph Mining Techniques"
     },
     {
          "head": {
               "text": "V. CONCLUSION AND fuTURE WORK",
               "type": "conclusion"
          },
          "paragraphs": [
               "In this study, we have presented the summary information of the different graph mining techniques. These graph mining techniques are based on the classification, clustering, decision tree approaches, which are the data mining fundamentals. In addition, we also have highlighted the research contributions and found out some limitations in different research works. Consequently, this work also depicts the critical evaluation in which comparison and contrast have been taken out to show the similarities and differences among different author's works. The spatiality of this work is that it reveals the literature review of different graph mining techniques and provides a vast amount of information under a single paper. In our future work, we have planned to propose a new classification method based on graph mining technique, provide its implementation and compare its results with the different existing classification based graph mining algorithms."
          ],
          "paper_id": "2231cc70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Graph Mining: A Survey of Graph Mining Techniques"
     }
]