[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "This paper studies the impact of environment taxes and market competition on firms' choices of a clean technology. Specifically, we model two profit-maximizing firms competing with each other in a duopoly market where the firms charge the same price and face a common price-dependent demand. The firms play a two-stage game in the following sequence. In the first stage (technology game), the firms choose from two available technologies which differ in environmental emissions as well as in the fixed and variable costs. In the second stage (production game), depending on the technology choices, firms simultaneously choose optimal production quantities, given an exogenous environmental tax rate set by a regulator. We show that a priori symmetrical duopolist may choose the same or different technologies, depending on the tax rate and other parameters, and clean and normal technologies may coexist in equilibrium. Contrary to common belief, switching to the clean technology is not always a best response to an increase in the tax rate. We find that the firms' reaction to an increase in the tax rate may be non-monotone. We also show that the tax rate range for both firms to adopt clean technology is narrower than that in the monopoly case, which suggests that the regulator needs to be more precise in setting tax rate to motivate all firms to switch to the clean technology when there exist competition. relies on the assumption that production level is fixed. They show that optimal policy depends on various parameters and firm response. Reference [4] also shows that policy optimality is a function of technology parameters. A number of research focuses on the impact of specific regulatory policy on firm activities. Reference [5] studies the impact of wind-electricity supply uncertainty on firm adoption. Reference [6] studies the impact of initial allocation of emission rights on firm production. Reference [7] uses a two-stage model to study the impact of carbon tax and carbon emission right on capacity investment. They show that the uncertainty of emission right price will not necessarily lower firm expected profit. Reference [8] studies how to use environmental taxation to provide proper incentives for firms to make the \"right\" technology choices. They show that firm's reaction to an increase in taxes may be non-monotone: while an initial increase in taxes may motivate a switch to a greener technology, further tax increases may motivate a reverse switch; supplementing the environmental taxation with fixed cost subsidies and consumer rebates can expand the range of parameters over which the green technology is chosen and often close the welfare gap to the centralized solution."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "INTRODUCTION",
               "type": "introduction"
          },
          "paragraphs": [
               "Environmental issues are becoming one of the most important factors when companies make important business decisions, such as investment and technology choice. Many industries have developed various alternative technologies to reduce pollution. However how to incentivize companies to choose these technologies is not straightforward. Regulators may use various tools, such as environmental taxes, fines, subsidies, consumer rebates, and cap-and-trade mechanisms, to achieve regulatory objectives. Each of these tools may have its own pros and cons depending on specific industry structure, implementation feasibility, policy parameters, and more importantly the strategic response of the regulated bodies.",
               "References and study the impact of different regulatory policies on the adoption of new pollution-abating technologies. They rank policy effectiveness in the following order: auctioned permits, taxes and subsidies, free permits, and emission standards. Reference points out this conclusion This paper builds on , and incorporates the effect of industry competition on \"green\" (clean) technology adoption and policy design. Specifically, we model a duopolist who first make technology decisions and then compete in a Cournot quantity game, given an exogenous environmental tax rate set by the regulator. We show that the duopolist may choose the same or different technologies, depending on the tax rate and other financial parameters, clean and normal technology may coexist in equilibrium. Contrary to common belief, a clean technology is not always the best response to tax rate increases. We find that the firms' reaction to an increase in tax rate may be non-monotone: an initial increase in tax rate may motivate just one firm to switch to the clean technology, but its competitor may keep the technology choice unchanged. Further rate increases then motivate the unchanged firm to choose the green technology too. After that, tax rate increases may motivate a reverse switch, again first just one firm switches back to the normal technology, and then followed by the other one.",
               "Our findings show that market competition complicates firms' technology choices. We find that in two disjoint tax rate ranges, normal and clean technologies coexist in the market, although the \"normal\" firm has a lower profit than the \"clean\" one, it does not switch to the clean technology because if the normal firm also switch to the clean technology, it will lead to fiercer competition and even lower profit for the firm. We further show that the tax rate range for both firms to adopt clean technology is narrower than that in the monopoly case. function is a linear function, p = A -Bq, where p is the market price and the production quantity is q, A, B > 0 are constants which relate to market size and price sensitivity. For given tax rate t and technology choice i, the firm's profit by producing q units is given by Our findings are valuable to policy makers. We show that the effectiveness of environmental policies is moderated by market competition. A tax rate that induces a monopolist to adopt the clean technology may not induce all firms to adopt the technology when market competition is present. If the regulator's goal is to induce all firms switch to the clean technology, it has to set the tax rate more precisely or consider subsidizing the fixed cost or the variable cost of the clean technology.",
               "By solving Pro i (t) = max q0 Pro i (q, t), we obtain the firm's optimal production quantity as follows,",
               "The rest of the paper is organized as follows. In Section II, we formulate the model and solve the basic monopoly case. In Section III, we solve the duopoly case, and discuss the equilibrium technology choices of competing firms for given tax rates. Section IV analyzes the equilibrium in more details and discusses how the equilibrium might change with parameters. Section V summarizes our findings and discusses future extensions.",
               "As long as the environmental tax rate, t, is not too high, i.e., t(A -C i )/E i , production is always an optimal choice. To simplify the notation, let R i (t) = A -C i -E i t, and r i = R i (0) = A -C i . Hence r i /E i denotes the upper bound of tax rate that induces production, for given technology i.",
               "We make the following assumption."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "II. THE MODEL",
               "type": "modelling"
          },
          "paragraphs": [
               "In this paper, we consider the models of a monopoly and a duopoly acting in response to environmental taxation imposed by a regulator. The firms are risk neutral and make a two-stage decision to maximize their expected profits. In the first stage, the firms can either invest in a clean technology (C) that allows them to produce with higher costs but less pollutant emission or in a normal (dirty) technology (N) which produces with lower costs but emits more pollutant. Hereafter we use i, i = C, N, to denote the technology chosen by a firm. The fixed setup cost of technology i is K i , where K C > K N . For simplicity, we assume K N = 0, which will not influence our results and can be relaxed easily.",
               "This assumption states that the condition on tax rate is stricter for a \"normal\" firm than for a \"clean\" firm to start production. That is, if a tax rate is optimal for a \"normal\" firm to start production, a \"clean\" firm will also start production, but not vice versa. This assumption is reasonable since otherwise for given technology choice i, the taxes motivate a \"normal\" firm instead of a \"clean\" firm to produce. From the point of view of our model, this is not an interesting case. Actually we can verify that if this assumption is violated, the firm will always choose a normal technology in the first stage. Therefore we only consider the case r C /E C > r N /E N for the rest of the paper.",
               "In the second stage, during the production process, a firm that has adopted technology i in the first stage produces at a variable cost C i , where C C > C N . As a byproduct of the production process, the firm outputs E i pollutant per unit of its products, where E C < E N . A regulator imposes tax t for each unit of emitted pollutant. For the product market we assume a linear demand function, and use a Cournot model to describe the competition in the duopoly case. Firms maximize their expected profits by making a two-stage decision, given tax rate t.",
               "Substitute the optimal production quantity into equation and back to the first stage. After taking the setup cost into consideration, the firm's optimal profit when choosing technology i is given by First we consider a monopoly case. This is actually a revised version of where they consider a monopoly and k available technologies. Different from , we focus on the impact of competition on firms' technology choices. We consider two types of technologies, and take the regulator as an exogenous agent. The monopoly case provides a useful benchmark which we can compare the result of the duopoly case.",
               "The firm then compares Pr C (t) and Pr N (t) to determine the optimal technology choice. LetPr(t) = Pr C (t) -Pr N (t), which denotes the difference in optimal profits from different technology choices. For given t, the firm chooses the clean technology whenPr(t) > 0, otherwise the normal technology is chosen. We have the following result."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "Proposition 1. If",
               "type": "modelling"
          },
          "paragraphs": [
               ", thenPr(t) is quasi-concave with a unique maximum at . Furthermore, we have",
               "We start by obtaining the monopolist's optimal production decision in the second stage. Assume the inverse demand",
               "and decreasing for t. Therefore, we have following result. firms, the firm index 1 or 2 appears in subscript as well. We continue to use Pr i (t) to denote the optimal profit when technology i is chosen."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "Proposition 2. The clean technology is inducible if, and only if , and",
               "type": "modelling"
          },
          "paragraphs": [
               "The first stage game is schematically represented by a 22 payoff matrix as follows. Firm profits are illustrated in each matrix cell: the first is for firm 1 and the second is for firm 2.",
               ".",
               "Firm 2 C N Given the assumptions on costs and pollutant emission of each technology, we know thatPr(0) < 0. Thus, if the clean technology is inducible, we can solvePr(t) = 0 to obtain one root on , where the sign ofPr(t) switches from negative to positive, indicating a switch from normal technology to clean technology. From equation and the proof of Proposition 1, there must exist a on , wherePr(t) decreases to 0 again, which suggests at the firm switches back to the normal technology. We summarize these results in the following proposition. Region I:",
               ", a normal technology is preferred;",
               "Region II: , a clean technology is preferred;",
               "Region III: , a normal technology is preferred.",
               "Furthermore, , and ,",
               "In the second stage, given technology choices, the firms play a Cournot game and determine their production quantities simultaneously. To find the pure-strategy Nash equilibrium for the first stage game, we need to analyze the best response action of each firm given the technology choice of the rival firm. Since we are unable to predict the optimal technology choices up front, we proceed by analyzing production decisions in all possible subgames and then we solve the technology game backward.",
               "where .",
               "Proposition 3 indicates that the choice of technology is nonmonotone, increasing the tax rate may induce a firm to switch back to the normal technology. This non-monotone property is due to the higher fixed cost associated with a clean technology.",
               "is a critical tax rate where the technology choice switches from normal to clean, and is a critical rate where the technology choice switches from clean back to normal. obtain similar results, but we are more interested in the equilibrium technology choices where market competition exists, which is the main focus of the paper."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "A. The production game",
               "type": "modelling"
          },
          "paragraphs": [
               "In this stage the two firms play a Cournot quantity game. Assume a linear inverse demand function: p = A -B(q 1 + q 2 ), where q j is the quantity produced by firm j, j = 1, 2. The optimization problem for firm j, given tax rate t and the production quantity of the rival firm, , is",
               "III. THE DUOPOLY MODEL Now we consider the duopoly case where two a priori symmetric firms play a two-stage simultaneous noncooperative game. In the first stage, each firm invests in either a clean technology or a normal technology. Depending on the technology choices, three possible subgames emerge. We use superscripts to refer to the type of emerging subgames: (m) refers to an asymmetric game where one firm chooses the clean and the other chooses the normal technology, also referred to as the (C, N) or (N, C) subgame; (c) refers to the (C, C) symmetric subgame where all firms invest in the clean technology; and (n) denotes the (N, N) symmetric subgame where all firms invest in the normal technology. We use c or n in subscripts to denote each firm's technology choice. When we need to differentiate This game has a unique Nash equilibrium and the price non-negativity constraint is always satisfied at equilibrium. As in the monopoly case, we define R j (t) = A -C j -E j t, j = 1, 2. The equilibrium is fully determined by R 1 (t) and R 2 (t) as follows.",
               "Proposition 4. The production game has four possible equilibria:",
               "Case 1: when R 1 (t)0 and R 2 (t)0, the equilibrium is ; Case 2: when R 2 (t) > 0 and R 2 (t)2R 1 (t), the equilibrium is ;",
               "Case 3: when R 1 (t) > 0 and R 1 (t)2R 2 (t), the equilibrium is ;",
               "Case 4: when 2R 1 (t) > R 2 (t) > > 0, the equilibrium is show the closed-form expressions of and respectively.",
               "In each symmetric subgame, there are two possible equilibria depending on t. When t is relatively low, both firms produce a positive quantity and their profits decrease in t; whereas when t is higher than a certain level, both firms shut down. and ."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "Case",
               "type": "modelling"
          },
          "paragraphs": [
               "Case 3:",
               "4:",
               "Lemma 1 indicates that the equilibrium evolves from both production, to partial production, and finally to no production as t increase, and the \"normal\" firm shuts down earlier than the \"clean\" firm. This is because the \"normal\" firm is hit harder than the \"clean\" firm by the increase in t, due to its higher pollutant emission per production unit."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "B. The technology game",
               "type": "modelling"
          },
          "paragraphs": [
               "To solve the technology game, we first derive firm profits, given their technology choices, and then calculate which technology choices consist of an equilibrium. We shall show that the value of the tax rate, t, is crucial in determining an equilibrium."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "Lemma 2. If",
               "type": "modelling"
          },
          "paragraphs": [
               "and 2r Cr N , when , the production equilibrium is case 2, and ,",
               "In , each cell of the payoff matrix denotes a subgame production game. First consider the symmetric subgames, (C, C) and (N, N), where R 1 (t) = R 2 (t). According to Proposition 4, by symmetry, the possible equilibrium could be either case 1 or 4. The equilibrium profit for each firm is when , the production equilibrium is case 4, and , when , the production equilibrium is case",
               "3, and , when , the production equilibrium is case 1,",
               "and .",
               "Lemma 2 shows a similar pattern as in Lemma 1 except when t is small (case 1), where the \"normal\" firm produces, but the \"clean\" firm shuts down. This is because in Lemma 2, 2r Cr N , which is equivalent to , suggesting that the variable cost of the clean technology is much higher than that of the normal technology. So when t is small, the penalty on the normal technology is not significant enough to overcome the normal technology's variable cost advantage over the clean technology, and thus the \"clean\" firm cannot gain enough market share to recoup the fixed cost . The last three cases of Lemma 2 are similar to that in Lemma 1. As t increases, the competitive advantage of being \"clean\" grows. When t is above certain threshold, the \"normal\" loses its competitiveness completely and shuts down. Finally when t is extremely high, production is not profitable even for the \"clean\" firm."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "Region IV: , (N,C) (or (C, N));",
               "type": "modelling"
          },
          "paragraphs": [
               "Region V: , ."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "IV. ANALYSIS OF THE DUOPOLY EQUILIBRIUM",
               "type": "modelling"
          },
          "paragraphs": [
               "Based on Lemma 1 and 2, we shall verify which technology combination consists of an equilibrium under different parameter combinations. To do that we define and as the profit gains a firm deviating from its current technology. Define , which is the profit gain when a \"normal\" firm switches to the \"clean\" technology, given that its rival chooses the \"clean\" technology. Define , which is the profit gain when a \"normal\" firm switches to a \"clean\" technology, given that its rival chooses a \"normal\" technology. The signs of and determine whether a technology combination is an equilibrium. Based on the signs of and , the Nash equilibrium of the technology game is shown in ."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "A. Non-monotone and asymmetric technology choices",
               "type": "modelling"
          },
          "paragraphs": [
               "Proposition 5 shows that the technology equilibrium gradually changes from , to (C, N), to (C, C), to (N, C), and to as the tax rate t increases. This result suggests that the effect of tax rate on technology choice is nonmonotone: a firm will choose normal technology when the tax rate is either too small or too large, which is consistent with the result of the monopoly case. The result of Proposition 5 also suggests that, besides t, a firm's technology choice takes into consideration of the choice of its competitors: when t is not too small or too large, two firms choose different technologies; only when t takes an intermediate value, both firms choose the clean technology. The asymmetric technology-choice case is interesting since it highlights the effect of market competition on technology choice: for some t, when one firm switches to a clean technology, another firm may not follow suit, since the (C, C) choice results in a lower profit for the \"normal\" in the (C, N) choice. Therefore although the \"normal\" firm now has a lower profit than the \"clean\" firm, it may not necessarily switch to the clean technology. EQUILIBRIUM OF THE TECHNOLOGY GAME Corollary 1: For two disjoint tax rate ranges, normal and clean technologies coexist in the market, although the \"normal\" firm has a lower profit than the \"clean\" one, it does not switch to the clean technology."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "N)",
               "type": "modelling"
          },
          "paragraphs": [
               "This corollary also implies that a firm's optimal profit function may not be continuous in the tax rate t, since when its rival switches technologies, the firm's profit will drop downward."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "C)",
               "type": "modelling"
          },
          "paragraphs": [
               "When i = 1, 2, C is the dominant strategy, so the equilibrium is (C, C). When i = 1, 2, N is the dominant strategy, so the equilibrium is (N, N). When and , (C, N) and (N, C) cannot be the equilibrium, so the equilibrium is either (C, C) or (N, N). When and , the equilibrium is either (C, N) or (N, C)."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "B. Fixed Cost and Feasible Tax Rate Range for Clean Technology Adoption",
               "type": "modelling"
          },
          "paragraphs": [
               "Higher the fixed cost K c is, smaller the advantage of a clean technology over a normal technology. Thus we should expect the lower bound of the tax rate that induces the adoption of the clean technology is higher for a higher K c . Moreover Proposition 3 shows that, in the monopoly case, the length of the tax rate range over which the firm chooses the clean technology indeed decreases in the fixed cost K c . We have the following corollary.",
               "By studying the signs of and , we can map the technology game equilibria to the space of the tax rate t.",
               "Proposition 5. There exist four critical points, , , , and , which segment the values of t into five regions. In each region, the equilibrium of the technology game is as follows:",
               "Corollary 2: When the clean technology is inducible in both cases, the length of the tax rate range over which the clean technology is chosen decreases in K c , and it decreases faster in the duopoly case than in the monopoly case."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "Region I:",
               "type": "modelling"
          },
          "paragraphs": [
               ", (N, N);"
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "Region II: , (C, N) (or (N, C));",
               "type": "modelling"
          },
          "paragraphs": [
               "Market competition also has an effect on the tax rate range over which at least one firm chooses the clean technology. We observe that condition for both firms to adopt clean technology is a sufficient condition for condition (5), but not vice versa, which suggests that the tax rate range that induces all firms to adopt the clean technology is narrower in the duopoly than in the monopoly case. In duopoly case, though the tax rate range that induces at least one firm to adopt the clean technology is wider than the range that induces a monopolist to adopt the clean technology, inducing both firms to adopt the clean technology requires narrower rate range. The reason is that in the duopoly case, competition lowers the benefit for the \"normal\" firm to switch to the clean technology when its rival has adopted the same technology, thus the switching only makes economic sense when the tax rate (penalty on the normal technology) is even higher."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "Corollary 3:",
               "type": "modelling"
          },
          "paragraphs": [
               "The tax rate range for both firms to adopt clean technology is narrower than that in the monopoly case.",
               "This finding is valuable to the regulator. A tax rate that induces a monopolist to adopt the clean technology may not induce all firms to adopt the technology when market competition is present. If the regulator's goal is to induce all firms switch to the clean technology, it has to set the tax rate more precisely or consider subsidizing the fixed cost or the variable cost of the clean technology.",
               "There are many directions this paper can be extended. First it would be desirable to extend the model to many firms. Then we can study the link between environmental policy parameters and the adoption rate of \"green\" technology in industry. \"Green\" technologies increase overall production costs, thus in the long term might result in some firms exiting the market. Fewer incumbents suggests lower industry competitiveness and might be detrimental to social welfare. A model that considers many firms might help to quantify this effect. Second the regulator can be incorporated into the model as a decision maker. It might be interesting to compare how the optimal tax rate changes in response to the market competitiveness. Third this paper only studies one policy instrument, environmental tax rate. We may extend it to consider a model that collectively optimizes several policy tools under different market competitiveness, which could generate some insights that help to coordinate different regulatory tools in answering to different market conditions."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     },
     {
          "head": {
               "text": "V. CONCLUSIONS",
               "type": "conclusion"
          },
          "paragraphs": [
               "In this paper we build a model that incorporates competition into firms' \"green\" technology adoption decision. We find the non-monotone technology choice in a monopoly, i.e., a firm will choose normal technology when the tax rate is either too small or too large, still persists in a duopoly market. But more importantly we show that for some tax rate, the a priori symmetric firms may choose different technologies: one choose the clean technology and the other the normal technology, in equilibrium. The reason behind is that market competition lowers the gains for the \"normal\" firm switching to the clean technology, so it has to postpone adoption unless offered an even higher environmental tax rate. We further show that the tax rate range for both firms to adopt clean technology is narrower than that in the monopoly case. Thus a tax rate that induces a monopolist to adopt the clean technology may not induce all firms to adopt the technology when market competition is present. If the regulator's goal is to induce all firms switch to the clean technology, it has to set the tax rate more precisely than in the monopoly case."
          ],
          "paper_id": "2236ae70-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "Green Technology Choice under Environmental Taxes"
     }
]