[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "We introduce the h-degree of a node as a basic indicator for weighted networks. The h-degree (d h) of a node is the number d h if this node has at least d h links with other nodes and the strength of each of these links is greater than or equal to d h. Based on the notion of h-degree other notions are developed such as h-centrality and h-centralization, leading to a new set of indicators characterizing nodes in a network."
          ],
          "paper_id": "223d1710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "h-Degree as a basic measure in weighted networks"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Network science ) is currently gaining more and more impact in informetrics. Many kinds of typical informetric networks, such as citation and co-citation networks ), co-author networks , keywords networks , and patent networks ( ) are being studied. Providing quantitative methods to express relational data and to resolve the structure of relations, network analysis is a useful tool for investigating networks, including those with informetric content. These methods can be used to study different forms of heterogeneous relations.",
               "After the introduction of the h-index for scientists in 2005 ) its theoretical aspects have been thoroughly discussed , while its meaning has been extended to various other source-item relations. One of the important reasons for the success of the h-index is that it measures the key part of a dataset in a relatively natural way. This feature is consistent with the 80/20 rule and the power-law distribution: common phenomena studied in information science ) as well as in network studies .",
               "Hence, combining network analysis and the h-index became an interesting idea. In 2009, Schubert, ) introduced the lobby index as a centrality parameter for nodes and the h-index of a network as an indicator for complete networks . The lobby index of node n is defined as the largest integer k such that n has at least k neighbors with a degree, d(n), of at least k. The h-index of a network is defined as, \"A network's h-index is h if not more than h of its nodes have a degree not less than h\" . These indicators can be further developed leading to enriched network analysis methods in numerous applications ( .",
               "Moreover network analysis can be said to be a scientific method based on links and nodes as fundamental units. These units lead to the notion of the degree of a node which is an essential parameter in network analysis. Complex relations in networks are reflected by different numbers of links and weights, as most informetric networks are indeed weighted networks. For example, journals in journal citation networks are characterized by the number of citations they give or receive, author pairs in co-author networks are characterized by the number of times they collaborate, and the number of co-occurrences are essential in the study of co-word networks. Based on the idea of the h-index, we claim that there may be another basic degree which is suitable for the analysis of weighted networks. This idea is developed in this contribution. We use the terms graph and network as synonyms."
          ],
          "paper_id": "223d1710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "h-Degree as a basic measure in weighted networks"
     },
     {
          "head": {
               "n": "2.1.",
               "text": "The h-degree",
               "type": "introduction"
          },
          "paragraphs": [
               "In unweighted, undirected networks two nodes are either linked or not. This may be represented by the value 1, indicating that a link exists, or 0, indicating that there is no link. However, in many real networks, the strength of links is an important parameter, leading to the notion of weighted (or valued) networks.",
               "The degree of a node, denoted as d(n), is one of the most basic characteristics in network studies. Many other parameters such as those based on shortest paths and fundamental properties of networks such as scale-free phenomena ) are based on this notion.",
               "In this article we define the node strength of a node in a weighted network as the sum of the strengths (or weights) of all its links ). Often the term node degree is used in the case of unweighted networks as well as in weighted ones. In order to make a clear distinction we use the term node degree (degree of a node) only for unweighted networks. In weighted networks we use the term node strength, denoted as d s (n). Weights in a network can, moreover, be of similarity type (as in co-authorship strength) or of dissimilarity type (as distances in a road map). Moreover, in a network of cities where links are existing roads and the corresponding weight is the distance between two cities measured along roads, this definition certainly does not seem to be meaningful. In such a graph the weight is related to the reachability of a city (the larger the weights, the smaller the reachability), but, for example, when there are two different roads between cities then this increases reachability so that it makes no sense to add distances (weights). Hence, in our opinion the standard definition of node strength is not always appropriate. Consequently, our analysis is restricted to cases where this definition can be used. For simplicity we assume in this article that weights are natural numbers.",
               "The lobby index mentioned in the introduction can be adapted to a weighted network as follows: the w-lobby index (weighted network lobby index) of node n, denoted as l(n) is defined as the largest integer k such that node n has at least k neighbors with node strength at least k. shows that node strength as defined above does not distinguish between obviously different situations. Node A in only has one link with one other node; node B has 5 links with 5 other nodes. The node strengths of A and B are the same and equal to 11, although their position and role in the network are significantly different.",
               "This example illustrates that more suitable basic parameters are needed to describe structural properties in a weighted network. Definition 1 introduces a new type of degree, which takes a step in this direction. It is called the h-degree, denoted as d h , and is defined as follows. Definition 1. The h-degree (d h ) of node n in a weighted network is equal to d h (n) if d h (n) is the largest natural number such that n has at least d h (n) links each with strength at least equal to d h (n). 2.1."
          ],
          "paper_id": "223d1710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "h-Degree as a basic measure in weighted networks"
     },
     {
          "head": {
               "n": "1.",
               "text": "Comments",
               "type": "introduction"
          },
          "paragraphs": [
               "In directed networks one can define an in-h-degree and an out-h-degree. For simplicity these are not used in this article.The h-degree of node A in is 1, while the h-degree of node B is 3, illustrating the fact that h-degree can -sometimes -make a distinction in circumstances where node strength cannot.From Definition 1 it follows that a node with h-degree d h may have more than d h links, but then these other ones have a lower strength. This is illustrated in where node B has 5 links, but only three have a weight equal to or larger than 3, so that node B's h-degree is 3.In a weighted network with N nodes the highest possible h-degree is N ? 1. This happens in a star network where the centre is linked to the other nodes with a weight equal to (at least) N ? 1.In a ring where each weight is at least 2, each node has h-degree 2.In unweighted networks the h-degree of a node is either 1 (a non-isolated node) or 0 (an isolated node). Also in weighted networks isolated nodes have d h = 0.Another solution for the problem illustrated in was proposed by Opsahl, Agneessens, and Skvoretz (2010). They make use of a tuning parameter to find a balance between the number of links and the weights attached to them in a weighted network. gives another illustration of the difference between node degree (in the underlying unweighted network), node strength and the h-degree in a weighted network. Degree centralities are given in .",
               "According to Definition 1 the h-degree can be considered as a compromise between the strength of links with adjacent nodes and the amount of adjacent nodes. In a sense, the difference between the h-degree and the node strength degree in weighted networks is similar to the difference between the h-index and the total number of citations in citation analysis. Compared with the node strength, another advantage of the h-degree is that it includes more information about local structural characteristics. As shown in , if we know that node A has node strength 3, we still cannot determine the links' structure: is it like A1, A2 or A3? However, if we know a node B with h-degree = 3, this fact contains more information. First, the main part of links' structure for node B is fixed. Second, we know that this node has 3 main links and the strength or weight of each main link is not less than 3. Of course, nodes with same h-degree may still have very different structural properties. For instance, one node may have no other links besides the d h ones determining its h-degree, while another node with the same d h -value may have hundreds of other links with weight d h . As the h-degree is a summary indicator it is to be expected that information is lost.",
               "The following properties establish a relation between the h-degree and the w-lobby index. Proposition 1. A node's h-degree is always smaller than or equal than its w-lobby index:",
               "Proof. If node n's h-degree is k then node n has at least k neighbors (as it has k links). These neighbors' node strength is at least k (the link with n alone yields at least a value equal to k). Hence l(n) is at least k.",
               "Proposition 2. If node n has exactly d h (n) links then d h (n) = l(n). Proof. If n has exactly d h (n) links then its w-lobby index can at most be equal to d h (n). However, by Proposition 1 d h (n)l(n). This proves the equality.",
               "Let N denotes the total number of nodes in a network and let N a be the number of adjacent nodes of a given node. Clearly, N aN ? 1 < N. Then, the following basic inequalities hold.",
               "Proposition 3. For non-isolated nodes in a weighted network, the following inequality involving the h-degree (d h ) always holds:",
               "Proof. For non-isolated nodes, there is at least one adjacent node linked to it, and the strength of this link is larger than or equal to 1, hence 1d h . N a is the total number of links of this node, leading to:",
               "Proposition 4. If node n has node strength d s (n) and h-degree d h (n) then",
               "Proof. When a node has h-degree d h , then the minimum number of links is d h , and each of these links has at least a strength equal to",
               "Similar to node degree in unweighted networks and node strength in weighted networks, the h-degree is a basic parameter for network analysis. Based on the h-degree, relevant measures for nodes, and networks as a whole are proposed in the next sections."
          ],
          "paper_id": "223d1710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "h-Degree as a basic measure in weighted networks"
     },
     {
          "head": {
               "n": "2.2.",
               "text": "Other h-centrality measures for nodes",
               "type": "introduction"
          },
          "paragraphs": [
               "The use of centrality measures, originating from social network analysis ) has led to valuable methods in all types of networks (Bollen, Van de Sompel, . Although these methods are mainly applied to identity and characterize key nodes in a network, various centrality measures focus on different roles played by nodes in a network. The best known centrality measures are degree centrality, based on node degree, closeness centrality, based on distance to other nodes, and betweenness centrality, based on the ability of nodes to control flows in a network . These measures were originally designed for unweighted networks. For example, when calculating the closeness centrality of nodes in a weighted network, the strength of links is often ignored and the weighted network is actually converted to an unweighted network.",
               "Degree centrality of node n in an unweighted network, denoted as C d (n), is defined as :",
               "Adapting this definition to the context of the h-degree we propose the following definition.",
               "Definition 2. In a weighted network with N nodes, the h-centrality, C h , of node n is defined as:",
               "where d h (n) is the h-degree of node n. h-Centrality is just a normalized form of the h-degree. The difference between the h-degree, the w-lobby index and h-centrality is illustrated in ; values are given in . h-Degree, w-lobby index and h-centrality of . Nodes A in and b have the same h-degree and w-lobby index, but different h-centrality; the same observation holds for node B.",
               "h-Centrality measures the importance of a node in a weighted network. Moreover, because it takes the size of the network into account, this measure makes nodes from different networks comparable. When considering a node, one difference between the w-lobby index and h-centrality is that the w-lobby index of a node is based on its neighboring nodes' degree while h-centrality is based on the number of links and their strength. Some basic properties of h-centrality are given below.",
               "Proposition 5. For non-isolated nodes in weighted networks, h-centrality (C h ) always satisfies the following inequality",
               "Proof. By Proposition 3, we have 1 follows immediately."
          ],
          "paper_id": "223d1710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "h-Degree as a basic measure in weighted networks"
     },
     {
          "head": {
               "text": "Proposition 6. If a node has node strength d and h-degree d h then the following inequality holds:",
               "type": "introduction"
          },
          "paragraphs": [
               "Proof. By Proposition 4 we know that d hd. Dividing by N ? 1 yields inequality (6)."
          ],
          "paper_id": "223d1710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "h-Degree as a basic measure in weighted networks"
     },
     {
          "head": {
               "n": "2.3.",
               "text": "h-Centralization for whole networks",
               "type": "introduction"
          },
          "paragraphs": [
               "Freeman observes that there are two meanings for the notion of centrality of a network: it could mean the extent to which all nodes are central, or it could refer to the dominance of a single point. Applying Freeman's centralization procedure we take the second approach. Given a vertex centrality index F a centralization index F 1 for the whole graph G with N nodes is defined as:",
               "where MAX(G) is the maximum value attained by F in the graph G and MAX(N) is the maximum value attained by the numerator in all possible graphs with N nodes. Based on this principle we define the h-centralization of a network based on the h-degree.",
               "Definition 3. In a weighted network G with N nodes, the h-degree centralization, C h (G) of this network is",
               "The denominator of Eq. is obtained as follows. The largest possible value for MAX(G) is N ? 1 (which can be reached in a star network). Then there are N ? 1 nodes with d h = 1, and hence a difference with the largest value of N ? 2, leading to a denominator equal to (N ? 1)(N ? 2).",
               "h-Centralization describes the distribution of weights in a network. A network has a high h-centralization if, compared to the node with largest h-centrality, the h-centrality of the other nodes is low. In those circumstances the links or weights in this high h-centralization network are concentrated in the central node. The distribution of weights in this network is unbalanced.",
               "Definition 3 can also be applied to a subnetwork. An example is given based on where we consider two subnetworks, which we compare among themselves and with the network as a whole.",
               "Group 1 (G 1 ) contains five nodes (N = 5); four have h-degree equal to 1 and one, namely node E, has h-degree equal to 2. Hence for this subnetwork MAX(G 1 ) = 2. The numerator of formula is 4, while the denominator is 12. Hence C d (G 1 ) = 0.33. Group 2 (G 2 ) contains seven nodes (N = 7); it is a star subnetwork, with six nodes having d h = 1 and one node having d h = 3 (which is not the maximum possible for such a star network). Consequently, the numerator of formula is here equal to 12, while the denominator is 30.",
               "Finally, for the whole network we have N = 14; MAX(G) = 3. The numerator is 122 + 11 = 25; the denominator is 1312 = 156. Hence C d (G) = 0.16. We note that the h-index of the whole network is 2."
          ],
          "paper_id": "223d1710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "h-Degree as a basic measure in weighted networks"
     },
     {
          "head": {
               "n": "2.4.",
               "text": "Indicators for measuring the concentration of weights",
               "type": "introduction"
          },
          "paragraphs": [
               "Standard network indicators were initially designed for unweighted networks. In this contribution we introduced the h-degree, h-centrality and h-centralization for weighted networks. When taking the ratio of these two types of measures, we obtain new indicators related to the distribution of weights in a network, and this on the level of nodes as well as on the level of whole components. In this context the following indicator is proposed. Definition 4. In a weighted network, the h-ratio index R h (n) is defined as",
               "The h-ratio index R h satisfies the following property."
          ],
          "paper_id": "223d1710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "h-Degree as a basic measure in weighted networks"
     },
     {
          "head": {
               "text": "Proposition 7.",
               "type": "introduction"
          },
          "paragraphs": [
               "The following inequalities always hold",
               "Proof. This follows immediately from Proposition 3 and the definition of R h ."
          ],
          "paper_id": "223d1710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "h-Degree as a basic measure in weighted networks"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "Data collection and processing",
               "type": "introduction"
          },
          "paragraphs": [
               "Data were retrieved from the Web of Science (WoS) databases (SCI, SSCI and A & HCI) on March 23, 2011. A co-citation network derived from highly cited papers in h-index research was constructed."
          ],
          "paper_id": "223d1710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "h-Degree as a basic measure in weighted networks"
     },
     {
          "head": {
               "n": "3.1.1.",
               "text": "Method",
               "type": "introduction"
          },
          "paragraphs": [
               "(1) We obtained the 49 most-cited articles citing Hirsch's original paper \"An index to quantify an individual's scientific research output\". These papers we each cited at least 20 times. We added Hirsch' original paper to this set, leading to 50 papers. The top most-cited ones, excluding Hirsch' original article, are shown in . (2) We downloaded the details of these 50 papers, including all these papers' references, saved them as .txt, and then imported them into a software program Network Workbench (NWB) . In this way we obtained 1532 different papers (some of which are not published in WoS source journals). A co-citation network was derived based on these 1532 nodes. (3) We wrote a computer program to transform this network into the format required by UCINET )."
          ],
          "paper_id": "223d1710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "h-Degree as a basic measure in weighted networks"
     },
     {
          "head": {
               "n": "3.2.",
               "text": "Results and analysis",
               "type": "introduction"
          },
          "paragraphs": [
               "The subnetwork of the co-citation network containing those nodes with h-degree larger than or equal to 7 is shown in . The main part of the co-citation network after the removal of the links whose strength is 1 is shown in .",
               "All nodes in the sub-network shown in have not less than 7 strong links (number of co-citations7) with other nodes in the whole network. Based on the h-degree, all these nodes are important nodes in the whole network. They, moreover, . The co-citation sub-network (after removing all links with strength one). Some parameters for nodes of h-degree5 in the case study."
          ],
          "paper_id": "223d1710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "h-Degree as a basic measure in weighted networks"
     },
     {
          "head": {
               "text": "Nodes (author/year/journal)",
               "type": "introduction"
          },
          "paragraphs": [
               "Node strength h-Degree Degree centrality h-Centrality (10 3 ) R h (10 3 )",
               "Hirsch, J. E.  have strong links with each other so that the sub-network has a high density and approaches a fully connected network. Obviously, Hirsch's original paper must be among these key nodes. Visually exhibits a core/periphery structure ). Some parameters for nodes of h-degree5 are given in . clearly shows that the notions of node strength and h-degree are different. For instance: the two nodes with h-degree equal to 7 have node strengths that differ by a factor two. The node strengths of the five nodes with h-degree equal to six vary from 188 to 880. This difference can be measured by the R h indicator. The node \"Gl?nzel, W. (2006), SCI Focus\" has the largest R h -value in . This means that the weight of this node's links is concentrated (in a relative sense) in a few strong links.",
               "For all nodes in our case network, as shown in , Wilcoxon's signed rank test shows the same result: the node degree and h-degree of nodes in this network are (statistically) significantly different.",
               "One reason why network science became a hot topic during the end of last century was the fact that it was observed that links in the Internet follow a power-law distribution . Using the data of our case study, we observe that the distribution of the h-degree also follows (approximately) a power-law. This is illustrated in using a relative size-frequency log-log plot. The newly introduced network parameters for our case study are shown in . The main point made here is that the distribution of weights in our example is quite uneven."
          ],
          "paper_id": "223d1710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "h-Degree as a basic measure in weighted networks"
     },
     {
          "head": {
               "n": "4.",
               "text": "Discussion and conclusion",
               "type": "conclusion"
          },
          "paragraphs": [
               "The methodological section and the case study indicate that the h-degree and derived indicators have interesting features. First, they are more suitable for weighted networks than indicators based on the underlying unweighted network, they combine the number of links and the strength of links, and reflect more information about the links' strength and structure. Second, they focus on the most important nodes and are consistent with a power-law. Third, they inherit some merits of the h-index. For example, the h-degree is easy to calculate.",
               "However, there are also some limits on the use of the h-degree and its derived measures. In some network studies, the numerical scale of links' weight is not suitable for ranking, for instance when weights belong to the interval and certainly when weights can be negative. At this point, a numerical transformation is needed (but then scientists should agree on the exact formulation of this transformation). Second, similar to the h-index, also the h-degree may be an indicator lacking discriminatory power.",
               "The measures introduced in this paper may lead to further informetric network studies. In citation networks, the h-degree refers to the most cited nodes. In keyword networks, it points to core concepts. In co-author networks, it singles out the most collaborative authors. Using the notion of h-centralization different networks can be compared. Furthermore, the h-degree may be applied in any discipline, and in any weighted network.",
               "We conclude by saying that the h-degree, h-centrality, h-centralization and other parameters based on the h-degree provide a set of useful measures for the study of weighted networks. Similar to node strength the h-degree is a basic measure, leading to new characterizations in networks, which may stimulate further studies."
          ],
          "paper_id": "223d1710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "h-Degree as a basic measure in weighted networks"
     }
]