[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Social media sites like Facebook have recently been blamed for their negative impact on wellbeing, with support from recent research. However, certain features and mechanisms of social media sites may actually increase their users' wellbeing, and the sites may serve as platforms for positive interventions to reach large populations and improve their lives. This paper examines China's leading Social Network, WeChat, and its potential effectiveness in cultivating wellbeing among Chinese users, through a review of the literature. The paper has six sections. Part 1 presents a brief summary of Positive Psychology and Positive Interventions. Part 2 reviews research findings regarding the impact of social media on wellbeing. Part 3 introduces WeChat's design features and how they may affect the users' behaviors. Part 4 suggests six hypotheses on how WeChat may improve user wellbeing. Part 5 proposes possible ways to apply positive interventions on WeChat which would enable users to actively improve their wellbeing. Finally, Part 6 reviews how datasets from various social networks have assisted psychological and developmental research. The last section also outlines a quantitative research proposal to validate the hypothesis that WeChat makes a positive impact on users' wellbeing, and offers limitations and implications for future work. Abstract Social media sites like Facebook have recently been blamed for their negative impact on wellbeing, with support from recent research. However, certain features and mechanisms of social media sites may actually increase their users' wellbeing, and the sites may serve as platforms for positive interventions to reach large populations and improve their lives. This paper examines China's leading Social Network, WeChat, and its potential effectiveness in cultivating wellbeing among Chinese users, through a review of the literature. The paper has six sections. Part 1 presents a brief summary of Positive Psychology and Positive Interventions. Part 2 reviews research findings regarding the impact of social media on wellbeing. Part 3 introduces WeChat's design features and how they may affect the users' behaviors. Part 4 suggests six hypotheses on how WeChat may improve user wellbeing. Part 5 proposes possible ways to apply positive interventions on WeChat which would enable users to actively improve their wellbeing. Finally, Part 6 reviews how datasets from various social networks have assisted psychological and developmental research. The last section also outlines a quantitative research proposal to validate the hypothesis that WeChat makes a positive impact on users' wellbeing, and offers limitations and implications for future work."
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     },
     {
          "head": {
               "text": "A Brief Introduction to Positive Psychology and Positive Psychology Interventions (PPIs)",
               "type": "introduction"
          },
          "paragraphs": [
               "Achieving greater wellbeing is an important goal for many people around the world . People seek to boost their wellbeing in a variety of ways -through earning greater income or developing more prestigious careers, taking beach vacations, or hanging out with friends. Polling data from Britain showed people are less happy than they were in the 1950s.",
               "Despite the fact that people are three times richer, the proportion of those polled claiming they are \"very happy\" fell from 52% in , suggesting that extra wealth has not brought extra wellbeing ). What brings wellbeing, then? In the past fifteen years, research about wellbeing and wellbeing-boosting strategies has accumulated to convincingly suggest that a large portion of happiness may be under people's control through the activities they choose and through how they construe and respond to situations in their lives ).",
               "Positive Psychology was founded at the end of twentieth century as a branch of psychology which uses scientific understanding and effective interventions to develop a satisfactory and flourishing life rather than merely treating mental illness. Positive Psychology represents an umbrella term for the theories and research about what makes life most worth living , with the goal to improve human wellbeing . Wellbeing has been posited as a multi-faceted and complex construct by many researchers (e.g, Forgeard, Jayawickreme, ). For example, posits that wellbeing consists of five aspects (positive emotions, engagement, relationships, meaning and purpose, and accomplishment; \"PERMA\"). While proposes that wellbeing has three components (emotional, social, and psychological), Rath, conceptualize wellbeing as five essential elements: career wellbeing, social wellbeing, financial wellbeing, physical wellbeing and community wellbeing.",
               "During the fifteen years of Positive Psychology's development, Positive Psychology Interventions (PPI) have been created and validated through empirical research and are being applied by a wide array of positive psychology practitioners worldwide. A number of PPIs that have already been established as effective in increasing wellbeing and/or reducing negative symptoms include writing gratitude letters, counting one's blessings, using one's strengths in a new way , performing acts of kindness , and meditating on positive feelings towards oneself and others .",
               "These activities are being applied through education in schools, business organizations, the military and in coaching. Positive education seeks to embed the principles of wellbeing in how schools and teachers teach and operate . There is an emerging generation of positive businesses, ranging from start-ups to multinational corporations, where the goal of business is not solely to make profit but also to implement interventions to increase employees' relationships, positive emotion and meaning in life . Positive psychology concepts and methods are proposed as additions to the military psychologist's toolbox to improve selection, training, and preparation for and the return from combat, as well as to build new and better ways of helping military families adapt and cope with the challenges they face . Coaching is an exciting new practice focused on improving lives of people without diagnosable mental illness. It is in line with the premise of Positive Psychology to help people identify their strengths and live a greater life. A number of coaching techniques are inspired by PPIs that were validated by empirical research )."
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     },
     {
          "head": {
               "text": "How to Make PPIs Effective and Accessible",
               "type": "introduction"
          },
          "paragraphs": [
               "Across a broad variety of PPIs and their applications across contexts, there are two important components that affect the success of PPIs in raising wellbeing: the participant's motivation to seriously engage in the target activity and his/her willingness to put effort into it. found participants who self-select into PPIs to show larger gains in wellbeing and larger decreases in depressive symptoms than those who do not self-select. In another study, found that during a six-week PPI self-reported participant effort predicted increases in wellbeing over the course of the study. This implies the importance of choosing carefully from the different available PPIs in order to generate positive results. Today, while positive psychology and PPIs are being shared through books and online seminars with self-selected mass audiences, little continued effort is required in practicing positive activities. Additionally, leadership trainings at workplaces may support spending effort for chosen interventions, but audiences are also less likely to be self-selected. Life or career coaching applied in one-to-one settings with direct supervision from trained positive psychology practitioners builds on the clients' motivation and the accountability provided appears to engender sustained effort towards the chosen goals. Despite the number of coaches worldwide reaching 47,500 in 2012 as reported by the International Coach Federation (\"International Coach Federation Global Coaching Study,\" 2012), it is a small number with limited reach compared to the population without diagnosed mental illness who are in need of PPIs. This leaves a question mark about whether coaching can generate broader impact, and what other available tools or formats of PPIs could play a role."
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     },
     {
          "head": {
               "text": "In his latest book, Flourish (2012), Martin Seligman, one of the founders of Positive",
               "type": "introduction"
          },
          "paragraphs": [
               "Psychology, sets up an ambitious vision for the future: by 2051, fifty-one percent of the people of the world should be flourishing. As clear as the huge benefits of achieving this would be, it presents a huge challenge particularly when compared with the limited number of coaches.",
               "According to the most recent United Nations estimates, the human population of the world is expected to reach 9.55 billion people in the spring of 2050 (World Population Prospects, 2013), making 51% 4.87 billion people. Is this 4.87 billion goal mission-impossible? How can this be made possible with effective PPIs that are both self-selected and involve individual efforts? In an era in which technology has fundamentally reshaped businesses, communication and social lives, we may find a possible solution in fast-growing online Social Network Sites (SNSs).",
               "There's no doubt Social Networks, including Facebook, Twitter, and Instagram have been building increasingly interactive platforms, which engage larger numbers of users since their advents in the past decade. The projected number of worldwide Social Network users will reach 2.55 billion in 2017, with a diminishing growth rate (20% Year-on-Year growth in 2012, 7%",
               "Year-on-Year growth in . Even assuming conservative 2% annual growth in the following 33 years, the world will have as many as 4.9 billion social network users by 2050."
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     },
     {
          "paragraphs": [
               "These calculations illustrate the potential of social networks to engage the general public.",
               "Social networks function to drive users' communication in a way that positive psychology practitioners could utilize to deliver PPIs through feature and mechanism design.",
               "In the next section, I'll briefly summarize the latest debates on whether Facebook, the world's leading social network, is improving or harming its users' wellbeing. "
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 4,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     },
     {
          "head": {
               "text": "Social Ties, Social Capital and Facebook's Impact on Users' Wellbeing",
               "type": "introduction"
          },
          "paragraphs": [
               "Social network sites (SNSs) are technological tools that support users' need and ability to form and maintain a wide network of social connections. Popular SNSs such as Facebook, Twitter, and Instagram allow individuals to express themselves, represent their social relationships, and establish or maintain connections with others. Created in 2004, Facebook has grown its user population exponentially in the past decade and become the largest SNS worldwide today with more than 1.2 billion monthly active users . Given its popularity, Facebook has become the topic of a growing body of research in the social sciences.",
               "First, it is helpful to introduce two basic concepts: social ties and social capital.",
               "Granovetter (1973) defined two types of relationships in our lives. Strong ties are relationships associated with frequent contact and deep feelings of affection and obligation, whereas weak ties are relationships with infrequent contact, superficial and easily broken bonds and narrowly shared interests. Strong and weak ties alike provide social support in different ways. Strong social ties generally help to buffer people from life's stresses, and thus lead to better social and psychological outcomes . Nonetheless, weak ties, including weak online ties , are especially useful for linking people to novel information and social resources outside people's closest, local groups .",
               "Social capital broadly refers to the resources accumulated through the relationships among people . define social capital as \"the sum of the resources, actual or virtual, that accrue to an individual or a group by virtue of possessing a durable network of more or less institutionalized relationships of mutual acquaintance and recognition\" (p. 14). In general social capital is seen as a positive result of interaction in a social network ). For individuals, social capital allows a person to draw on resources from other members of the networks to which he or she belongs.",
               "Putnam (2000) describes two basic forms of social capital: bridging and bonding.",
               "Bridging social capital, or the benefits derived from casual connections, can also lead to tangible outcomes such as novel information from distant connections. It is related to \"weak ties,\" which are loose connections between individuals who may provide non-redundant information, resulting in benefits such as employment references . Similarly, Boase, Horrigan, found that those with a wider range of occupations represented in their social circle were more likely to get help in changing jobs or finding health information. Recently, researchers have emphasized the importance of Internet-based linkages for the formation of weak ties, which serve as the foundation of bridging social capital. Bridging social capital might be augmented by SNSs (such as LinkedIn) which support loose social ties, allowing users to create and maintain larger, diffuse networks of relationships from which they could potentially draw resources ). hypothesize that SNSs could greatly increase the weak ties one could form and maintain, because the technology is well-suited to maintaining such ties cheaply and easily.",
               "In contrast to bridging social capital, bonding social capital reflects strong ties with tightly-knit, emotionally close relationships, such as family and close friends, who might be in a position to provide emotional support or access, physical assistance, or access to 'larger' benefits (such as willingness to loan a substantial sum of money).",
               "Ellison, proposed the third dimension of social capitalmaintained social capital, which speaks to the ability to maintain valuable connections as one progresses through life changes. argues that one of the possible causes of decreased social capital in the U.S. is the increase in families moving for job reasons. Tools such as online networks enable individuals to keep in touch with a social network after physically disconnecting from it, allowing them to maintain social capital.",
               "In August 2013, a team of researchers at the University of Michigan published a paper suggesting that using Facebook (FB) might increase dissatisfaction with your life ( . The authors of this study text-messaged people five times per day for two weeks and asked people about their Facebook use and their wellbeing. The more people used Facebook at a given time, the worse they felt the next time they were text-messaged. In addition, over the two weeks of the study, the more people used Facebook, the more their life satisfaction decreased.",
               "This finding stirred criticisms about how increasingly popular SNSs impacts our daily life and wellbeing. Rather than enhancing wellbeing, as frequent interactions with \"friends\" may powerfully do, these latest findings suggested the opposite result.",
               "One possible explanation of decline in subjects' well-being is that the negative impact is driven by one's social comparison to the perceived happy lives of other friends. Since Facebook provides a platform for people to manage others' impressions of them, people tend to present themselves in a favorable way on their Facebook profile.  Users who use Facebook more tend to attribute the positive content presented on Facebook to others' personality, rather than situational factors, especially for those they do not know personally. The analysis of 425 respondents indicated that those who have used Facebook longer agreed more with statements indicating that others were happier, and agreed less that life is fair.",
               "Similarly, users spending more time on Facebook each week agreed more that others were happier and had better lives. Furthermore, users who included more people whom they did not personally know as their Facebook \"friends\" believed them to have better lives. These findings made the researchers surmise that comparisons with friends hurt happiness. Spending time on",
               "Facebook can be associated with thinking that other people are living happier and better lives than you, and this is especially true for those who include people they have not met personally among their Facebook friends.",
               "Ellison, Steinfield and Lampe  with Facebook use and also allow its users to practice PPIs. The following section will introduce WeChat facts and features."
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     },
     {
          "head": {
               "text": "Developed by China's largest listed Internet company, Tencent, WeChat -known as",
               "type": "introduction"
          },
          "paragraphs": [
               "Weixin in China -was launched in January 2011 and has grown exponentially in China in the absence of major global competitors (Facebook, the world's biggest social network, with its own messenger app, is blocked by the Great Firewall 2 , as is Twitter are functions that allow you 1) to speak to a group of friends (turning your phone into a walkietalkie) which enables convivial and efficient connection with university friends, family members and interest groups, and 2) to chat one-on-one using quick audio snippets instead of textextremely useful when you are too distracted to concentrate on writing an SMS, or if you're writing in Chinese characters, which is cumbersome and takes longer using a standard alphabet.",
               "WeChat post, you're prompted to upload photo first, only after this step, the text input area opens; 4) allowing only mobile access. illustrates the two major functions of WeChat. shows a side-by-side comparison of WeChat and FB user features. to C's posts."
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     },
     {
          "head": {
               "text": "No Yes",
               "type": "introduction"
          },
          "paragraphs": [
               "Photo-dominant"
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     },
     {
          "head": {
               "text": "Photo/Text",
               "type": "introduction"
          },
          "paragraphs": [
               "Photo upload first when drafting new  . Differences between countries in response to the question \"Which social messaging app do you use at least once a week?\" Taken from On Device Research (2013)."
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     },
     {
          "head": {
               "text": "Six Hypotheses on How Wechat Improves Users' Wellbeing",
               "type": "introduction"
          },
          "paragraphs": [
               "How exactly do WeChat features possibly impact its 400 million users and their wellbeing? Below are six hypotheses.",
               "Strong-tie based Community. WeChat activates and strengthens connection with strong ties, and strong-tie relationships are good for physiological and physical health in general . People receive most of their social support from people with whom they are in most frequent contact, and bigger favors are offered by stronger ties ). proposed that strong ties with friends and neighbors are related to indices of psychological wellbeing, such as self-esteem and satisfaction with life. They serve as a buffer during tough times and provide a buffer against the effects of stress. Strong social relationships are also a vital component of physical wellbeing. There is compelling evidence that strong relationships contribute to a long, healthy life.",
               "A meta-analytic review based on 148 studies conducted from January 1990 to January or insufficient social relationships, indicating that maintaining relationships with close friends and family are important not only to our quality of life, but also our longevity (Holt-Lunstad, less satisfaction and can even lead to paralysis. Schwartz notes people are constantly being asked to make choices, even about the simplest things. The incredibly wide array of choices force people to build up some mechanism to eliminate a lot of choices quickly and these mechanisms sometimes leave people feeling as though they did not necessarily make the best choice, but just one of the good choices. Such self-doubt and anxiety do not contribute to happiness. Facebook has revolutionized how people relate to one another by allowing users to quickly amass hundreds of \"friends\" without physical distance barriers, but the following experience of managing interactions within the hard-wired limitation described by Schwartz, by either screening newsfeed information or selecting acquaintances, will consequently bring about anxiety caused by an overwhelming amount of choices.",
               "More specifically,  With an emphasis on constructing meaningful and close relationships, it may be worthwhile to restrict the amount of people we can friend. A SNS such as WeChat is less likely to induce negative experiences through being overwhelmed with a huge friend list in excess of the human capacity for relationship management because of its focus on strong-tie based relationships.",
               "Capitalization. The intimacy and privacy WeChat incubates may cultivate more positive experiences for both content sharers and viewers. In terms of general cultural trends, individuals in Western cultures value achievement and independence with the view that the self is the center of action, thought, and motivation. In contrast, East Asian cultures value interdependence and connectedness with others . In Eastern culture, sharing personal success or happiness often damages social relationships as it may result in negative consequences, as it is being perceived as bragging, invites jealousy or unfavorable social comparison ). As a result, Chinese people are generally conservative in announcing their happy life events. WeChat, by fostering a strong-tie based relationship, connects us with our close, supportive and trustworthy friends and family. In this way, the concern of soliciting negative consequences and damaging relationships is reduced, and hence, more Chinese people are posting their happy events on WeChat then they would given a more public audience.",
               "In psychology, this behavior of sharing one's positive events is termed capitalization.",
               "Gable, Reis, Impett, and Asher (2004) suggest that capitalization leads to increases in positive affect, greater life satisfaction and greater belongingness, because such action prolongs the positive impact the positive moments bring. Chou and Edge's (2012) Facebook study suggested constant positive statuses from people we do not know in person caused negative upward comparison, hence diminishing people's happiness. WeChat has less of that problem because users are not connected to as many people they do not really know. It thus appears that the strong social tie network structure on WeChat encourages sharing of positive experiences allowing for capitalization, while at the same time reducing negative upward comparison across weak ties. emotions. Following this theory, if WeChat encourages the posting of positive content as stipulated above, we could speculate that further sharing of positive experiences is stimulated through positive emotional contagion.",
               "Powerful Visuals. WeChat's User Interface (UI) design requires users to upload photos first when composing a post, which may increase the effectiveness of emotional communication.",
               "Even though WeChat allows direct text input entry, a number of functions such as \"@ friends\" or adding emoticons are removed to discourage text entry. Moreover, you cannot insert photos into the post if you start with text. In this way, users on WeChat are \"trained\" to either take and post photos or search images online to accompany their text statement. According to , Mobile savoring. WeChat seems to make users savor more. suggests that we don't always respond to \"good things\" that happen in our life in ways that maximize their positive effects on our lives. Savoring in psychology refers to mindfully engaging in thoughts or behaviors that heighten the effect of positive events on positive emotions . WeChat allows only mobile-based entry to encourage and enable users to capture the best on-the-go occasions and immediately share them with others, which is one of the key strategies of savoring ( ). Moreover, the photo-pro feature enables users to actively store images for future recall. research found that reminiscence on past happy events will rekindle happy feelings. Further, the authors studied people's emotional experience when reminiscing with cognitive imagery (photographs or scrapbooks) or memorabilia (souvenirs), and found that groups reminiscing using cognitive imagery reported greater increases than the memorabilia group. Based on this theory, the way WeChat encourage users to take and upload more photos on more occasions will not only record these happy moments, but also enable stronger positive feelings when these users recall events in the future. to an important person in one's life, and discovered that test participants who did gratitude visits showed the largest wellbeing boosts -that is, they were much happier and much less depressed -and these boosts were maintained one week after the visit and even one month after.",
               "Interestingly enough, such expressions of gratitude are being voluntarily applied by some",
               "WeChat users as shown in  \"Rucy is a girl with substance. Her copywriting is like a free-flying kite, free, wild and elegant. For her, you just don't need to tell her where to fly.\"",
               "\"Salis talks little but works hard! He's definitely a blue chip and progresses steadily. He is building a very solid foundation in his career and is on track to be a super star in the near future.\"",
               "\"Jacqueline left Shanghai to take oversea study in US. She enjoys reading, scuba diving, and loving others. Life is short, she has truly lived it up. Many people are busy without a clear goal, but Jacqueline knows when to pause and live a happy and purposeful life.\"",
               "\"Catching a chance to be free, be yourself, be the decision maker, and be the one who picks his client. This is Andrew, the founder of Wenming Advertising Agency, who always finds best pleasure and fulfillment during the journey.\"",
               "\"Handsome Arthur is our creative head, a banker and a singer. He loves reading and is very sporty. He is also wealthyso seems he's perfect in every aspect! He must have some weaknessI guess, but they're just so hidden so I never see them. I'm jealous!\"",
               "Another simple way of increasing happiness is through the \"three blessings\" exercise. found that test respondents who recollected three things that happened during the day about which they felt grateful and happy, as well as why they believed they happened for just one week were happier and less depressed one month, three months and six months later. Despite our natural focus on what goes wrong in our daily lives and our quickness to notice even the smallest of problems , this \"counting your blessings\" exercise simply but powerfully directs our attention to notice the good things in our lives and get the more from them. Anecdotal evidence suggests that WeChat users, motivated by its highly private and intimate friend network settings, are more readily sharing the blessings they count regularly. A friend of mine, Yihong, deliberately shares weekly \"three blessings\"",
               "posts, reviewing her development, accomplishments and happy moments in her life and that of her family. Despite living in a long-distance relationship with her husband and taking care of two kids on her own, she told me she was able to focus more on the cheerful time of her husband's weekly visits and her kids' development at school (see below for a flavor of",
               "Yihong's post entry). Yihong's \"counting blessings\" WeChat journal.",
               "Translation of two post entries: \"My positive psychology journal: 1) advanced the newborn's bedtime from 11pm to 10pm for two days. This 50-day old baby can sleep 4 to 7 hours a night. It seems it will be easy to hand her over to her grandma; 2). Mom's eye vision recovered fast after surgery and became the best among our family members. She's now very positive and proposes to take care of my kids in S'pore; 3) When mom got sick suddenly, my husband and I were put in a torturous test to develop our baby-sitting and caring skills quickly. It was tough especially when we had different ideas. Fortunately, we made it and learned lot through the process; 4) Again, because of Mom's absence, I had to review books to figure out how to best take care my two kids, and I'm happy with my progress; 5) Meeting a few close friends and catching up, feeling great!\"",
               "\"My positive psychology journey 1) based on my two-week experiment, I find my productivity and sleep quality are significantly improved without using Taobao (Amazon's equivalent) and Weibo (Twitter's equivalent). I decided to continue not to use them, for health and self-regulation; 2) Our nanny suddenly took sick leave, leaving me and my husband a mess. Fortunately we figured out a solution together and learned how to be resilient and stay positive in this adversity;",
               "3) The mosquito bite on Niuniu's head is cured; 4) Discussed Montessori with my friend from the education industry, got some inspiration and will start reading books around absorbent mind.",
               "While not being the result of overt direction, these actions on WeChat are voluntarily "
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     },
     {
          "head": {
               "text": "Growth of Social Network and Big Data",
               "type": "introduction"
          },
          "paragraphs": [
               "Thanks to the increasing popularity of multiple SNSs, a vast amount of data sets with hundreds of millions of people and their behaviors and interactions have become available for intensive analysis and to inform decision making (National Science Foundation, 2012, para. 4).",
               "Researchers and computer scientists have developed technical methods to process the large volumes of data and use it to study human psychology and development. Online SNSs such as",
               "Facebook, Twitter and Google queries are deemed promising resources for research about people, as the interactions and shared updates about the self are spontaneous, emotionally salient and personal . They have proven useful for tracking mood variation across seasons , predicting the stock market , and providing earlier indication of influenza epidemics ( .",
               "Since this paper aims to discuss the role of SNSs in impacting their users' wellbeing and possible PPIs applied through SNS platforms, we focused on reviewing the various approaches and evolving methods in investigating human wellbeing and identifying PPIs. Traditionally, psychology research conducts correlational studies to identify the emotions, cognitions, and behaviors that distinguish happy and unhappy people (e.g. ), and then these potentially wellbeing-promoting thoughts and behaviors are developed in interventions that can be tested against neutral control activities to see if they make a difference (e.g., . Although these studies have improved our understanding of human wellbeing, they have relied heavily on small samples of hundreds of undergraduates or adults who are not necessarily representative of the larger population . That is now changing with increasingly popular online social media that not only allows social scientists to unobtrusively study self-descriptive content in real time , but also makes the collection and analysis of massive amounts of data sets across large and diverse populations possible ( ).",
               "In their study of expression of personality on Facebook,   shows the words and phrases most correlated with each age group, split across gender. The size of the word/phrase reflects the size of the correlation. on Twitter over long time periods, Dodds et al. were able to find a number of dates with noticeable differences in language taken to indicate happiness levels compared to nearby dates.",
               "Positive days occur mainly on annual religious, cultural and national events, whereas negative days on unexpected societal or natural traumatic events. This correlational analysis helps to potentially infer activities or experiences related to wellbeing.",
               "SNS-based big data studies lay a foundation for future psychological research to better measure and understand the subjective wellbeing of large populations, and allow researchers to dig into specific behaviors and activities that are positively correlated with well-being for specific demographic segments. In addition, using similar methods there is the potential to replicate these studies across regions for a cross-cultural comparisons, as the behaviors expressed through topics and key words and phrases related to well-being may differ across various cultures."
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     },
     {
          "head": {
               "text": "Proposal for Quantitative Research on WeChat",
               "type": "introduction"
          },
          "paragraphs": [
               "Currently, WeChat has not released any user data other than gender and location to the public, presumably due to user privacy concerns. This is the major reason that this thesis based upon a literature review rather than a quantitative analysis. However, with growing maturity of the product and demands for commercialization and monetization, it's highly likely that WeChat will share more user data with third parties in the near future. Therefore, I propose and outline a quantitative research plan in anticipation of the to-be-released user data which could validate WeChat's positive impact to users' wellbeing by analyzing what kind of usage behaviors are most associated with various demographic segments, and evaluating how proven PPIs could increase users' LS."
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     },
     {
          "head": {
               "text": "Replicate Facebook /Twitter study conducted by Schwartz et al. (2013). We exclude",
               "type": "introduction"
          },
          "paragraphs": [
               "mapping of geographic wellbeing due to the unavailability of prefecture-level LS data in China.",
               "We aim to recruit 100,000 WeChat active users who access WeChat more than one time a day, log-on for more than sixty minutes and post/comment more than three times a week. We would collect their demographic data (gender, age) and socio-economic status (education, income).",
               "Tweets (posts and comments) from a twelve month period will be collected and aggregated. We will then use Differential Language Analysis to identify the distinct words, phrases and topics that distinguish people based on their gender, age, education and income."
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     },
     {
          "head": {
               "text": "Evaluate whether and how WeChat's usage impacts their users' wellbeing. In addition",
               "type": "experiment"
          },
          "paragraphs": [
               "to the analyses described above, we add another dimension -users' wellbeing measured by the PERMA profiler before, during and after a twelve-month study period. Ideally, we hope to recruit 5,000 non-WeChat users and study whether their wellbeing increases or decreases after using WeChat for twelve months, controlling for other factors.",
               "However, the fact that there are already 396 million WeChat users (29% of China's population 4 )",
               "may make it a challenge to find a sufficient number of non-WeChat users. In this case, we propose to collect WeChat users' usage behavior data such as how long/when they log on, as well as how many posts, comments and likes they share. By analyzing correlations between users' wellbeing and their usage behavior we hope to find the optimum way of using WeChat which leads to positive psychological outcomes. Moreover, using available demographic and socioeconomic information, we can further break down the information gathered to understand what type of WeChat usage behavior is positively corrected with wellbeing within each user segment.",
               "Assess how positive interventions such as the \"gratitude letter\" and \"counting your blessings\" impacts users' wellbeing. For each intervention, we will recruit 1,000 active WeChat users to practice each intervention on daily basis for one month and track their wellbeing results weekly across the study period, as well as one week, two weeks, one month, and three months after the study. We hope to find out whether engaging in interventions will increase users'",
               "wellbeing and how long that impact may last. If the result is positive, this will form a solid ground to recommend to WeChat to launch programs or apps that will engage users en masse to participate and hence improve their wellbeing.",
               "Despite the unavailability of WeChat user data at this stage, we believe that the research proposed above could have an impact on the future design and management of WeChat. We hope our proposal brings awareness and urgency to the decision makers at WeChat, demonstrates that their platform carries immense potential to improve hundreds of millions' lives, and that our research can offer an important key to helping them find out how to do so."
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     },
     {
          "head": {
               "text": "Conclusions and Limitations",
               "type": "conclusion"
          },
          "paragraphs": [
               "Increasing popularity of online Social Networks have made massive amounts of user data available and accessible. Psychology researchers have teamed up with computer scientists to develop new methods to efficiently manage and analyze massive behavior, language and interaction data generated from social platforms, and draw conclusions and implications for human development and psychological science. With due regard to controversial findings around SNSs' impact on human flourishing suggesting Facebook usage may undermine users' wellbeing ( , this paper discussed how the leading SNS in China, WeChat, may positively impact to users' wellbeing. The strong-tie based community, selective friend list, increased chance of capitalization and of savoring experiences, and the encouragement of visual communication are hypothesized as key processes towards increased happiness for WeChat users.",
               "Furthermore, anecdotal evidence suggesting WeChat users self-initiate positive interventions (e.g. through writing gratitude letters and counting three blessings) points towards the opportunity to further study the potential for effective PPI delivery through WeChat. The limitation of this paper lies in its lack of quantitative analysis due to unavailability of data. We propose to empirically validate the above hypotheses and observations through a quantitative research design in the near future, once WeChat provides opportunities to share user data. Ultimately, we hope to inform SNSs and their vast number of users about how to improve well-being."
          ],
          "paper_id": "224ca770-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "ScholarlyCommons How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing A Capstone Project Submitted In Partial Fulfillment of the Requirements for the Degree of Master of Applied Positive Psychology HOW WECHAT CULTIVATES WELLBEING 2 How WeChat, the Most Popular Social Network in China, Cultivates Wellbeing"
     }
]