[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "A learning network is a network of persons who create, share, support and study learning resources ('units of learning') in a specific knowledge domain. Such networks may consist of a large number of alternative units of learning. One of the problems learners face in a learning network is to select the most suitable path through the units of learning in order to build the required competence in an effective and efficient way. This study explored the use of indirect social interaction to solve this problem. Units of learning that have been completed successfully by other comparable learners are presented to the learners as navigational support. A learning network is simulated in which learners search for, enrol in and study units of learning, subject to a variety of constraints: a) variable quality of the different units of learning, b) disturbance, i.e. interference by priorities other than learning and c) matching errors that occur when the entry requirements of the selected unit of learning do not align with the pre-knowledge of the learner. Two conditions are explored in the network: the selection of units of learning with and without indirect social interaction. It was found that indirect social interaction increases the proportion of learners who attain their required competence in the simulated learning network."
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "One of the aims of using Internet technologies in education and training is to develop more flexible, adaptable and interoperable learning resources than are currently available. By using technologies, learners will be able to access learning resources anywhere, at any time and from a large variety of suppliers. Schools, universities and companies are already providing more and more courses, workshops and other learning resources via the Internet. Learners themselves can create and share resources such as blogs, reports, theses and personal websites that others can then use to learn. In principle, all these resources (called 'units of learning', UOLs) can be found using Internet search engines, but regardless of the knowledge domain, such search engines will turn up large numbers of more and less adequate results, causing selection problems for learners. Furthermore, when a students enrols in an Internet course with provider X and later takes another course with provider Y, there is little continuity: assessment results are not carried over, the social environment is different, and there is no learner support beyond what the individual institution has to offer.",
               "Learners searching for learning resources will have two basic questions:",
               "Given my current knowledge and competences, and given my personal characteristics, preferences and circumstances:",
               "1. When I want to learn more about topic X, or want to build up more competence in domain X, what UOLs can I study best and in what order?",
               "2. I have recently finished studying UOLs . What unit or units of learning, or set of UOLs, are suitable to continue my studies?",
               "The answers to these questions are currently provided within the context of a single educational or training institute. Students typically select the most adequate institute and the student services or the curriculum within that institute provides the answers. However, Internet technologies essentially offer an additional, broader context in which learners can review what multiple providers have on offer on the Internet to select the best possible solution at a particular point in their lives. This includes the possibility of communicating and sharing resources with other people who are interested in the same subject. We refer to a group of persons who create, share, support and study a distributed set of UOLs in a specific knowledge domain as a Learning Network or LN ( ). Such networks support seamless, widespread access to learning facilities at work, at home and in schools and universities. The use of ICT networks implies the development of new ways of organising learning facilities that go beyond course, programme, and institution-centric models and envisage a learner-centred, learner-controlled model of distributed lifelong learning.",
               "An LN is more than just a searchable collection of UOLs. It should also have an organisation that controls the network's behaviour with respect to: access, quality, community policies, learner data, interoperability standards, and so on. In small networks, this organisation can be controlled by the management of an institute, but in larger multi-institutional and international networks it is more likely that these systems are self-organised. A self-organised system acts without centralised control. Di Marzo define self-organisation as the mechanism that controls the structure of a system or its organisation through the internal, local interactions between its components. These interactions give rise to properties that transcend those of the individual components in the system. Well-known examples can be found in social insect studies, for example the foraging behaviour of ants or their ability to sort eggs without any ant knowing the sorting algorithm ). The basic principle underlying this behaviour is called indirect social interaction or 'stigmercy' in biology . The theory of stigmercy describes the use of asynchronous communication between actors mediated by environmental changes. Ants, for instance, use a chemical substance called pheromones to leave trails in the environment from their nest to a food source. This mechanism is a critical aspect of this study, and will be explained in more detail in the next section.",
               "The objective of the research described in this paper was to explore how we can use the principles of indirect social interaction to help lifelong learners navigate in a learning network with multiple providers of UOLs. A simulation study was conducted in which the learning network was modelled, including a mechanism to provide learners with advice based on indirect social interaction. The focus of the advice was on the first question posed earlier: \"When I want to learn more about topic X, or want to build up more competence in domain X, what UOLs can I study best and in what order?\".",
               "The hypothesis was that introducing an indirect social interaction mechanism to support the selection of suitable UOLs will increase the proportion of learners who attain their study target in a learning network for lifelong learning.",
               "The idea is that indirect social interaction will advise learners to select a path that has been shown to be effective. This is particularly significant when learners must choose between different alternative paths in the network, all leading to the same targets, but having different chances of success. Through indirect social interaction, the path that the learners ultimately follow is expected to converge with the path that offers them the greatest chance of success.",
               "We will begin by discussing the basic concepts of the conceptual model for the simulation in more detail: the principles of lifelong learning, the representation of a learning network, the principles of self-organisation and indirect social interaction, and the basic model for target attainment and dropping out in a learning network. We follow this discussion with a description of how the model was implemented in the simulation package. Finally, we conclude by presenting and discussing the results of the simulation runs."
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "Lifelong learning",
               "type": "introduction"
          },
          "paragraphs": [
               "Lifelong learning is defined as the activities people perform throughout their life to improve their knowledge, skills and competence in a particular field, given some personal, societal or employment related motives ).",
               "There are several specific characteristics of lifelong learning that have to be taken into account when developing LNs (see ). The major characteristics of lifelong learning are already contained in the phrase itself: it is \"lifelong\" (from cradle to grave) and puts \"learning\" (and not instruction) centre-stage. Knowledge and competences grow during one's life in different fields, and learning facilities should offer the possibility of supporting the lifelong building of knowledge and competences at different levels of proficiency in a given field. There are several implications that can be summarised as follows.",
               "First of all, putting the learner centre-stage means that the learner-and not a teacher or an instituteis responsible for his/her own learning processes (see also Shuell 1992; Longworth 2003). Lifelong learners are self-directed , and can perform different learning activities in different contexts at the same time. For learners to be self-directed, they must be in a position to oversee what is available and determine how this matches their needs, preferences, prior knowledge and current situation. One of the basic requirements is to be able to search for adequate UOLs and to plan suitable learning paths through these UOLs.",
               "Secondly, learners are typically engaged in a variety of formal and informal learning activities during their lifetime. This implies that the task of providing lifelong learning facilities cannot be entrusted to a single institute, but has to be seen as the collection of UOLs provided worldwide by different providers in a specific field and over time. However, lifelong learners need a single point of mobile access to distributed information about the UOLs on offer, and -to avoid overload -they should receive help in selecting the most suitable solution, given their needs, prior knowledge and current situation. Ideally, information about learning facilities should be amenable to digital processing, thereby facilitating Learning Brokerages ) able to mediate between learners and learning providers to identify the most appropriate steps to be taken at any point in the learner's lifetime.",
               "Thirdly, the participants in an LN in any given field have different levels of competence, varying from novice to top expert, and from practitioner to researcher and developer. Traditionally, the heterogeneity of the student body has been reduced as far as possible by providing clear entry requirements and using cohorts of groups that are considered homogeneous. Lifelong learning opens the door to exploiting the heterogeneity of learners by setting up learning communities in which novices collaborate with more experienced people. An approach of this kind is described by ; in their description, novices are positioned in a more peripheral role and experts in a more central role when they solve a problem jointly.",
               "Fourthly, it is necessary to maintain a consistent, standard record of an individual's growth in competence in order to ensure that learners can search for new learning facilities that match and extend their current knowledge. One approach that is currently the subject of great interest is the definition and use of portable digital portfolios. These portfolios are owned by the learners themselves and are used and updated over a lifetime, across informal and formal education and training )."
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "Representation of a Learning Network",
               "type": "introduction"
          },
          "paragraphs": [
               "An LN can be modelled as a two-mode graph with the node types 'participant' and 'UOLs'. The participants are persons who can have a variety of roles in the LN, for example learner, provider, teacher, assessor, tutor, mentor, etc. Participants who study UOLs are called learners. The UOLs can be any resource or event that will help them to learn something in the given knowledge domain. Examples are courses, web logs, workshops, websites, conferences, and discussions in the given domain. Any participant can create new UOLs, can search and select UOLs or can study UOLs.",
               "When using the LN, learners travel from assessment node to assessment node (AN to AN). The path of ANs completed sequentially over time by an individual learner is called a learning track. A track represents the actual behaviour of learners. Paths through a Learning Network that are planned beforehand are called routes. In traditional education, teachers or instructional designers are responsible for this route planning (e.g., curriculum planning). Lifelong learning may, however, involve a different approach. Learning tracks can be shared between the learners in an LN. This can be a single track or an analysis of the aggregated, collective tracks of a set of learners to determine the most successful routes. This data is expected to help learners 'navigate' in the LN and is a form of indirect social interaction.",
               "Another concept in an LN is the learner's position in the LN (in , the set {a4, a8, a10}). This is defined as the set of ANs marked as completed in the LN, based on the actor's portfolio. The learner may not necessarily have completed the ANs specified; he or she may have already met the objectives associated with the ANs in some other way (e.g., as a result of exemptions arising from previous study or work experience). A target is any set of ANs that takes the learner to a particular level of competence or expertise in the domain (in the set {a1,, a8}). These targets and connected competence levels may be selfdefined (e.g., step-by-step) or may be predefined in the network.",
               "A target can be associated with one or more formal assessments to certify knowledge or a competence. This can either involve an additional, specific kind of AN, or it can be integrated into one or more ANs. The discrepancy between the set of target nodes and the set of position nodes defines the set of ANs that a learner has to complete to reach the target. shows this to-do list as the set {a1, a2, a3, a5, a6, a7}. Once this list has been drawn up, a sequence of learning steps can be established by deciding on the order in which the ANs are completed (e.g., first a3, then a1 and a5 simultaneously, then a2 and a7 simultaneously, and finally a6). This decision can be based on the tracks of other successful and comparable learners in the LN. A learner can also follow a more exploratory route or can change routes on demand. Ultimately this will also create a track that can be shared."
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "Self-organisation and indirect social interaction",
               "type": "introduction"
          },
          "paragraphs": [
               "Self-organisation relies on four basic mechanisms according to Bonabeau, Dorigo and Theraulaz (1999): 1. Multiple interactions between the actors in the system. Self-organisation is not optimal if the learners do not interact with each other, e.g., as in a self-study system without interaction. Selforganisation is a basic requirement for the next three mechanisms.",
               "2. Positive feedback. These are rules that govern the creation of a structure by amplifying certain behaviours, e.g., recruitment to study a certain UOL by informing learners about the paths taken by others.",
               "3. Negative feedback. This feedback counterbalances the positive feedback by means of mechanisms such as the enrolment restrictions for a certain UOL.",
               "4. Amplification of random fluctuations. To facilitate the discovery of new solutions (e.g., new UOLs), and to prevent convergence of suboptimal solutions (so-called suboptimal convergence) when better ones are available, some randomness in the behaviour is crucial in a self-organised LN.",
               "The interactions between the actors in a self-organised system can be direct or indirect. Direct interactions are, for instance, communication between learners as they study an UOL. Indirect interaction (stigmercy) occurs when an actor changes the environment and another actor perceives this as a signal to take some action. The principle of stigmercy can be illustrated by the example of ants in a colony interacting when foraging for food. Their interaction is based on a chemical substance called pheromones which they deposit in their environment and can be smelled by other ants. Pheromones can be aggregated (the more ants leave the substance along the same track, the stronger the signal) and can evaporate (the signal becomes weaker as time passes). The behaviour of ants while foraging for food can be described in the following way (Dorigo, Di Caro and Gambardella 1999):",
               "persons available who have already completed all 10. That is less likely than when the information is based on a set of 2 UOLs.",
               "4. The calculations must be as efficient as possible. Because of the large numbers of possible participants and UOLs in the network, a combinatorial explosion can occur if the calculations are not efficient.",
               "The procedure we designed following these requirements is presented in the implementation section."
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "Drop-out and Motivation",
               "type": "introduction"
          },
          "paragraphs": [
               "The aim of this study is to increase the proportion of learners who attain their target. Stated differently: the aim is to reduce the drop-out rate. Learning Networks share common characteristics with open and flexible distance education systems that use technologies to mediate communication with learners. These institutes are known to have high drop-out rates, an issue that has been studied extensively in the past. have stated that 53% of all drop-outs are caused by an external situational disturbance, for example job changes or other social, economic or physical priorities that interfere with the student's intentions. In a study conducted by , this was found to be as high as around 70% for distance education settings. The model developed by is well known and focuses on the decision-making process of university students. The model states that there is a strong correlation between social and academic integration, which influences the student's commitment to the university, and that this in turn influences his or her decision to drop out or to persist. Social integration is the amount of support that a student gets from his peers, and academic integration is the student's commitment to the objectives of the study and the policies and communication within the institute.",
               "The early drop-out models developed by , and are all based on the average 24 year old student in residential education. As a result, these models do not make sufficient allowance for external factors that influence more flexible, lifelong learning situations.",
               "Another more recent and competitive model explaining drop-outs in education is defined by the selfdetermination theory (SDT, see . It centres on the concept of motivation: when a student is no longer motivated, he or she will drop out. The theory states that it is intrinsic to human nature to be motivated to learn, but that motivation can be strengthened or weakened by external factors. It is this theoretical principle that we have adopted to stand for drop-out and attainment in our simulation model: a learner has a certain amount of motivation that can be increased or decreased by certain factors. The procedure we designed is roughly the following (this will be discussed in more detail in the implementation section):",
               "? Every learner has three assigned abstract competences, A, B and C, each with 5 competence levels. Level 0 represents no competence and level 5 expert competence.",
               "? Every UOL has an objective and prerequisites. The objective is defined as the competence level that is attained after completion (e.g., A 1] or [B 3]) and the prerequisites are always precisely one level lower than the objective level. Because the levels are abstract, they can be matched to any situation.",
               "? Every learner starts with a random motivation (-level) that is represented by a rational positive number.",
               "? A learner will drop out when his or her motivation has fallen below zero.",
               "? Motivation decreases when an external situational disturbance occurs, when the UOLs are of low quality or when there are matching errors, indicating that the learner's existing competences do not match the entry requirements of the UOL. When the existing competences are lower than the entry level required, the UOL is too 'difficult' for the learner. When a UOL is too difficult, the learner's motivation decreases.",
               "? Motivation increases when a learner successfully completes a UOL. The motivation also increases when the learner's competence level is a good match and the general level of his or her other competences is relatively high compared with the level to be attained. In other words, this is a person with a high general level of competence. Motivation also increases when a UOL is easy (learner has a higher competence level than required). Motivation decreases every time a learner fails to pass an exam. When a learner fails a fixed number of times for the same exam, his or her motivation will drop considerably.",
               "? Every UOL has an average assigned study load, this being the average time that a learner with a good match on the entry requirements of the UOL will need to complete it.",
               "? Every learner starts with a randomly assigned weekly study time.",
               "? The time learners need to complete a UOL depends on the same factors that influence motivation: a) whether external situational disturbances occur, b) whether the UOLs are of low quality and c) whether matching errors occur. These same factors will influence the probability of a learner passing an exam.",
               "? Because the motivation bonus for passing an exam will only be given after the learner has completed the UOL, and because the disturbance, quality and matching-error factors can increase the amount of time the learner spends on the UOL while decreasing motivation at the same time, motivation will decrease even further (with an attendant greater risk of dropping out).",
               "To conclude this section, it should be noted that it may be difficult to measure the drop-out rate in flexible systems. The formula is:"
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "number of learners = number attained + number studying + number searching + number dropping out",
               "type": "introduction"
          },
          "paragraphs": [
               "The only known factor in most systems is the number of learners who have attained their targets (when there are official completion activities, like exams). Whether a learner is 'still studying a UOL', 'searching for a new UOL' or is a 'drop-out' is hard to determine. As a consequence, for this study we will concentrate on the proportion of learners who have attained their target by completing the necessary UOLs. summarises the model used in this study."
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "Figure 2. Summary of the model",
               "type": "conclusion"
          },
          "paragraphs": [
               "The learner has a set of characteristics (target & goal, etc.); a UOL has a set of characteristics , and the relationship between a learner and the selected UOL has a set of characteristics (e.g., matching error). The learner is primarily influenced by disturbance factors in the environment. The UOL is primarily influenced by the quality procedures that have been introduced to develop and run it. The relationship between the learner and the UOL is influenced by the procedure used to select a UOL that matches the competences and goal of the learner and chooses the best of the available alternatives (e.g., one of the UOLs with the highest quality). In this study we will concentrate on the role of indirect social interaction to improve the selection procedure."
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "In General",
               "type": "conclusion"
          },
          "paragraphs": [
               "We used the Netlogo (version 2.0.1; 7 May 2004) multi-agent simulation environment developed by Wilensky (1999) to implement the Learning Network. The learners are the agents ('turtles') who are moving in an environment that consists of a variety of different UOLs ('patches', see ). Several settings can be modified in the interface: the number of UOLs (0-180), the number of weeks (0-1040), the simulation runs, the mean number of learners entering the system every week (0-1000), the risk of disturbance (0-100%), the matching error (0-100%), the minimum and maximum quality of a UOL (each 0-100%), the mean weekly study time a learner has available (0-40 hours), the study load for a UOL (0-200 hours) and the proportion of learners that will follow the advice given based on indirect social interaction (pheromone strength, 0-100%). The distributions of the random variables are chosen according to common conventions described in . They are not yet based on empirical data. The source of the simulation program can be found at: http://www.ou.nl/open/rkp/_sim/ Lnmodel127-articleVersion.nlogo. "
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "Setup of the model",
               "type": "modelling"
          },
          "paragraphs": [
               "Pressing the setup button prepares the environment:",
               "? The selected UOLs are distributed randomly in the environment.",
               "? Objectives are randomly assigned to the UOLs (A, B or C), and a level is set for the objective (a positive integer that is obtained by rounding off the random number drawn from an exponential distribution with M = 0.5).",
               "? A random quality level is set (between the minimum and maximum levels set in the interface).",
               "? All the UOLs are assigned the study load set in the user interface.",
               "? A random number of learners (Poisson distribution with M = mean-new-learners) is randomly positioned in the environment. Initial colour of the learners is red.",
               "? A randomly assigned target and target level is set for each learner. This is expressed in a set (e.g., ] or [A 5]).",
               "? A randomly assigned motivation level is set for each learner (Gamma Distribution with M = 2 and Std = 0.5).",
               "? A randomly assigned level of existing competences ('pre-knowledge') is set for each learner for the three competences A, B and C (round exponential with mean 0.5).",
               "? A randomly assigned number of hours of available study time per week is set for each learner (Gamma distribution with= (M * M / S 2 ) and= 1 / (S 2 / M)), where M is the mean weekly study time that is set in the user interface).",
               "? All the default initial values for the simulation are set, e.g., an empty portfolio per learner."
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "Running the model",
               "type": "modelling"
          },
          "paragraphs": [
               "Pressing the go button starts up the simulation:",
               "? A first goal is calculated for each of the learners which -with respect to the target -is always one competence level higher than they already have attained. For instance, when the target is ] and the current competence of the learner is [B 1], then their goal is set to . This means that they are searching for a UOL that has [B 2] as its objective.",
               "? The learners walk randomly through the environment. When they encounter a UOL, they will check whether the UOL matches their goal, with some random matching errors set in the user interface. When the learner thinks that there is a match, he or she starts studying the UOL (the turtle sits on the patch while studying). When there is no match, the learner continues searching. When a learner selects any other UOL than the goal, this is called a matching error.",
               "? Every week that the learner has actually spent studying is calculated. The calculation is based on the study time that the learner is supposed to have available every week. However, the study time is adjusted in line with the following error factors: -quality of the UOL (low quality: learner needs more hours to study the course), -disturbance (when disturbance occurs, the learner had less time available than planned), and -matching errors (when the course is relatively difficult given the learner's competence level: the learner needs more time; when the course is relatively easy: the learner needs less time). Two variables are updated for every learner: the total study time spend on the current UOL (time-learn-spends := study time available per week * error-factor, where the error factor is calculated by error-factor := disturbance + 1 / competence-match + quality of UOL) / 3), and the total planned study time (total-planned-study-time := number of weeks studying this UOL * study time).",
               "? When a learner has studied the UOL (actual time spent is equal to or higher then the study load of the UOL), he or she takes an exam. The probability of the learner passing the exam depends on the error factors mentioned above. If the learner fails, the number of exam attempts is updated by 1, the motivation is decreased by a motivation malus (-0.3) and the learner will need an extra 20% of the study time before the next exam attempt can start. If the learner makes 4 attempts and does not succeed, a large motivation malus (-10) will be applied. This will almost always cause the learner to drop out. When the learner passes the exam, a motivation bonus is added to his or her existing motivation (+1.5), his or her competence level is updated, and the ID of the UOL that has been completed is added to the learner's portfolio.",
               "? After the first goal has been attained, the question is whether the learner has already attained his or her target. In the example given above, that is not the case. After finishing [B 2], the learner's next goal is ] and then ] to attain the target. Once he or she has attained the target, the learner is awarded the status 'attained objective' and is made invisible. If the learner has not attained the target, he or she steps away from the current UOL and starts searching for a new UOL that fits the new goal. The learner's colour changes to green when a regular search is performed and to yellow when the learner follows a pheromone track (explanation follows).",
               "? Every new week, the motivation of each learner is assessed. When it is below 0, the turtle's status changes to 'drop-out' and its colour is set to white (white turtles can be made invisible with a switch).",
               "? Motivation is influenced by matching errors, by external situational disturbance and by low quality of the UOLs in the following way: every week the motivation is adapted according to the formula: motivation = motivation + mean-motivation * (error-factor -1). The error factor is calculated as stated earlier.",
               "? The week ends when all above-mentioned activities have been performed; a new week starts with the random selection of new learners according to the same mechanism as was described in setup.",
               "? All formulas have connected weight factors that allow future experimentation with different settings and sensitivity analysis."
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "Implementation of Indirect Social Interactions: the pheromone strength",
               "type": "modelling"
          },
          "paragraphs": [
               "Indirect social interactions can be set using the 'pheromone-strength' slider (0-100%). When set to 0%, there is no indirect social interaction in the system. When set to any other percentage (e.g., 80%), the learner will be given advice when it is available, but the probability that he or she will follow the advice is set to the same percentage (in this case 80%). The type of advice given answers the first learner question 'When I want to learn more about topic X, or want to build more competence in domain X, what UOLs can I study best and in what order?'. The answers to this question are given one by one in the procedure, i.e. when the learner completes a UOL, he or she is advised on the best UOL to take next in order to attain the target, and so on.",
               "The procedure is designed to meet the requirements stated earlier, and follows the same four steps that we have used to describe the foraging behaviour of ants:",
               "1. When no 'pheromone' information is available in the environment to support the selection of UOLs, learners have to select UOLs in the regular way. A regular search is based on the meta-information given by the providers of the UOL (e.g., about the objectives, prerequisites, setting), and the assumed match between a) the learner's goal and the learning objective of the UOL, and b) the entry requirements of the UOL and the learners' prerequisites. Note that the information about UOLs, as given by the providers, can contain errors (low quality courses are presented as high quality courses or the prerequisites are not stated explicitly) and the information can be wrongly interpreted by the learner. Furthermore, the learner can make mistakes when assessing his own preknowledge. These errors create matching errors. In an earlier study , we found a relationship between matching errors and drop-out behaviour among open university students: matching errors are correlated to drop-out rates (a better match decreases the drop-out rate by between 17% and 21% in open distance education).",
               "2. When a learner completes a UOL, this information is stored in a personal portfolio. After having completed one or more UOLs, the portfolio will contain a list of the identifiers of UOLs that the learner has completed successfully. The list is sorted according to the sequence of completion. The portfolio lists hold the actual pheromone trail information that can be read and used by the mechanism which provides advice to individual learners. For instance: when person A has portfolio [A,B,C,D,E] and person B has portfolio , the advice for person B may be to enrol in UOL C. Using information in this way is comparable to recommender systems such as that used by amazon.com ('Customers who bought this item also bought:'). The major difference is that the information on books is based on ordering behaviour, whereas the information in a learning network will not be based on enrolment ('people who enrolled for this course also enrolled for the following courses:'), but on the successful completion of UOLs.",
               "[B], and there are six other learners in the system who have completed B (share same position), but have also completed at least one more UOL. The six have the following portfolios:"
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "[A,B,C] [B,C] [B,D] [B,E] [B,D,E,F] [A,B,C]. The nextAN list is then [C, C, D, E, D, C].",
               "type": "modelling"
          },
          "paragraphs": [
               "To create the advice, precisely one item is randomly selected from this list. The result is that the most frequently followed path (B-C) has a higher probability of being selected. There is a chance that the other paths (B-D and B-E) will be selected, to prevent suboptimal convergence to the path (B-C). Note that the procedure includes two types of randomness (the first two requirements for the procedure): first, the variable likelihood that the advice will be followed by the learner, and second, the random selection of a successful path when there is more than one alternative (with the most frequently followed paths having the greatest chance of being selected). In this case, the learner is advised to enrol in UOLs that have been successfully completed by other learners who share the same position. In order to meet the third requirement for the design of the procedure ('large probability of pheromone info being available'), we must look carefully at the number of UOLs selected to represent the current position of the learner. We decided to use only the most recently completed UOL to represent the position of the learner to meet the third requirement. The more UOLs are taken into account, the better we expect the advice to be, but the smaller the chance that the learner will in fact find any advice. This also meets the fourth requirement (computational efficiency).",
               "4. Other learners who follow the same path successfully will increase the strength of the trail for those who follow because the path will show up more frequently on the nextAN list. When learners cease following the path, its relative importance will slowly evaporate, i.e. the relative likelihood that it will be selected decreases. In this model, we did not put limits on UOLs (e.g., only 20 learners may enrol) or on their availability (e.g., a one-off course). When such restrictions occur, the nextAN must be adjusted by deleting all the UOLs that are not or no longer available."
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "Experiment",
               "type": "experiment"
          },
          "paragraphs": [
               "To explore the effects of indirect social interactions (pheromone-strength) on the percentage of learners who attain their targets (attained proportion), we conducted a series of simulation runs in a 2 4 factorial design. The dependent variable is the attained proportion, and the factors are: matchingerror, min-quality, disturbance-chance, and pheromone-strength. The selected factor levels are the following: matching error (0% and 100%), min-quality (0% and 100%; max-quality is always set to 100%), and disturbance (0% and 100%).",
               "According to ), a simulation study is a computer-based statistical sampling instrument in which the output processes are almost always non-stationary and autocorrelated. This means that classic statistical techniques that are based on Independent and Identically Distributed (IID) observations are not directly applicable. Correcting this problem involves applying the principle of independence across runs. This means that the N in a simulation study is not the number of cases in a single run, but the number of replications of the same simulation. It also implies that the seed of the random number must vary per run and is not fixed, as is usual in some approaches intended to reduce variance.",
               "Given this principle, we decided to replicate every condition 12 times (N = 12 per condition). Furthermore, we decided to use a warm-up period to simulate 260 simulated weeks (5 years) and use the values of the 260 th week to create the distributions for the attained proportion.",
               "The settings selected to run the experiment were the following:",
               "Settings in user interface: Units of learning: 100 Weeks: 1040 (the number of 260 weeks, is controlled automatically; this setting only prevents early termination). Mean-new-learners: 10 Mean-weekly-study-time: 6 Max-quality: 100 Study-load-uol: 25",
               "Vary variables in experiment: matching-error: values 0 and 100 min-AN-quality: values 0 and 100 disturbance-chance: values 0 and 100 pheromone-strength: values 0 and 100 replications: values 1, 2, 3, ... , 12",
               "Set up model with these commands: setup",
               "Step model with these commands: go"
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "Stop after this many steps: 260",
               "type": "experiment"
          },
          "paragraphs": [
               "Data analysis was performed with SAS JMP 5.1. All systems ran under the Linux operating system. provides the exploratory outcome after analysing the full factorial design (using the Standard Least Squares analysis) in order to investigate the effect size of the different factors. When the scaled estimates are considered, the largest effects (all factors with p < 0.0001) are disturbance-chance (-0.15), min-quality (0.14), pheromone-strength (0.04), matching-error (-.04), and the interactions: pheromone-strength * matching-error (0.02), pheromone-strength*min-quality (-0.01), and min-quality*disturbance-chance (-0.01).  shows the attained proportion for the three interactions.  and table 1 show that the main effects matching-error and min-quality are modified by pheromone-strength, and that the main effect of min-quality is modified by disturbance. There is a small difference in the attained proportion when pheromones are and are not provided if there are no matching errors (5%). However, when there are matching errors, pheromones increase the attained proportion by 12%. The table also shows that, in this case, the use of pheromones compensates for the matching errors (see the two 50% scores).",
               "In this study we are interested in the effects of pheromone strength on the attained proportion. The most logical and parsimonious model would be one that includes only a) the significant effects, b) the two-, three-and four-way effects that include pheromone strength and c) the interaction effect, for which all the underlying pairs of effects are also significant. Applying these rules to the findings of table 1 results in a model with 6 effects (table 2). The results show that the model still explains a large proportion of variance (97.7%).",
               "The main regression effect of pheromone strength on the attained proportion is provided by the formula: percentage attained = 43.9 + 0.09 * pheromone-strength (p<0.006). This formula indicates that the overall attained proportion without the use of pheromones is 43.9% in the given system configuration, and the overall improvement is 9% when pheromones are provided and the advice is always followed by the learners.",
               "The correlation between the attained proportion and the drop-out proportion is 0.9922 (p<0.00001).",
               "The model presented for the attained proportion is similar to the model for the drop-out proportion.",
               "The data presented tested the model by comparing the attained proportion for precisely 260 weeks. To get an idea of the dynamic changes in the attained proportion over time, presents the attained proportion and the drop-out proportion across 520 weeks in different system configurations.",
               "A. Settings in user interface: units of learning: 100 weeks: 520 mean-new-learners: 6 mean-weekly-study-time: 6 study-load-uol: 25",
               "Factor settings: disturbance-chance: 100 matching-error: 100 min-AN-quality: 0 max-quality: 100 pheromone-strength: 0 note: these settings represent the worst-case scenario"
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "B. Settings in user interface:",
               "type": "experiment"
          },
          "paragraphs": [
               "See above.",
               "Factor settings: disturbance-chance: 100 matching-error: 100 min-AN-quality: 0 max-quality: 100 pheromone-strength: 100 note: these settings represent the influence of pheromones in the worst-case scenario A. Settings in user interface: units of learning: 100 weeks: 520 mean-new-learners: 6 mean-weekly-study-time: 6 study-load-uol: 25",
               "Factor settings: disturbance-chance: 100 matching-error: 100 min-AN-quality: 0 max-quality: 100 pheromone-strength: 0 note: these settings represent the worst-case scenario"
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "C. Settings in user interface:",
               "type": "experiment"
          },
          "paragraphs": [
               "See above.",
               "Factor settings: disturbance-chance: 0 matching-error: 0 min-AN-quality: 100 max-quality: 100 pheromone-strength: 0 note: these settings represent the best-case scenario . Drop-out and attained proportions over 520 weeks, different settings",
               "When comparing with 5B, we seen that the influence of pheromones on the attained proportion continues to increase after the 260 weeks selected to compare the conditions in this study. The model itself is not expected to be influenced; however, estimates of the effect on the attained proportion depend largely on the timeframe in which the pheromones work."
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     },
     {
          "head": {
               "text": "Discussion",
               "type": "experiment"
          },
          "paragraphs": [
               "The purpose of the simulation program was to explore the effects of indirect social interaction in order to help lifelong learners navigate in a learning network (LN). The first challenge was to create a model of an LN that could be implemented in the form of a simulation program. The basic structure was inspired by the theories presented, but at a more detailed level we were forced to make many arbitrary choices, as we were modelling a future system with no empirical data available as yet.",
               "Besides exploring the effects of indirect social interaction, then, the study helped us to operationalise the theory of LNs in very concrete terms. This effect has been discussed in the literature as one of the major advantages of simulation studies (see e.g., . There is one further advantage in this particular case: we are developing new technologies, and the simulation study can help us to define the requirements of these technologies before embarking on the costly process of development, implementation, testing and revision.",
               "The outcome of this study showed that, given the settings selected, the matching procedure based on indirect social interaction increased the overall percentage of learners that attain their learning objectives in the simulated LN (the attained proportion) by 9%. When there are major matching errors in the LN, the increase is 12%. When there is a large variance in the quality of the UOLs (between 0% and 100%), then the pheromone condition increases the attained proportion to 10%. This confirms the hypothesis stated in the introduction.",
               "The effects on the attained proportion are (in order of importance): disturbance-chance, min-quality, pheromone-strength, matching-error, and the interactions pheromone-strength * matching-error and pheromone-strength-min-quality. This leads us to make the following recommendations for the design of LNs that use settings similar to the one explored in the simulation:",
               "? Decrease the chance of disturbance. An example measure is to have the learners study in a quiet environment where they can concentrate on learning. However, this does not always work with distance learners. Other measures, for example better time management, can be explored in that case.",
               "? Increase the minimum quality of the UOLs. Several measures can be taken here, for example more controlled development and deployment of the UOLs (including testing, use of proven theoretical and practical principles), but also learner ratings, reviews and the application of other quality assessment techniques. Indirect social interaction also influenced learners in this study to not select low quality UOLs.",
               "? Decrease the matching error. Traditional measures to prevent matching errors are to provide valid information about the precise objectives of the UOL, the level of competence attained by the UOL, the entry requirements in terms of pre-knowledge, the situational and personal requirements, the quality of the UOL, the social and personal value of completing the UOL, etc. Learners can also be helped to assess their knowledge, competence levels, and other entry requirements. This whole process is rather costly and time consuming, so one of the things that this study proposes is to use indirect social interactions that are derived and presented automatically to prevent matching errors.",
               "? When indirect social interactions are introduced into the LN, increase the number of learners that follow the advice given. This comes down to their having confidence in the advice given, and it is one of the issues that should be explored in future research.",
               "The present study presented our first exploratory research on indirect social interactions within the context of learning networks. The program can be extended in future in the following ways:",
               "First of all, the program has several limitations. One is that, of the four requirements of -(multiple interactions, positive feedback, negative feedback and randomness) -the program does not yet implement mechanisms of negative feedback. To provide for negative feedback, access to certain UOLs can be restricted (e.g., maximum number of learners is 20; enrolment is only once a year; UOLs are cancelled/enrolment is closed) and new UOLs can be added from time to time.",
               "Another issue is that the matching errors in the current implementation only address mismatches on the level of competence as compared to the entry requirements. Mismatches can also occur on other factors such as personal preferences and situational circumstances. These factors can be introduced in later versions of the simulation to explore the effects.",
               "A further limitation is that learners do not interact with each other in the program; in reality there is always a combination of indirect and direct social interaction influencing the choices made.",
               "Furthermore, all UOLs are currently of the same type, whereas in reality they can differ from one another considerably (e.g., lectures, workshops, discussions, etc.). These different types of UOLs are expected to have different effects on social interaction.",
               "Another limitation of the program is that it does not allow for UOLs coming from different providers, something that can lead to resistance when switching to UOLs from another provider (e.g., bureaucratic rules, competition issues, learners who want to remain in an environment with which they are familiar, etc.).",
               "A final limitation is that the simulation does not take cost aspects into account (e.g., development costs, costs for learners, operating costs for the institutes), although it is known that these factors play a role in the decisions of learners (and institutes to develop new UOLs).",
               "Besides the limitations mentioned, the mechanisms that are currently implemented must be further explored in greater depth and improved where possible. The most important mechanism is the procedure that we used to provide for indirect social interactions. Are there better procedures? Can we implement it differently? Does the procedure produce any negative side effects (e.g., in the composition of the portfolio, in the structure or the composition of the LN, etc.)? One specific issue is whether the convergence effect produces side effects when it comes to providing support for the units of learning. Typically, this will result in some UOLs having a large enrolment of learners and others having a very small enrolment. This has consequences for the support infrastructure associated with each UOL in the LN. Another issue is the implementation of the nextAN list. Currently this list is based on the information stored in the portfolios of learners. Another possibility would be to store the data in the UOLs, e.g. when a learner completes a UOL, information is left about previous successfully completed UOLs. This principle is more consistent with the theory of stigmercy (an agent changes its environment, cq a learner changes the UOL).",
               "Another future issue is that a variety of sensitivity analysis has to be performed to detect whether the model is robust enough to cope with changes in certain settings, e.g. the distribution of random variables or the settings in the user interface. More detailed analysis can be performed, based on comparisons of the attained proportion over time.",
               "Although many questions remain, the outcomes of this study are promising enough to justify further research in this area."
          ],
          "paper_id": "2257f210-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "Increasing Learner Retention in a Simulated Learning Network using Indirect Social Interaction"
     }
]