[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "h i g h l i g h t s ? A novel independent cascade model based on opinion change, called IC-OC, was proposed for information spreading. ? Two probabilities were introduced to predict opinion change when users are exposed to bilateral opinions. ? The IMIC-OC model was proposed for influence maximization. ? Experiments were conducted on three real networks to verify that the IMIC-OC model has larger influence than two baseline methods. a r t i c l e i n f o a b s t r a c t The rapid growth of online social networks is important for viral marketing. Influence maximization refers to the process of finding influential users who make the most of information or product adoption. An independent cascade-based model for influence maxi-mization, called IMIC-OC, was proposed to calculate positive influence. We assumed that influential users spread positive opinions. At the beginning, users held positive or negative opinions as their initial opinions. When more users became involved in the discussions, users balanced their own opinions and those of their neighbors. The number of users who did not change positive opinions was used to determine positive influence. Corresponding influential users who had maximum positive influence were then obtained. Experiments were conducted on three real networks, namely, Facebook, HEP-PH and Epinions, to calculate maximum positive influence based on the IMIC-OC model and two other baseline methods. The proposed model resulted in larger positive influence, thus indicating better performance compared with the baseline methods."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Online social networks (OSNs) are beneficial for researchers and companies that study user behaviors and make profits, respectively. For example, advertisers found a subset of users to maximize the adoption of products , which is a way of using influence maximization. The goal of influence maximization is to maximize the number of users involved in discussions or adopt products in the network. The independent cascade-based model for influence maximization is proposed in this study to handle this problem.",
               "In recent years, many researchers have focused on influence maximization. Kempe et al. first used greedy algorithm to study influence maximization based on two models, namely, Independent Cascade (IC) and Linear Threshold (LT). Chen et al. calculated positive influence amidst the existence of negative opinions within a network. However, the authors assumed that if users adopted one opinion, they would never change their opinions. As time passes, users are probably influenced by others to adopt opposite opinions. Thus, when users are exposed to different attitudes, probabilities are introduced to predict whether such users would change their minds until no neighbor changes opinions.",
               "To better understand the proposed model for influence maximization, a novel IC model based on opinion change, called IC-OC, is proposed to show the process through which users build opinions. In the beginning of information spreading, the IC model is used to predict the initial opinions of the user. As several users become involved in the discussion, a transforming probability is introduced to predict whether users would change their initial opinions. The proposed model is verified by the dataset culled from Facebook.",
               "1 Then, the IMIC-OC model is used to calculate maximum positive influence in three real networks.",
               "We model social network as a directed influence graph. Nodes denote individuals and edges denote ''who influences whom''. In some social networks, such as Twitter and Sina Weibo, user relations are unidirectional, such that the structure of network is directly used as influence graphs. Other social networks provide bidirectional relations, such as Facebook and the co-author's network. In these networks, an undirected edge is divided into two directed edges to obtain the influence graph.",
               "In the current study, the IC-OC model is proposed to explain how users build opinions during the process of information spreading. The IMIC-OC model is proposed to find influential users who have maximum positive influence. The following items summarize our contributions to the literature.",
               "? Transforming probability is introduced to predict whether users change their initial opinions when bilateral opinions exist in the network.",
               "? The IC-OC model for information spreading is proposed to gain a better explanation for opinion formation.",
               "? The IMIC-OC model is proposed to tackle the influence maximization problem; the properties of the proposed model are also analyzed.",
               "Experiments were conducted on a real network. First, the IC-OC model was verified for information spreading. Experimental results indicated that the proposed model had better performance than the baseline methods. Maximum positive influence was calculated by applying the IMIC-OC model on three real datasets. The findings showed that the proposed model had better performance compared with the baseline methods. Further explanations were given.",
               "The reminder of this study is organized into sections. Prior works on influence maximization and opinion formation are discussed in Section 2. Section 3 presents the problem statement. Section 4 introduces the IC-OC model for information spreading and the IMIC-OC model for influence maximization. Section 5 shows the experimental results. Finally, Section 6 presents the conclusion."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "2.1.",
               "text": "Influence maximization",
               "type": "introduction"
          },
          "paragraphs": [
               "Many researchers have attempted to tackle the influence maximization problem. Kempe et al. proposed two basic information diffusion models, namely, IC and LT. An algorithm was used to obtain an approximate solution for this NP-hard problem. Chen et al. categorized the solutions to the problem of influence maximization into two classes: reducing running time of algorithms and using new methods to calculate influence.",
               "Many studies have focused on improving the efficiency of algorithms on influence maximization . Zhang et al. , for example, reduced running time and memory consumption by mapping several networks into one network. Goyal et al. proposed CELF++, a novel CELF algorithm, to reduce running time. used Monte-Carlo simulation to improve time complexity, whereas Li et al. considered wide influence spread to tackle location-aware influence maximization.",
               "Other studies proposed new algorithms to calculate influence . Zhou et al. employed the voter model to handle the situation wherein different users activate the same user. Wu et al. used core users in the forefront of a network to calculate influence, and Li et al. proposed a novel conformity-aware cascade model, which used conformity theory to calculate influence. Meanwhile, Zhu et al. combined continuous-time Markov chain and IC model for influence maximization. Guo et al. proposed personal influence maximization, which aimed to find users who can activate targeted users. Lee et al. maximized influence on specific users by query processing. In sum, the problem of influence maximization is based on information spreading. Researchers have proposed new models to exploit the structure of network or user relations so as to improve the performance of information spreading. Based on these models, the authors proposed corresponding models for influence maximization to find influential users.",
               "Some researchers have also attempted to calculate influence when different opinions exist in a network. For instance, Chen et al. proposed the IC-N model to calculate influence when negative opinions were present in a given network. They assumed that users never change opinions once activated. However, in reality, users could change their opinions, that is, the accumulation of opposite opinions in the network could possibly make users change their minds. Thus, we introduce transforming probability to predict whether users would change opinions when they are exposed to different views. Li et al. introduced broadcast and current attitude in studying user attitude modification. Based on the above method, the authors proposed the IMLT-IOA model for influence maximization."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "2.2.",
               "text": "Opinion formation",
               "type": "introduction"
          },
          "paragraphs": [
               "In real life, people may actually change their initial opinions when their neighbors, who have a profound impact on them, hold opposite opinions. Some researchers have studied the problem of opinion formation . Das et al. categorized models for opinion formation into three models, namely, averaging, flocking and voter. In averaging models, users update their opinions by using the average of neighbors. In flocking models , conformity bias exists. In voter models , users randomly pick up the opinions of their neighbors at each time step. Meanwhile, Wang et al. introduced a freezing period in the voter model. During the freezing period, users have a high probability to change their minds. After that time, users could easily reach consensus in the network."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "3.",
               "text": "Problem statement",
               "type": "introduction"
          },
          "paragraphs": [
               "Various definitions of social networks are available. First, the influence graph is introduced, which is a directed graph expressed as G = (V , E). Definition 1. An influence graph G = (V , E) is a directed graph that shows the relation of ''who influences whom''. Here, V = {v 1 , . . . , v n } denotes a set of users, while E = {e 1 , . . . , e m } denotes a set of edges.",
               "Definition 2. Neighbors N(v) denote entire neighbors of user v. and N out (v) denote in-and out-neighbors, respectively. If user v j is an out-neighbor of user v i , v jN out (v i ), user v i has an impact on user v j . Meanwhile, if user v j is an in-neighbor of user v i , v jN in (v i ), user v j influences user v i .",
               "For example, shows that edge e 1 connects users v 1 and v 2 . Edge e 1 denotes that user v 1 influences user v 2 . User v 1 is an in-neighbor of user v 2 , that is, v 1N in (v 2 ), and user v 2 is an out-neighbor of user v 1 , that is, v 2N out (v 1 ).",
               "Definition 3. Users are categorized into three classes, namely, inactive (I), positive (P), and negative (N). Here, I users are not activated in the network. P users hold positive opinions in the network, and N users hold negative opinions in the network.",
               "In , only user v 6 is inactive, I = {v 6 }. Five users are positive, P = {v 1 , v 2 , v 3 , v 4 , v 7 }, whereas one user is negative, N = {v 5 }.",
               "Three classes of users can be expressed as |V | = |I| + |P| + |N|, ",
               "is a network that indicates relations between a specific user v i and neighbors",
               "In , ego network G e (v 2 ) of user v 2 shows relations between user v 2 and neighbors, N(v 2 ) = {v 1 , v 4 , v 5 , v 7 }. The ego network of user v 2 includes five users, V e = {v 1 , v 2 , v 4 , v 5 , v 7 }, and four edges, E e = {e 1 , e 3 , e 4 , e 6 }. ",
               "where user v iS is an influential user, s i is the sentiment of user v i , and user v j is activated in the network and holds positive opinions. Definition 8. Negative influence denotes a set of users with negative opinions when influential users S spreads negative opinions. Owing to the asymmetry between positive and negative influence, we mainly study positive influence. Further explanations are given in Section 4.",
               "As shown in , the network has seven users V = {v 1 , . . . , v 7 }, and six edges E = {e 1 , . . . , e 6 }. If user v 1 is an influential user, S 1 = {v 1 }, we set user v 1 to spread a positive message. Users v 2 , v 3 , v 4 , v 5 adopt this information and only user v 5 holds a negative opinion. Thus, positive influence is(S 1 ) = {v 2 , v 3 , v 4 } and |(S 1 )| = 3. If user v 2 is an influential user, S 2 = {v 2 }, positive influence is(S 2 ) = {v 4 } and |(S 2 )| = 1. If user v 3 is an influential user, S 3 = {v 3 }, positive influence is(S 3 ) = ? and |(S 3 )| = 0. Definition 9. Maximum positive influencem (S) denotes the maximum number of users who are activated by influential users S when the number of influential users is given as |S| = k. Maximum positive influence is defined asm (S) = max{|(S)|}."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "text": "(5)",
               "type": "introduction"
          },
          "paragraphs": [
               "In , if the cardinality of influential users is 1, |S| = 1, many users can be influential users, S 1 = {v 1 }, S 2 = {v 2 }, and S 3 = {v 3 }. In addition, the maximization positive influence ism (S) = {v 2 , v 3 , v 4 } and S = S 1 .",
               "Problem Definition: Given number k, we aim to find a set of influential users S * who activate the maximum positive influence(S). Hence,",
               "where the cardinality of influential users S is k."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "4.1.",
               "text": "IC-OC model",
               "type": "modelling"
          },
          "paragraphs": [
               "We introduce the IC-OC model in this section. Information spreading is initiated when some users spread information within the network. Out-neighbors are activated by adoption probability and hold the same opinion by conforming probability. Explicit definitions of probabilities are given in Section 4.2.1. As time passes, bilateral opinions emerge in the network. When in-neighbors hold different opinions, users change opinions by transforming probability while keeping their opinions by stubborn probability. The explicit definitions of these probabilities are provided in Section 4.2.1."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "4.2.",
               "text": "IMIC-OC model",
               "type": "modelling"
          },
          "paragraphs": [
               "The IMIC-OC model aims to find a set of users who have maximum positive influence. This section analyzes properties of the IMIC-OC model. Therefore, we mainly analyze positive influence in the following sub-sections."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "4.2.1.",
               "text": "Introduction of IMIC-OC model",
               "type": "introduction"
          },
          "paragraphs": [
               "In the IMIC-OC model, we first propose how influential users utilize paths to reach a user. Second, some probabilities are introduced to explain how users build opinions in the process of information spreading. Third, probabilities are introduced to calculate positive influence in the IMIC-OC model. Path(S, v i ) = {path 1 , . . . , path n } denotes a set of paths from influential users S to user v i , whereas L = {l 1 , . . . , l n } denotes corresponding lengths of paths, Path(S, v i ) = {path 1 , . . . , path n }. Many influential users can reach user v i . Thus, the shortest path, path min (S, v i ), from influential users S to user v i , is calculated to obtain the initial opinion of user v i . In addition, l min (S, v i ) is the corresponding length, path i = ?v 1 , v 2 , . . . , v i ? denotes entire users in path i , and path min (S, v i ) = ?v 1 , v 2 , . . . , v l min , v i ? shows the entire users in path min (S, v i ).",
               "Probabilities are introduced to describe the spread of information from one user to another as well as the changing of opinions during the process of information spreading. The explicit explanations are given below. Definition 10. Adoption probability p a is the probability of adopting information. If user v i has an influence on user v j , adoption probability p a can be expressed as",
               "where N 1 is the number of posts that are published by user v i , N 2 is the number of posts that are adopted by user v j , and n is the number of posts adopted by v j from user v i . Definition 11. Conforming probability p c is the probability that represents how user v j conforms to user v i when user v j adopts a piece of information from user v i . Conforming probability is defined as",
               "where n c is the number of posts whose sentiment is consistent with the sentiment expressed by user v i , and n is the number of posts adopted by v j from user v i . Definition 12. Positive propagation probability pp is the probability that user v j adopts information from user v i and user v j holds the same opinion as user v i . Positive propagation probability is defined as",
               "where pp ij denotes the positive propagation probability between users v i and user v j , p a denotes adoption probability, p c denotes conforming probability, N 1 is the number of posts that are published by user v i , N 2 is the number of posts adopted by user v j , n is the number of posts adopted by v j from user v i , and n c is the number of posts whose sentiment is consistent with the sentiment expressed by user v i .",
               "Definition 13. Negative propagation probability np is the probability that user v j adopts the information from user v i , and user v j holds the opposite opinion against user v i . Negative propagation probability is defined as",
               "where np ij denotes negative propagation probability between user v i and user v j , p a denotes the adoption probability, p c denotes the conforming probability, N 1 is the number of posts published by user v i , N 2 is the number of posts adopted by user v j , n is the number of posts adopted by v j from user v i , and n c is the number of posts whose sentiment is consistent with the sentiment expressed by user v i .",
               "When more users become involved in discussions, other users may begin to hold different opinions in the network. Some users could change their minds when some in-neighbors hold opposite opinions. Transforming and stubborn probabilities are introduced to predict whether users change their minds. Prior to the introduction of probabilities, two weights, stubborn w ii and influential w ji , are introduced in the ego network to calculate these two probabilities. The definitions of stubborn weight w ii and influential weight w ji are expressed below. Given user v i , the sum of stubborn weight w ii and influential weight w ji is equal to 1, and is expressed as",
               "Here, w ii = 0 indicates that users are not insistent on their initial opinions and are easily influenced by neighbors. In this case, the proposed model is close to the IC model. In addition, w ii = 1 indicates that users are insistent and are not about to change their initial opinions. In this case, the proposed model is close to the IC-N model .",
               "According to , stubborn weight is ",
               "Temporary stubborn weight and temporary influential weight are satisfied in Eq. (12). Thus, temporary stubborn weight ",
               "Owing to the asymmetry between positive and negative influences, stubborn weight w p ii and negative stubborn weight w n ii are expressed as",
               "where c p denotes parameter c for positive influence, and c n denotes parameter c for negative influence.",
               "Based on stubborn weight w ii and influential weight w ji , the sentiment of user v i at time t + 1 balances neighbors v jN in (v i ) and the sentiment of user v i at time t. We multiply stubborn weight w ii and the sentiment s i (t) of user v i at time t, influential weight w ji and neighbor sentiment s j (t). The equation is expressed as",
               "where sgn( * ) is a sign function, w ii denotes the stubborn weight of user v i , and w ji denotes the influential weight when user v jN in (v i ) has an impact on user v i ."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "text": "Definition 16. Transforming probability p t represents how users change their opinions from one sentiment to another.",
               "type": "modelling"
          },
          "paragraphs": [
               "Here, p t1 denotes the transforming probability from positive to negative, whereas p t2 denotes the transforming probability from negative to positive.",
               "Definition 17. Stubborn probability p s indicates that users keep their opinions even when neighbors hold different opinions. Similarly, we obtain two corresponding stubborn probabilities: p s1 denotes the probability that users keep positive opinions, and p s2 denotes the probability that users keep negative opinions.",
               "Given user v i , the sum of transforming probability p t and stubborn probability p s is equal to 1, and is expressed as",
               "Eq. is rewritten for the positive and the negative situations, which are expressed as",
               "Transforming probability p t1 from positive to negative is the sum of influential weights from negative in-neighbors, and is expressed as",
               "where w ji is the influential weight from user v j to user v i , and v jN n in (v i ) denotes that user v j is a negative in-neighbor of user v i .",
               "According to , stubborn probability p s1 is the sum of positive stubborn weight and influential weights from positive in-neighbors, and is expressed as",
               "where w p p ii is the stubborn weight for the positive, w ji is the influential weight from user v j to user v i , and v jN in (v i ) denotes that user v j is a positive in-neighbor of user v i .",
               "Similarly, transforming probability p t2 from the negative to the positive requires the sum of influential weights of positive in-neighbors N p in (v i ). Stubborn probability p s2 for the negative is the sum of negative stubborn weight and influential weights from negative in-neighbors. These relations are respectively expressed as",
               "In conclusion, the process of information spreading follows a certain procedure discussed here. First, within a network, users are categorized into three classes, namely, inactive (I), positive (P), and negative (N). Users transfer from one class to another based on probabilities.  When the in-neighbors N in (v j ) of user v j hold opposite opinions, and they have a profound impact on user v j , user v j could change his initial opinion. If user v j is positive at time t, he keeps a positive opinion at time t + 1 with stubborn probability p s1 and changes to negative opinion with transforming probability p t1 . However, if user v j is negative at time t, he keeps a negative opinion with stubborn probability p s2 and holds a positive opinion at time t + 1 with transforming probability p t2 .",
               "Probabilities are introduced to calculate positive influence. The shortest path from path min (S, v i ) is introduced to calculate initial opinions. The probability P(s 0 = 1) that the initial opinion of user v i is positive depends on probabilities among users path min (v i ) = ?v 1 , v 2 , . . . , v lmin , v i ? in the shortest path. This path is defined as where pp l min ,i denotes positive propagation probability between users v l min and v i , and pp j,j+1 denotes positive propagation probability between users v j and v j+1 .",
               "The probability P(s 0 = ?1) that the initial opinion of user v i is negative is defined as",
               "j=1 where np l min ,i denotes the negative propagation probability between users v l min and v i , and pp j,j+1 denotes the positive propagation probability between users v j and v j+1 .",
               "After user v i obtains an initial opinion, user v i updates this opinion when his in-neighbors update their views. We calculate probability P(s t+1 = 1), in which user v i holds positive opinion at time step t + 1 after he forms an initial opinion. Two cases lead to this situation. First, user v i holds positive opinion at time step t and still keeps positive at time step t + 1. Second, user v i holds negative opinion at time step t and changes to be positive at time step t + 1. This process is explained by",
               "where P(s t = 1) denotes the probability that user v i holds a positive opinion at time step t, P(s t = ?1) denotes the probability that user v i holds a negative opinion at time step t, p s1 denotes the stubborn probability for positive opinions, and p t2 denotes the transforming probability from negative to positive.",
               "Similarly, we calculate probability P(s t+1 = ?1) that the opinion of user v i is negative at time step t + 1. Two cases lead to this situation. First, user v i holds negative opinion and retains the negative view at time step t + 1. Second, user v i holds positive opinion at time step t, but changes to be negative at time step t + 1. Specifically, this probability is defined as",
               "where P(s t = ?1) and P(s t = 1) denote the probability that user v i holds negative and positive opinions at time step t, respectively, p s2 denotes the stubborn probability that user v i keeps the negative opinion, and p t1 denotes the transforming probability that user v i changes the opinion from positive to negative opinion. The algorithm is presented as Algorithm 1. Based on influence graph G = (V , E), the number of influential users is given as k. The number of influential users who have maximum positive influence is then calculated. Based on the class to which user v belongs, we could now predict the class to which user v will belong at the next time step."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "4.2.2.",
               "text": "Properties of the IMIC-OC model",
               "type": "modelling"
          },
          "paragraphs": [
               "The IMIC-OC model for influence maximization is NP-hard. Here, we mainly describe some properties of IMIC-OC model, such as monotonicity and submodularity. Theorem 1. Given influence graph G = (V , E), the maximum positive influencem (S) is monotone, and is expressed as"
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "text": "Input: G = (V , E), an expected number k of influential users S",
               "type": "modelling"
          },
          "paragraphs": [
               "Output: Influential users S 1: Let S = ?, S * = ? 2: for iter=1:k do 3:",
               "for each vN out (u) do if vI then calculate path min 8:",
               "generate random value r 1 9:",
               "if r 1 < P(s 0 = 1) then 10:  ",
               "Proof. We obtain a set of influential users S and user uV \\ S. We calculatem (S) at step 1 andm (S{u}) at step 2. Here, v s1 denotes the state of user v at step 1 and v s2 denotes the state of user v at step 2. With such information, we",
               "where vI denotes that user v is inactive, vP denotes that user v holds a positive opinion, and vN denotes user v holds a negative opinion.",
               "The result of Eq. is based on which part is larger in the right side of this equation. During information spreading, the most important function is to activate neighbors. Stubborn weight adds difficulty to changing minds from negative to positive than to activating inactive neighbors. Thus, the number of users who change opinions is smaller than the number of users who are activated. In other words, part 1 is larger than part 2, that is,m (S{u}) ?m (S)0. Hence, if we enlarge the number of influential users S, positive influence increases in the network. In conclusion,m (S) is monotone.",
               "Theorem 2. Given any influence graph G = (V , E), the maximum positive influencem (S) is submodular, and is expressed as Statistical data of the three real-world networks."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "text": "Dataset",
               "type": "experiment"
          },
          "paragraphs": [
               "Facebook 421,578 508,837 Average degree 4.58 13.11 8.43",
               "Proof. We obtain two sets of influential users, S and T , S ? T ? V , and user uV \\ T . Maximum positive influencem (S{u}) andm (T{u}) are expressed as",
               "According to Eqs. and , we could obtain"
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "5.1.",
               "text": "Datasets",
               "type": "experiment"
          },
          "paragraphs": [
               "We crawled the data in Facebook from March 18th to March 28th, 2014 on a specific topic. Our dataset includes 14,980 users, 1,955 posts, 9,721 comments, and 22,078 likes. We assume that if users like a post, then they have the same opinions as the authors of the original posts. We utilize the dataset from Facebook to validate the IC-OC model, and to find influential users S. We also use two other real networks to find influential users S. First, HEP-PH, which is an undirected graph, is the co-authorship graph from the ''high energy physics phenomenology'' section in the e-print, arXiv.",
               "5 Second, the dataset of Epinions, which is a directed graph, is a who-trust-whom online social network of a general consumer review site, Epinions.",
               "7 illustrates the basic information of the three real networks."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "5.2.",
               "text": "Parameter estimation",
               "type": "experiment"
          },
          "paragraphs": [
               "The probabilities in the process of information spreading are estimated in this section. exhibits the distribution of adoption probability p a , which follows power-law distribution. indicates the distribution of conforming probability p c . Therefore, we obtain the distribution of positive propagation probability pp in , which also follows power-law distribution."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "5.3.",
               "text": "Validation of the IC-OC model",
               "type": "modelling"
          },
          "paragraphs": [
               "The comparison of the proposed model and baseline methods is made to prove that the proposed model performs better than the baseline methods."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "text": "IC-N:",
               "type": "modelling"
          },
          "paragraphs": [
               "Proposed by Chen et al. , this algorithm assumes that users would not change their opinions after they obtained initial opinions.",
               "LT-IO: Proposed by Li et al. , this novel linear threshold model (LT) is used for modeling information spreading; it introduces broadcast and current attitude in considering user attitude modification."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "5.3.2.",
               "text": "Performance of the IC-OC model",
               "type": "modelling"
          },
          "paragraphs": [
               "We examine the performances of adoption and positive cascades. Adoption cascades denote the number of users who adopt the information, while positive cascades indicate the number of users who hold positive opinions in the final state.",
               "Coefficient of determination (R 2 ), sum of square for errors (SSE), and root-mean-square error (RMSE) are adopted to determine the performance for adoption cascades ( and for positive cascades ( IC-OC model has better performance, compared with the baseline methods. Relative to adoption cascades, the IC-OC model has 10.5% and 11.6% improvements compared with the IC-N and LT-IO models, respectively. Relative to positive cascades, the IC-OC model has 3.1% and 20.8% improvements compared with the IC-N and LT-IO models, respectively. Performance metrics are defined as  where X is a series of values to be predicted, x i is the ith value in series X , ? x is the mean of series X , and?xand? and?x i is the predicted value of x i ."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "5.4.",
               "text": "Influence maximization",
               "type": "modelling"
          },
          "paragraphs": [
               "First, we investigate how parameter c affects positive influence. Second, influential users are found in three real networks, which are Facebook, HEP-PH, and Epinions. The results of maximum positive influence, which are obtained using different methods, are shown in this section. Experimental results manifest that the IMIC-OC model calculated the largest maximum positive influence."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "5.4.1.",
               "text": "Parameter analysis",
               "type": "modelling"
          },
          "paragraphs": [
               "Parameter c has an impact on stubborn weight w ii , which represents how users keep their initial opinions. A greater parameter c value indicates that users have stronger willingness to keep their initial opinions. illustrates maximum positive influence with respect to parameter c by varying the number of influential users from 1 to 50. This figure shows that positive influence increases as parameter c rises. Thus, increasing parameter c has greater positive influence and smaller marginal increments."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 19,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "5.4.2.",
               "text": "Baseline methods",
               "type": "modelling"
          },
          "paragraphs": [
               "Random: An algorithm selects k influential users randomly from entire users V .",
               "MaxDegree: An algorithm selects top-k users who have maximum out-degrees as influential users.",
               "Greedy: An algorithm obtains approximate solution of influence maximization. "
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 20,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "5.4.3.",
               "text": "Comparisons among algorithms",
               "type": "modelling"
          },
          "paragraphs": [
               "The performances of the IMIC-OC model and baseline methods are discussed in this sub-section. Maximum positive influencem (S) is calculated by varying the number of influential users from 1 to 50. shows that on Facebook, the maximum positive influence of the IMIC-OC model is close to the Greedy model. In addition, the Random model has the smallest maximum positive influence among these algorithms, and the positive influence of the MaxDegree model is smaller than the IMIC-OC model. exhibits the maximum positive influence on NEP-PH. The result is similar with that from the Facebook dataset. On Epinions, the maximum positive influence of the MaxDegree model is close to the IMIC-OC model in . This result depends on the structure of the network, suggesting that users who have higher degrees are more influential in this network.",
               "In conclusion, the Random model has the worst performance among the three real networks; hence, this model is not feasible in calculating maximum positive influence. The result of the MaxDegree model depends on the structure of the network. If influential users have high degrees, the result of the MaxDegree model is close to the IMIC-OC model. The result of the IMIC-OC model is close to the Greedy model in all three networks, indicating that the IMIC-OC model is feasible in calculating maximum positive influence."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 21,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "n": "6.",
               "text": "Conclusion",
               "type": "conclusion"
          },
          "paragraphs": [
               "The proposed IMIC-OC model for influence maximization aims to find a set of users who maximize the adoption of information. Further, the IC-OC model for information spreading is proposed to explain how users build their opinions.",
               "The IC-OC model introduces stubborn and transforming probabilities. These probabilities are used to predict whether users would change initial opinions when exposed to different opinions. At the beginning, information spreaders activate their neighbors to adopt information based on adoption probability. Conforming probability denotes how neighbors keep the same opinions as the users who spread information. As time passes, different opinions emerge in the network. Users could then possibly change their minds by transforming probability or keep the same opinions by stubborn probability.",
               "Next, we verify the IC-OC model on the Facebook dataset. Results show that the IC-OC model has better performance than the baseline methods. Relative to adoption cascades, the IC-OC model has 10.5% and 11.6% improvements compared with the IC-N and LT-IO models, respectively. Meanwhile, relative to positive cascades, the IC-OC model has 3.1% and 20.8% improvements compared with the same baseline methods, respectively.",
               "The IMIC-OC model for influence maximization is proposed to find influential users. The minimum path to calculating initial opinions of users is obtained first. Then, we update user opinions at each step until no neighbor changes opinion. Ultimately, users who activate maximum positive influence are selected as influential users. Positive influence is calculated based on three real networks. The analyses of Facebook and NET-PH data yield similar results. Meanwhile, the Random model has the worst performance, while the IMIC-OC model has the largest maximum positive influence. The IMIC-OC model is close to the Greedy model, which proves that the IMIC-OC model is a feasible method in calculating positive influence. However, results from Epinions exhibit a difference. The MaxDegree model is close to the IMIC-OC model, indicating that more influential users have more degrees."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 22,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     },
     {
          "head": {
               "text": "Universities of China (Grant No. 2014RC0501), Natural Science Foundation of China (No. 61402045), and Specialized",
               "type": "conclusion"
          },
          "paragraphs": [
               "Research Fund for Doctoral ."
          ],
          "paper_id": "2265d4c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 23,
          "fromPaper": "Influence maximization in social networks under an independent cascade-based model"
     }
]