[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Online social networks play a major role in the spread of information at very large scale. A lot of effort have been made in order to understand this phenomenon, ranging from popular topic detection to information diffusion modeling, including influential spreaders identification. In this article, we present a survey of representative methods dealing with these issues and propose a taxonomy that summarizes the state-of-the-art. The objective is to provide a comprehensive analysis and guide of existing efforts around information diffusion in social networks. This survey is intended to help researchers in quickly understanding existing works and possible improvements to bring."
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "n": "1.",
               "text": "INTRODUCTION",
               "type": "introduction"
          },
          "paragraphs": [
               "Online social networks allow hundreds of millions of Internet users worldwide to produce and consume content. They provide access to a very vast source of information on an unprecedented scale. Online social networks play a major role in the diffusion of information by increasing the spread of novel information and diverse viewpoints . They have proved to be very powerful in many situations, like Facebook during the 2010 Arab spring or Twitter during the 2008 U.S. presidential elections for instance. Given the impact of online social networks on society, the recent focus is on extracting valuable information from this huge amount of data. Events, issues, interests, etc. happen and evolve very quickly in social networks and their capture, understanding, visualization, and prediction are becoming critical expectations from both endusers and researchers. This is motivated by the fact that understanding the dynamics of these networks may help in better following events (e.g. analyzing revolutionary waves), solving issues (e.g. preventing terrorist attacks, anticipating natural hazards), optimizing business performance (e.g. optimizing social marketing campaigns), etc. Therefore researchers have in recent years developed a variety of techniques and models to capture information diffusion in online social networks, analyze it, extract knowledge from it and predict it.",
               "Information diffusion is a vast research domain and has attracted research interests from many fields, such as physics, biology, etc. The diffusion of innovation over a network is one of the original reasons for studying networks and the spread of disease among a population has been studied for centuries. As computer scientists, we focus here on the particular case of information diffusion in online social networks, that raises the following questions : (i) which pieces of information or topics are popular and diffuse the most, (ii) how, why and through which paths information is diffusing, and will be diffused in the future, (iii) which members of the network play important roles in the spreading process?",
               "The main goal of this paper is to review developments regarding these issues in order to provide a simplified view of the field. With this in mind, we point out strengths and weaknesses of existing approaches and structure them in a taxonomy. This study is designed to serve as guidelines for scientists and practitioners who intend to design new methods in this area. This also will be helpful for developers who intend to apply existing techniques on specific problems since we present a library of existing approaches in this area.",
               "The rest of this paper is organized as follows. In Section 2 we detail online social networks basic characteristics and information diffusion properties. In Section 3 we present methods to detect topics of interest in social networks using information diffusion properties. Then we discuss how to model in-formation diffusion and detail both explanatory and predictive models in Section 4. Next, we present methods to identify influential information spreaders in Section 5. In the last section we summarize the reviewed methods in a taxonomy, discuss their shortcomings and indicate open questions."
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "n": "2.",
               "text": "BASICS OF ONLINE SOCIAL NET-WORKS AND INFORMATION DIFFU-SION",
               "type": "introduction"
          },
          "paragraphs": [
               "of messages. represents the stream produced by the members of the network depicted in the previous example. That stream can be viewed as a sequence of decisions (i.e. whether to adopt a certain topic or not), with later people watching the actions of earlier people. Therefore, individuals are influenced by the actions taken by others. This effect is known as social influence , and is defined as follows:",
               "An online social network (OSN ) results from the use of a dedicated web-service, often referred to as social network site (SNS ), that allows its users to (i) create a profile page and publish messages, and (ii) explicitly connect to other users thus creating social relationships. De facto, an OSN can be described as a user-generated content system that permits its users to communicate and share information.",
               "An OSN is formally represented by a graph, where nodes are users and edges are relationships that can be either directed or not depending on how the SNS manages relationships. More precisely, it depends on whether it allows connecting in an unilateral (e.g. Twitter social model of following) or bilateral (e.g. Facebook social model of friendship) manner. Messages are the main information vehicle in such services. Users publish messages to share or forward various kinds of information, such as product recommendations, political opinions, ideas, etc. A message is described by (i) a text, (ii) an author, (iii) a time-stamp and optionally, (iv) the set of people (called \"mentioned users\" in the social networking jargon) to whom the message is specifically targeted. shows an OSN represented by a directed graph enriched by the messages published by its four members. An arc e = (u x , u y ) means that the user \"u x \" is exposed to the messages published by \"u y \". This representation reveals that, for example, the user named \"u 1 \" is exposed to the content shared by \"u 2 \" and \"u 3 \". It also indicates that no one receives the messages written by \"u 4 \". DEFINITION 2 (Social Influence). A social phenomenon that individuals can undergo or exert, also called imitation, translating the fact that actions of a user can induce his connections to behave in a similar way. Influence appears explicitly when someone \"retweets\" someone else for example. DEFINITION 3 (Herd behavior). A social behavior occurring when a sequence of individuals make an identical action, not necessarily ignoring their private information signals."
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "text": "DEFINITION 4 (Information Cascade).",
               "type": "modelling"
          },
          "paragraphs": [
               "A behavior of information adoption by people in a social network resulting from the fact that people ignore their own information signals and make decisions from inferences based on earlier people's actions.",
               "X X P P X X P P P P X X X X P P P P P P P P DEFINITION 1 (Topic). A coherent set of semantically related terms that express a single argument. In practice, we find three interpretations of this definition: (i) a set S of terms, with |S| = 1, e.g. {\"obama\"} (ii) a set S of terms, with |S| > 1, e.g. {\"obama\", \"visit\", \"china\"} and (iii) a probability distribution over a set S of terms. WLPH P P P P P P P P P P P P P P Every piece of information can be transformed into a topic using one of the common formalisms detailed in Definition 1. Globally, the content produced by the members of an OSN is a stream on the social influence effect, information can spread across the network through the principles of herd behavior and informational cascade which we define respectively in Definition 3 and 4. In this context, some topics can become extremely popular, spread worldwide, and contribute to new trends. Eventually, the ingredients of an information diffusion process taking place in an OSN can be summarized as follows: (i) a piece of information carried by messages, (ii) spreads along the edges of the network according to particular mechanics, (iii) depending on specific properties of the edges and nodes. In the following sections, we will discuss these different aspects with the most relevant recent work related to them as well as an analysis of weaknesses, strength, and possible improvements for each aspect. "
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "n": "3.",
               "text": "DETECTING POPULAR TOPICS",
               "type": "modelling"
          },
          "paragraphs": [
               "One of the main tasks when studying information diffusion is to develop automatic means to provide a global view of the topics that are popular over time or will become popular, and animate the network. This involves extracting \"tables of content\" to sum up discussions, recommending popular topics to users, or predicting future popular topics.",
               "Traditional topic detection techniques developed to analyze static corpora are not adapted to message streams generated by OSNs. In order to efficiently detect topics in textual streams, it has been suggested to focus on bursts. In his seminal work, Kleinberg proposes a state machine to model the arrival times of documents in a stream in order to identify bursts, assuming that all the documents belong to the same topic. show that the temporal dynamics of the most popular topics in social media are indeed made up of a succession of rising and falling patterns of popularity, in other words, successive bursts of popularity. shows a typical example of the temporal dynamics of top topics in OSNs.",
               "ing the raw continuous data into a sequence of collection of messages published during equally sized time slices. This principle is illustrated on , which shows a possible discretization of the stream previously depicted in . This pre-processing step is not trivial since it defines the granularity of the topic detection. A very fine discretization (i.e. short time-slices) will allow to detect topics that were popular during short periods whereas a discretization using longer time-slices will not. Shamma et al. propose a simple model, PT (i.e. Peaky Topics) , similar to the classical tf-idf model in the sense that it is based on a normalized term frequency metric. In order to quantify the overall term usage, they consider each time slice as a pseudo-document composed of all the messages in the corresponding collection. The normalized term frequency ntf is defined as follows: ntf t,i = tft,i DEFINITION 5 (Bursty topic). A behavior associated to a topic within a time interval in which it has been extensively treated but rarely before and after.",
               "In the following, we detail methods designed to detect topics that have drawn bursts of interest, i.e. bursty topics (see Definition 5), from a stream of topically diverse messages.",
               "All approaches detailed hereafter rely on the computation of some frequencies and work on discrete data. Therefore they require the stream of messages to be discretized. This is done by transformcft , where tf t,i is the frequency of term t at the i th time slice and cf t is the frequency of term t in the whole message stream. Using that metric, bursty topics defined as single terms are ranked. However, some terms can be polysemous or ambiguous and a single term doesn't seem to be enough to clearly identify a topic. Therefore, more sophisticated methods have been developed.",
               "AlSumait et al. propose an online topic model, more precisely, a non-Markov on-line LDA Gibbs sampler topic model, called OLDA. Basically, LDA (i.e. Latent Dirichlet Allocation ) is a statistical generative model that relies on a hierarchical Bayesian network that relates words and mes-sages through latent topics. The generative process behind is that documents are represented as random mixtures over latent topics, where each topic is characterized by a distribution over words. The idea of OLDA is to incrementally update the topic model at each time slice using the previously generated model as a prior and the corresponding collection of messages to guide the learning of the new generative process. This method builds an evolutionary matrix for each topic that captures the evolution of the topic over time and thus permits to detect bursty topics.",
               "Cataldi et al. propose the TSTE method (i.e. Temporal and Social Terms Evaluation) that considers both temporal and social properties of the stream of messages. To this end, they develop a five-step process that firstly formalize the messages content as vectors of terms with their relative frequencies computed by using the augmented normalized term frequency . Then, the authority of the active authors is assessed using their relationships and the Page Rank algorithm . It allows to model the life cycle of each term on the basis of a biological metaphor, which is based on the calculation of values of nutrition and energy that leverage the users authority. Using supervised or unsupervised techniques, rooted in the calculation of a critical drop value based on the energy, the proposed method can identify most bursty terms. Finally, a solution is provided to define bursty topics as sets of terms using a co-occurence based metric.",
               "These methods identify particular topics that have drawn bursts of interest in the past.develop a method that permits predicting which topics will draw attention in the near future. Authors propose to adapt a technical analysis indicator primary used for stock price study, namely MACD (i.e. Moving Average Convergence Divergence), to identify bursty topics, defined as a single term. The principle of MACD is to turn two trendfollowing indicators, precisely a short period and a longer period moving average of terms frequency, into a momentum oscillator. The trend momentum is obtained by calculating the difference between the long and the shorter moving averages. Authors give two simple rules to identify when the trends of a term will rise: (i) when the value of the trend momentum changes from negative to positive, the topic is beginning to rise; (ii) when the value changes from positive to negative, the level of attention given to the topic is falling.",
               "The above methods are based on the detection of unusual term frequencies in exchanged messages to detect interesting topics in OSNs. However, more and more frequently, OSNs users publish non-textual content such as URL, pictures or videos. To deal with non-textual content, Takahashi et al. propose to use mentions contained in messages to identify bursty topics, instead of focusing on the textual content. Mentioning is a social practice used to explicitly target messages and eventually engage discussion. For that, they develop a method that combines a mentioning anomaly score and a changepoint detection technique based on SDNML (i.e. Sequentially Discounting Normalized Maximum Likelihood). The anomaly is calculated with respect to the standard mentioning behavior of each user, which is estimated by a probability model. summarizes the surveyed methods according to four axes. The table is structured according to four main criteria that allow for a quick comparison: (i) how is a topic defined, (ii) which dimensions are incorporated into each method, (iii) which types of content each method can handle, and (iv) either the method detects actual bursts or predicts them. It should be noted that the table is not intended to express any preference regarding one method or another, but rather to present a global comparison. "
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "n": "4.",
               "text": "MODELING INFORMATION DIFFU-SION",
               "type": "modelling"
          },
          "paragraphs": [
               "Modeling how information spreads is of outstanding interest for stopping the spread of viruses, analyzing how misinformation spread, etc. In this section, we first give the basics of diffusion modeling and then detail the different models proposed to capture or predict spreading processes in OSNs. . . An ordered set of nodes capturing the order in which the nodes of the network adopted a piece of information.",
               "X X X X X X X X DEFINITION 7 (Spreading Cascade). A directed tree having as a root the first node of the activation sequence. The tree captures the influence between nodes (branches represent who transmitted the information to whom) and unfolds in the same order as the activation sequence."
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "text": "W W W W",
               "type": "modelling"
          },
          "paragraphs": [
               "The diffusion process is characterized by two aspects: its structure, i.e. the diffusion graph that transcribes who influenced whom, and its temporal dynamics, i.e. the evolution of the diffusion rate which is defined as the amount of nodes that adopts the piece of information over time. The simplest way to describe the spreading process is to consider that a node can be either activated (i.e. has received the information and tries to propagate it) or not. Thus, the propagation process can be viewed as a successive activation of nodes throughout the network, called activation sequence, defined in Definition 6.",
               "Usually, models developed in the context of OSNs assume that people are only influenced by actions taken by their connections. To put it differently, they consider that an OSN is a closed world and assume that information spreads because of informational cascades. That is why the path followed by a piece of information in the network (i.e. the diffusion graph) is often referred to as the spreading cascade, defined in Definition 7. Activation sequences are simply extracted from data by collecting messages dealing with the studied information, i.e. topic, and ordering them according to the time axis. This principle is illustrated in . It provides knowledge about where and when a piece of information propagated but not how and why did it propagate. Therefore, there is a need for models that can capture and predict the hidden mechanism underlying diffusion. We can distinguish two categories of models in this scope: (i) explanatory models and (ii) predictive models. In the following, we detail these two categories and analyze some representative efforts in both of them. ; u 2 ; u 3 ; u 5 ], with t 1 < t 2 < t 3 < t 4 ."
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "n": "4.1",
               "text": "Explanatory Models",
               "type": "modelling"
          },
          "paragraphs": [
               "The aim of explanatory models is to infer the underlying spreading cascade, given a complete activation sequence. These models make it possible to retrace the path taken by a piece of information and are very useful to understand how information propagated.",
               "Gomez et al. propose to explore correlations in nodes infections times to infer the structure of the spreading cascade and assume that activated nodes influence each of their neighbors independently with some probability. Thus, the probability that one node had transmitted information to another is decreasing in the difference of their activation time. They develop NETINF, an iterative algorithm based on submodular function optimization for finding the spreading cascade that maximizes the likelihood of observed data.",
               "Gomez et al. extend NETINF and propose to model the diffusion process as a spatially discrete network of continuous, conditionally independent temporal processes occurring at different rates. The likelihood of a node infecting another at a given time is modeled via a probability density function depending on infection times and the transmission rate between the two nodes. The proposed algorithm, NETRATE, infers pairwise transmission rates and the graph of diffusion by formulating and solving a convex maximum likelihood problem .",
               "These methods consider that the underlying network remains static over time. This is not a satisfying assumption, since the topology of OSNs evolves very quickly, both in terms of edges creation and deletion. For that reason, Gomez et al. extend NETRATE and propose a time-varying inference algorithm, INFOPATH, that uses stochastic gradients to provide on-line estimates of the structure and temporal dynamics of a network that changes over time.",
               "In addition, because of technical and crawling API limitations, there is a data acquisition bottle- neck potentially responsible for missing data. To overcome this issue, one approach is to crawl data as efficiently as possible. Choudhury et al. analysed how the data sampling strategy impacts the discovery of information diffusion in social media. Based on experimentations on Twitter data, they concluded that sampling methods that consider both network topology and users' attributes such as activity and localisation allow to capture information diffusion with lower error in comparison to naive strategies, like random or activity-only based sampling. Another approach is to develop specific models that assume that data are missing. Sadikov et al."
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "n": "4.2.1",
               "text": "Graph based approaches",
               "type": "modelling"
          },
          "paragraphs": [
               "develop a method based on a ktree model designed to, given only a fraction of the complete activation sequence, estimate the properties of the complete spreading cascade, such as its size or depth. We summarize the surveyed explanatory models in . In the following, we detail the second category of models, namely, predictive models.",
               "There are two seminal models in this category, namely Independent Cascades (IC ) and Linear Threshold (LT ) . They assume the existence of a static graph structure underlying the diffusion and focus on the structure of the process. They are based on a directed graph where each node can be activated or not with a monotonicity assumption, i.e. activated nodes cannot deactivate. The IC model requires a diffusion probability to be associated to each edge whereas LT requires an influence degree to be defined on each edge and an influence threshold for each node. For both models, the diffusion process proceeds iteratively in a synchronous way along a discrete time-axis, starting from a set of initially activated nodes, commonly named early adopters : DEFINITION 8 (Early Adopters). A set of users who are the first to adopt a piece of information and then trigger its diffusion."
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "n": "4.2",
               "text": "Predictive Models",
               "type": "modelling"
          },
          "paragraphs": [
               "These models aim at predicting how a specific diffusion process would unfold in a given network, from temporal and/or spatial points of view by learning from past diffusion traces. We classify existing models into two development axes, graph and non-graph based approaches.",
               "In the case of IC, for each iteration, the newly activated nodes try once to activate their neighbors with the probability defined on the edge joining them. In the case of LT, at each iteration, the inactive nodes are activated by their activated neighbors if the sum of influence degrees exceeds their own influence threshold. Successful activations are effective at the next iteration. In both cases, the process ends when no new transmission is possible, i.e. no neighboring node can be contacted. These two mechanisms reflect two different points of view: IC is sender-centric while LT is receiver-centric. An example of spreading process modeled with IC is given by . We detail hereafter models arising from those approaches and adapted to OSNs.",
               "Galuba et al. propose to use the LT model to predict the graph of diffusion, having already observed the beginning of the process. Their model relies on parameters such as information virality, pairwise users degree of influence and user probability of adopting any information. The LT model is fitted on the data describing the beginning of the diffusion process by optimizing the parameters using the gradient ascent method. However, LT can't reproduce realistic temporal dynamics.",
               "Saito et al. relax the synchronicity assumption of traditional IC and LT graph-based models by proposing asynchronous extensions. Named AsIC and AsLT (i.e. asynchronous independent cascades and asynchronous linear threshold), they proceed iteratively along a continuous time axis and require the same parameters as their synchronous counterparts plus a time-delay parameter on each edge of the graph. Models parameters are defined in a parametric way and authors provide a method to learn the functional dependency of the model parameters from nodes attributes. They formulate the task as a maximum likelihood estimation problem and an update algorithm that guarantees the convergence is derived. However, they only experimented with synthetic data and don't provide a practical solution.",
               "Guille et al. also model the propagation process as asynchronous independent cascades. They develop theT-BaSIC model (i.e. Time-Based Asynchronous Independent Cascades), which parameters aren't fixed numerical values but functions depending on time. The model parameters are estimated from social, semantic and temporal nodes' features using logistic regression.",
               ", WW W X X X : LIM forecasts the rate of diffusion by summing the influence functions of a given set of early adopters. Here, the early adopters are u 1 , u 2 and u 3 whose respective influence functions are Iu 1 , Iu 2 and Iu 3 ."
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "n": "4.2.2",
               "text": "Non-graph based approaches",
               "type": "modelling"
          },
          "paragraphs": [
               "Non-graph based approaches do not assume the existence of a specific graph structure and have been mainly developed to model epidemiological processes. They classify nodes into several classes (i.e. states) and focus on the evolution of the proportions of nodes in each class. SIR and SIS are the two seminal models , where S stands for \"susceptible\", I for \"infected\" (i.e. adopted the information) and R for recovered (i.e. refractory). In both cases, nodes in the S class switch to the I class with a fixed probability. Then, in the case of SIS, nodes in the I class switch to the S class with a fixed probability, whereas in the case of SIR they permanently switch to the R class. The percentage of nodes in each class is expressed by simple differential equations. Both models assume that every node has the same probability to be connected to another and thus connections inside the population are made at random. propose a simple and intuitive SIS model that requires a single parameter,. It assumes that all nodes have the same probabilityto adopt the information and nodes that have adopted the information become susceptible at the next time-step (i.e.= 1). This is a strong assumption since in real-world social networks, influence is not evenly distributed between all nodes and it is necessary to develop more complex modeling that take into account this characteristic.",
               "Yang et al.",
               "start from the assumption that the diffusion of information is governed by the influence of individual nodes. The method focuses on predicting the temporal dynamics of information diffusion, under the form of a time-series describing the rate of diffusion of a piece of information, i.e. the volume of nodes that adopt the information through time. They develop a Linear Influence model (LIM ), where the influence functions of individual nodes govern the overall rate of diffusion. The influence functions are represented in a non-parametric way and are estimated by solving a non-negative least squares problem using the Reflective Newton Method . illustrates how LIM forecasts the rate of diffusion from a set of early adopters and their activation time. propose a Partial Differential Equation (PDE ) based model to predict the diffusion of an information injected in the network by a given node. More precisely, a diffusive logistic equation model is used to predict both topological and temporal dynamics. Here, the topology of the network is considered only in term of the distance from each node to the source node. The dynamics of the process is given by a logistic equation that models the density of influenced users at a given distance of the source and at a given time. That definition of the network topology allows to formulate the problem simply, as for classical non-graph based methods while integrating some spatial knowledge. The ",
               "n/a n/a n/a x x AsLT T-BaSIC : Summary of diffusion prediction methods, distinguishing graph and nongraph based approaches w.r.t incorporated dimensions and mathematical modeling. parameters of the model are estimated using the Cubic Spline Interpolation method .",
               "We summarize the surveyed predictive models in . In the following section, we discuss the role of nodes in the propagation process and how to identify influential spreaders."
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "n": "5.",
               "text": "IDENTIFYING INFLUENTIAL INFOR-MATION SPREADERS",
               "type": "modelling"
          },
          "paragraphs": [
               "Identifying the most influential spreaders in a network is critical for ensuring efficient diffusion of information. For instance, a social media campaign can be optimized by targeting influential individuals who can trigger large cascades of further adoptions. This section presents briefly some methods that illustrate the various possible ways to measure the relative importance and influence of each node in an online social network. Kitsak et al. show that the best spreaders are not necessarily the most connected people in the network. They find that the most efficient spreaders are those located within the core of the network as identified by the k-core decomposition analysis , as defined in Definition 9. Basically, the principle of the k-core decomposition is to assign a core index k s to each node such that nodes with the lowest values are located at the periphery of the network while nodes with the highest values are located in the center of the network. The innermost nodes thus forms the core of the network. Brown et al. observe that the results of the k-shell decomposition on Twitter network are highly skewed. Therefore they propose a modified algorithm that uses a logarithmic mapping, in order to produce fewer and more meaningful k-shell values.",
               "Cataldi et al. propose to use the well known PageRank algorithm to assess the distribution of influence throughout the network. The PageRank value of a given node is proportional to the probability of visiting that node in a random walk of the social network, where the set of states of the random walk is the set of nodes.",
               "The methods we have just described only exploit the topology of the network, and ignore other important properties, such as nodes' features and the way they process information. Starting from the observation that most OSNs members are passive information consumers, Romero et al. develop a graph-based approach similar to the well known HITS algorithm, IP (i.e. Influence-Passivity), that assigns a relative influence and a passivity score to every users based on the ratio at which they forward information. However, no individual can be a universal influencer, and influential members of the network tend to be influential only in one or some specific domains of knowledge. Therefore, develop a non-graph based, topicsensitive method. To do so, they define a set of nodal and topical features for characterizing the network members. Using probabilistic clustering over this feature space, they rank nodes with a within-cluster ranking procedure to identify the most influential and authoritative people for a given topic. Weng et al. also develop a topic-sensitive version of the Page Rank algorithm dedicated to Twitter, TwitterRank.",
               "Kempe et al. adopt a different approach and propose to use the IC and LT models (previously described in Section 4.2.1) to tackle the influence maximization problem. This problem asks, for a parameter k, to find a k-node set of maximum influence in the network. The influence of a given set of nodes corresponds to the number of activated nodes at the end of the diffusion process according of little interest. In contrast, OLDA defines a topic as a distribution over a set of words but in turn has a high complexity, which prevents it from being applied at large scale. Consequently, there is a need for new methods that could produce intelligible results while preserving efficiency. We identify two possible ways to do so, through: (i) the conception of new scalable algorithms, or (ii) improved implementations of the algorithms using, e.g. distributed systems (such as Hadoop). Social dimension. Furthermore, popular topic detection could be improved by leveraging burstiness and people authority, as does TSTE, which relies on the PageRank algorithm. However, that possibility remains ill explored so far.",
               "Data complexity. Currently the focus is set on the textual content exchanged in social networks. However, more and more often, users exchange other types of data such as images, videos, URLs pointing to those objects or Web pages, etc. This situation has to be fully considered and integrated at the heart of the efforts carried out to provide a complete solution for topic detection.",
               "to IC or LT, using this set as the set of initially activated nodes. They provide an approximation for this optimization problem using a greedy hillclimbing strategy based on submodular functions.",
               "The surveyed influence assessment methods are summarized in ."
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "n": "6.",
               "text": "DISCUSSION",
               "type": "modelling"
          },
          "paragraphs": [
               "In this article, we surveyed representative and state-of-the-art methods related to information diffusion analysis in online social networks, ranging from popular topic detection to diffusion modeling techniques, including methods for identifying influential spreaders. presents the taxonomy of the various approaches employed to address these issues. Hereafter we provide a discussion regarding their shortcomings and related open problems.",
               "We distinguish two types of models, explanatory and predictive. Concerning predictive models, on the one hand there are non-graph based methods, that are limited by the fact that they ignore the topology of the network and only forecast the evolution of the rate at which information globally diffuses. On the other hand, there are graph based approaches that are able to predict who will influence whom. However, they cannot be used when the network is unknown or implicit. Although a lot of effort have been performed in this area, generally speaking, there is a need to consider more realistic constraints when studying information diffusion. In particular, the following issues have to be dealt with:"
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "n": "6.1",
               "text": "Detecting Popular Topics",
               "type": "modelling"
          },
          "paragraphs": [
               "The detection of popular topics from the stream of messages produced by the members of an OSN relies on the identification of bursts. There are mainly two ways to detect such patterns, by analyzing (i) term frequency or (ii) social interaction frequency. In this area, the following challenges certainly need to be addressed:",
               "Topic definition and scalability. It is obvious that not all methods define a topic in the same way. For instance Peaky Topics simply assimilates a topic to a word. It has the advantage to be a low complexity solution, however, the produced result is DEFINITION 10 (Closed World). The closed world assumption holds that information can only propagate from node to node via the network edges and that nodes cannot be influenced by external sources.",
               "Closed world assumption. The major observation about modeling information diffusion is certainly that all the described approaches work under a closed world assumption, defined in Definition 10. In other words, they assume that people can only be influenced by other members of the network and that information spreads because of informational cascades. However, most observed spreading pro- cesses in OSNs do not rely solely on social influence. The closed-world assumption is proven incorrect in recent work on Twitter done by Myers et al. in which authors observe that information tends to jump across the network. The study shows that only 71% of the information volume in Twitter is due to internal influence and the remaining 29% can be attributed to external events and influence. Consequently they provide a model capable of quantifying the level of external exposure and influence using hazard functions . To relax this assumption, one way would be to align users' profiles across multiple social networking sites. In this way, it would be possible to observe the information diffusion among various platforms simultaneously (subject to the availability of data). Some work tend to address this type of problems by proposing to de-anonymize the social networks .",
               "Cooperating and competing diffusion processes. In addition, the described studies rely on the assumption that diffusion processes are independent, i.e. each information spreads in isolation. argue that spreading processes cooperate and compete. Competing contagions decrease each other's probability of diffusion, while cooperating ones help each other in being adopted. They propose a model that quantifies how different spreading cascades interact with each other. It predicts diffusion probabilities that are on average 71% more or less than the diffusion probability would be for a purely independent diffusion process. We believe that models have to consider and incorporate this knowledge.",
               "Topic-sensitive modeling. Furthermore, it is important for predictive models to be topic-sensitive. have studied Twitter and found significant differences in the mechanics of information diffusion across topics. More particularly, they have observed that information dealing with politically controversial topics are particularly persistent, with repeated exposures continuing to have unusually large marginal effects on adoption, which validates the complex contagion principle that stipulates that repeated exposures to an idea are particularly crucial when the idea is controversial or contentious. Dynamic networks. Finally, it is important to note that OSNs are highly dynamic structures. Nonetheless most of the existing work rely on the assumption that the network remains static over time. Integrating link prediction could be a basis to improve prediction accuracy. A more complete review of literature on this topic can be found in ."
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "n": "6.3",
               "text": "Identifying Influential Spreaders",
               "type": "modelling"
          },
          "paragraphs": [
               "There are various ways to tackle this issue, ranging from pure topological approaches, such as kshell decomposition or HITS to textual clustering based approaches, including hybrid methods, such as IP which combines the HITS algorithm with nodes' features. As mentioned previously, there is no such thing as a universal influencer and therefore topic-sensitive methods have also been developed.",
               "Opinion detection. The notion of influence is strongly linked to the notion of opinion. Numerous studies on this issue have emerged in recent years, aiming at automatically detecting opinions or sentiment from corpus of data. We believe that it might be interesting to include this kind of work in the context of information diffusion. Work dealing with the diffusion of opinions themselves have emerged and it seems that there is an interest to couple these approaches."
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     },
     {
          "head": {
               "n": "6.4",
               "text": "Applications",
               "type": "modelling"
          },
          "paragraphs": [
               "Even if there are a lot of contributions in the domain of online social networks dynamics analysis, we can remark that implementations are rarely provided for re-use. What is more, available implementations require different formatting of the input data and are written using various programming languages, which makes it hard to evaluate or compare existing techniques. SONDY intends to facilitate the implementation and distribution of techniques for online social networks data mining.",
               "It is an open-source tool that provides data preprocessing functionalities and implements some of the methods reviewed in this paper for topic detection and influential spreaders identification. It features a user-friendly interface and proposes visualizations for topic trends and network structure."
          ],
          "paper_id": "2277fd30-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Information Diffusion in Online Social Networks: A Survey"
     }
]