[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "The increased popularity of social networking sites, such as LinkedIn, Facebook, and Twitter, has opened opportunities for new business models for electronic commerce, often referred to as social commerce. Social commerce involves using Web 2.0 social media technologies and infrastructure to support online interactions and user contributions to assist in the acquisition of products and services. Social media technologies not only provide a new platform for entrepreneurs to innovate but also raise a variety of new issues for e-commerce researchers that require the development of new theories. This could become one of the most challenging research arenas in the coming decade. The purpose of this introduction is to present a framework that integrates several elements in social commerce research and to summarize the papers included in this special issue. The framework includes six key elements for classifying social commerce research: research theme, social media, commercial activities, underlying theories, outcomes, and research methods. The proposed framework is valuable in defining the scope and identifying potential research issues in social commerce. We also explain how the papers included in this special issue fit into the proposed research framework."
          ],
          "paper_id": "228543a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Introduction to the Special Issue Social Commerce: A Research Framework for Social Commerce"
     },
     {
          "head": {
               "text": "What Is Social Commerce?",
               "type": "abstract"
          },
          "paragraphs": [
               "Although there is no standard definition of the term, social commerce (also known as social business), generally refers to the delivery of e-commerce activities and transactions via the social media environment, mostly in social networks and by using Web 2.0 software. Thus, SC can be considered a subset of e-commerce that involves using social media to assist in e-commerce transactions and activities. It also supports social interactions and user content contributions. In essence, it is a combination of commercial and social activities. Marsden collected 22 different definitions of SC, which include several of SC's properties (e.g., word of mouth, trusted advice, or buying with the help of friends). Stephen and Toubia defined SC as a form of Internet-based social media that allows people to actively participate in the marketing and selling of products and services in online marketplaces and communities. Dennison et al. used the IBM definition, which states that social commerce is the concept of word of mouth applied to e-commerce, and it is the marriage of a retailer's products and the interaction of shoppers with content.",
               "Note that many definitions of SC reflect the ideas of community-level participation and socioeconomic impacts in e-commerce. An SC Web site is a place where people can collaborate online, get advice from trusted individuals, find goods and services, and then purchase them. To summarize, SC has three major attributes: social media technologies, community interactions, and commercial activities.",
               "There are two major configurations of SC Web sites. First, social networking Web sites can add commercial features that allow for advertisements and transactions. For instance, Facebook, LinkedIn, and several other social networking Web sites open their application programming interfaces to allow commercial activities to be easily conducted among members. Second, traditional e-commerce Web sites such as Amazon.com can add social networking capabilities to take advantage of the power of social networking, allowing B2C Web sites to better understand and serve their customers. There are many success stories of the application of SC, mostly by large retailers (e.g., Coca-Cola, McDonald's, Starbucks, and Dell) and service providers (e.g., banks and airlines). Yet there are some stories of failure (e.g., Wal-Mart) and complaints about the waste of time and money as well as security and privacy breaches. Therefore, how to take advantage of this new form of e-commerce is a challenging issue for both practitioners and academia ."
          ],
          "paper_id": "228543a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Introduction to the Special Issue Social Commerce: A Research Framework for Social Commerce"
     },
     {
          "head": {
               "text": "A Framework for Social Commerce Research",
               "type": "abstract"
          },
          "paragraphs": [
               "Due to the complexity and innovativeness of SC, it is necessary to have a framework to organize relevant knowledge in a cohesive way that may be used to guide researchers and practitioners. This framework must be based on the essential attributes of SC and existing research foundations. From our description in the previous section, two major essential elements of social commerce can be identified. They are social media and commercial activities. We view them as the fundamental elements of SC. An event must include both in order to be called SC. These are illustrated on the left-hand side of the framework, as shown in .",
               "For academic researchers, there are four additional elements that must be included when defining research projects: research themes, theoretical foundations, outcome measures, and research methods. Different themes and methods often reflect different paradigms adopted by researchers. Underlying theories and the outcomes reflect different research purposes. Hence, we call them enrichment elements in SC research. When combined, the six elements (shown on the right-hand side of the framework) provide a framework that can be used to classify and guide research in social commerce. The essentials of the six elements are described next."
          ],
          "paper_id": "228543a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Introduction to the Special Issue Social Commerce: A Research Framework for Social Commerce"
     },
     {
          "head": {
               "text": "Social Networking Media",
               "type": "abstract"
          },
          "paragraphs": [
               "The power of SC is primarily due to the large number of members participating in social networks. Word of mouth and other activities in social networking play a key role in affecting the attitude and behavior of the user. Therefore, taking advantage of social networking is the most essential attribute of SC. Note that several types of Web sites exist in social media, such as blogs, microblogs, social networks, social shopping Web sites, and other Web 2.0 Web sites, such as YouTube and Flickr."
          ],
          "paper_id": "228543a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Introduction to the Special Issue Social Commerce: A Research Framework for Social Commerce"
     },
     {
          "head": {
               "text": "Commercial Activities",
               "type": "abstract"
          },
          "paragraphs": [
               "Some activities on social networking Web sites are not commercial in nature. For instance, people share their thoughts, information about a news event, photos, and jokes for amusement. These, albeit popular, cannot be identified as social commerce because these activities do not lead to any commercial benefits such as buying or selling products or attitude changes on certain commercial events. Therefore, it is essential that information sharing or other activities of social media involve commercial intentions and implications. To define it broadly, any kind of activity that leads to commercial benefits falls into the definition of commercial activities. The major commercial activities are listed in . Note that the major four groups of activities are in the areas of marketing, enterprise management, technology support, and management. The figure shows a broad scope of sample activities in each group that can benefit from the use of social media."
          ],
          "paper_id": "228543a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Introduction to the Special Issue Social Commerce: A Research Framework for Social Commerce"
     },
     {
          "head": {
               "text": "Research Themes",
               "type": "abstract"
          },
          "paragraphs": [
               "A research theme is the central issue that a research project intends to explore. All research projects must have a clear theme. For example, a study may want to discover how social networking sites can influence the loyalty of its members. If the intention is to explore the role of different Web site functionality on customer loyalty, then the research theme is the Web site design. If the intention is to explore how word of mouth affects consumer attitudes, the research theme is user behavior."
          ],
          "paper_id": "228543a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Introduction to the Special Issue Social Commerce: A Research Framework for Social Commerce"
     },
     {
          "head": {
               "text": "Research Methods",
               "type": "abstract"
          },
          "paragraphs": [
               "Another essential element for differentiating research projects is their research method. Different research methods have different strengths and limitations."
          ],
          "paper_id": "228543a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Introduction to the Special Issue Social Commerce: A Research Framework for Social Commerce"
     },
     {
          "head": {
               "text": "Figure 2. The Major Activities of Social Commerce",
               "type": "abstract"
          },
          "paragraphs": [
               "For example, the case study method allows insights of a particular event to be explored in detail, but the generalizability of the findings is usually low. A longitudinal study, for example, can reveal insights that may not be found from a cross-sectional survey. Selection of a proper research method is an important factor for SC research projects."
          ],
          "paper_id": "228543a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Introduction to the Special Issue Social Commerce: A Research Framework for Social Commerce"
     },
     {
          "head": {
               "text": "Underlying Theories",
               "type": "abstract"
          },
          "paragraphs": [
               "For a research to be academically solid, inclusion of theoretical foundations often plays a critical role. For SC research, theories related to social interaction and social process may be useful in understanding consumer behavior and predicting the outcomes. In , we list a few of them. For instance, the motivation theory may help explain why people perform SC and how intrinsic and extrinsic motivations work in social commerce. Trust theory is used in interpreting social behavior and may be able to shed light on issues in SC research (e.g., )."
          ],
          "paper_id": "228543a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Introduction to the Special Issue Social Commerce: A Research Framework for Social Commerce"
     },
     {
          "head": {
               "text": "Outcome measures",
               "type": "abstract"
          },
          "paragraphs": [
               "The outcome measures indicate the eventual results a research project intends to find. It is usually the dependent variable in a research model. In , we have identified a few popular ones. For instance, customer loyalty is often a target in social marketing research. Financial gains and market growth may be the outcomes for investigating whether a particular social commerce business model works. Web site usage is an outcome measure adopted in user behavior or technology adoption research.",
               "All SC research could have corresponding elements in the above framework. For example, Liang, et al. are studying the factor of social support and how it may affect the intention to conduct social commerce in a social networking Web site. The corresponding elements in the framework of the study are: The framework has two major values for researchers. First, it can be used to differentiate research projects and help organize a large amount of literature for synthesis, comparison, and further analysis. Second, it can be used to identify potential research issues. For example, if we intend to study how SC may affect the performance of a company, then we can use the following steps to build a feasible research project:",
               "1. Identify a research theme, such as firm performance or business model. 2. Choose a research method, such as to survey companies that have adopted SC. 3. Determine the commercial activities to be studied, such as advertising or customer relationship management. 4. Determine proper social media to be investigated (i.e., different types of social media-Facebook, LinkedIn, or Twitter). If the social media type may be an influencing factor, then choose a few of them for comparison. 5. Find theoretical foundations on which to construct the model. If the project intends to study the effect of social advertising, can the persuasion theory or the uses and gratifications theory be chosen? 6. Determine the outcomes and their proper measurements. For social advertising research, possible outcome measures may be clickthrough rates, customer attitude, or customer loyalty. Given the above sample, we can see that our framework provides a useful tool for SC research. Of course, the examples described in this introduction are not all-inclusive. Interested readers may extend the framework to fit their study."
          ],
          "paper_id": "228543a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Introduction to the Special Issue Social Commerce: A Research Framework for Social Commerce"
     },
     {
          "head": {
               "text": "The Papers in This Special Issue",
               "type": "abstract"
          },
          "paragraphs": [
               "Four papers are included in this special issue. They went through two rounds of review and revision, and they represent a wide range of research themes, commercial activities, media types, theories, outcomes, and research methods. shows how they fit into the proposed framework.",
               "The paper by focuses on how social shopping features in a shopping Web site affect purchasing behavior. More specifically, the paper classifies Web site features into general, direct, and social shopping and then analyzes the predictability of these features with the actual purchase using clickstream data. Through the analysis of over 2.7 million data items, the researchers found that tagging and high ratings have a positive impact on user click-outs. In contrast, the more lists and styles used, the less likely the user is to click out, although lists and styles seem to enhance the site's stickiness and exploration. Moreover, the more direct shopping features are used, the less likely the user is to click out.",
               "The second paper, by Pagani and Mirabello , targets the usage behavior of social television. The researchers conducted a comprehensive survey to investigate how personal and social interactive engagements affect the active and passive use of TV in a social Web site. The results show that social interactive engagement is positively associated with both active and passive usages.",
               "The third paper, by Liang, Ho, Li, and Turban , investigates how social influence may affect the user's intention to recommend and ask for social commerce information. The researchers adopted the social support theory to analyze the role of informational and emotional support in social commerce and found that both social support and Web site quality affect the intention to adopt social commerce. However, their effects are mediated by the relationship quality between the user and the social networking Web site.",
               "The fourth paper, by Amblee and Bui , examines the effect of electronic word of mouth (eWOM) on B2C Web site sales. The researchers studied the market of Amazon Shorts' e-books, which included digital microproducts sold at low and unique selling prices, and found that eWOM is a useful vehicle for conveying reputation and generating a higher level of sales.",
               "Overall, the research framework proposed in this introduction and the representative papers published in this issue can serve as a good foundation for those who are interested in studying SC. Given the rapid expansion of social media, we hope that this pioneering work will attract more scholars to the exploration of these potential research issues."
          ],
          "paper_id": "228543a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Introduction to the Special Issue Social Commerce: A Research Framework for Social Commerce"
     }
]