[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "The pervasive use of social media has generated unprecedented amounts of social data. Social media provides easily an accessible platform for users to share information. Mining social media has its potential to extract actionable patterns that can be beneficial for business, users, and consumers. Social media data are vast, noisy, unstructured, and dynamic in nature, and thus novel challenges arise. This tutorial reviews the basics of data mining and social media, introduces representative research problems of mining social media, illustrates the application of data mining to social media using examples, and describes some projects of mining social media for humanitarian assistance and disaster relief for real-world applications."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Data mining research has successfully produced numerous methods, tools, and algorithms for handling large amounts of data to solve real-world problems. Traditional data mining has become an integral part of many application domains including bioinformatics, data warehousing, business intelligence, predictive analytics, and decision support systems. Primary objectives of the data mining process are to effectively handle large-scale data, extract actionable patterns, and gain insightful knowledge. Because social media is widely used for various purposes, vast amounts of user-generated data exist and can be made available for data mining. Data mining of social media can expand researchers' capability of understanding new phenomena due to the use of social media and improve business intelligence to provide better services and develop innovative opportunities. For example, data mining techniques can help identify the influential people in the vast blogosphere, detect implicit or hidden groups in a social networking site, sense user sentiments for proactive planning, develop recommendation systems for tasks ranging from buying specific products to making new friends, understand network evolution and changing entity relationships, protect user privacy and security, or build and strengthen trust among users or between users and entities. Mining social media is a burgeoning multidisciplinary area where researchers of different backgrounds can make important contributions that matter for social media research and development.",
               "The objective of this tutorial is to introduce social media, data mining, and their confluence-mining social media. We attempt to achieve the goal by presenting representative and interesting research issues and important social media tasks based on our experience and research. This tutorial first reviews data mining, social media and its types, and the importance of social media mining. In2, we briefly introduce representative issues in social media mining. In3, we highlight the impact of social media mining using three examples based on our current research. Section 4 illustrates how social media mining is applied in some real-world applications-two projects on humanitarian assistance and disaster relief (HADR) carried out in the Data Mining and Machine Learning Laboratory (DMML) at Arizona State University (ASU). We conclude this tutorial in5."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "1.1.",
               "text": "Data Mining",
               "type": "introduction"
          },
          "paragraphs": [
               "Data mining (Tan et al. ) is a process of discovering useful or actionable knowledge in large-scale data. Data mining also means knowledge discovery from data (KDD) (Han et al. ), which describes the typical process of extracting useful information from raw data. The KDD process broadly consists of the following tasks: data preprocessing, data mining, and postprocessing. These steps need not be separate tasks and can be combined together. Data mining is an integral part of many related fields including statistics, machine learning, pattern recognition, database systems, visualization, data warehouse, and information retrieval (Han et al. ). Data mining algorithms are broadly classified into supervised, unsupervised, and semisupervised learning algorithms. Classification is a common example of supervised learning approach. For supervised learning algorithms, a given data set is typically divided into two parts: training and testing data sets with known class labels. Supervised algorithms build classification models from the training data and use the learned models for prediction. To evaluate a classification model's performance, the model is applied to the test data to obtain classification accuracy. Typical supervised learning methods include decision tree induction, k-nearest neighbors, naive Bayes classification, and support vector machines.",
               "Unsupervised learning algorithms are designed for data without class labels. Clustering is a common example of unsupervised learning. For a given task, unsupervised learning algorithms build the model based on the similarity or dissimilarity between data objects. Similarity or dissimilarity between the data objects can be measured using proximity measures including Euclidean distance, Minkowski distance, and Mahalanobis distance. Other proximity measures such as simple matching coefficient, Jaccard coefficient, cosine similarity, and Pearson's correlation can also be used to calculate similarity or dissimilarity between the data objects. K-means, hierarchical clustering (agglomerative or partitional methods), and density-based clustering are typical examples of unsupervised learning.",
               "Semisupervised learning algorithms are most applicable where there exist small amounts of labeled data and large amounts of unlabeled data. Two typical types of semisupervised learning are semisupervised classification and semisupervised clustering. The former uses labeled data to make classification and unlabeled data to refine the classification boundaries further, and the latter uses labeled data to guide clustering. Cotraining is a representative semisupervised learning algorithm. Active learning algorithms allow users to play an active role in the learning process via labeling. Typically, users are domain experts and their skills are employed to label some data instances for which a machine learning algorithm are confident about its classification. Minimum marginal hyperplane and maximum curiosity are two popular active learning algorithms.",
               "Data mining includes other techniques such as association rule mining, anomaly detection, feature selection, instance selection, and visual analytics. Additional details related to these data mining techniques can be found in Han et al. , , , Zhao and Liu , and Liu and Motoda ."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "1.2.",
               "text": "Social Media",
               "type": "introduction"
          },
          "paragraphs": [
               "Social media ) is defined as a group of Internet-based applications that build on the ideological and technological foundations of Web 2.0 and that allow the creation and exchanges of user-generated content. Social media is conglomerate of different types of social media sites including traditional media such as newspaper, radio, and television and nontraditional media such as Facebook, Twitter, etc. shows characteristics of different types of social media.",
               "Social media gives users an easy-to-use way to communicate and network with each other on an unprecedented scale and at rates unseen in traditional media. The popularity of social media continues to grow exponentially, resulting in an evolution of social networks, blogs, . Characteristics of different types of social media."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "text": "Type Characteristics",
               "type": "introduction"
          },
          "paragraphs": [
               "Online social networking Online social networks are Web-based services that allow individuals and communities to connect with real-world friends and acquaintances online. Users interact with each other through status updates, comments, media sharing, messages, etc. (e.g., Facebook, Myspace, LinkedIn). Blogging A blog is a journal-like website for users, aka bloggers, to contribute textual and multimedia content, arranged in reverse chronological order. Blogs are generally maintained by an individual or by a community (e.g., Huffington Post, Business Insider, Engadget)."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "text": "Microblogging",
               "type": "introduction"
          },
          "paragraphs": [
               "Microblogs can be considered same a blogs but with limited content (e.g., Twitter, Tumblr, Plurk). Wikis A wiki is a collaborative editing environment that allow multiple users to develop Web pages (e.g., Wikipedia, Wikitravel, Wikihow). Social news Social news refers to the sharing and selection of news stories and articles by community of users (e.g., Digg, Slashdot, Reddit). Social bookmarking Social bookmarking sites allow users to bookmark Web content for storage, organization, and sharing (e.g., Delicious, StumbleUpon)."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "text": "Media sharing",
               "type": "introduction"
          },
          "paragraphs": [
               "Media sharing is an umbrella term that refers to the sharing of variety of media on the Web including video, audio, and photo (e.g., YouTube, Flickr, UstreamTV). Opinion, reviews, and ratings The primary function of such sites is to collect and publish usersubmitted content in the form of subjective commentary on existing products, services, entertainment, businesses, places, etc. Some of these sites also provide products reviews (e.g., Epinions, Yelp, Cnet). Answers",
               "These sites provide a platform for users seeking advice, guidance, or knowledge to ask questions. Other users from the community can answer these questions based on previous experiences, personal opinions, or relevent research. Answers are generally judged using ratings and comments (e.g., Yahoo! answers, WikiAnswers).",
               "microblogs, location-based social networks (LBSNs), wikis, social bookmarking applications, social news, media (text, photo, audio, and video) sharing, product and business review sites, etc. Facebook, 1 the social networking site, recorded more than 845 million active users as of December 2011. This number suggests that China (approximately 1.3 billion) and India (approximately 1.1 billion) are the only two countries in the world that have larger populations than Facebook. Facebook and Twitter have accrued more than 1.2 billion users, 2 more than thrice the population of the United States and more than the population of any continent except Asia."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "1.3.",
               "text": "Mining Social Media",
               "type": "introduction"
          },
          "paragraphs": [
               "Vast amounts of user-generated content are created on social media sites every day. This trend is likely to continue with exponentially more content in the future. Hence, it is critical for producers, consumers, and service providers to figure out management and utility of massive user-generated data. Social media growth is driven by these challenges: (1) How can a user be heard? (2) Which source of information should a user use? (3) How can user experience be improved? Answers to these questions are hidden in the social media data. These challenges present ample opportunities for data miners to develop new algorithms and methods for social media.",
               "Data generated on social media sites are different from conventional attribute-value data for classic data mining. Social media data are largely user-generated content on social media sites. Social media data are vast, noisy, distributed, unstructured, and dynamic. These characteristics pose challenges to data mining tasks to invent new efficient techniques and algorithms. For example, Facebook and Twitter 4 report Web traffic data from approximately 149 million and 90 million unique U.S. visitors per month, respectively. According to the video sharing site YouTube, 5 more than 4 billion videos are viewed per day, and 60 hours of videos are uploaded every minute. The picture sharing site Flickr, as of August 2011, hosts more than 6 billion photo images. Web-based, collaborative, and multilingual Wikipedia 7 hosts over 20 million articles attracting over 365 million readers.",
               "Depending on social media platforms, social media data can often be very noisy. Removing the noise from the data is essential before performing effective mining. Researchers notice that spammers ( , Chu et al. ) generate more data than legitimate users. Social media data are distributed because there is no central authority that maintains data from all social media sites. Distributed social media data pose a daunting task for researchers to understand the information flows on the social media. Social media data are often unstructured. To make meaningful observations based on unstructured data from various data sources is a big challenge. For example, social media sites like LinkedIn, Facebook, and Flickr serve different purposes and meet different needs of users.",
               "Social media sites are dynamic and continuously evolving. For example, Facebook recently brought about many concepts including a user's timeline, the creation of in-groups for a user, and numerous user privacy policy changes. The dynamic nature of social media data is a significant challenge for continuously and speedily evolving social media sites. There are many additional interesting questions related to human behavior can be studied using social media data. Social media can also help advertisers to find the influential people to maximize the reach of their products within an advertising budget. Social media can help sociologists to uncover the human behavior such as in-group and out-group behaviors of users. Recently, social media was reported to play an instrumental role in facilitating mass movements such as the Arab Spring 8 and Occupy Wall Street. 9"
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "2.",
               "text": "Issues in Mining Social Media",
               "type": "introduction"
          },
          "paragraphs": [
               "In this section, we introduce some representative research issues in mining social media."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "2.1.",
               "text": "Community Analysis",
               "type": "introduction"
          },
          "paragraphs": [
               "A community is formed by individuals such that those within a group interact with each other more frequently than with those outside the group. Based on the context, a community is also referred to as a group, cluster, cohesive subgroup, or module. Communities can be observed via connections in social media because social media allows people to expand social networks online (Tang and Liu ). Social media enables people to connect friends and"
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "paragraphs": [
               "find new users of similar interests. Communities found in social media are broadly classified into explicit and implicit groups. Explicit groups are formed by user subscriptions, whereas implicit groups emerge naturally through interactions. Community analysts are generally faced with issues such as community detection, formation, and evolution. Community detection often refers to the extraction of implicit groups in a network. The main challenges of community detections are that (1) the definition of a community can be subjective, and (2) the lack of ground truth makes community evaluation difficult. Tang and Liu divided community detection methods into four categories: (1) node-centric community detection, where each node satisfies certain properties such as complete mutuality, reachability, node degrees, frequency of within and outside ties, etc. (examples include cliques, k-cliques, and k-clubs); (2) group-centric community detection, where a group needs to satisfy certain properties (for example, minimum group densities); (3) network-centric community detection, where groups are formed based on partition of network into disjoint sets (examples are spectral clustering and modularity maximization); and (4) hierarchycentric community detection, where the goal is to build a hierarchical structure of communities. This allows the analysis of a network with different resolutions. Representative methods are divisive clustering and agglomerative clustering.",
               "Social media networks are highly dynamic. Communities can expand, shrink, or dissolve in dynamic networks. Community evolution aims to discover the patterns of a community over time with the presence of dynamic network interactions. Backstrom et al. found that the more friends you have in a group, the more likely you are to join, and communities with cliques grow more slowly than those that are not tightly connected."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 10,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "2.2.",
               "text": "Sentiment Analysis and Opinion Mining",
               "type": "introduction"
          },
          "paragraphs": [
               "Sentiment analysis and opinion mining aim to automatically extract opinions expressed in the user-generated content. Sentiment analysis and opinion mining tools allow businesses to understand product sentiments, brand perception, new product perception, and reputation management. These tools help users to perceive product opinions or sentiments on a global scale. There are many social media sites reporting user opinions of products in many different formats. Monitoring these opinions related to a particular company or product on social media sites is a new challenge.",
               "Sentiment analysis is hard because languages used to create contents are ambiguous. Major steps of sentiment analysis are (1) finding relevant documents, (2) finding relevant sections, (3) finding the overall sentiment, (4) quantifying the sentiment, and (5) aggregating all sentiments to form an overview. Basic components of an opinion are (1) an object on which opinion is expressed, (2) an opinion expressed on a object, and (3) the opinion holder. Objects are generally represented as a finite set of features, where each feature represents a finite set of synonymous words or phrases. Opinion mining tasks can be performed at the document level , Pang et al. ), sentence level (Riloff and Wiebe , Yu and Hatzivassiloglou ), or feature level (Hu and Liu , Popescu and Etzioni , Liu and Maes ). Extracting opinions expressed in comparative sentences is a difficult task, and some preliminary work can be found in Jindal and Liu , Jindal and Liu , Liu , and Pang and Lee . Performance evaluation of sentiment analysis is another challenge because of the lack of ground truth."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "2.3.",
               "text": "Social Recommendation",
               "type": "introduction"
          },
          "paragraphs": [
               "Traditional recommendation systems attempt to recommend items based on aggregated ratings of objects from users or past purchase histories of users. A social recommendation system makes use of user's social network and related information in addition to the traditional recommendation means. Social recommendation is based on the hypothesis that people who are socially connected are more likely to share the same or similar interests (homophily), and users can be easily influenced by the friends they trust and prefer their friends' recommendations to random recommendations. Objectives of social recommendation systems are to improve the quality of recommendation and alleviate the problem of information overload. Examples of social recommendation systems are book recommendations based on friends' reading lists on Amazon or friend recommendations on Twitter and Facebook. More details on social recommendation systems can be found in , Ma et al. , and Backstrom and Leskovec ."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "2.4.",
               "text": "Influence Modeling",
               "type": "modelling"
          },
          "paragraphs": [
               "Social scientists have been exploring influence and homophily in social networks for quite some time ( , Lazarsfeld and Merton ). It is important to know whether the underlying social network is influence driven or homophily driven. For example, in the advertisement industry, if the social network is influence driven, then the influential users should be identified and incentivized to promote the product or services to the members of the social network. However, if the social network is homophily (similarity) driven, then some individual users should be directly targeted to promote sales. Most social networks have a mixture of both homophily and influence. Hence, distinguishing them is a challenge. Aral et al. and La Fond and Neville gave details on distinguishing social influence and homophily in social networks.studied the influence maximization problem. For a given information propagation model, influence maximization aims to identify the set of initial influential users from a given snapshot of a social network such that they can influence the maximum number of other users within given budget constraints. Agarwal et al. presented a preliminary model to identify influential bloggers in a community. The blogosphere obeys a power law distribution with a few blogs being extremely influential and a huge number of blogs being largely unknown. They reported that active bloggers are not necessarily influential and proposed effective influence measures to identify influential bloggers. A more general discussion on modeling and data mining in the blogosphere is given by Agarwal and Liu ."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "2.5.",
               "text": "Information Diffusion and Provenance",
               "type": "modelling"
          },
          "paragraphs": [
               "Researchers study how information diffuses and explore different models of information diffusion, including the independent cascade model, the threshold model, the susceptibleinfected model, and the susceptible-infected-recovered model. Many such models have been studied , Granovetter , Mahajan , Macy , Berger ). Researchers apply these models to analyze the spread of rumors, computer viruses, and diseases during outbreaks. Two important problems from the social media viewpoint are (1) how information spreads in a social media network and which factors affect the spread, and what plausible sources are, given some information from social media. The first problem of information diffusion has received good attention from researchers. The second problem is still an open research problem-information provenance in social media-and recognized as a key issue to differentiate rumors from truth. Because social media data are distributed and dynamic, the conventional techniques used in classical provenance research cannot be directly applied in social media."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "2.6.",
               "text": "Privacy, Security, and Trust",
               "type": "modelling"
          },
          "paragraphs": [
               "The low barrier to and pervasive use of social media give rise to concerns on user privacy and security issues. New challenges arise due to user's opposing needs: on one hand, a user would like to have as many friends and share as much as possible, and on the other hand, a user would like to be as private as possible when needed. However, being gregarious requires openness and transparency, but being private constricts one's sharing. In addition, a social networking site has its business needs to encourage users to easily find each other and expand their friendship networks as widely as possible-in other words, to be open. Hence, social media poses new security challenges to fend off security threats to users and organizations. With the variety of personal information disclosed in user profiles (e.g., information about other users and user networks may be indirectly accessible), individuals may put themselves and members of their social networks at risk for a variety of attacks. Social media has been the target of numerous passive as well as active attacks including stalking, cyberbullying, malvertizing, phishing, social spamming, scamming, and clickjacking.",
               "Gross and Acquisti showed that only a few users change the default privacy preferences on Facebook. In some cases, user profiles are completely public, making information available and providing a communication mechanism to anyone who wants to access it. It is no secret that when a profile is made public, malicious users including stalkers, spammers, and hackers can use sensitive information for their personal gain. Sometimes malevolent users can even cause physical or emotional distress to other users (Rosenblum ). Narayanan and Shmatikov ",
               "Liu and Maes pointed out a lack of privacy awareness and found a large number of social network profiles in which people described themselves with a rich vocabulary in terms of their passions and interests. Krishnamurthy and Wills discussed the problem of leakage of personally identifiable information and how it can be misused by third parties (Narayanan and Shmatikov ). Squicciarini et al. introduced a novel collective privacy mechanism for better managing shared content between users. Fang and LeFevre focused on helping users to understand simple privacy settings, but did not consider additional problems such as attribute inference (Zheleva and Getoor ) or shared data ownership (Squicciarini et al. ). Zheleva and Getoor showed how an adversary can exploit an online social network with a mixture of public and private user profiles to predict the private attributes of users. Baden et al. presented a framework where users dictate who may access their information based on public-private encryption-decryption algorithms.",
               "Social trust depends on many factors that cannot be easily modeled in a computational system. Many different versions of definition of trust are proposed in the literature (Deutsch "
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "text": ", Sztompka [54], Mui et al. [44], Olmedilla et al. [47], Grandison and",
               "type": "modelling"
          },
          "paragraphs": [
               "Sloman , Artz and Gil ). A highly cited thesis on trust computation (Marsh ) provides theoretical perspectives of modeling trust, but its complex nature makes it very difficult to apply, especially to social networks (Golbeck and Hendler ). Trust between any two people is observed to be affected by many factors including past experiences, opinions expressed and actions taken, contributions to spreading rumors, influence by others' opinions, and motives to gain something extra. Another important aspect of trust is the trustworthiness of user-generated content. Moturu and Liu provided an intuitive scoring measure to quantify the trustworthiness of health-related user-generated content in social media."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "3.",
               "text": "Illustrative Examples of Mining Social Media",
               "type": "modelling"
          },
          "paragraphs": [
               "In this section, we present some examples in our research to illustrate how to mine social media data to address novel research issues. The first example is about assessing user vulnerability on a social networking sites to maintain user privacy. The second example explores the importance of social and historical ties on a location-based social network. The third example introduces a method that can take advantage of multifaceted trust for predictive analytics."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "Assessing User Vulnerability on a Social Networking Site (Gundecha et al. [23])",
               "type": "modelling"
          },
          "paragraphs": [
               "Attribute-value data are a principal data form in social media. Attributes available for every user on a social networking site can be categorized into two major types: individual attributes and community attributes. Individual attributes are those attributes that contain individual user information. Individual attributes include personal information such as gender, birth date, phone number, home address, etc. Community attributes are those attributes that contain information about the friends of a user. Community attributes include friends that are traceable from a user's profile (i.e., a user's friends list), tagged pictures, and wall interactions. Using the privacy and security settings of a profile, a user can control the visibility of most individual attributes but has limited control over the visibility of most community attributes. For example, Facebook users these days can control photo tagging and the sharing of their friend list with the public but still can not control friends sharing their friend lists or uploading photos of them from their profiles to the public. Our earlier work (Gundecha et al. ) used a large-scale Facebook data set to assess attribute visibility, which can be used to obtain general behavior of Facebook users. For example, Facebook users do not usually disclose their mobile phone number. Hence, users that do disclose phone numbers have a propensity to vulnerability because they disclose more sensitive information in their profiles. A large portion of users are either not careful or not aware of consequences of their actions on the privacy information of their friends. Thus, protecting community attributes is important in protecting user privacy.",
               "A novel mechanism was proposed by Gundecha et al. to enable users to protect against vulnerability. Often users on a social networking site are unaware that they could pose a threat to their friends because of their vulnerability. Gundecha et al. showed that it is feasible to measure a user's vulnerability based on three factors: (1) the user's privacy settings that can reveal personal information, (2) the user's action on a social networking site that can expose his or her friends' personal information, and (3) friends' actions on a social networking site that can reveal the user's personal information. Based on these factors, Gundecha et al. formally presented one of the earliest models for vulnerability reduction. They proposed a four-step procedure to estimate user vulnerability: (1) estimate risk to privacy due to individual attributes (referred to as the I-index), (2) estimate risk to privacy due to community attributes (referred to as the C-index), (3) estimate the visibility of a user based on the I-index and C-index (referred to as the P -index), and (4) estimate the user vulnerability based on the P -indexes of a user and his one-hop friends (referred to as the V -index).",
               "Figures 1(a) and 1(b) show the relationship between the I-index and C-index as well as that between the P -index and V -index for 100,000 randomly chosen Facebook users. Note that users are sorted in ascending order of their I-indexes and P -indexes. The x-axis and y-axis show users and their index values, respectively. A user's vulnerable friend is defined as a friend whose unfriending will lower the V -index score of a user. This definition of a vulnerable friend can be generalized to multiple vulnerable friends. shows a comparison of the V -index values of each user before and after the unfriending of the user's k most vulnerable friends. For each graph in , the x-axis and y-axis indicate users and their V -index values, respectively. Without loss of generality, we sorted all users, in the ascending order based on the existing V -index values, before we plotted the graphs in . We ran the experiment on 300,000 randomly selected users of the Facebook data set. shows the performance comparison of V -index values for each user before (+) and after (?) unfriending the k most vulnerable friends. We ran the experiments for different values of k including 1, 2, 10, and 50. As expected, vulnerability decreases consistently as the value of k increases, as seen in . a) I-index and Cindex for each user (b) P -index and Vindex for each user LBSNs have been a popular form of social media in recent years. They provide locationrelated services that allow users to check in at geographical locations and share such experience with their friends. Millions of check-in records in LBSNs contain rich social and geographical information and provide a unique opportunity for researchers to study users' social behavior from a spatial-temporal aspect, which in turn enables a variety of services including place advertisement or recommendation, traffic forecasting, and disaster relief.",
               "To understand a user's check-in behavior, it is inevitable to perform a historical analysis of users. It is because the historical check-ins provide rich information about a user's interests and hints about when and where a particular user would like to go. In addition, social correlation theory suggests to consider users' social ties, because human movement is usually affected by their social events, such as visiting friends, going out with colleagues, and so on. These two relationship ties can shape the user's check-in experience on LBSNs, and each tie gives rise to a different probability of check-in activity, which indicates that people in different spatial-temporal-social circles have different interactions.",
               "The historical ties of a user's check-in behavior have two properties on LBSNs. First, a user's check-in history approximately follows a power-law distribution; i.e., a user goes to a few places many times and to many places a few times. Second, the historical ties have a short-term effect. Taking advantage of the similarity between language modeling and location-based social network mining, the work of Gao et al. introduced the Pitman-Yor process to location-based social networks to model the historical ties of a user i for his checkin behavior c n+1 = l at time (n + 1) and location l, specifically, the power-law distribution and short-term effect of historical ties, denoted as historical model (HM) as shown below:",
               "where u, t ul , d |u| , r |u| , and t u are parameters. A social-historical model (SHM) is proposed to explore user i's check-in behavior integrating both of the social and historical effects:",
               "where",
               "where N indicates user i's set of neighbors.",
               "The experiments with location prediction on a real-world LBSN compare the proposed methods (HM and SHM) with some baseline methods. The results are plotted in , demonstrating that the proposed methods best model users' check-ins in terms of location prediction; in other words, social and historical ties can help location prediction.",
               "This work finds that a user's friends can influence his next location because users that have shared friends tend to go to similar locations than those without. The power-law property and short-term effect are observed in historical ties; thus, a historical model is introduced to capture these properties. The experimental results on location prediction demonstrate that the proposed approach is suitable in capturing a user's check-in property and outperforms current models."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "3.3.",
               "text": "Discerning Multifaceted Trust in a Connected World (Tang et al. [57])",
               "type": "modelling"
          },
          "paragraphs": [
               "The issue of trust has attracted increasing attention from the community of social media research. Trust, as a social concept, naturally has multiple facets, indicating multiple and heterogeneous trust relationships between users. Here is a multifaceted trust example from Epinions. (a) shows single trust relationships between user 1 and his 20 friends. Here, we can see that user 7 is the more trustable for user 1. and 4(c) show their multifaceted trust relationships in the categories \"home and garden\" and \"restaurants,\" respectively. For the category \"home and garden,\" user 7 is not necessary the most trusted . The performance comparison of prediction models demonstrates that by considering social and historical ties, the proposed models can help location prediction. Fraction of training set",
               "Note. MFC, most frequent check-in model; MFT, most frequent time model; Order-1, order-1 Markov model; Order-2, order-2 Markov model.",
               "friend of user 1. This shows that trust relationships in different categories vary. Thus, people trust others differently in different facets.",
               "There are two challenges to study in obtaining multifaceted trust between users: first, the representation of multiple and heterogeneous trust relationships between users, and second, estimating the strength of multifaceted trust. Traditionally, trust is represented by an adjacency matrix. However, this cannot capture the multifaceted trust relations.developed a new algorithm, mTrust, that extends a matrix representation to a tensor representation, adding an extra dimension for facet description. Previous work observed a strong correlation between trust and user similarity in the context of rating systems. Therefore, it is reasonable to embed trust strength inference in rating prediction. Thus, to evaluate the usefulness of multifaced trust, this work embeds the multifaceted trust inference in the framework of rating prediction.",
               "Interesting findings from the experiments are that (1) more than 20% of reciprocal links are heterogeneous, (2) more than 14% transitive trust relations are heterogeneous, and (3) more than 11% of cocitation trust relations are heterogeneous. With these findings, mTrust can be applied to many online tasks such as improving rating prediction, enabling facet-sensitive ranking, and making status theory applicable to reciprocal links."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 19,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "4.",
               "text": "Employing Social Media in Real-World Applications",
               "type": "modelling"
          },
          "paragraphs": [
               "Social media has been increasingly used in a wide range of domains; examples include political campaigns (e.g., presidential elections), mass movements (e.g., organizing Occupy Wall Street movements, Arab Spring), as well as disaster and crisis response and relief coordination. In this section, we show how social media mining is used for HADR.",
               "Government and nongovernmental organizations (NGOs) have been faced with challenges to effectively respond to crises such as natural disasters (e.g., tsunamis, hurricanes, earthquakes). Providing efficient relief to the victims is a primary focus in saving lives, minimizing further losses in the aftermath, and accelerating recovery. Crowdsourcing tools via social media such as Twitter, Ushahidi, and Sahana have proven useful in gathering information during and after a crisis. However, they are designed to go beyond crowdsourcing. Additional capabilities are required for response coordination, secured collaboration, and trust building among relief organizations. Goolsby pointed out the need for such a social media system and described the effort to build it to allow different organizations to share crowdsourced and groupsourced information, and analyze and visualize the processed information for intelligent decision making. In this section, we describe two social media prototype systems designed to facilitate efficient collaboration among disparate organizations for effective and coordinated responses to crises."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 20,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "4.1.",
               "text": "ASU Coordination Tracker (Gao et al. [17])",
               "type": "modelling"
          },
          "paragraphs": [
               "When natural disasters occur, the international community would join forces to provide disaster relief and humanitarian assistance. Some prominent examples include the Haiti earthquake and the subsequent cholera outbreak, and the devastating earthquake and tsunami in Japan. Social media has revolutionized the use of traditional media and played an important role in these events as an information collector and disseminator, and as a communication and collaboration tool.",
               "As one of the most important functions of social media, crowdsourcing is a collaborative information sharing mechanism based on the principle of collective wisdom. Wikipedia 10 is a perfect example of crowdsourcing, where people collectively publish information on various topics. Crowdsourcing is capable of leveraging participatory social media services and tools to collect information, and it allows crowds to participate in various HADR tasks. Its integration with crisis maps has been a very effective crowdsourcing application in HADR efforts. One of the earliest such systems was Alive in Afghanistan, where people in Afghanistan submitted their reports on accidents and terrorist attacks across Afghanistan.",
               "Although crowdsourcing applications can provide accurate and timely information about a crisis for decision making, current crowdsourcing applications still fall short in supporting disaster relief efforts (Gao et al. ). Most importantly, current applications do not provide a common mechanism specifically designed for collaboration and coordination between disparate relief organizations. For example, relief organizations that work independently can cause conflicts and complicate the relief efforts. If independent organizations duplicate a response, it will draw resources away from the other areas in need that could use the duplicated supplies. It can also result in delayed response to other disaster areas. Furthermore, because of the noisy and chaotic nature of crowdsourced data, current crowdsourcing applications cannot provide readily useful information for disaster relief efforts."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 21,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "paragraphs": [
               "To address these shortfalls of crowdsourcing to a certain extent, an online coordination system, the ASU Coordination Tracker (ACT), was devised. The ACT is an event response coordination system with the primary goal of facilitating multiorganization response (military, governments, NGOs, etc.) to an event such as a disaster and providing relief organizations the means for better collaboration and coordination during a crisis. It is a speedy and effective approach with easy, open communication and streamlined coordination. The major features and advantages of the ACT are summarized below:",
               "? leveraging crowdsourcing information to provide the means for a groupsourcing response for organizations to assist persons affected by a crisis effectively,",
               "? developing novel strategies to analyze the requests and maximize the coordinate efforts of crowdsourced data for disaster relief,",
               "? visualizing the requests to give a global view of the request distribution to facilitate responders, and",
               "? increasing the coordination efficiency by optimally responding to requests.",
               "The ACT consists of five functional modules: request collection, request analysis, response, coordination, and situation awareness. Raw requests from users are collected via crowdsourcing and groupsourcing methods. The request analysis module takes advantage of both data mining technology and expert knowledge to iteratively capture the essential content of raw requests. Based on the demand and disaster background, raw requests are analyzed and classified into various categories. Essential contents extracted from the raw data are then stored in a requests pool. The system visualizes the requests pool on its crisis map, with its selective visibility bonded to the access levels of users (organizations). The response module is designed to allow relief organizations to contribute, receive, and evaluate different response options and plan response actions. Relief organizations are able to respond to requests through the crisis map directly. The coordination model uses the interagency concept (Goolsby ) to avoid response conflicts while maintaining centralized control. The ACT displays every available request on the crisis map. Each request is in one of the following four states: available, in process, in delivery, or delivered. To avoid conflicts, relief organizations are not able to respond to requests that are being fulfilled by another organization. A statistics module runs in the background to help track relief progress for situation awareness, relief strategy adjustments, and further decision making.",
               "The ACT is a developing system that enables coordination among organizations during disaster relief. We are investing approaches to improve collaboration efficiency and provide differential security to relief organizations and decision makers. The disaster relief ASU Crisis Response Game (Abbasi et al. ) has demonstrated that by both leveraging crowdsourcing information and providing means for a groupsourcing response, organizations can effectively assist victims."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 22,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "4.2.",
               "text": "TweetTracker (Kumar et al. [32])",
               "type": "modelling"
          },
          "paragraphs": [
               "TweetTracker 12 is a Twitter-based analytic and visualization tool. The focus of the tool is to help HADR relief organizations to acquire situational awareness during disasters and emergencies to aid disaster relief efforts ( ). New social media platforms, such as Twitter microblogs, demonstrate their value and cability to provide information that is not easily attainable from traditional media. For example, during the Mumbai blasts of 2011, 13 firsthand information from the affected region was available on Twitter moments after the blast. TweetTracker is designed to help to track, analyze, review, and monitor tweets. This is achieved through near-real-time tracking of tweets with specific keywords/hashtags and tweets generated from the region affected by the crisis. The tool supports monitoring and analysis of the collected tweets via real-time trending, data reduction, historical review, and integrated data mining techniques.",
               "TweetTracker consists of three main components: (1) a Twitter stream reader, (2) a data storage module, and (3) a data mining and visualization module. The Twitter stream reader is a data collection module that continually crawls tweets through the Twitter streaming API (Application Programming Interface).",
               "14 Tweets are filtered based on user-specified keywords, hashtags, and geolocations. The data storage module is responsible for storing and indexing the collected tweets into a relational database for use by the visualization module. The data mining and visualization module is a Web-based user interface to the collected tweets and a means to analyze the collected tweets. It provides geospatial visualization of tweets related to a particular event on a map, summarizes the tweets, and visualizes the trending keywords in the form of a word cloud, and it can identify popular resources (URLs) and users mentioned in the tweets. The tool also includes built-in language translation support for monitoring of multilingual tweets.",
               "TweetTracker has been used in tracking, visualizing, and analyzing activities including the Arab Spring movement, the Occupy Wall Street movement, and various natural disasters such as earthquakes and cholera outbreaks."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 23,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     },
     {
          "head": {
               "n": "5.",
               "text": "Summary",
               "type": "conclusion"
          },
          "paragraphs": [
               "Valuable information is hidden in vast amounts of social media data, presenting ample opportunities social media mining to discover actionable knowledge that is otherwise difficult to find. Social media data are vast, noisy, distributed, unstructured, and dynamic, which poses novel challenges for data mining. In this tutorial, we offer a brief introduction to mining social media, use illustrative examples to show that burgeoning social media mining is spearheading the social media research, and demonstrate its invaluable contributions to real-world applications.",
               "As a main type of \"big data,\" social media is finding its many innovative uses, such as political campaigns, job applications, business promotion and networking, and customer services, and using and mining social media is reshaping business models, accelerating viral marketing, and enabling the rapid growth of various grassroots communities. It also helps in trend analysis and sales prediction. Social media data will continue their rapid growth in the foreseeable future. We are faced with an increasing demand for new algorithms and social media mining tools. Existing preliminary success in social media mining research efforts convincingly demonstrates the promising future of the emerging social media mining community and will help to expand research and development and explore online and off-line human behavior and interaction patterns."
          ],
          "paper_id": "23180dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 24,
          "fromPaper": "Mining Social Media: A Brief Introduction"
     }
]