[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Researchers have long converged that the evolution of a Social Networking Service (SNS) platform is driven by the interplay between users' preferences (reflected in user-item consumption behavior) and the social network structure (re-flected in user-user interaction behavior), with both kinds of users' behaviors change from time to time. However, traditional approaches either modeled these two kinds of behaviors in an isolated way or relied on a static assumption of a SNS. Thus, it is still unclear how do the roles of users' historical preferences and the dynamic social network structure affect the evolution of SNSs. Furthermore, can jointly model-ing users' temporal behaviors in SNSs benefit both behavior prediction tasks? In this paper, we leverage the underlying social theories (i.e., social influence and the homophily effect) to investigate the interplay and evolution of SNSs. We propose a probabilistic approach to fuse these social theories for jointly modeling users' temporal behaviors in SNSs. Thus our proposed model has both the explanatory ability and predic-tive power. Experimental results on two real-world datasets demonstrate the effectiveness of our proposed model."
          ],
          "paper_id": "23300290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Modeling Users' Preferences and Social Links in Social Networking Services: A Joint-Evolving Perspective"
     },
     {
          "head": {
               "n": "1",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Online SNSs, such as Facebook, Twitter, and location-based social networks, facilitate the building of social relations among people who share similar interests. Thus, people can stay connected with others and be informed of new consumption preferences of social friends.",
               "Generally, a SNS platform is built upon two kinds of users' behaviors: consuming items (reflected in user-item interaction such as rating, buying and check-in) and building social links (reflected in user-user interaction such as the directed trust and the undirected friendship). One step further, discovering users' consumption preferences and suggesting new links are two core behavior prediction tasks for these systems: Collaborative Filtering (CF), which discovers the like-minded users with similar consumption history, forms the basis of user preference discovery ; Node Proximity (NP) based models, which exploit the topological structure of social networks, play a central role in the social link suggestions . In summary, these two directions utilized a particular kind of users' historical behavior to predict the same kind of behavior, and are usually well researched in parallel. However, social scientists have long converged that these two kinds of users' behaviors are not isolated, instead, the interplay between them drives the evolution of SNSs. Two social theories explain this interplay: the social influence argues users' future preference behavior is affected by the social network around them, and the homophily effect states people tend to associate and bond with others that have similar preferences . An example of such evolving of a SNS platform is shown in . Thus, some research works have leveraged one type of users' behavior to help another behavior prediction task ) or assumed a time-invariant user latent factor is shared among users' behaviors ( ). Nevertheless, these works either modeled users' two kinds of behaviors in an isolated way or relied on a static assumption of a SNS. Thus, we still can not give an explanatory answer to the question -how do the roles users' two kinds of behaviors play in the evolution of SNSs? Furthermore, can jointly modeling users' temporal behaviors benefit both prediction tasks?",
               "To answer these two questions, there are some technical challenges. First, both kinds of users' behaviors mix together to form the evolution of SNSs. Thus, it is hard to distinguish the contribution of each kind of users' behavior in the evolution process. Second, it is still unclear how to build connections among users' two kinds of behaviors over time and jointly model them. To tackle these challenges, in this paper, we propose an Evolving Joint Prediction (EJP) approach to fuse the underlying social theories for explaining and jointly modeling users' two kinds of behaviors over time. Specifically, we associate users and items with latent representations, where the user latent factors are time-dependent and shared among these two kinds of behaviors. In the meantime, we clearly quantify the influence of current consumption preference and the social structure for the future users' behaviors with underlying social theories. Finally, we validate the effectiveness of our proposed model on both behavior prediction tasks by performing experiments on two realworld datasets. To the best of our knowledge, this is one of : A showcase of the evolution of a SNS platform. At each time, users perform two kinds of behaviors: build a Social link or show her Consumption preference. We use \"A2B\" at each newly added behavior to denote the current behavior of \"A\" leads to the future behavior \"B\". E.g., a \"S2C\" label is added from t to t+1 as u1 shows Consumption preference to v2 possibly because her social neighbors (u1 has followed u4 and u5 before t + 1 ) consumed item v2 before. the few attempts that have both the explanatory ability and the predictive power for tracking the evolution of SNSs."
          ],
          "paper_id": "23300290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Modeling Users' Preferences and Social Links in Social Networking Services: A Joint-Evolving Perspective"
     },
     {
          "head": {
               "n": "2",
               "text": "Related Work",
               "type": "relatedwork"
          },
          "paragraphs": [
               "We first summarize the traditional solutions for user preference discovery and social link prediction, then we introduce the efforts on modeling users' behaviors in SNSs.",
               "Collaborative Filtering. Collaborative filtering (CF) is a technique to discover user consumption preference for personalized item suggestions . Among all CF techniques, latent factor based models have shown great success ( ). With users' preferences change from time to time, some recent works took the temporal dynamics of users' interests into consideration ( ). For instance, Xiong et al. introduced an additional latent dimension over time ( ) to model the overall trends of items for users' preference decision.",
               "Link Prediction. Link prediction is the task of predicting the possible links in the near future given a snapshot of a social network. The literature can be classified into two categories: unsupervised (Liben-Nowell and and supervised . With the availability of evolving social network data, recent studies considered the temporal link prediction problem ( ). An intuitive yet effective approach is to collapse multiple time-sliced linked data into a single matrix with weighted averaging, then the static link prediction models could be applied . Others proposed tensor factorization or non-parametric time-series models to capture the temporal information in graph evolution .",
               "Modeling users' two kinds of behaviors in SNSs. The principles of the social influence and the homophily effect suggest that users' consumption preferences and the social linking behaviors are not isolated. Thus, the social-based recommendation system utilizes the social influence theory to help improve the performance of traditional CF ( . Others proposed to exploit users' preference history, i.e., the homophily effect for link prediction ( ). A recent work analyzed and modeled the temporal behaviors in a SNS using bidirectional effects (Jamali, Haffari, and Ester 2011). It differs from our problem formulation in that it focused on the global evolution of a SNS, thus can not be used for personalized recommendation. proposed to jointly model users' two kinds of behaviors in a unified framework, thus achieved better performance than modeling them separately. Our work advances their model in: (1) Their model assumed a static representation of SNSs while our work captures the temporal dynamics of the SNS evolution. (2) Our model has the explanatory power that explicitly quantifies the social network effect and users' historical preference for the evolution of SNSs."
          ],
          "paper_id": "23300290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Modeling Users' Preferences and Social Links in Social Networking Services: A Joint-Evolving Perspective"
     },
     {
          "head": {
               "n": "3",
               "text": "The Proposed Model",
               "type": "modelling"
          },
          "paragraphs": [
               "In an online SNS platform, there are a set of users U (|U | = N ) and items V (|V | = M ). Users perform two kinds of behaviors over time: consuming items and building social links with others, which can be summarized into two tensors: a consumption tensor CR NMT and a social link tensor SR NNT . If user a consumes item i at time window t, C t ai denotes the rating preference score. Otherwise it is 0 indicating the user does not show any preference during that time. Similarly, S t ab = 1 if user a connects a link to user b at time t, otherwise it equals 0. Without confusion, we use a, b, c to represent users and i, j, k to denote items. Then the problem can be defined as:",
               "Given the user consumption tensor C and the social tensor S, our goal is two-fold: (1) quantify the relative contribution of social influence and homophily effect of each user for the evolution of SNSs. (2) predict each user's consumption behavior and the social link behavior at time T + 1.",
               "In this section, we propose a probabilistic latent approach to fuse the above two social theories. Specifically, for each user a at each time t, we associate her with a time-dependent latent consumption preference factor U t a . To model the social influence effect, U t a is influenced by her social neighbors' interests at previous time. To capture the homophily effect, each user's decision on whether to build a social link to another user is also influenced by the similarity between their latent interest factors. Thus the user latent factors are time-dependent and shared among these two kinds of users' behaviors. In the following, we first give an overview of our proposed framework, followed by the model learning."
          ],
          "paper_id": "23300290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Modeling Users' Preferences and Social Links in Social Networking Services: A Joint-Evolving Perspective"
     },
     {
          "head": {
               "text": "Probabilistic Modeling",
               "type": "modelling"
          },
          "paragraphs": [
               "Evolutional Consumption Behavior Modeling For each user a and each item i, the predicted consumption preference between them at time t could be expressed as:",
               "preferences and others are easily influenced by social neighbors' decisions,a is personalized and varies among people. The larger thea , the larger the social influence effect plays in this user's future consumption decision, the less likely this user follows her own previous preferences.",
               "At the initial time t = 1, the social network has not been set up yet, thus each user's latent interests are only determined by her own consumption preferences without any social influence. We assume a zero-mean Gaussian distribution of users' latent factors at that time. Then we summarize the prior over user latent tensor as:",
               "where N (,2 ) is a normal distribution with meanand variance2 . Y is an indicator tensor in which it equals 1 if user a rates item i at time t. U t aR D1 is the latent preference of user a at time t in user latent tensor UR TND and ViR D1 is the item latent factor in item latent matrix VR MD . , denotes the inner product of two vectors. Given the limited observed preference data, a typical approach is to add priors to the latent variables. As other traditional CF models , we add a zero-mean Gaussian prior on the item latent matrix:"
          ],
          "paper_id": "23300290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Modeling Users' Preferences and Social Links in Social Networking Services: A Joint-Evolving Perspective"
     },
     {
          "head": {
               "text": "i=1",
               "type": "modelling"
          },
          "paragraphs": [
               "Now our goal turns to how to model the evolution of users' latent interest tensor U . In fact, as shown in , a user's current interest is mainly influenced by two underlying reasons: First, a user follows her previous preferences to make current consumption decisions. This effect uses the historical consumption behavior for future consumption prediction and is the base of traditional CF models. For example, a possible reason for u2 to consume v4 at time t in is that u3-a user that has similar consumption preference with her consumed v4 in the past. Second, in a social network, the social influence theory argues that people are affected by their social neighbors to make future decisions. E.g., u1 is influenced by her social friend u4, thus consumes v2 at time t + 1. We explicitly model the two effects of each user's latent interests at time window t = 2, 3, ...T as:",
               "Evolutional Social Behavior Modeling Similar as the user consumption behavior, each user a's link behavior is also mainly influenced by two factors. First, user a connects to another user that is close to her based on the topological graph structure, which can be modeled by traditional link prediction measures. E.g., u1 bonds with u5 at time t in Figure1 can be mainly attributed to this reason. Second, user a finds another user that shows similar consumption preferences, then she is likely to associate with her in the near future to share consumption experience. This is termed as the homophily effect in social science and it is widely accepted in explaining the social network construction process ). An illustration of this homophily effect is that u2 connects to u5 in Figure1.",
               "As we represent users' consumption preferences with latent factors, the homophily effect between users could be measured by comparing their latent consumption preferences. Then the predicted link scorS t ab between user a and b at time t = 2, 3, ...T could be modeled as:",
               "wherea is a coefficient that captures a user's unique characteristic in balancing these two factors. In this equation, h(a, b, t) measures the node proximity between them in a social network and the second part measures the homophily effect. As the social network is dynamic and changes from time to time, it is reasonable to assume the node proximity between users also varies. Since the focus of our paper is not to devise more sophisticated models to measure node proximity between users, here, we simply adopt a classical is the set the users that a has social links with till time t, Here, we simply set this weight",
               "as an average of all users that a connects.a is a non-negative parameter that balances these two influencing factors. As users may have their own decisions in balancing these two aspects, e.g., some people like to follow their own Though simple, this metric directly measures the weighted triangles between two potentially linked users and usually has very good link prediction performance (Liben-Nowell and Kleinberg 2007).",
               "At t = 1, no historical user latent preference is available, it is reasonable to assume that the social structure is the only factor that determines the social relationships:",
               "Given the predicted link score in Eq. , the likelihood of the predicted link value can also be modeled as:",
               "Among them,S is a tradeoff coefficient between the consumption prediction loss and the social link prediction loss, andU is a coefficient that measures how users' latent preference over time.U1, andV are regularization parameters for user latent matrix at time 1 and the item latent matrix.",
               "The coupling between U ,V and the balance parameters makes the objective function of Eq.(9) not convex, however, it is convex with regard to each parameter. Specifically, the derivative of each parameter is:",
               "Figure 2: Graphical representation of the proposed model.",
               "Model Learning and Prediction We summarize the graphical representation of the proposed latent model in , where the shaded and unshaded variables indicate the observed and latent variables. Given users' behavior tensors C and S, our goal is to learn the pa-",
               "a=1 . Particularly, the posterior distribution overis:",
               "Maximizing the log posterior of the above equation is equivalent to minimizing the following objective:",
               "where is an indicator function that equals 1 if x is true and 0 otherwise.",
               "Since the objective function is convex with regard to each parameter, a local minimum can be achieved by updating each parameter iteratively. As there are no constraints on U and V , we can update them directly using Stochastic Gradient Descent (SGD) method (Bottou 2010). With the bound constraints ofa anda , a local minimum can be found by the Projected Gradient(PG) method (Lin 2007). Specifically, for eacha (0a1), the PG method update the current solutionk a in k-th iteration tok+1 a by the following rule:",
               "After learning the related parameters, the two goals in the problem definition process can be answered: (1) the relative contribution of the social influence and the homophily effect can be directly obtained from parametersand. (2)The predicted behaviors of each user at T + 1 are:",
               "and 2 social links. After that, each user's preference rating is normalized into 0 to 1. shows the basic statistics of the two datasets after pruning. In data splitting process, we use the data till time T for model training, i.e., T=11 (T=3) in Epinion (Gowalla). Among them, we randomly extract 10% of the records as the validation dataset, which are used for parameter tuning. The newly added behaviors in T+1 are treated as the test data.",
               "We summarize the algorithm for our proposed model in Algorithm 1. Dealing with Data Imbalance. Note that in social link construction process, S t ab = 0 denotes a missing link between user a and b. If we consider all missing link records in the optimization function of Eq.(9), the problem turns to a highly imbalanced learning problem with much more labels of 0 than 1. Here, we borrow an effective undersampling technique. Particularly, for each newly added positive link, we randomly select m missing links as observed pseudo negative links with a weight of . In each iteration, the time complexity is "
          ],
          "paper_id": "23300290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Modeling Users' Preferences and Social Links in Social Networking Services: A Joint-Evolving Perspective"
     },
     {
          "head": {
               "n": "4",
               "text": "Experiments",
               "type": "experiment"
          },
          "paragraphs": [
               "Data Description and Experimental Setup. The datasets we used are: the who-trust-whom online product sharing dataset Epinions (Richardson, Agrawal, and Domingos 2003) and the location based social networking dataset Gowalla (Scellato, Noulas, and Mascolo 2011). In both datasets, we treated each month as a time window. We filtered out users that have less than 2 consumption records In the following, we report the resuts of our proposed model Evolving Joint Prediction (EJP). The step size of EJP is empirically set to be 0.01. For each iteration, EJP costs about 50 seconds on Epinions and 200 seconds on Gowalla and it converges in less than 100 iterations on both datasets, so the training time is less than 6 hours. As we have already analyzed the time complexity of EJP (linear with the records and time windows), we focus on the effectiveness analysis due to page limit. We also devise two simplified models of EJP: Evolving Consumption Prediction (ECP) and Evolving Link Prediction (ELP). Specifically, ECP leverages the dynamic social network for consumption prediction (i.e.,S = 0 in Eq. ) and ELP utilizes users' temporal consumption preferences for link prediction (i.e., we do not optimize the first term in Eq. ). There are several parameters in our model, we set the regularization parameters asU1 =V = 0.1.U is set to be 5 in Epinions and 1 in Gowalla, andS is set to be 0.5 in Epinions and 5 in Gowalla.",
               "User Consumption Preference Prediction. We compare the consumption prediction results with: PMF (Mnih and Salakhutdinov 2007), TMF ( ), SocialMF (Jamali and Ester 2010), and a joint learning model FIP ( ). For better illustration, we summarize the details of these models in . We adopt the widely used Root Mean Squared Error (RMSE) measure for consumption prediction precision comparison ). For fair comparison, all parameters in these baselines are tuned to have the best performance. shows the consumption prediction results of various models with different latent dimension sizes D on both datasets. As can be seen from this figure, among all models, our proposed latent model EJP performs the best, followed by the related model ECP. Also, the SocialMF and TMF have better performance than PMF, indicating the effectiveness of incorporating the time and social network information. Last but not least, the performance improvement is significant for nearly all latent based models from D = 5 : Characteristics of the Baselines. ) and a joint model FIP ( ). In link prediction task, our goal is usually to rank the potential linked users. As the user size is huge, it is impractical to take all users as candidates. Thus we adopt a similar approach that has been accepted by many works ( : for each test user a, we randomly sample 100 negative linked users that are not connected to her till the test time window. Then we mix those positively linked users and the sampled users together to select the top potential linked users of each test user. This process is repeated 10 times and we report the average results. Particularly, we adopt three widely used top-n ranking metrics: precision, recall, and F1 measure, where n denotes the size of the link prediction list ( ). We set n = 5 as it is useless to recommend too many friends, also, most online social networks adopt a similar number of potential friends for recommendation. shows the link prediction performance. We set n = 5 as it is useless to recommend too many friends. Among all models, EJP has significant better predictive power than all baselines and ELP ranks the second, followed by hTrust. This finding suggests it is effective to leverage the homophily effect reflected in users' consumption behavior for link prediction. The joint model improves over traditional baselines, nevertheless, it does not perform as well as our proposed model. We guess a possible reason is that FIP uses a shared same user latent factor to represent both users' consumption preferences and link structure, which may not well capture all the information of users' two kinds of behaviors. Note that besides n = 5, we have also measured the link prediction performance with other values of n (from n = 1 to n = 20) and we found the overall trend is the same. Therefore, due to page limit, we do not report the detailed results at other settings of n."
          ],
          "paper_id": "23300290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Modeling Users' Preferences and Social Links in Social Networking Services: A Joint-Evolving Perspective"
     },
     {
          "head": {
               "text": "Model Consumption Social Link Time Consumption Social Evolution Explanation",
               "type": "modelling"
          },
          "paragraphs": [
               "Visualization of the Balance Parameters. An important characteristic of our proposed model is that it has the explanatory power to distinguish each user a's uniqueness in balancing two vital social theories, i.e., the social influence (a ) and the homophily effect (a ). To visualize each user a's preference in balancing these two effects, we represent each user as a 2-dimensional data point (a ,a ) and randomly illustrate some users in . As can be seen from this figure, different uses do have their own uniqueness in balancing these two social theories for decision making. For example, the upper right corner indicates users that are likely to be influenced by social neighbors and the homophily effect for decision making, while the bottom-left corner shows users that are not likely to be swayed by social neighbors and the homophily effect for future behaviors.",
               "Parameter Setting. There are four parameters in our model:U 1 ,V ,S andU . These parameters are important but not difficult to tune. Among them,U 1 andV are the regularization parameters of users' latent factors at time 1 and the item latent factor. Since these two parameters have a similar form as the traditional PMF model , we tune them on PMF and set them under the setting of the best performance on PMF. Thus we do not report the detailed setting of these two parameters. In the following, we report the setting of the remaining two parameters. Particularly, we choose the RMSE measure and F1 measure to evaluate the performance of these two tasks.",
               "The setting ofS is shown in . For eachS, we initialize EJP with the results from ECP (S = 0 in ECP), and stop model learning when either prediction task performance begins to decrease. In this figure, asS increases from 0.1 to larger values, the overall trend is that the consumption performance decreases while the link performance  We provided a focused study on understanding users' temporal behaviors in SNS platforms. Particularly, by leveraging the social influence theory (homophily effect) for consumption prediction (link connection), we explicitly distinguished each kind of users' behavior for the evolution of SNSs. We established a joint latent model to address both prediction tasks in a unified framework. Experimental results validated that the users' preferences and the social network information are mutually helpful. In the future, we would like to follow this direction and explore how to build a more effective SNS platform based on our findings.",
               "increases as we put more weight on the social network information. Please note that both behavior prediction performance increases as we setS from 0 to a 0.1. We explained it before as there are mutual relationship between users' behaviors, thus jointly modeling them would have better results. Given the results, settingS in a reasonable range would balance these two prediction tasks, e.g.,S in [0.1, 0.7] in Epinions and in Gowalla. A possible reason whyS has a much larger value in Gowalla than Epinions is that, we have much less new connected link records in Gowalla than Epinions, thus we should put more weights on the link prediction results of Gowalla data."
          ],
          "paper_id": "23300290-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Modeling Users' Preferences and Social Links in Social Networking Services: A Joint-Evolving Perspective"
     }
]