[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Social influence in social networks has been extensively researched. Most studies have focused on direct influence, while another interesting question can be raised as whether indirect influence exists between two users who're not directly connected in the network and what affects such influence. In addition, the theory of complex contagion tells us that more spreaders will enhance the indirect influence between two users. Our observation of intensity of indirect influence, propagated by n parallel spreaders and quantified by retweeting probability in two Twitter social networks, shows that complex contagion is validated globally but is violated locally. In other words, the retweeting probability increases non-monotonically with some local drops. A quantum cognition based probabilistic model is proposed to account for these local drops."
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Thanks to the fast development of Web2.0, many online social networks have emerged, where the observation of information diffusion, or social influence, in large-scale data becomes possible. Social influence has been studied by many researchers, including the validation of influence ( , the propagation of influence among multiple types of social media ( ), the maximization of influence spread in the whole network ( , and the probabilistic modeling of direct influence ( . However, most relevant studies focused on direct influence, while another relevant question regarding social influence may be raised as to whether a user can exert indirect influence on his/her friends' friends and what affects such influence. Normally, multiple intermediate persons called spreaders are involved in the indirect communication between two persons, i.e., the sender and the receiver. Those spread-ers may have a combinational effect on the indirect influence propagated from the sender to the receiver.",
               "A concept closely related to indirect influence is complex contagion. Unlike simple contagion, which can spread in social networks after just one contact with a single infected neighbor like a disease, complex contagion is a phenomenon where multiple sources of exposure to a new idea are required before an individual adopts the idea . That is to say, repeated exposures of an individual to an idea recommended by his/her multiple neighbors positively affect the probability he/she will eventually follow that idea. studied the spread of hashtags in Twitter and quantified the probability of a user adopting a new hashtag as the function of the number of his/her neighbors who have already adopted it. They found that the spread of political hashtags validates the complex contagion, where the adoption probability increases monotonically as the number of neighbors who had already adopted the same hashtags increases, until a plateau is finally reached. By contrast, for idiom hashtags, complex contagion does not take effect, and the adoption probability decays rapidly when more neighbors have adopted the same hashtags.",
               "The problem we are studying is similar to , but we focus on message spread behavior and indirect influence on Twitter. A concrete example of this is shown in , where Alice sends out original messages, Charlie and Carol further spread Alice's messages (i.e., by retweeting) and Bob finally receives them. After that, Bob may choose to further spread Alice's messages to others, just like his two neighbors Charlie and Carol have done, or not. Here, the intent of Bob to further spread Alice's messages would reflect the intensity of the indirect influence of Alice on Bob, which can be measured as the probability that Bob will further spread Alice's messages, given that Charlie and Carol have already spread these messages. If complex contagion takes effect, the influence intensity will be higher when both Charlie and Carol spread Alice's messages than when either or none of the two spread them.",
               "In this paper, we examine the intensity of indirect influence as the function of the number of parallel spreaders between two users on Twitter who don't have direct following relations. We found that complex contagion is observed globally but is violated locally. Especially, when the number of spreaders increases from one to two, there's an obvious drop in the intensity. The newly emerging field of quantum cognition is applied to interpret the local drops in terms of interference effect on the process of decision-making. Recently, an article from NewScientist indicated how humans may actually think in a \"quantum\" manner . Research from cognitive science has also provided some initial evidence of quantum-like cognitive interference in human decision-making ). These cognitive experiments showed that the classical law of total probability was violated. Instead, quantum probability was applied to explain the experimental results. In addition, quantum cognition has been employed to further advance the theory of information retrieval (IR) ( .",
               "Our main contributions are:",
               "? Examine the change of parallel indirect influence between the sender and the receiver, quantified by retweeting probability, with the number of spreaders and found that such probability increases non-monotonically with some local drops;",
               "? Verify the existence of complex contagion in the indirect influence on the global scale;",
               "? Propose a probabilistic model based on quantum cognition to explain local drops in retweeting probability.",
               "This paper is organized as follows: Section 2 defines the problem. Section 3 shows the experimental results. Section 4 proposes quantum cognition model and Section 5 discusses its mathematical validity. Section 6 lists related literature and finally Section 6 concludes the study."
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "2.",
               "text": "Problem Definition",
               "type": "modelling"
          },
          "paragraphs": [
               "Twitter users send and read messages called tweets, which contain no more than 140 characters. One user can read another user's messages by following them. In addition, one user's message can be re-sent by his followers via retweeting. A retweeting message starts with the identifier \"RT @username\". Such following/follower relationships connect Twitter users and form the social network where information flows through retweeting. Given a collection of tweets C = {t}, V represens all Twitter users while E = {(u, v) |u, vV} represents all following relations where u follows v. We provide several formal definitions as follows:",
               "? DEFINITION 1. [Following Triple] ?t starting with \"RT @y: RT @x\" posted by z, we build a following triple T xyz = (x, y, z), x, y, zV and claim that (z, y)E and (y, x)E. We also define C(T xyz ) as the total count of tweets that belongs to T xyz and C(v), vV as the total count of tweets v posted.",
               "? DEFINITION 2.",
               "[Spreaders] ?a, bV, we define spreaders between a and b as S ab = {y|T ayb NULL, yV}.",
               "? DEFINITION 3. [N-spreader Retweeting Pattern] ?a, bV we define a retweeting pattern P ab = {T ayb |yS ab } and |S ab | = n. Consequently, we define a n-spreader retweeting pattern as P n = {P ab ||S ab | = n}, and P ab is an instance of P n .",
               "? DEFINITION 4. [Retweeting Probability] ?P ab ?, we define the probability of b retweeting from a as Pr(b|a; S ab ) = yS ab C(T ayb )/C(a). Consequently, we define the retweeting probability of n-spreader retweeting pattern as Pr(n) = P abP n Pr{b|a; S ab }/|P n |.",
               "? DEFINITION 5.",
               "[Indirect Influence] ?x, zVP xz ?, we think x exerts indirect influence on z. Pr(n) indicates the average intensity of indirect influence in n-spreader retweeting pattern.",
               "Starting from 1-spreader retweeting pattern to illustrate how information spreads in Twitter ), where B follows C and C follows A. We assume that B does not directly follow A so it can only read A s messages through C. A posts a tweet T and C reads and retweets it by adding the sign RT @A. Such information flow is represented by solid arrays because it is actually observed. Then B reads T and decides whether to further retweet it by adding a sign RT @C. The information flow from B is represented by a dashed array because it is not an actual but a potential flow. We can measure the intent of B to further propagate A s messages transferred by C using the retweeting probability Pr(B|A; C). For instance, A posts a total of 100 tweets and 20 of them are retweeted by C. Then B further retweets 5 of the 20 tweets, which makes Pr(B|A; C)= 5/100 = 0.05. , and our research question can be formulated as: Given n spreaders, how does the curve Pr(n) change with n?",
               "According to complex contagion, Pr(n), which represents the intensity of indirect influence, increases monotonically with n, since more spreaders involved in transferring the sender's messages leads to higher probability of the receiver to further propagate the sender's messages. We examined the probability in the real Twitter data to see whether this is true."
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "3.",
               "text": "Results",
               "type": "modelling"
          },
          "paragraphs": [
               "In this section, we show the results of retweeting probability in two different Twitter datasets and testify the existence of complex contagion. One dataset consists of tweets from the public timeline that can be seen as a whole social network, while the other consists of tweets from a certain user's ego network."
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "Dataset1",
               "type": "experiment"
          },
          "paragraphs": [
               "The first dataset 1 contains 467 million tweets from 20 million Twitter users from June to December 2009 , which covers 20%-30% of total public tweets during this period. shows the distribution of n-spreader retweeting pattern. As the number of spreaders increases, the corresponding number of instances drops, indicating that the situation where too many spreaders are involved is infrequent. The maximum number of spreaders we found is 29. We plot the curve Pr(n) for n = 1 to 10 in (b). The reason that we don't show the part of the curve for n > 10 is that the relatively rare occurrence of patterns with a large number of spreaders makes the result subject to random disturbance and yields unreliable observations. From (a) we can see that the global trend of Pr(n) is increasing as n increases. That is to say, overall, the intensity of indirect influence tends to become higher, or at least persists, as more spreaders are included, which validates the phenomenon of complex contagion in the global level. However, there are two drops spotted in Pr(n), i.e. from n =1 to 2 and 8 to 9. To testify the statistical significance of the two decreased probability values we observed, we used t-test of difference between two means 2 since retweeting probability is a type of mean value according to DEFINITION 4. Specifically, we tested two hypothesis: Pr(1) > Pr(2) and Pr(8) > Pr(9). Two indices, t-score and p-value were calculated, with higher t-score and lower p-value indicating more statistically significant difference. Generally, we consider the difference (decrease) as statistically significant if p-value is less than 0.05; otherwise, the difference (decrease) is very likely to be caused by random noise. The results are shown in : We can see both p-values and t-scores dataset1 dataset2 decrease from 1 to 2 from 8 to 9 from 1 to 2 from 4 to 5 from 7 to 8 t-score 88.44 8.38 5.15 1.51 5.11 p-value 0.00 0.00 0.00 0.06 0.00 show that the two drops of retweeting probability are statistically significant, especially when one spreader becomes two spreaders. This implies that the decrease is indeed caused by some other reason rather than random noise. In other words, the indirect influence decays occasionally as the number of spreaders increases, wherein the complex contagion is violated locally."
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "3.2.",
               "text": "Dataset2",
               "type": "experiment"
          },
          "paragraphs": [
               "The second dataset comes from Knowledge Engineering Lab at Tsinghua University and covers the time span from August to December in 2009. The process of tweets crawling started from @yanglicai, a popular Twitter user in the Chinese community, then extended to all contacts of @yanglicai identified from his replying and retweeting messages. Subsequently, tweets from the contacts of his contacts are crawled as well. Finally, 192,999 tweets from 8254 users were obtained, and 25.5% of all crawled tweets were retweeting messages. If dataset1 represents the whole network, we view dataset2 as an ego network with @yanglicai located at the center with all other users having direct/indirect interactions with @yanglicai.",
               "We do the same investigation for the second dataset as the first dataset. (a) shows the distribution of n-spreader retweeting patterns in this ego-network. Again, the number of instances decreases as n increases. We plotted the curve of Pr(n) in (b). Similar to dataset1, several drops are spotted, i.e. from n =1 to 2, 4 to 5 and 8 to 9. We also did the same t-test with results shown in . The p-value of the test for the decreased probability occurring when n changes from 4 to 5 is a little larger than 0.05, implying that such decrease is only marginally trustable and is possibly caused by random noise. However, the other two drops still show high statistical significance because both p-values are close to 0. In summary, the phenomenon that retweeting probability increases non-monotonically with some local drops is observed in both the whole network (dataset1) and certain ego-network (dataset2), verifying that complex contagion is globally validated but locally violated."
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "4.",
               "text": "Quantum Cognition",
               "type": "experiment"
          },
          "paragraphs": [
               "Although the effect of complex contagion on the indirect influence is observed on a global scale, the local scale decreasing in influence needs further interpretation. Actually, a reason for this may be related to human psychology and cognition, a topic too complex to explain. The emerging field of quantum cognition, however, might be able to provide a potential interpretation for the decreased influence phenomenon. This field applies the formalism of quantum theory to model cognitive phenomena such as memory, judgment and decision making. Notably, in the process of decision making where a decision depends on multiple factors, quantum cognition assumes that these factors are not independent but have quantum-like interference effects on the final decision in a manner similar to the explanation for results from double-slit experiments )."
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "4.1.",
               "text": "A Physical Metaphor",
               "type": "experiment"
          },
          "paragraphs": [
               "From the perspective of quantum cognition, the information spread is compared here to the physical wave quantum phenomenon. In the wave theory, the phase and magnitude of a wave at a certain point is the linear superposition of all waves from all sources. This superposition can result in constructive (when the wave phases align) or destructive (when the waves are out of phase) interference. Such quantum interference was first observed in the well-known double-slit experiment , where quantum waves that pass through two slits interfered with each other and generated a pattern of bright and dark bands on the screen. )",
               "We use our example in to illustrate the physical metaphor for information spread in (b). Alice's sending out an initial message to Charlie and Carol creates an information 'wave' in the form of a primary wavefront. Then Charlie and Carol forward Alice's messages by creating two secondary wavefronts. Finally, the two waves arriving at Bob may have constructive/destructive interference effects on his intent to further propagate the information flow. If constructive interference occurs, the intensity of Bob's intent to propagate Alice's messages will increase, which is very similar to the effect of complex contagion. If destructive interference occurs, the intensity of Bob's intent will decrease, which goes against complex contagion.",
               "We give an intuitive illustration to show how Bob's intent decreases due to a destructive interference effect. Assume that initially only Charlie spreads Alice's messages while Carol does not. Bob receives Alice's messages through Charlie and becomes interested in these messages and further spreads them, because Bob has obtained relevant and fresh information. Later on, Carol also begins to spread Alice's messages but they largely overlap with those already spread by Charlie. Bob therefore becomes less interested in Alice's messages because he's overwhelmed with redundant information. Thus Bob's intent to further spread Alice's messages decreases, and so does the indirect influence of Alice on Bob. Here, the interference between two spreaders leads to destructive effects on the indirect influence from the sender to the receiver, which may explain the local decrease spotted in . If a third spreader joins in and provides the receiver with new and relevant information about the sender, the indirect influence may rise again."
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "4.2.",
               "text": "Cognition Model",
               "type": "modelling"
          },
          "paragraphs": [
               "Although an intuitive interpretation of locally decreased influence is given in terms of quantum cognition, formal mathematical modeling is needed. We propose a cognitive model called a q-attention model. This model originates from , whose work presents a family of processing models for the source-monitoring paradigm in human cognition but is especially tailored to our social influence research in Twitter. Note that most concepts and notations used in our quantum modeling come from the theory of quantum probability .",
               "The q-attention model is designed for the situation where a group of Twitter users S n = C j , j = 1, 2, ..., n, follow user A and are also followed by user B. S n receive tweets from A and also retweet them to B. In addition, we assume that there exists an upper limit on the total number of users B can pay attention to among all B s followees, due to human's cognitive processing capacity. We set the number as Nn . In order to formulate the probability Pr(B|A; S n ) as a function of n, we propose two versions of q-attention model: one is based on classical probability theory, and the other is based on quantum probability theory. "
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "text": ". Classical q-attention model",
               "type": "modelling"
          },
          "paragraphs": [
               "We model the cognitive process of B retweeting from A s messages through C jS n by dividing it into two phases: First, B pays attention to C j s messages; Second, B reads those messages retweeted by C j from A and decides whether to further retweet them ). In the first phase, we define q j as the probability that B pays attention to C j and require N q=1 q j = 1 . In the second phase, we have already defined Pr(B|A; C j ) to measure B s retweeting intent through C j . Finally, the probability that B retweets from A through C j can be computed by the classical law of total probability:",
               "We replace Pr(B|A; S n ) with Pr(n) to represent the general case and two implications can be drawn:",
               "? The total effect of all spreaders on the receiver is just the linear superposition of an individual effect of each spreader, which is represented by an independent single term without interfering with other spreaders' effects;",
               "? Pr(n) increases monotonically as n increases, indicating that adding spreaders only increases the final intent of B to further retweet A s messages.",
               "Actually, the classical q-attention model matches the sense of complex contagion. Inspired by the description of influence curve of political hashtag in Romero et al. (2011), we can represent Pr(n) as a monotone increasing function. In the simplest case, we can assume that Pr(n) is just a linear increasing function of n from 1 until N . When nN, Pr(n)Pr(N), because the upper limit of human's information processing probability is reached and the intensity of influence persists at a relatively stable level. To summarize, Pr(n) can be approximately represented by the following piecewise defined function:"
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "4.2.2.",
               "text": "Quantum q-attention model",
               "type": "modelling"
          },
          "paragraphs": [
               "To take into account the cognitive interference effect that is ignored in the classical q-attention model, we now formulate a quantum version of the q-attention model. According to quantum probability theory Gudder (1988), a probability p of an event is not primitive but derived from something more primitive called a probability amplitude ? (a complex number) -the probability is the square of magnitude of the amplitude, i.e. p = |?| 2 . As is shown in (b), the structure of quantum q-attention model is almost the same as the classical version, except for the following three differences:",
               "? The classical probability of paying attention to C j , previously denoted by q j , is replaced by a probability amplitude denoted by ? j . B is assumed to be in a superposition state, denoted by:",
               "where ? j represents the \"potential\" of B to consider the tweets from C j , but the potential is represented by a complex number. The probability of paying attention to the tweets from C j is obtained from the squared magnitude q j = |? j | 2 and again we require N j=1 |? j | 2 = 1. Overall, Equation 3 represents B s cognitive state of selecting spreaders C j to pay attention to in a quantum manner;",
               "? The classical probability that B retweets from A through C j , previously denoted by Pr(B|A; C j ), is replaced by the probability amplitude B|A; C j , which represents the B's \"potential\" to retweet but such potential is represented by a complex number. The probability of retweeting is obtained from the squared magnitude Pr(B; A, C j ) = | B; A, C j | 2 ;",
               "? The quantum probability obeys the law of total amplitude rather than the law of total probability. The probability that B retweets from A passed along by C jS n is represented by Pr(B; A, S n ) = | A, S n | 2 . To determine the amplitude A, S n we replace the sum of probabilities shown in Equation 1 with the sum of amplitudes given below:",
               "To make it clear, we show some examples of how quantum q-attention model naturally encompass interference effects. First, we consider n = 1 in which case only one spreader C 1 exists. Then",
               ". Apparently, the quantum version is exactly the same as the classical version because no interference occurs.",
               "Next we consider n = 2 in which case S 2 = S 1 , S 2 . From Equation 4 we have:",
               "The first two terms corresponds to the same probability that we obtain from the classical model, while the last terms form a conjugate pair:",
               "where12 is the phase difference of the two complex number ? 1C 1 and ? 2C 2 which is dependent on the relation between C 1 and C 2 . The sum of the conjugate pair produces a real number that we call an interference term:",
               "Note that the cosine term can be positive (producing constructive interference), negative (producing destructive interference) or zero (no interference). Notably, if the cosine value is sufficiently negative, then the probability of B retweeting from A through two spreaders C 1 and C 2 can be smaller than the probability given only one spreader C 1 , i.e. |? 2C 2 | 2 + I 12 < 0. Finally we consider the case n = 3 and S 3 = S 1 , S 2 , S 3 . Similarly, we obtain:",
               "with the interference term defined as:",
               "Again, each interference term can be positive or negative. If they are all large negative numbers, then we may then find a decrease in the probability for three spreaders compared with one or two spreaders. There is also a possibility that all the interference terms will cancel out each other in which case the combinational interference would be equal to none. In other words, the quantum version in this case is reduced to the classical version."
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "4.2.3.",
               "text": "Comparison between two q-attention models",
               "type": "modelling"
          },
          "paragraphs": [
               "We now systematically compare the classical and quantum q-attention models and mathematically interpret the locally decreased influence based on the quantum q-attention model. The architecture of the two models is actually the same yet the main conceptual difference between the two lies in the representation of probability. Based on above equations, we can obtain the mathematical relation between the two models as:",
               "where Pr q (n) represents the average result of the quantum model while Pr c (n) represents the average result of the classical model. The only difference between the two models is the sum of interference terms, which represents the interference effect. If we consider the delta value, we obtain: c (n) = Pr c (n) ? Pr c (n ? 1) = q nPr(B|A; C n )",
               "n?1 q (n) = Pr q (n) ? Pr q (n ? 1) = q nPr(B|A; C n ) +",
               "From Equation 7, we can easily obtain c (n) > 0, i.e., Pr c (n) increases monotonously with n. In other words, B s intent to retweet A s messages always becomes stronger as more spreader C j are involved in relaying A s messages. However, the situation becomes more complex in Equation 8, due to the interference items. It becomes very difficult to predict the changing tendency of B s retweeting intent. Especially, if n?1 j=1 I i j > ?|q nPr(B|A; C n )|, we have q (n) < 0. In other words, sometimes the destructive effect will become so strong that it decreases B s intent. Compared with the classical q-attention model, the quantum q-attention model fully captures the trend of indirect influence shown in and 4(b). When constructive cognition interference occurs or interference cancel out (i.e., the classical model), the influence increases and complex contagion takes effect; when destructive cognition interference occurs, the influence may decrease and complex contagion is violated. In addition, the constructive/null effect occurs more frequently than the destructive effect, corresponding to the global increase of indirect influence with occasional local drops. Although our proposed quantum cognition model shows promise, it is a purely theoretical hypothesis based on current research in the field and needs further empirical verification."
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "5.",
               "text": "Discussion",
               "type": "modelling"
          },
          "paragraphs": [
               "Equation 6 shows that the core part of quantum q-attention model is the interference terms, which can be modeled as a linear combination of different cos(i j ) terms. Then the remain problem is how to evaluate the capability of quantum model (i.e. thosei j ) in characterizing the dynamic of indirect influence regarding retweeting behavior in Twitter. It is difficult to solve because those interference terms are affected by complex human psychological or other factors, which needs further investigation and experimentation. Moreover, the quantum cognition model is more like a conceptual and theoretical prototypical model, rather than traditional probabilistic models, like Markov random filed or Bayesian network, which already have mature frameworks for parameters learning and prediction evaluation. Therefore, the complete evaluation of the quantum model is beyond our work at the moment and we will leave it for future work.",
               "In spite of the difficulty of model evaluation illustrated above, we still attempt to justify the mathematical capability of the quantum q-attention model in interpreting the co-existence of global increase and local drops found in the empirical data, by answering two questions: First, if we have already observed the change of the retweeting probability with the number of spreaders in one empirical dataset, can we find the valid mathematical solutions of cos(i j )? Second, can we apply some simple rule to generate simulated/fake cos(i j ) terms, which can lead to global increased but locally dropped retweeting probabilities against different number of spreaders?",
               "To answer the first question, we rely on the simple classic linear model described in Equation 2 and 1. In addition, we assume that the empirical values of retweeting probabilities represent the output of quantum model and the difference between the quantum and classical model are fully captured by interference terms, as is shown in Equation 6. Then by solving the linear equations composed of Equation 1,2,6, we can obtaini j for different values of n. There're two points that worth attention. First, if |cos(i j )| > 1, then it is an invalid solution and the quantum q-attention model fails. Second, most of the time, the solutions are not unique and multiple combinative solutions of cos(i j ) can be found.",
               "We take dataset1 as the example to illustrate how to find those cos(i j ). We set N as half of the total number of retweeting patterns found in dataset1, i.e. N=14. When n = 2, we solve the linear equations above and obtain cos(12 ) = ?0.524, which is a valid value since ?1cos(12 )1. It also indicates that the interference between C 1 and C 2 is destructive, which leads to a local drop. When n = 3, we solve the linear equations and use the already known value of cos(12 ). We obtain 44.4cos(13 ) + 7.8cos(12 ) = 7.9 (9)",
               "Obviously, cos(13 ) and cos(12 ) have more than one solutions and they may have opposite signs. In other words, when C 3 is added, the interference between C 1 and C 3 and the interference between C 2 and C 3 may behave in different directions, leading to the rise of the global indirect influence again. To be general, those cosine terms satisfy the following equation when n = k > 2: . We also try to find values of cos(i j ) for other n values and the solutions are all valid, which confirms the mathematical plausibility of proposed quantum model. However, It is worth note that the cos(i j ) items calculated from one dataset do not apply to other dataset, because different sets of users have different types of interactions.",
               "To answer the second question, we run a simple simulation to generate those cos(i j ) without any prior knowledge by assuming that cos(i j ) is just uniformly distributed from [-0.5, 0.5] and can be randomly sampled. Here we examine three types of retweeting probabilities: classical model value from Equation 2, emprical value from the dataset1, and simulated quantum model value from Equation 10, 6 and randomly sampled cos(i j ). We plot two groups of three retweeting probability curves by using two different random number generator seeds. The simulated quantum model curves in both (a) and show the trend of global increase plus local drop, which matches our motivation of building quantum q-attention model. However, the curve of retweeting probability in (b) shows large deviation from the empirical value curve, implying that the set of cos(i j ) are not randomly distributed but follow some rules, which need further examination in order to better fit the real data.",
               "Although we demonstrate the mathematical plausibility of quantum model above, our work just initiates a new direction of applying quantum cognition to social influence study, which is not seen in any other current related researches yet. We will leave the study of complete parameter estimation and model evaluation of quantum q-attention model for future work, possibly by combining existing machine learning techniques and psychological experiments. "
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "6.1.",
               "text": "Information and Influence Propagation",
               "type": "modelling"
          },
          "paragraphs": [
               "The origin of information propagation in social networks comes from social influence, which occurs when an individual's thoughts, feelings or actions are affected by other people. Information propagation characterizes the way that a node in social networks can spread an information meme to its neighbor nodes via exerting social influence on them. The existence of social influence has been validated by many researchers . Different types of influence across various fields has been studied, including social media like Blog ( ), ) and Twitter ( , as well as academia ). The maximization of influence spread in the whole network was investigated ( as well. In addition, different methods of probabilistic modeling of social influence were also proposed. used Topical Affinity Propagation to model the topic-level social influence on large social network; De found three contextual factors that affect the influence propagation between two friends in MySpace. Although many interesting phenomena have been observed from the above researches, most of the time only direct communication between two adjacent persons in a social network is considered in modeling and analyzing the information propagation. Normally, multiple intermediate persons called spreaders are involved in the indirect communication between two persons, i.e., the sender and the receiver. Those spreaders may not be independent but have combinational interference on the information flow from the sender to the receiver. Some have studied the problem of serial indirect influence where indirect influence is propagated through n serial nodes. found that happiness spreads among people as far as 3 hops. tried to quantify the indirect influence of n-degree friends at the topical level. However, very few studies have focused on the parallel indirect influence, where indirect influence is propagated through n parallel nodes, the focus of our paper."
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "6.2.",
               "text": "Quantum cognition",
               "type": "modelling"
          },
          "paragraphs": [
               "A recent article from NewScientist pointed out the strong connection between quantum theory and human thought processes, where human cognition is found to follow fuzzy logic more than classical logic . Cognitive science researches have also identified the existence of quantum-like cognitive interference in human decision-making ( , where the experiments showed that the classic law of total probability was violated. Instead, quantum probability was introduced to explain the experimental results. Quantum cognition has been introduced in the IR field with the hope to build more user-centric methods in searching and ranking. proposed an extended vector space model (EVSM) to model context-sensitive high-order information. suggestted ranking the document relevance using QT as judgment of relevance that is not independent from other documents, and the interference of other documents play an important role in judging the relevance. They proposed a novel quantum probability ranking principle (QPRP) to model a situation, where a document relevance assessment is influenced by other documents. Although quantum cognition has been extensively applied in IR, our paper takes the first lead in applying quantum cognition to analyze the indirect social influence in social networks."
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "6.3.",
               "text": "Complex Contagion",
               "type": "modelling"
          },
          "paragraphs": [
               "Complex contagion ) refers to the phenomenon where multiple sources of exposure to a new idea are required before an individual adopts the idea. Simple contagion, however, can spread in social networks with just one contact with a single infected neighbor, as a disease may function. found that individuals are more likely to acquire new health practices while living in networks with dense clusters of connections, that is, when in close contact with people they already know well. For instance, people are more likely to participate regularly in the health forum if they had more health buddies who registered for it. studied the spread of hashtags in Twitter and quantified the probability of a user adopting a new hashtag as the function of the number of his/her neighbors who have already adopted it. They found that the spread of political hashtags validates the complex contagion, where the adoption probability increases monotonically as the number of neighbors who have already adopted the same hashtags increases, until finally reaching a plateau. By contrast, for idiom hashtags, complex contagion does not take effect and the adoption probability decays rapidly when more neighbors have adopted the same hashtags."
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     },
     {
          "head": {
               "n": "7.",
               "text": "Conclusions",
               "type": "conclusion"
          },
          "paragraphs": [
               "In this paper, we investigate the propagation of parallel indirect influence on Twitter with a focus on how the intensity of influence changes with the number of spreaders. We construct two social networks formed by the following relations (confirmed by RT in messages) in Twitter, quantify the intensity of indirect influence with the retweeting probability, and plot the curve of retweeting probability with the number of spreads. We find that the phenomenon of complex contagion is validated globally since the overall trend of the retweeting probability is gradual increasing against the number of spreaders. However, the probability decreases locally as well. We apply quantum cognition theory in an attempt to interpret the local anomaly.",
               "Although some interesting findings about indirect influence on Twitter are observed in this study, a great deal of future work remains to be done on the topic. First, the phenomenon of locally decreased influence needs further study. Quantum cognition itself may not be sufficient to explain it. Some theories from psychology, sociology, and probability will help address these complexities. Second, we plan to compare the indirect influence curves for different topics. We think that different patterns in retweeting behaviors exist for different topics on Twitter. It will be very meaningful to compare them and see whether complex contagion works or not in different contexts. Third, we hope to testify our quantum cognition model on other social networks including Facebook. For instance, \"like\" is a common action in Facebook. We can model the probability of a use who \"like\" some item on Facebook as the number of his/her social neighbors who already \"liked\" the same item, and see whether complex contagion with local drops reemerges. Finally, our current work is more descriptive and observational than mathematical formulations. We hope to build a probabilistic model to represent and predict indirect influence in the future."
          ],
          "paper_id": "23277710-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "Modeling Indirect Influence on Twitter"
     }
]