[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Trustworthy computing has recently attracted significant interest from researchers in several fields including multi-agent systems, social network analysis , and recommender systems. As an additional dimension of information to past rating history, trust has been shown to be helpful for improving the accuracy of recommendations. Studies on the relationship between trust and rating behaviors may provide insights into the formation of trust in the context of online community, and lead to possible indicators for the effective use of trust in recommendations. In this paper, we study people's trust and rating behavior with the Epinions dataset. Epinions.com is a popular product review website allowing users to rate various categories of products, and establish a list of trustworthy users. We perform correlation analysis of activeness and trustworthiness defined by the number of ratings and the * Corresponding author. number of trustors to derive findings that can help the design of new decision support mechanisms in trust-based recommender systems. We then propose a trustee-influence based trust model where a trustee's activeness or trustworthiness is used to determine trust relationships. This trust model is incorporated into a memory-based and matrix factorization recommender systems to support online purchasing decision-making. Experimental results demonstrate the effectiveness of the proposed trust model for recommendation ."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Nowadays, people often seek advice from online product reviews sites to help make their purchase decisions. This is especially important for buying from online stores, because compared to a brick and mortar store, it is usually more difficult to gauge the actual quality of a product from an online store through descriptions and pictures. Product review sites, such as Epinions 1 , provide a platform for people to share their experience by disseminating their opinions on products or services to help future buyers make purchasing decisions. For example, to show how much one is satisfied with a product, a rating from one to five can be provided by a user where five corresponds to the best and one the worst. Other than giving reviews and ratings to products, in the site of Epinions, users can also indicate their lists of trustworthy users, whose reviews they generally trust. The concept of trust, which is o-riginally derived from social science, has been introduced to computer science with diverse applications in many decision making situations. Trust behavior manifests itself as the reliance on one person or entity by another. People usually trust others who have a good reputation or with an honourable title.",
               "Once a trust relationship has been established, the ideas or behaviors of the trustee, i.e., the one who is being trusted, can influence the behaviour of the trustor, i.e., the one who trusts. Many computational trust models have been developed to predict which agents are trustworthy .",
               "Recommender system is an important tool for making informed decisions based on the vast amount of information we are facing today. In a typical recommender system, the similarity between users' past rating behaviours (a.k.a., the users' rating profiles) are used to define a user's neighbourhood.",
               "However, when replying solely on the availability of past rating data, the challenges of data sparsity and \"cold-start\" arise. To alleviate these problems and improve the recommendation accuracy, social connections such as the trust relationships have been used in recommender systems as additional information to define neighbourhood . The idea is that people usually accept the opinions of those whom they trust even when they have not yet demonstrated similar interests according to the observed rating data. Several studies have shown correlation between trust and rating similarity and the potential for using one of them to predict the other . However, it is also generally agreed that people trusting each other may not always share similar preferences . While these propositions show the complexity of people's rating and trust behaviour, more in-depth studies are needed to analyse their relationships and establish deeper understanding into how users' online behaviours can be used for trust-aware recommendations.",
               "In this paper, we explore the correlation and inconsistency between activeness and trustworthiness to investigate the rating-trust behavior in the context of recommender systems. Specifically, we consider activeness and trustworthiness as a user's two types of influence in a trust network, which is a special social network where each connection represents a trust relationship. Activeness is defined as the number of ratings made by a user, and trustworthiness is defined as the number of trustors the user has. We perform statistical analysis to study the correlation between activeness and trustworthiness to understand whether active users are more likely to be trusted by more people. In addition, we also discuss the inconsistency between activeness and trustworthiness with regard to individual users (i.e., a particular user who has a large number of trustors may provide only a small number of ratings; or an active user who provided a large number of ratings may not obtain large trustworthiness from others).",
               "In a social network, the number of incoming links is a fundamental metric to measure a user's social influence. When the social network is a trust network, a user's social influence is measured by the number of users who trust this user. In this paper, we perform influence analysis in the context of a online community where both rating and trust data are available. According to the strong correlation between activeness and trustworthiness as shown by our statistical analysis, the number of ratings regarded as user's activeness may also be used to measure a user's influence. Based on the findings from our analysis that users tend to trust a neighbor according to the neighbor's social influence, we propose a trust model incorporating a trustee's social in-fluence. The weight of a trust relationship is decided by the trustee-influence.",
               "Different from similarity-based trust model which builds a trust relationship based on the rating similarity between two users, trustee-influence based trust model is asymmetric and thus is more natural to describe trust relationships which are usually not reciprocal. We then apply the proposed trust model in a recommendation engine. Extensive experiments based on the Epinions dataset demonstrate significant improvement of the proposed trustee-influence based trust model over similarity-based trust models, which confirms that a trustee's social influence is an important factor to be considered when modeling trust.",
               "The rest of the paper is organized as follows. In Section 2, we review the related works on the application of computational trust models in recommender systems. Then, in Section 3, users' trust-rating behavior is analysed by investigating the relationships between activeness and trustworthiness using data from Epinions. A trust model based on trustee influence is proposed and incorporated with a recommendation engine in Section 4 and Section 5. Section 6 highlights experiment results. Finally, we conclude the paper and discuss promising future research directions in Section 7."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "2.",
               "text": "Related Work",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Many popular recommendation methods make use of the rating history from a large group of users to predict the preference of a target user. In collaborative filtering methods, including user similarity and item similarity based approaches as well as model-based approaches such as matrix factorization , it is assumed that a user's interest characterized by historical ratings remain unchanged in the future, so that users with similar interests will be interested in similar products.",
               "Recently, trust-aware approaches based on past observed ratings and trust relationships have been proposed for recommender systems . The correlation between trust and rating similarity has been explored by several studies in order to validate the use of trust for rating prediction and vise versa. The work in provided statistical evidence to show the existence of positive correlations between interest similarity and trust. The bidirectional interaction between trust and rating was studied in to explain the formation and evolution of online communities. In , it was shown that two users' rating similarity increases after they establish a trust relationship.",
               "It has also been shown in that rating similarity between users with a trust relationship is stronger on average than between those without a trust relationship.",
               "Based on the assumption that a user and the user's neighbors give similar ratings, several research proposed to make rating predictions based on a combination of \"self\" preference and \"neighbor\" preference . The difference in these approaches lies in how they define the predicted rating in the objective function. In , both \"self\" rating and neighbor ratings are combined through Matrix Factorization (MF); in , the MF predicted \"self\" rating is combined with observed neighbor ratings for predicting a user's future ratings; and in the \"self\" rating is defined based on user bias and item bias, and ratings from the neighbors are the observed ratings.",
               "Although it is intuitive to directly use observed ratings on an item from neighbors as part of the predicted ratings for a user to the same item, this is only effective when the neighbors have rated the same item with this user.",
               "However, such ratings may not be available in many cases. Another difference in these approaches is the weight of trust. Equal weight for trust is used in , whereas in and , the weight of trust is an unknown variable solved by minimizing the objective function.",
               "Other than directly minimizing the rating difference on each item between each user and the neighbors, trust is also used as a method of regularization in MF based models . Two types of regularization methods are commonly used: neighborhood regularization minimizes the difference between the user's latent feature vector and the average of the neighbors' feature vectors; while pairwise regularization minimizes the difference of the feature vectors for each pair of users with a trust relationship. Neighborhood regularization has been applied in for circle-based recommendation, where different levels of trust between the same pair of users are considered for items in different categories. In , the number of ratings in each product category is used to weigh a trust relationship. It is assumed that users who provided more ratings are more likely to be regarded as an expert, and hence, are more trusted than those who provided a small number of ratings.",
               "There are also other attempts in integrating trust into recommendation, such as the random-walk based approach in . On the other hand, the correlation between trust and rating similarity has also been used for predicting users' trustworthiness as well . A recent study utilized logistic regression to predict trust relationships with social science inspired features defined based on historical ratings .",
               "However, in many practical applications, users are only asked to provide a set of trustworthy users without specifying the strength of each trust relationship. The original trust network is thus usually available in a binary format reflecting only the existence or absence of trust relationships. Since the degrees of trust between trustors and trustees are usually different, using equal weights for all trust relationships does not capture the complete trust dynamics. Hence, a weighted trust network defining the strength of all trust relationships is important for designing more accurate trust models which, in turn, affect the accuracy of trust-empowered recommender systems. In we proposed the initial idea of using social influence to weight trust.",
               "In this paper, we present systematic analysis of two types of influence and then propose a trust model leveraging on this additionally available source of information to improve the performance of recommender systems."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "3.",
               "text": "Analysis of Activeness and Trustworthiness",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Before proposing the trust model, we need to first understand the new characteristics of the weighted trust networks. In this section, we conduct correlation and inconsistency analysis with a focus on the users' activeness and the trustworthiness to understand the trust-rating behavior in the realworld online community of Epinions.",
               "The dataset is first used in . Some basic statistics of the dataset are given in . Among 22,164 users, 18,097 users are involved in the trust network. Among all the pairs with trust relationships, 24% are reciprocated.",
               "Since the reliability or reputation of users are out the focus of this study, the quality of rating and trust data are not concerned and all the available ratings and trust relationships are regarded as the ground truth. We define the number of ratings provided by a user as the user's activeness; and the number of trustors trusting the user as the user's trustworthiness. Both activeness and trustworthiness may be used to measure a user's social influence, i.e., an active user or a user trusted by many can have strong influence over others.",
               "In this section, we analyze the relation between these two types of influence, i.e., activeness and trustworthiness, to uncover insights into user's rating-trust behaviors. Other than seeking statistical evidence of the existence of correlations, it is also interesting for us to look into the individual level to study potential inconsistencies between activeness and trustworthiness.",
               "Let R nun i be the rating matrix containing the ratings by n u users on n i items (where r viR is the rating by user v on item i), and binary matrix B represent the original uniformly weighted trust network where b uvB denotes the trust relationship between user u and user v (i.e., b uv = 1 if u trusts v, otherwise b uv = 0). We use I r (v) to represent the influence of a user v based on this user's activeness:",
               "and I t (v) the influence defined by this user's trustworthiness measured by the number of users that trust v (or incoming links to the corresponding node in the trust network) which is calculated as:",
               "Next, we present the detailed analysis on the relationship between activeness and trustworthiness."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "3.1.1.",
               "text": "Correlation between Activeness and Trustworthiness",
               "type": "relatedwork"
          },
          "paragraphs": [
               "We first investigate the similarity between the distribution of activeness nu ], i.e.,",
               "with ? I r = From the analysis, we obtained the correlation coefficient DS = 0.11 with p = 3.75 ?62 < 0.001. This shows that the correlation between the distribution of activeness and the distribution of trustworthiness is significant."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "3.1.2.",
               "text": "Overlap between Highly Active Users and Highly Trustworthy Users",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Next, we explore the overlap between users who have shown high activeness and high trustworthiness, respectively. Through this analysis, we investigate what the conditional probability is for a user to be highly active",
               "given that he/she has high trustworthiness, and vice versa.",
               "We have three sets of users as follows:",
               "? R: users are sorted in descend order of their I r (v) values.",
               "? T : users are sorted in descend order of their I t (v) values.",
               "? Random: users are randomly ordered.",
               "Let R(n), T (n), and Random(n) denote the subsets of top n users of the above three sets. We then calculate the overlapping or the number of common users between each pair of these sets:",
               "Based on the above definitions, we want to investigate whether the following inequalities hold",
               "The first inequality means that compared to an arbitrary user, a trustworthy user has a high probability to be active. In other words, if we want to look for an active user, the chance of selecting one from users with high trustworthiness is larger than selecting at random.",
               "The second means that compared to an arbitrary user, an active user is more likely to be trusted by others. In other words, if we want to look for a user who has many trustors, the chance of selecting one from the set of active users is higher than selecting at random.",
               "Since |R(n)| = |T (n)| for a given n, |C 2 (n)| is equal to |C 3 (n)| in a probability sense, i.e.,",
               "when N is large enough (C 2 (n, i) and C 3 (n, i) are defined by Eq. and Eq. with the ith trial of random set). This means if",
               "Therefore, we only focus on the first inequality. for all the n < 2200. This means that compared to randomly selected users, users with a large number of trustors are more in common with users that have the largest number of ratings. gives the detailed number for n = 23, 111, and 222 which are 0.1%, 0.5% and 1% of the total, respectively.",
               "It shows that when consider the top 23 users, for a user selected from T (23), its probability to be in R(23) is 8.7%, where T (23) is a set of 23 users with the largest trustworthiness and R(23) is a set of users with the largest activeness; while the probability of a randomly selected user to be in R is very tiny, i.e., no user is found in this way in 10 trials in our experiment.",
               "Similarly, when consider top 0.5% and 1% users, the probability for a user with large trustworthiness to be a user with large activeness, which are 6.31% and 8.56%, respectively, are much larger than the random one, which are only 0.45% and 0.99%, respectively. The above analysis shows a strong correlation between highly active users and highly trustworthy users for the Epinions data."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "3.1.3.",
               "text": "Activeness of users with low trustworthiness",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Lastly, we investigate the activeness of users with low trustworthiness to validate the correlation between activeness and trustworthiness from another perspective, i.e., if the two are positively correlated, users with low trustworthiness are more likely to be less active. Specifically, we study the average number of ratings made by users with a small number of trustors. "
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "3.2.",
               "text": "Inconsistency",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Since activeness and trustworthiness are two different concepts, it is also interesting to investigate the inconsistency between the two. Inconsistency means a user trusted by many other users may not have provided a large number of ratings; and one who have provided a lot of ratings does not necessary lead to more trust from others. While the correlation shows an average trend in a large number of instances, the inconsistency is analyzed on instance level for individual users to show that for a particular user, high activeness does not necessarily lead to high trustworthiness.",
               "We select the most active users and the most trustworthy users for investigation. Specifically, we look at 10 users who made the largest number of ratings to see whether they also have a large number of trustors. lists top 10 active users and their corresponding number of trustors. It is ob-served that only three of them are trusted by a large number of other users, while the left seven only have a very small number of trustors or even no trustors. Here, user ID corresponds to the time each user registered, i.e., the earlier the user was registered, the smaller the ID was assigned. We found that users with smaller ID or registered earlier usually have more trustors, such as users with ID 2,760, 2,034 and 557. Users registered for a short time such as 19,163, 13,658, and 15,827 may not be trusted by many others even they have made a lot of ratings because it takes time to be known by other users. They may finally get many trustors after a certain period of time. We also found that comparing users who focus on a certain category of products, users interested in a various of item categories tend to be trusted by more users. shows the rating distribution of the three early users namely user 2,760, user 2,034, and user 557 over different categories. All of these three users made a large number of ratings and registered around the same time, but they have different number of trustors. It is seen from that compared with 2,034, who rated more than 20 items in six categories, the other two users 2,760 and 557 who made more than 20 ratings to items across less categories have less trustors. This shows that users rating in a broad range of categories makes it more likely for them to be known to more users and finally have a larger set of trustors.",
               "We also checked the top 10 users who have the largest number of trustors to see whether they are more active than other users in table 4. It is seen that many users only made a small number of ratings. This shows that to make the popularity of a user or to be trusted by more people, other properties, such as the quality of the reviews the user made, may be more important than the number of ratings the user scored."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "3.3.",
               "text": "Discussions",
               "type": "relatedwork"
          },
          "paragraphs": [
               "From the above analysis of the Epinions data, we found that statistically speaking, an active user is more likely to be regarded as trustworthy by others and a user trusted by many other users is usually an active one. This shows strong correlation between activeness and trustworthiness, which can be regarded as two measurements of influence.",
               "However, through individual instance-level investigation, we also found the inconsistency between them for a particular user. Based on these results, using activeness defined by the number of ratings to measure a user's influence could be misleading as some users are untrustworthy although they made a large number of ratings while some others may become popular with only a small number of high quality reviews. Compared to activeness, the trustworthiness is more reliable to be used to capture the influence of the trustees as people usually build their trust network in a more careful and comprehensive way based on different types of information of the potential trustees, such as the user profile, the reviews made, the rank, and the number of trustors. However, the trust network is not able to reflect the up-to-date information. Build manually makes the trust network only contain local information as one user only know a part of others users when they build their trust relationships. It requires time for the trust network to evolve to a state that reflects the global information to a certain level. This makes trustworthiness defined by the number of trustors less instant than the rating-based",
               "influence. This problem may be alleviated by using some more sophisticated way to define the trustworthiness which considers evolving and propagation of trust."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "4.",
               "text": "Trustee influence based trust for recommendation",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Activeness and trustworthiness may be regarded as two types of influence.",
               "Based on the findings from the analysis, we propose a trust model based on trustee influence and then incorporate it into a recommendation system."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "4.1.",
               "text": "Trust model based on trustee influence",
               "type": "modelling"
          },
          "paragraphs": [
               "A trust network is a special social network where each edge represents a trust relationship. The original trust network is unweighted as only the existence, rather than the strength, of trust relationships is available. Since the degrees of trust between a user and users in this user's trust list are usually different, using equal weights for all trust relationships does not capture the reality, and negatively affects the effectiveness of the trust-based recommender systems. Most existing approaches weight a trust relationship based on the number of common items the two users have rated together or the rating similarity between the two users. In practice, only a very small subset of users, e.g., 7% in the Epinions data, have rated at least one item together with at least one of his/her trustees. Thus, it is difficult for similarity-based trust-aware recommender systems to perform well in practice.",
               "Influence analysis in a trust network helps to find agents with the most influence, and how people's decisions are affected by others . It has been successfully used to predict the sign of a given interaction in , and . In this paper, we propose a Trustee Influence based Trust model (TIT) as Definition 4.1, in which the degree of trust placed on a trustee by a trustor is directly proportional to the trustee's influence. TIT is different from rating similarity based trust models, which depends on both the trustor and the trustee having commonly rated items in the past.",
               "A comparison between the trustee-influence based trust and rating similarity based trust is made with the example scenario below, which involves a small dataset with five users who have provided ratings on six items as follows: These users form six trust relationships, i.e.,",
               ", and u 5u 4 . shows the degree of each trust relationship under different approaches. In the rating similarity based approach Rsim , each trust relationship is measured by the cosine similarity between the rating profile of the two users. Both the activeness (I r ) based and trustworthiness (I t ) based influence from the TIT model are listed. It is seen that the weights of three trust relationships turn to be 0 for Rsim which leaves three trust relationships. This means the final trust network is more sparse than the original one when using Rsim to get the weight due to the sparsity of rating data. This phenomenon is less obvious for I r based influence which makes one trust relationship receive 0 weight as the trustee of this trust relationship has never provided any rating. All trust relationships will be assigned a non-zero weight when using I t based influence. It is also seen that the weight with trustee influence is asymmetric, e.g.,"
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "4.2.",
               "text": "Trustee Influence based Trust (TIT) for Recommendation",
               "type": "modelling"
          },
          "paragraphs": [
               "With the TIT model T , we incorporate it to a recommender system to improve rating prediction. The challenge here is to predict the future rating i.e., vN u , ?t uv > 0."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "4.2.1.",
               "text": "Neighborhood-based approach",
               "type": "modelling"
          },
          "paragraphs": [
               "One way to incorporate trust for recommendation is through the neighborhood based approach, which is a memory-based collaborative filtering method. Based on the assumption that a user and its neighbors give similar ratings, the rating of a user for item i is estimated using the average of the ratings for this item provided by this user's neighbors",
               "where N u represents user u's neighbors (who are users trusted by u in this case); ? r u is the user bias calculated as the average rating provided by u. In order to predict?rpredict? predict?r ui , it requires at least one of the neighbors to rate i. This condition makes the Neighborhood-based approach inapplicable to many cases where non of the user all due to the sparsity of ratings."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "4.2.2.",
               "text": "Trust regularized matrix factorization",
               "type": "modelling"
          },
          "paragraphs": [
               "Other than predicting a user's rating directly based on this his/her trustees' historical ratings on the same item, another way is to use trust for regularization of Matrix Factorization (MF). Trust regularized MF have been proposed in order to make use of trust for helping rating prediction . Neigh- Since the trustee influence for different trust relationships could vary significantly, e.g., the number of trustors are very different for different trustees, which may cause the regularization is dominated only by a small number of trust relationships with large weights while make most of others no contribution. To avoid this problem, here we propose a MF with Normalized Pairwise",
               "On the right-hand side of the above equation, the first term is the sum of ",
               "where",
               "u are the solution of p u and q i in the original MF method, and for normalized pairwise trust regularization we have",
               "Algorithm 1 gives more details on iteratively learning of p u and q i . Once user features and item features are learned, we use them to predict the score of a rating as?ras? as?r ui = p T u q i ."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "5.",
               "text": "Experimental Results",
               "type": "experiment"
          },
          "paragraphs": [
               "In this section, we conduct numerical experiments using the Epinions dataset as in to evaluate the rating prediction performance using ll + 1.",
               "7: until convergence recommendation methods with trustee influence based trust.",
               "We present the performance of rating prediction using the proposed trust model with neighborhood-based method and matrix factorization method.",
               "We compare the results of the trustee-influence based trust namely I r and I t with that of rating similarity based trust denoted as Rsim . I r and I t are the proposed trustee-based weight where I r is the number of ratings and I t is the number of trustors. Cosine similarity is used to calculate the rating similarity Rsim."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "5.1.",
               "text": "Experiment Settings",
               "type": "experiment"
          },
          "paragraphs": [
               "In our experiment, we perform 5-fold cross validation in our experiments as in . 80% of the ratings and all the trust relationships for training data and the left 20% ratings for testing data. The two popular rating prediction evaluation metrics: 1) Root Mean Square Error (RMSE) and 2)",
               "Mean Absolute Error (MAE) defined below are used for evaluation:"
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "5.2.",
               "text": "Results",
               "type": "experiment"
          },
          "paragraphs": [
               "The result of the Nearest Neighbor approach with three types of trust weight, namely the rating similarity (Rsim) and the two types of trusteeinfluence are given in . We give the result of a baseline approach denoted as userMean, which only predict the rating of a user based on the average of this user's rating history.",
               "The results of Matrix Factorization based approaches are shown in . In previous work such as and , k = 10 was shown to be a good choice for the Epinions data. For comparison, we reported two groups of results with respect to the number of factors k = 5 and k = 10, respectively.",
               "Both the basic MF and MF with normalized pairwise trust regularization (MF-NPTR) are tested with I t and I r based trust model. We set the parameter= 0.1, and the trust regularization weight= 0.1."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "5.3.",
               "text": "Discussions",
               "type": "experiment"
          },
          "paragraphs": [
               "It can be observed from that Neighborhood-based approach with all the three types of trust weight give better results than the baseline. This confirms the usefulness of trust for recommendation. For the three types of trust weight, I r gives the best result. The result of I t is not as good as I r . As Neighborhood-based approach directly makes use of neighbors ratings, the prediction performance could be directly affected by the amount of rating data of neighbors with large weights. This problem is minimized when using I r , as we assign neighbors with large weights only if they made a large number of ratings. However, this problem could be more obvious when I t is used. We have shown earlier that many users with a large number of trustors only made very small number of ratings. This means when using I t , many of neighbors with large weights only have small number of rating records, which is insufficient enough to predict accurately. Therefore, I r is more effective than I t for Neighbourhood-based approach.",
               "Comparing results in with those in , it is seen clearly that matrix factorization is consistently better than Neighborhood-based approach. It can be observed from that compared to the classic MF method, the result is improved with regularization using trust. The two trustee-based trust methods achieve better results than rating similaritybased weights when pairwise regularization is used."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     },
     {
          "head": {
               "n": "6.",
               "text": "Conclusions and Future work",
               "type": "conclusion"
          },
          "paragraphs": [
               "Recommender system is a critical tool to support user decision making in various online activities. In this paper, we studied the rating-trust behavior of users in online communities where both rating data and trust data are In the current study, we study each type of influence individually as weight of trust to compare their performance and know the properties of each of them. However, in real life, the way in which people establish their trust in others is more complex and involves consideration of richer contextual information. In future research, it is interesting to explore the combination of the two types of trustee influence based weight and the similarity-based weight in a systematic way with more real world datasets, so that the desirable properties of each are kept while their weaknesses are alleviated."
          ],
          "paper_id": "23560120-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "A Social Influence based Trust Model for Recommender Systems"
     }
]