[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Note that the author(s) has the following rights:-immediately after publication, to use all or part of the article without revision or modification, including the EPLA-formatted version, for personal compilations and use only;-no sooner than 12 months from the date of first publication, to include the accepted manuscript (all or part), but not the EPLA-formatted version, on institute repositories or third-party websites provided a link to the online EPL abstract or EPL homepage is included."
          ],
          "paper_id": "23717860-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Predicting missing links via significant paths A LETTERS JOURNAL EXPLORING T H E FRONTIERS O F PHYSICS"
     },
     {
          "head": {
               "n": "1",
               "text": "OVER",
               "type": "abstract"
          },
          "paragraphs": [
               "Impact Factor -The 2010 Impact Factor is 2.753; your work will be in the right place to be cited by your peers 500 000 full text downloads in "
          ],
          "paper_id": "23717860-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Predicting missing links via significant paths A LETTERS JOURNAL EXPLORING T H E FRONTIERS O F PHYSICS"
     },
     {
          "paragraphs": [
               "Speed of processing -We aim to provide you with a quick and efficient service; the median time from acceptance to online publication is 30 days Details on preparing, submitting and tracking the progress of your manuscript from submission to acceptance are available on the EPL submission website www.epletters.net."
          ],
          "paper_id": "23717860-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "abstract"
          },
          "paragraphNo": 2,
          "fromPaper": "Predicting missing links via significant paths A LETTERS JOURNAL EXPLORING T H E FRONTIERS O F PHYSICS"
     },
     {
          "head": {
               "n": "30",
               "text": "DAYS",
               "type": "abstract"
          },
          "paragraphs": [
               "If you would like further information about our author service or EPL in general, please visit www.epljournal.org or e-mail us at info@epljournal.org. "
          ],
          "paper_id": "23717860-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Predicting missing links via significant paths A LETTERS JOURNAL EXPLORING T H E FRONTIERS O F PHYSICS"
     },
     {
          "head": {
               "text": "www.epl journal.org",
               "type": "abstract"
          },
          "paragraphs": [
               "Visit the EPL website to read the latest articles published in cutting-edge fields of research from across the whole of physics.",
               "Each compilation is led by its own Co-Editor, who is a leading scientist in that field, and who is responsible for overseeing the review process, selecting referees and making publication decisions for every manuscript.",
               "?  If you are working on research in any of these areas, the Co-Editors would be delighted to receive your submission. Articles should be submitted via the automated manuscript system at www.epletters.net Artistic impression of electrostatic particle-particle interactions in dielectrophoresis, adapted from N Aubry and P If you would like further information about our author service or EPL in general, please visit www.epljournal.org or e-mail us at info@epljournal.org Introduction. -Plenty of empirical and theoretical studies aim at understanding the intrinsics of evolving networks, from characterizing topological features to revealing network functions . Among fruitful research issues, link prediction is a fundamental challenge . Indeed, the extent to which the network evolution is explicable coincides with our capacity to predict missing links . In addition, the accurate predictions help recommend friends in online social networks , explore protein-to-protein interactions , reconstruct airline networks , boost e-commerce scales , and so on.",
               "Most conventional methods formalized the task of link prediction in the form of estimating the probability that two disconnected nodes would be linked, which was believed to be positively correlated with the similarity between them . Some researchers extracted node attributes and calculated node similarity in the Euclidean space of attributes, but unfortunately met the difficulty in extraction and sparsity . Instead, mainstream methods took into account the topological similarity based on network structures only, and could be classified into three major classes . The first class calculated topological similarity with global structural information, such as the Katz Index that counts all paths connecting two nodes with shorter paths preferred . Such global metrics showed fair performance in prediction but suffered from high computational complexity. The second class, defined on local structures, was much easier to calculate. Typical methods counted the number of common neighbors (CN) , usually with a penalization of largedegree end nodes (e.g., Salton Index , S?rensen Index , Hub Promoted Index , Leicht-Holme-Newman Index , etc.), or of large-degree common neighbors, such as Adamic-Adar Index (AA) and Resource Al location Index (RA) . Although successfully reducing the computational expense, local metrics suffered from relatively poor prediction performance. In order to find a nice tradeoff between performance and complexity, the third class of similarity metrics was proposed on quasilocal structures. The Local Path Index (LP) ignored longpath terms in Katz Index , and its bounded version (BLP) relates local paths in an elaborate way . The Local Random Walk Index (LRW) limits a random walker within a local range , while the Superposed Random Walk Index (SRW) continuously released a random walker at the starting node to emphasize the nodes near the target node .",
               "(a) E-mail: mail@huangjunming.com However, most existing methods simply summed paths up and neglected the heterogeneity in paths, i.e.,t h e 18008-p1",
               "Xuzhen possibility that different paths, even with the same length, indicate different similarities between two end nodes. Take a problem in collaborative filtering for example. Since many people has read the popular series of Harry Potter, reading a Harry Potter book does not expose much information of a reader's taste, and therefore finding neighbors for him is sometimes random. The overestimated similarity between such a reader and his dissimilar neighbors attributes to the user-book-user paths containing a large-degree node, the book of Harry Potter. Intuitively speaking, a path containing small-degree nodes indicates a greater similarity. An intermediate node with fewer neighbors is usually more selective in establishing links, and thus has greater similarity with each neighbor. Besides, its small degree sometimes implies a concentrated range of interests. Both reasons lead to a high probability that two of its neighbors are mutually similar. The case of a node with numerous neighbors is the opposite. It is not necessarily that two of its neighbors are mutually similar, e.g.,it is probable that a reader with wide interests over various topics have two of his favorite books totally different. With that intuition we believe, two nodes with a smalldegree common neighbor are more probable to be similar, which could be extended to a more general form that a path containing small-degree nodes provides an evidence of a greater similarity between two ends.",
               "Inspired by the above discussion, we propose a new index to measure the contribution of a path when calculating the similarity between its two ends, namely the significant path index,o rSP for short. The proposed index incorporates degrees of intermediate nodes into the path length, defining a path is significant if it is short and consists of small-degree intermediate nodes. Such a significant path is believed to reflect a great similarity between its two ends. Empirical results verify that the proposed index significantly improves prediction accuracy in link prediction, compared with five mainstream baselines.",
               "E T yet) is ranked higher than a randomly chosen link in U ?E (i.e., a non-existent link). If all the likelihood scores are generated from an independent and identical distribution, the AUC value should be about 0.5. Therefore, the degree to which the value exceeds 0.5 indicates how much better the algorithm performs than pure chance.",
               "Baselines. -Under the simplest framework of link prediction , each pair of nodes, v x and v y , is assigned a similarity score s xy . All non-observed links are ranked according to their scores, and the links with higher scores are supposed to be of higher existent likelihoods. Five mainstream algorithms (each corresponding to a similarity index) are implemented as baselines for performance comparison, described below.",
               "The Common Neighbors Index (CN) measures the similarity between two nodes with the number of their common neighbors:",
               "where(x) denotes the set of neighbors of node v x ,a n d(x)ɦ(y) represents the set of common neighbors of node v x and v y . The Adamic-Adar Index (AA) expands CN by emphasizing less-connected common neighbors, as:",
               "zʦ(x)ɦ(y)",
               "The Resource-Allocation Index (RA) simulates resource transmissions between two nodes, and penalizes common neighbors with large degrees, as:",
               "The Local Path Index (LP) additionally counts the contribution of local paths with length three, as:",
               "Problem and metric. -We here consider an undirected network G(V, E), where V and E stand for the sets of nodes and links, respectively. To test the algorithm's accuracy, the set of links, E, is randomly divided into two parts: the training set, E T , is treated as known information, while the testing set (also called probe set or validation set in the literature), E P , is used for testing and no information in this set is allowed to be used for prediction.",
               "where A is the adjacency matrix andis a free parameter. The Bounded Local Path Index (BLP) bounds local paths with structural coefficients according to path lengths:",
               "Every link prediction algorithm aims at uncovering links in the testing set.",
               "A standard metric, called the area under the receiver operating characteristic curve (AUC for short) is used to quantify the prediction accuracy. Provided the rank of all non-observed links (i.e., links in U ? E T , where U is the universal set) according to their estimated existent likelihoods, the AUC value can be interpreted as the probability that a randomly chosen link in E s BLP xy = ,",
               "where l max indicates the maximum length under consideration, P i (v x ,v y ) is the set of all paths connecting v x and v y with length i,a n d|P i (v x ,v y )| is the number of these paths. P (i.e., a link that indeed exists but does not belong to",
               "Significant paths. -Our basic idea comes from the intuition that paths should not be counted indifferently: a short path consisting of small-degree intermediate nodes provides more evidence of a missing link connecting its 18008-p2",
               "Predicting missing links via significant paths : The basic topological features of the twelve benchmark networks. |V | denotes the number of nodes, |E| is the number of links, represents the average degree, denotes the average distance, C indicates the clustering coefficient , r indicates the assortativity coefficient , and H is the degree heterogeneity, defined as H = 2 . two ends. In the proposed significant path index, we calculate the similarity between a pair of non-adjacent node by counting paths connecting them while penalizing both the lengths and the intermediate nodes' degrees of those paths. "
          ],
          "paper_id": "23717860-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Predicting missing links via significant paths A LETTERS JOURNAL EXPLORING T H E FRONTIERS O F PHYSICS"
     },
     {
          "head": {
               "text": "Definition 1. On an undirected unweighted network",
               "type": "modelling"
          },
          "paragraphs": [
               "where k i is the degree of node v i , M (q)={v2 ,,v n?1 } is the set of intermediate nodes of path q,a n dis the degree-penalizing parameter that penalizes nodes with large degrees when<0. This index has previously been applied to quantify the expected traffic congestion in transportation networks .",
               "of nodes v 1 and v 3 , and find a total of 2 paths connecting them:",
               "Comparing those two paths, v 2 , the only intermediate node of q 1 ,a ppears more selective and is thus more similar to both v 1 and v 3 , which suggests a larger probability that v 1 and v 3 are also similar to each other. On the contrary, q 2 provides less evidence since q 2 is longer and its intermediate nodes have larger degrees.",
               "Definition 2. On an undirected unweighted network G(V, E), the significant path index S SP xy of a pair of nodes v x and v y is the sum of the significance of every path connecting v x and v y ,a s S SP xy1(q)+2(q)+, qP2 qP3 where? are the length-penalizing parameters that penalize paths with longer lengths and thusl >lif l<l.",
               "Since paths longer than three cost expensive computations but contribute little to predicting links , we ignore those paths in practice. As only two lengthpenalizing parameters remain, we simply let=21 and rewrite eq. as follows:",
               "The two parametersandpenalize path length and node degree, respectively, capturing the intuition that the fewer the nodes a path passes through and the smaller the degrees such nodes have, the stronger the evidence that the two ends of such path are actually connected by a missing link. shows a simple example to illustrate the significant path index. We calculate the SP index Data. -Experiments are performed on twelve real networks . We converted arcs into undirected links and removed loops and multi-links to make them simple networks, keeping their connectivity. i) US Air97 (USAir) : the network of the US air transportation system. ii) Yeast PPI (Yeast) : the protein-protein interaction network of yeast. iii) NetScience (NS) : the network of coauthorships between scientists publishing on the topic of networks. iv) Jazz : the network of Jazz musicians. v) C.elegans (CE) : the neural network of the nematode worm C.elegans. vi) Slavko : the Facebook friendship network of Slavko?itnikSlavkoSlavko?itnik. vii) E-mail network (Email) : the e-mail communication network of the University Rovira i Virgili (URV) in Tarragona, Spain. viii) Infectious (Infec) : the faceto-face contact network of people during the exhibition \"Infectious: Stay Away\" in 2009 at the Science Gallery in Dublin. ix) EuroSiS web mapping study (ES) : mapping interactions between Science in Society actors on the Web of 12 European countries. x) UC Irvine messages For each network, the optimal values ofandare presented inside the corresponding plot. Notice that, for every case, the optimalis smaller than zero, indicating that to penalize the large-degree intermediate nodes.",
               "social network (UcSoci) : the communication network according to the sent messages between users of an online community of students from the University of California, Irvine. xi) Food Web of Florida ecosystem (FW) : the relationship of carbon exchanges in the cypress wetlands of South Florida during the wet season. xii) Small & Griffith and Descendants (SmaGri) : the network composed of citations to Small & Griffith and Descendants. reports the basic topological features of these networks.",
               "Each original data set is randomly divided into a training set E T containing 80% links, and a testing set E P containing 20% links, while the connectivity in E T is guaranteed.",
               "Results. -We firstly report the performance of SP withvarying in the range [?2, 2] andfrom 0 to 1.0 as suggested in , measured with average AUC under 10 independent runs with different random divisions of training sets and testing set. As shown in , the performance varies withcontinuously in most cases. For every data set, a single peak is observed when<0. This demonstrates the intuition we claimed that the intermediate nodes with smaller degrees provide stronger evidence of the existence of a missing link than nodes with larger degrees. Specifically, in most data sets a sudden decrease around= 0 is observed, at which the index changes from penalizing paths consisting of large-degree intermediate nodes (<0) to penalizing paths consisting of small-degree intermediate nodes (>0). Since largedegree nodes usually lie in many paths (as suggested by the strong correlation between degree and betweenness, see for example ), in the case of>0, many paths with large-degree nodes are wrongly assigned high contributions and thus a large proportion of non-existent links will be put in the top positions, eventually leading to a large decline in algorithm's performance.",
               "The performance seems not sensitive toas long as>0. In , besides curves whentakes typical positive values such as 0.001 and 0.01, we intentionally provide the curve when= 0, meaning the deletion of long paths' contributions. In most data sets, except for USAir and Jazz, there is a distinctive deviation between curves with=0a n d>0. The AUC performance curve : Prediction accuracy measured by AUC values on the twelve benchmark networks. Each data point is an average over 10 independent realizations, each of which corresponds to a random 80%-20% division of training set and testing set. All the present results correspond to the optimal cases by tuning the parameters if any. Numbers in brackets stand for the standard deviations. with= 0 is obviously beneath the contrasts. Accordingly, SP is particularly useful for the networks with many long paths. The phenomenon indeed confirms that the combination with long paths is very necessary."
          ],
          "paper_id": "23717860-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Predicting missing links via significant paths A LETTERS JOURNAL EXPLORING T H E FRONTIERS O F PHYSICS"
     },
     {
          "head": {
               "text": "AUC",
               "type": "modelling"
          },
          "paragraphs": [
               "To demonstrate the prediction ability, we report the performance of SP index with the optimal (,)v a l u eo n1 2 data sets, respectively. reports the average AUC values of SP and baselines. SP achieves the best performance in 10 out of 12 data sets, and is the runner-up in the remaining two (see boldface values in table 2). Notice that those data sets represent different kinds of networks with heterogeneous topological features (see table 1) and disparate organization principles, the comparison highlights that SP works well consistently on various situations.",
               "Analyzing the difference in performance between SP and baselines, we realize that it is the penalization on largedegree nodes and the consideration of long paths that explain the difference. CN indifferently counts the number of common neighbors on 2-hop paths, ignoring node degrees and long paths, resulting in its worst performance in most data sets. AA and RA extend CN by similarly penalizing large-degree nodes, and not surprisingly obtain a better performance than CN. However, the fixed form of penalization limits their flexibility to adjust for disparate networks. Besides, ignoring long paths prevents them from better predictions in networks fulfilled with long paths such as Yeast. In contrast, LP and BLP take long paths into account and thus outperform on those two networks. However, lacking a consideration of large-degree nodes, LP and BLP meets difficulty in accurately predict missing links in networks with plenty of large-degree nodes, such as USAir.",
               "index (SP) is proposed to formalize that intuition into a similarity metric, summing up the discounted degrees of all intermediate nodes over all local paths connecting two non-adjacent nodes. Empirical results demonstrate that, with a negative parameterthat penalizes large-degree nodes, the proposed SP outperforms five representative mainstream baselines, evaluated with AUC as binary classifiers. A sudden decrease in the prediction performance is observed whenchanges from penalizing to encouraging large-degree nodes.",
               "Looking at the parametersand, we find that instead of a fixed value of the penalizing parameter, i.e.,= ?1 in RA, the SP allows a flexible value of the penalizing parameter, resulting in its performance among the best in most data sets. The contribution of long paths are weak but not negligible. In networks where long paths play a more important role, ignoring long paths is unwise and leads to a poor performance, suggested by the performance of RA in Yeast, meanwhile an inappropriately largealso depresses the performance.",
               "The SP starts a broad space for investigation on link prediction and facilitates new promising applications in the future, such as infrastructure constructions planning like traffic transportation, researches on the reactions between organisms in biological experiments, evolutions of people's relations in social activities, controls of propagation of disease, protections of ecological system network, and so on. * * * Conclusion and discussion. -We start from the intuition that a path containing small-degree nodes indicates a greater similarity, and thus provide more evidence of a missing link between its two ends. A Significant Path"
          ],
          "paper_id": "23717860-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Predicting missing links via significant paths A LETTERS JOURNAL EXPLORING T H E FRONTIERS O F PHYSICS"
     }
]