[
     {
          "head": {
               "text": "PROPERTIES OF THE PREFERENCE",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "FOR CONSISTENCY SCALE reported that the preference for consistency scale is moderately correlated with only two of the Big 5 factors: openness to new experience (r ? ?.38) and conscientiousness . Additionally, the scale is positively correlated with measures of rigidity (r ? .48), and personal need for structure (r ? .47), which is unsurprising as these two measures also assess need for order, a concept similar to consistency. Cialdini et al. additionally reported that the relationship between the preference for consistency and the following measures were not found to be significant: extroversion, agreeableness, neuroticism, self-monitoring, locus of control, social desirability, and intelligence. Finally, Cialdini and his colleagues reported that, in a college student sample, the preference for consistency scale was reliable, ? .89, and had a mean of 5.43 on a scale with endpoints ranging from 1 to 9 (SD ? 1.19). Other research comparing PFC scores collected during mass pre-testing with a second set of PFC scores assessed in the lab 6 to 12 weeks later indicates that the test-retest reliability of the PFC scale is high, r (260) ? .62 . Studies by Keogh, Zimbardo, and Boyd (1999) on personality and substance use generated findings very much in keeping with those reported by Cialdini and his associates regarding the properties of the PFC. presents the full 18-item preference for consistency scale.  PREFERENCE FOR CONSISTENCY: GENERAL RESEARCH FINDINGS Research on the preference for consistency scale has revealed that individuals who score high versus low on the scale demonstrate different patterns of behavior. For instance, one study indicated that, relative to those low in PFC, individuals high in PFC were more likely to follow through on their commitment to attend scheduled experiments as part of their introductory psychology requirements . Along these same lines, other research reports that individuals high in PFC, relative to those individuals low in PFC, were more likely to return experimental materials as promised after completing the materials at home ). Two studies conducted by Council and colleagues revealed that the test-retest reliability on questionnaires is higher for individuals high in PFC relative to those low in PFC.",
               "Other research indicates that preference for consistency is higher in older people relative to younger individuals and that those with a high preference for consistency also express higher levels of emotional upset and motivation to reduce upset than do individuals with a low PFC ). Additionally, reported that PFC predicted drug and alcohol use, with individuals low in PFC reporting more substance use. Finally, a study on computer use in a public setting reported that preference for consistency predicts loyalty to using the same public access computer terminal repeatedly . Overall the literature reviewed above supports the notion that PFC moderates consistency-based behavior."
          ],
          "paper_id": "2373c250-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Preference for consistency and social influence: A review of current research findings"
     },
     {
          "head": {
               "text": "PFC: SOCIAL INFLUENCE RESEARCH FINDINGS",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Although the literature cited above demonstrates that preference for consistency moderates consistency-based behavior generally, the focus on the present review is on preference for consistency as a moderator of social influence processes. We define social influence as a change in one's beliefs, behavior, or attitudes due to external pressure that may be real or imagined ). There are two broad areas within the social influence literature: compliance, which examines changes in behavior, and persuasion, which examines changes in attitudes and beliefs."
          ],
          "paper_id": "2373c250-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Preference for consistency and social influence: A review of current research findings"
     },
     {
          "head": {
               "text": "Preference for consistency and compliance",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "One of the more difficult to replicate consistency-based compliance tactics is called the foot-in-the-door procedure (see Burger's 1999 meta-analysis for a review). The tactic works as the name implies, by getting a proverbial foot-in-the-door-by gaining compliance with a small request (e.g., signing a petition supporting a particular charity), an influence agent increases the likelihood that his or her target will agree to a related, larger request (e.g., contributing to that charity) representing the ultimately desired change in behavior . One explanation for the success of the foot-in-the-door procedure is that people comply with the second, target request to be consistent with agreeing with the initial small request.",
               "To address this difficulty conducted a study to examine whether PFC moderates susceptibility to the foot-in-the-door effect. Specifically, they predicted that individuals high in PFC would be more susceptible to the foot-in-the-door effect because consistency in behavior is important to them. Conversely, they predicted that individuals low in PFC would not demonstrate increased compliance, relative to controls, after agreeing to the small request because consistency in behavior is not inherently important to them. To test this prediction, participants in the experimental condition were contacted on the telephone and first asked to respond to three short questions about their television viewing. Participants in the control condition did not receive this request and only received the second, target request. The target request, also delivered by phone, was to fill out a long (50-item) survey on television-viewing tendencies that needed to be returned within 2 weeks from the date of the request. Prior to the phone call, Cialdini et al. had collected participants' scores on the preference for consistency scale. The results indicated that PFC did indeed moderate the foot-in-the-door effect, with participants high in PFC showing an increase in compliance with the target request after initially agreeing with the first request, while participants low in PFC did not show a foot-in-the-door effect. These results support the notion that variation in preference for consistency is one reason why it may be difficult to reliably produce a foot-in-the-door effect.",
               "Guadagno, Asher, Demaine, and Cialdini replicated and expanded on this study in two studies that examined the conditions under which the foot-in-the-door effect fails even for individuals high in PFC. In meta-analysis of the foot-in-the-door effect, the length of delay between the first and second requests was found to be a significant moderator of the effect, with little or no delay between requests decreasing compliance to the second, target request. Additionally, Burger reported that labeling an individual as helpful had the opposite effect and increased compliance with the target request. In Guadagno et al.'s first study they sought to examine whether this would be the case for individuals high in PFC. Accordingly, high-PFC participants were asked to attend an experiment at a set location. When they arrived, an experimenter greeted them and told them that the study location had been moved. The experimenter provided the participant with an envelope containing experimental materials and gave him or her instructions to get to the new location in an adjacent building. Unbeknown to the participant, this was done so that a confederate waiting between the buildings could stop and administer the initial request to the participant-to sign a petition advocating increased federal aid to the homeless-if they were in the experimental condition. Condition information was signaled by the color of the participant's envelope. The confederate thanked participants for their helpfulness after they signed the petition. Participants in the control condition were not approached by the confederate. Once participants arrived at the new location, they completed a filler task and received the second, target request, which was to commit to volunteer at a canned food drive for the homeless. Half the participants in the experimental condition received a memo that started out by asking: ''Are you a helpful person?'' while the other half of the participants did not receive this reminder of their prior helpfulness. As predicted, results indicated that even asking a high-PFC individual two requests in quick succession was ineffective-compliance actually decreased in the experimental condition relative to controls. However, spurring high-PFC individuals to label themselves as helpful had the opposite effect, producing 73% compliance to the target request relative to 33% in the control condition. Thus, making a prior history of helpfulness salient resulted in a powerful consistency effect among high-PFC scorers.",
               "In their second study, sought to replicate and expand upon Study 1 by also examining the impact of making prior helpfulness salient on low-preference-for-consistency individuals. The procedure for this study was identical to foot-in-the-door study (described above), except that there was a third condition which included a manipulation in between the first request (to complete a 3-item survey) and second request (to complete a 50-item survey), which was intended to make participants' prior helpfulness salient. The experimenter paused between requests and said: ''Thanks. Do you usually help people you don't know?'' To ensure that the participants had time to attend to this question, the experimenter asked the participant to wait while he or she got a new pen. For individuals high in PFC, participants exposed to the footin-the-door (small request followed by larger, target request) procedure were, as expected, more compliant with the target request than those in the control (target request only) condition, and making helpfulness salient did enhance compliance although only moderately. For individuals low in PFC there was no difference in compliance with the target request between the control condition and the foot-in-the-door condition when prior helpfulness was not made salient. However, low-PFC participants in the salient prior helpfulness condition actually demonstrated a significant decrease in compliance relative to controls. The authors labeled this a reverse foot-inthe-door effect and reasoned that, when their previous history of action is salient, low-PFC individuals prefer to behave in a manner that is inconsistent with their prior behavior. displays the results of this study.",
               "Overall, the studies examining compliance with consistency-based social influence tactics have demonstrated that preference for consistency does significantly moderate behavior, with high-PFC individuals demonstrating consistency in behavior and low-PFC individuals demonstrating no consistency in behavior or even anti-consistent behavior when their prior actions are made salient."
          ],
          "paper_id": "2373c250-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Preference for consistency and social influence: A review of current research findings"
     },
     {
          "head": {
               "text": "Downloaded by [Auckland University of Technology] at 18:32 01 November 2015",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Preference for consistency and persuasion also examined preference for consistency as a moderator for persuasion in the two contexts: balance and dissonance. The particular balance paradigm was one in which, typically, individuals who expect that they are going to meet someone, and therefore who perceive a (unit) connection to this person, come to like the person more than someone they do not expect to meet. The dissonance context was the free choice dissonance paradigm, in which it is typically the case that individuals given the free choice to engage in a counter-attitudinal behavior are more likely to change their attitude in that direction relative to those not given a choice. In the balance experiment, high-PFC participants replicated the traditional balance effect by experiencing more favorable attitudes toward an individual they expected to meet than one they did not expect to meet. However, low-PFC participants did not demonstrate a traditional balance effect, showing instead equivalent levels of favorability toward others they did and did not expect to meet.",
               "In the dissonance experiment, high-PFC participants replicated the traditional dissonance finding by becoming more favorable towards a tuition increase if they were given the free choice to write an essay supporting the increase, relative to high-PFC participants not given a choice. However; low-PFC participants did not demonstrate a traditional dissonance effect: they showed equivalent levels of favorability toward a tuition increase whether or not they had a free choice in writing an essay that advocated the increase. further examined the relationship between preference for consistency and attitude change within the context of the free choice dissonance paradigm. They expected that partitioning participants into those with high, moderate, or low preference for consistency would produce traditional dissonance effects for the high PFC scale scorers, would produce no significant dissonance effects for the middle PFC scale scorers, and would produce a reverse dissonance effect among the lowest PFC scale scorers. Participants who were high, moderate, or low in PFC participated in a dissonance study in which half of them were given the choice to write a counter-attitudinal essay advocating comprehensive exams before graduation from their school, and half were not given a choice. Salience of the consistency motive was also manipulated: half the participants were led to expect interaction with another individual for whom consistency was important, whereas the other half expected to interact with someone for whom a consistency-irrelevant concept, health, was important. In all conditions, attitude toward the counter-attitudinal topic-comprehensive exams-was assessed.",
               "Bator and Cialdini found that, as in , high-PFC participants demonstrated the classic dissonance effect as expected, reporting more favorability toward the message in the choice condition than the no-choice condition. For moderate PFC participants, as expected, the traditional dissonance effect did not appear. Finally, for low-PFC participants a reverse dissonance effect appeared (less change among participants given free choice to write the essay); but this reversal only occurred when the concept of consistency was made salient. Much like foot-in-the-door study, low PFC scale scorers responded in the opposite direction to traditional findings, in this case by demonstrating more favorability toward the counter attitudinal message in the no-choice than the choice condition. Thus, the results of these studies indicate that level of preference for consistency can impact not only whether attitude change occurs, but also the direction of that change.",
               "Finally, Heitland and Bohner (2010 this issue) examined the impact of preference for consistency in a free choice dissonance paradigm design to reduce prejudice, and found results similar to those reported above. German participants who had been selected by reporting lower levels of liking for Turkish individuals (the dominant ethnic and religious minority group in Germany) were asked to record a speech advocating integrated housing for German and Turkish people, an ostensibly counter-attitudinal position for these participants. Choice (whether or not participants chose to give a speech arguing in favor of integrated housing) and self-relevance were manipulated and preference for consistency was assessed. In the high selfrelevance condition participants were asked to imagine being in an integrated housing situation. In the low self-relevance situation participants were asked to imagine the integrated housing would occur in a neighboring country.",
               "After the participants recorded their speech, attitudes toward Turkish people were measured both immediately and 3 weeks later. Participants high in preference for consistency were more likely to change their negative attitudes toward Turkish individuals when they freely chose to give the speech or when self-relevance was high. For low-preference-for-consistency participants there was no change in prejudicial attitudes as a function of experimental condition. Additionally, the researchers reported that the correlation between attitudes toward Turkish individuals at the two assessment times after the speech was significantly higher for high-PFC participants as compared to those low in preference for consistency. Thus the results of this study indicate that preference for consistency again moderates attitude change via a cognitive dissonance manipulation and that PFC scores also impact the duration of such attitude change in a relatively unexplored domain: prejudice reduction.",
               "Other research examining the impact of inconsistent attitudes has reported similar findings. For instance, reported that preference for consistency moderated the relationship between attitudinal ambivalence and related unpleasant feelings when two conflicting attitudes were accessible. Specifically, their results demonstrated that individuals high in PFC experienced especially strong unpleasant feelings when confronted with their own attitudinal inconsistency, whereas low-PFC participants did not show any such strong discomfort.",
               "Similarly, examined preference for consistency differences in response to being stood-up by a friend-a circumstance that represented an inconsistency between what the friend did and what friends are supposed to do. The researchers varied the explanation for this situation so that there was either a sufficient or insufficient justification for the friend's action. Based on dissonance theory, Nail et al. predicted that participants who received the poor excuse would derogate their friend more than those who received a good excuse. Their results confirmed their predictions regarding attitude toward the friend and also revealed that the effect was stronger for individuals high versus low in PFC. Additionally, regardless of the justification, participants high in PFC reported feeling more offended than did those low in PFC in response to the inconsistency of being stood up by a friend.",
               "An additional study shed further light on the relationship between preference for consistency and attitude change. Nail, Bedell, and Little (2003) collected data in the aftermath of the White House affair between former President Clinton and Monica Lewinsky. Participants were asked to report their attitude toward the idea of prosecuting President Clinton after he left office. Such prosecution could be seen as consistent with evidence that he had, indeed, acted improperly while in office. Individuals high in preference for consistency reported more favorable attitudes toward prosecution than did those low in PFC. Furthermore, there was a significant interaction between preference for consistency and political party, indicating that Democrats who were low in PFC did not favor prosecution, but Democrats who were high in PFC favored prosecution as much as Republicans, who invariably favored prosecution. Thus, among high-PFC Democrats, the desire that punishment should properly follow an improper action was stronger than party affiliation in determining their attitude toward the delivery of that punishment, most likely because the research questions made the scandal more salient than their political leanings at the moment opinions were assessed."
          ],
          "paper_id": "2373c250-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Preference for consistency and social influence: A review of current research findings"
     },
     {
          "head": {
               "text": "DISCUSSION",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "The results of the last 14 years of research on preference for consistency demonstrate that it is an important moderator of consistency-based social influence processes. This suggests that social influence researchers would be wise to measure preference for consistency as a potential moderator when conducting empirical examinations of consistency in attitudes, beliefs, or behaviors.",
               "Although the body of literature on preference for consistency is growing, there is still much work needed to fully understand the impact of this individual difference characteristic on social influence. For instance, some of the studies reviewed above examined preference for consistency as a moderator by examining participants who scored at the extreme high and low ends of the scale, whereas other researchers examined individuals across the continuum. Unanimity across researchers in terms of the value that constitutes high vs low preference for consistency in future research would help clarify our understanding of what is means to be high or low in preference for consistency.",
               "Future research might examine preference for consistency as a moderator of other consistency-based social influence phenomena such as the baitand-switch procedure-in which individuals commit to an outcome (e.g., the purchase of an attractive, bargain model automobile) only to be then switched to a different, less desirable outcome (e.g., a more expensive model) that they would have not originally accepted -or the low-ball technique, which is similar to the bait-and switch procedure except that, after the initial commitment, the outcome is changed into a less desirable one (e.g., when the bargain model's price is increased) rather than replaced (e.g., by a more expensive model) . Because the effectiveness of both compliance tactics rely on an individual remaining consistent with his or her initial commitment even though the details of the agreement change, it stands to reason that individuals high in preference for consistency would be more susceptible to this type of influence tactic.",
               "Additionally, future work should examine whether preference for consistency moderates consistency-based social influence procedures across cultures. To date, we are unaware of any cross-cultural data on the preference for consistency scale but it is conceivable that individuals in collectivistic cultures may report lower levels of preference for consistency, as research indicates that individuals high in individualism are more susceptible to consistency-based influence appeals than are those high in collectivism )."
          ],
          "paper_id": "2373c250-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Preference for consistency and social influence: A review of current research findings"
     }
]