[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Many important applications can be generalized as the influence maximization problem, which targets finding a K-node set in a social network that has the maximum influence. Previous work only considers that influence is propagated through the network with a uniform probability. However, because users actually have different preferences on topics, such a uniform propagation can result in inaccurate results. To solve this problem, we have designed a two-stage mining algorithm (GAUP) to mine the most influential nodes in a network on a given topic. Given a set of users' documents labeled with topics, GAUP first computes user preferences with a latent feature model based on SVD or a model based on vector space. Then to find top-K nodes in the second stage, GAUP adopts a greedy algorithm that is guaranteed to find a solution within 63% of the optimal. Our evaluation on the task of expert finding shows that GAUP performs better than the state-of-the-art greedy algorithm, SVD-based collaborative filtering, and HITS."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "within a factor of (1 ? 1/e). Their experiments show that the A social network reflects a social structure made up of a set of individuals and ties among them, such as relationship, connections, and interactions. Online social networks such as FaceBook and LinkedIn have been remarkably popular for making friends and finding jobs, and other types of social networks include scientific collaboration networks , mobile phone networks , and instant messaging networks .",
               "Being very popular, social networks have a strong synergy with business applications. Among them, ''viral marketing'' tries to select a set of users that will potentially influence a large number of other users to choose a product, where the influence works mostly by ''word-of-mouth''. Searching for domain experts and finding the most important blogs are other examples that can be solved with analysis on social networks.",
               "Both ''viral marketing'' and searching for domain experts can be generalized as the influence maximization problem : given a social network and a parameter K , find a K -node set that eventually has the maximum influence, where influence propagates in the network according to a stochastic cascade model. In other words, the problem is to select top-K influential nodes in the network such that they eventually influence the most people in the network. Kempe et al. have proved that finding the optimal solution to the influence maximization problem is NP-hard. However, a simple greedy algorithm can approximate the optimal solution greedy algorithm significantly outperforms the classic approach using degree-and centrality-based heuristics.",
               "After Kempe's seminal work, later work improved on the algorithm's efficiency and were scaled to larger social networks. However, all the algorithms follow the same diffusion process as in Kempe's work, where each active node has the same influence on other nodes. In reality, the diffusion process of different topics propagates differently in networks . Topical Affinity Propagation (TAP) models the topic-level social influence on large networks and demonstrates that different topics actually lead to different influence results. Although the influence graph generated from TAP reveals the influence on a fine-grain level, TAP was only applied to the problems of finding representative nodes or constructing the influential subgraphs. There is no research on the influence maximization problem taking the user preferences into account. Without considerations of user preferences, the results of influence maximization are often inaccurate for a specific topic.",
               "We study the influence maximization problem with the consideration of user preferences. To account for user preferences during the influence propagation, we propose a two-stage algorithm, called Greedy Algorithm based on Users' Preferences (GAUP), for the influence maximization problem. Specifically, for a social network and a set of users' documents labeled with topics, our two-stage algorithm works as follows: the vector space model (VSM), popularly used in information retrieval. a total probability of 1 ? (1 ? p) c v,w to activate w once it becomes active. The above models do not consider topics and user preferences on different topics. Intuitively, the more preferences on topic T by v and its neighboring nodes, the more likely the influence will happen. Thus, we consider the activation probability p is not uniform, but is related to user preferences on a topic T .",
               "We have evaluated our GAUP algorithm on an academic coauthor network DBLP.",
               "1 Experimental results show that GAUP significantly outperforms the traditional greedy algorithm in terms of influence spread on specific topics. We compared GAUP with other popular algorithms for the task of searching for domain experts and found that GAUP is more effective than SVD-based collaborative filtering. In this extended version of our conference paper , our new experimental results show that (1) LSI-based user preferences are more effective than those of the VSM; and (2) compared with link-based HITS algorithm , GAUP produces more reliable results, because HITS suffers from the problem of topic drift.",
               "The rest of the paper is organized as follows. Section 2 discusses background. Section 3 elaborates the design of GAUP. Section 4 presents experimental results and validates the effectiveness of our approach. Section 5 summarizes related work. Finally, Section 6 concludes our work."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "2.2.",
               "text": "Approximation of influence maximization problem",
               "type": "introduction"
          },
          "paragraphs": [
               "The ''influence maximization problem'' is NP-hard. Thus, finding an optimal solution is generally hard. However, approximation algorithms do exist and can find solutions with proven guarantees, if the influence of a seed set is submodular, non-negative, and monotone. A function f () is submodular if it satisfies a natural ''diminishing returns'' property: the marginal gain from adding an element to a set S is at least as high as the marginal gain from adding the same element to a superset of S. Formally, for all pairs of sets S ? T , a submodular function satisfies:",
               "Nemhauser has shown that if f () is submodular, nonnegative, and monotone, the NP-hard ''influence maximization problem'', can be approximated by a greedy hill-climbing algorithm within a factor of (1 ? 1/e). Our GAUP exploits this property"
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "2.",
               "text": "Preliminaries",
               "type": "relatedwork"
          },
          "paragraphs": [
               "in the second stage to find approximate solutions (Section 3.3).",
               "This section first discusses influence diffusion models and solutions to the influence maximization problem , and then describes Singular Value Decomposition (SVD) . Readers familiar with the content may skip this section."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "2.3.",
               "text": "Singular Value Decomposition",
               "type": "relatedwork"
          },
          "paragraphs": [
               "SVD is a well-known matrix factorization method that factors an nc matrix R into three matrices:",
               "where U and V are two orthogonal matrices of size nn and cc, When considering models for influence spread through a social network, we often describe a node as being either active or inactive. Active nodes are those that are influenced by other active nodes, and are able to influence their inactive neighbors when they become active; inactive nodes are those that have not been influenced by their active neighbors. The influence diffusion from respectively. In this paper, we use SVD to compute user preferences, which are represented as low-dimensional latent features learnt from a user-topic matrix.",
               "nodes' influence added together exceeds a threshold. All nodes that were active in step t ? 1 remain active in step t. The threshold for each node is uniformly distributed within interval 3. Design , representing the fraction of v's neighbors that must be active in order to activate v.",
               "In independent cascade model, the diffusion process also unfolds in discrete steps: when an active node v becomes active in step t ? 1, it is given a single chance to active each of its inactive This section first formulates the definition of the influence maximization for a topic, and then discusses details of the twostage algorithm GAUP. neighbors with a probability p, which is independent of the history thus far. If multiple nodes try to activate the same node, their attempts are sequenced in an arbitrary order. If successful, the"
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "Problem formulation",
               "type": "modelling"
          },
          "paragraphs": [
               "We formulate the problem as follows. A social network is an activated node becomes active in step t. Whether or not v succeeds, undirected graph G = (V , E). Vertices in V are the nodes in the it cannot make any further attempts to activate its neighboring nodes in subsequent rounds. The process ends when no activations are possible.",
               "The activation probability p in Kempe's work is uniform to each edge of the graph. If node v and w have c v,w parallel edges, v has network, and edges in E model the relationship between nodes.",
               "There is a set of users' documents with topic labels. Given a number K and a topic label T , the task is to generate a seed set S of K vertices, with the objective that influence spread is as large as possible for topic T from the seed set.",
               "In this paper, we use the DBLP dataset, where G is a coauthorship graph, vertices are authors of academic papers and an edge indicates that the corresponding two authors have coauthored a paper. Parallel edges between two vertices denote Notations. Translation rules for converting publication counts to 1-5 ratings. The left column is the personal fraction of papers that a person publishes at a specific conference."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "text": "Terms Descriptions",
               "type": "modelling"
          },
          "paragraphs": [
               "A graph G with vertex set V and edge set E K Number of seeds to be selected R Number of rounds of simulations",
               "The uniform propagation probability p v,w"
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "text": "# in this conference/ personal total # Ratings",
               "type": "modelling"
          },
          "paragraphs": [
               "The propagation probability that node v activates node w",
               "Influence spread of S on a specific topic T the number of papers coauthored by the two authors. In DBLP, we can get information on each paper, including authors and conferences. We regard each conference as a distinct topic and each paper as a labeled document. lists the notations used in this paper.",
               "The resulting matrix is large and extremely sparse. Performing SVD on such a matrix is computationally intensive. To solve this problem, we remove authors who have published in less than ten conferences from the matrix, thus reducing the size of the matrix significantly. The intuition is that we are interested in the most influential people among all authors and these important ones tend to publish heavily at many different conferences."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "3.2.",
               "text": "Computing user preferences",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "We consider two different methods for computing a user's preference for a topic. The first LSI model is a matrix factorization technique that predicts user preferences from a large-scale usertopic matrix. The other VSM is a content-based approach that uses document similarity as preferences for topics."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "3.2.2.",
               "text": "VSM-based user preferences",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "In the vector space model, we use all documents authored by a user to create a person-document . Similarly, for each topic, we combine all documents of that topic to construct a topic-document.",
               "All documents form a lexicon set L = {t 1 , t 2 , . . . , t |L| }. Then we compute vectors for all person-documents and topic-documents, where the ith element of the vector is the TF-IDF weight for lexicon t i . Finally, an active user's preference on a topic is defined as the cosine similarity between their corresponding vectors, i.e.,"
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "3.2.1.",
               "text": "LSI-based user preferences",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "To compute user preferences for a specific topic, we adopt the LSI model, which can project user preferences into a reduced latent space. By assigning a weight for each latent item, our algorithm can compute the preference value of a user for a given topic.",
               "Specifically for a given user-topic matrix M, our algorithm obtains preference prediction using the following steps:",
               "where a is the person-document vector for the active user and D(T )",
               "is the topic-document vector for the topic T . ",
               "X is a matrix with dimension of nk, describing the authors'"
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "3.3.1.",
               "text": "Extended Independent Cascade (EIC) model",
               "type": "modelling"
          },
          "paragraphs": [
               "In the traditional Independent Cascade (IC) model, the probability of an activation is uniform to all edges. However, such a uniform probability cannot capture the preferences of users on different topics. For mobile social networks, Wang et al. extend the IC model to accommodate contact frequency. Similarly, GAUP considers the probability of influence is not only associated with influence frequency, but is also correlated with user preferences: the preferences in the k-dimensional latent space, i.e., the weights of more preferences on topic T by v and w, the more likely the influk latent features by the authors. X (a) denotes the ath row of X , representing user a's weights for k latent features. Y is a matrix ence will happen. In order to describe this property, we define p v,w as follows:",
               "with dimension of kc, representing the relationship between kdimensional latent space and c topics. Y (T ) denotes T th column of",
               "Y , representing k latent features' weights to the T th topic. C 0 is a constant.",
               "To compute the predictions, we simply calculate the dot product of the ath row of X and the T th column of Y and add the C 0 back. C a,T is the prediction of ath author's preference for topic T .",
               "From the DBLP dataset, we can get a user-topic matrix M, where rows are authors and columns are conferences. The question is how to define values in matrix M. Inspired by the rating matrix used in collaborative filtering, entries in matrix M are rated with a 5-star scale, where high scores mean that users prefer more favorably the conference. lists rules for such a translation.",
               "Following these rules, we obtain the user-topic matrix M, where M ij denotes the preference of author i to conference j. A zero value means author i is not interested in conference j or has not published in the conference."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "text": "This new influence model is called Extended Independent",
               "type": "modelling"
          },
          "paragraphs": [
               "Cascade (EIC) model. In the above formula, the original uniform probability p is weighted with a user preference function F (). The C v,T and C w,T are calculated by . In experiments, we choose the function F (C v,T , C w,T ) to be the square of the product of C v,T and C w,T . When node v and w have c v,w parallel edges, v has a total probability of 1? c v,w to activate w once it becomes active."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "3.3.2.",
               "text": "Approximation guarantee",
               "type": "modelling"
          },
          "paragraphs": [
               "Mining top-K influential nodes in the new EIC model is NP-hard, but can be approximated with a greedy hill-climbing algorithm. The EIC model is an edge-weighted version of the IC model, for which Kempe proves that the influence function is submodular. Because the objective function is obviously non-negative and monotone, we can use the greedy strategy to obtain a (1?1/e??)-"
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "3.3.3.",
               "text": "The greedy mining algorithm",
               "type": "modelling"
          },
          "paragraphs": [
               "To compute the influence spread in mining the seed set and in evaluating the performance of algorithms, we often use Monte Carlo simulations. Let S be the seed set computed from the greedy algorithm and RS(S) denote the resulting set of influence cascade."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "text": "Algorithm 1",
               "type": "modelling"
          },
          "paragraphs": [
               "The greedy algorithm for mining top-K influential nodes.",
               "1: Input: graph G = (V , E), number K , topic T , user preference vector UP(T )",
               "2: Output: a seed set S",
               "The influence spread after the random process is |RS(S)|. For any topic T , we obtain a user-preference vector UP(T ) from the 3:",
               "4: Initialize S = ?, R = 10000, Q = ?, current_is = 0 previous step. GAUP takes the graph G, the number K , and the"
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "text": "5: // Compute activation probability of each edge",
               "type": "modelling"
          },
          "paragraphs": [
               "vector UP(T ) as input and generates a seed set S of cardinality K , 6: for each edge (v, w)E do with the purpose that the expected influence spread by the seed set S is as large as possible for topic T . The idea of the greedy algorithm is to run for K rounds, where each round finds the vertex that will maximize the incremental influence spread in the round. Algorithm 1 describes the details of GAUP. First we calculate the propagation probability of each 7: . Otherwise, the increase of influence spread by adding this node to current set S is computed and the vertex is inserted back to the priority queue (lines 32-37).",
               "Note that lines 23-39 implement the CELF optimization , which takes advantages of the submodularity property of the influence maximization objective. Because of submodularity, during each round, the incremental influence spread of a large number of nodes does not need to be re-evaluated when their values in the previous round are less than the values of some other nodes in the current round. Previous work has shown that this optimization can improve the performance by a factor up to 700 times. ? Which one of the LSI-based and VSM-based user preference "
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "4.1.",
               "text": "Experimental setup",
               "type": "experiment"
          },
          "paragraphs": [
               "Dataset. We extract an academic co-author network from DBLP, which provides bibliographic information on major computer science journals and proceedings. DBLP indexes more than one million articles. In the extracted co-author network, each node represents an author and an edge represents that the corresponding two authors have collaborated once. Parallel edges means that the authors have collaborated more than once. We only select the papers published in conferences and extract the authors who have published in at least 10 conferences. The generated network with papers from 411 conferences contains 8627 nodes and 91 574 edges.",
               "For the VSM-based user preference, we use paper titles to represent documents, because DBLP does not contain the full content of papers and it would be expensive to do so. We use standard word stemming and remove stop words.",
               "Influence model. We conduct experiments to compare the stateof-the-art greedy algorithm using the IC model and the GAUP using the EIC model. In the IC model, the probability p is set to 0.01 . In the EIC model, the probability p v,w is computed by Eq. (5), where",
               "2 in this paper. Algorithms and metrics. lists the algorithms that are compared with in this paper. GA and GAUP are the greedy algorithms mentioned above. CF is the collaborative filtering algorithm based on SVD that select nodes with biggest C v,T values as seed set. For expert search, we also consider the HITS algorithm . For co-authors of a paper, we add links pointing to the first author from all other co-authors.",
               "For evaluation, the following metrics are used:",
               "? ISST(S, T ): influence spread of seed set S on a specific topic T .",
               "This metric evaluates the influence on a specific topic that takes  account of user preferences. ISST is defined as Eq. , where node v belongs to all nodes being activated by seed set S.",
               "close. In contrast, illustrates the ratios of ISST of comm over ISST of kdd for different topics. For topic SIGCOMM, we can observe that ISST(comm, SIGCOMM) is significantly larger than",
               "ISST(kdd, SIGCOMM), more than two times when K15. On",
               "the other hand, ISST(comm, SIGKDD) is only about one third of",
               "? IS(S): the traditional influence spread of seed set S that does not ISST(kdd, SIGKDD) for topic SIGKDD when K15. These results take user preferences into account.",
               "To obtain the IS(S) and ISST(S, T ) for each seed set S, we run demonstrate that ISST effectively measures the influence spread on specific topics and should be used as the metric other than the traditional IS when considering user preferences.",
               "Monte Carlo simulations using the corresponding IC and EIC model 10,000 times and take the average. For all these algorithms, we"
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "4.3.",
               "text": "Expert search",
               "type": "experiment"
          },
          "paragraphs": [
               "compare their IS(S) and ISST(S, T ) with different S sizes of 5, 10, 15 and 20."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "4.2.",
               "text": "Study on influence spread",
               "type": "experiment"
          },
          "paragraphs": [
               "This experiment studies whether the GAUP algorithm can find experts in a specific domain. Again, we choose SIGCOMM as the topic. shows the seed sets obtained by GA, CF, GAUP, and HITS when K = 5. None of the authors selected by GA This experiment evaluates the performance of the proposed GAUP algorithm in a real co-author network and compares GAUP with other algorithms on the specific topic of SIGCOMM. shows the ISST of various algorithms using the EIC model. From the figure, we can observe that Random as the baseline performs very badly. GAUP performs significantly better than other algorithms when K15. GAUP outperforms GA by about 10% when K is 15 and more than 30% when K is 20. This is because GAUP can find more important nodes with respect to the specified topic. When K is 5 or 10, GA finds nodes that can activate more nodes than GAUP (shown in . As a result, the cumulative influence of GA on the topic exceeds that of GAUP. CF performs worse than GA by about 30%, because CF does not consider the influence diffusion process. compares the IS(S) of various algorithms in the IC model. Because IS(S) does not take user preferences into account, the performance of GAUP is not so good as GA, since GA can find the most influential nodes across all topics. GAUP performs significantly better than Random and CF, because GAUP can find the most influential nodes in a specific topic. CF does not perform well because the influence diffusion process is not used.",
               "ISST vs. IS. This experiment studies the effectiveness of ISST and IS when considering users' topic preferences. We first use the GAUP algorithm to generate two seed sets, comm and kdd, for topic SIGCOMM and SIGKDD, respectively. With these two seed sets, we compute their IS and ISST values. shows that when K increases, IS(comm) and IS(kdd) are becoming very is in the field of networks, because GA does not take domain preference into account and tends to find experts in other domains. In contrast, GAUP, CF, and HITS can successfully find networking experts. We verified that all these people have published in wellknown networking conferences. Apart from Jennifer Rexford, all four other experts selected by GAUP and CF are different. James F. Kurose appears in both GAUP and HITS. Joseph Naor published lots of papers at networking conferences, but none in SIGCOMM. This indicates that our algorithm can effectively find domain experts.",
               "To further study the effectiveness of GAUP, CF and HITS, we designed the following experiments to compare GAUP and CF, and to demonstrate the topic drift problem of HITS."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 19,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "4.3.1.",
               "text": "GAUP vs. CF",
               "type": "experiment"
          },
          "paragraphs": [
               "With the GAUP and CF results given in it is generally hard to measure which set of users is better. To address this problem, we designed the following experiment. For the field of networks, we choose two topics, SIGCOMM and ICCCN. Then the GAUP and CF algorithms are run to find the top 5, 10, 15, and 20 experts. Finally, we consider experts that are found by both topics. illustrates the results of these two algorithms. We can observe that for the top 5, 10, and 15 experts, CF finds none that appear in both topics. In contrast, GAUP discovers 2, 4, and 5 overlapping ones for the top 5, 10, and 15, respectively. CF only finds one overlapping for the top 20 users, in which case GAUP finds 7. The seed set of GA, CF, and GAUP when K = 5.   This experiment shows that GAUP can find common experts for different sub-topics in a domain. Thus, these experts are more likely to be the most influential ones in the domain. The CF algorithm does not consider the influence spread process, and only finds experts for specific topics. As a result, CF does not produce results as good as GAUP."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 20,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "4.3.2.",
               "text": "Topic drift of HITS",
               "type": "experiment"
          },
          "paragraphs": [
               "The effectiveness of HITS depends on the quality of the initial set of nodes. Previous work has shown that HITS may suffer from topic drift. To illustrate this problem, we run the HITS algorithm with three different seed sets for topic SIGCOMM:",
               "? 20-set: we select 20 users from the experts returned by GAUP and CF for topic SIGCOMM;",
               "? 30-set: we choose 10 new users together with 20-set, where some of new users are not in the field of networks;",
               "? 31-set: we add a new user, Wen Gao, to 30-set. shows the top five experts found by the HITS algorithm for these three seed sets. The results of 20-set and 30-set only differ for one person, and all of them are well-known networking people. However, none of the results for 31-set is in the field of networks. This is because Wen Gao and its neighboring nodes are well connected in the graph generated by HITS. As a result, the most highly ranked authorities and hubs deviate from the original topic of SIGCOMM.",
               "This experiment demonstrates that the quality of HITS is highly dependent on the seed set. Because GAUP does not need such seeds, a direct comparison of HITS and our GAUP is difficult. We emphasize that GAUP is more reliable than HITS for finding experts, because of the considerations for user preferences in the influence model. This experiment studies the effectiveness of LSI-based and VSM-based user preference models. For both approaches, we compute the top 30 users for the topic of SIGCOMM, where the top five users are illustrated in . For the top 30 users, the results are shown in .",
               "We verified that all these users are interested in networks, and all top five users have published more than five papers in SIGCOMM. In fact, two users, Donald F. Towsley and Lixia Zhang, appear in the top five places for both approaches. However, when looking at the top 30 users, shows the VSM becomes less accurate, as only 20 out of 30 have actually published papers in SIGCOMM. In contrast, LSI achieves 29. This indicates that there may be subtle difference in a user's preference and the topic in SIGCOMM, which the VSM cannot capture, especially for the top 21-30 users. LSI models user preferences via latent variables and is more accurate.",
               "In summary, the LSI approach performs better than the VSM. Because LSI does not rely on text content and uses only structure information among users, LSI is more applicable for social networks."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 21,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "5.1.",
               "text": "Influence maximization",
               "type": "experiment"
          },
          "paragraphs": [
               "The ''influence maximization problem'' was first studied as viral marketing strategies and revenue maximization . These studies target marketing strategies, while this paper focuses on finding the most influential people in a social network.",
               "Kempe et al. formulate influence maximization as a discrete optimization problem and prove it to be NP-hard. They propose a greedy approximation algorithm with significant computations. Several recent studies aim at improving the algorithm's efficiency. CELF optimizes the greedy algorithm by exploiting the submodularity property to reduce the number of evaluations on the influence spread of users, which is also used by GAUP. NewGreedy removes edges that will not contribute to propagation to get a smaller graph. MixedGreedy combines CELF and NewGreedy together, where the first round uses NewGreedy and the remaining rounds use CELF. CGA first detects communities in a social network, and then employs a dynamic programming algorithm for selecting communities to find influential users. Kimura and Saito propose shortest-pathbased influence cascade models and provide efficient algorithms for computing influence spread under these models. However, they do not directly address the efficiency issue of the greedy algorithms studied by Kempe, because the influence cascade models are different. None of these approaches consider user preferences during influence diffusion and rather use a uniform probability. GAUP differs from these approaches by taking account of user preferences.",
               "very effective on Netflix competition . GAUP also adopts matrix factorization, which is used to estimate user preferences for subsequent top nodes mining. The use of matrix factorization in GAUP differs from CF in that GAUP explicitly filters out many rows in the matrix to reduce the matrix size, while CF has to work with the whole matrix. The goal of CF is to find the most relevant items for a given user, which is different from our purpose of searching for the most influential users. Additionally, our experiments have shown that collaborative filtering alone cannot find the most influential nodes."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 22,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "5.2.",
               "text": "Expert search",
               "type": "experiment"
          },
          "paragraphs": [
               "Previous work has proposed two ways to find experts. The first one leverages information retrieval techniques . The P@NOPTIC Expert system first collects all documents authored by an individual and concatenates them to create a ''persondocument''. Then, a standard document search system runs over these person-documents, where experts for an input query are returned as the people corresponding to the highest-ranked person-documents. An improvement by Balog et al. is to first collect relevant documents and then use them to find experts. The specific domain of an expert is modeled by keywords in the information retrieval approach. In contrast, our approach uses LSIcomputed hidden variables to represent user preferences.",
               "The second method is the link-based method , which exploits the structure of social networks. Campbell et al. use a modified version of the Hyperlink-Induced Topic Search (HITS) algorithm to identify authorities. Zhang et al. study the expertise finding problem in a social network of an online forum, where variants of PageRank and HITS are tested. Ghosh and Lerman compared a number of influence metrics over For the influence maximization problem, we have proposed a new GAUP algorithm to mine top-K influential nodes in social networks based on user preferences. In contrast, previous work does not take user preferences into account and only considers a uniform probability model for influence diffusion. Our GAUP algorithm works in two stages. To compute user preferences in the first stage, we study two different models, an LSI model, to project user preferences into a reduced latent space, and a VSMbased model. GAUP adopts a greedy algorithm in the second stage to find the most influential nodes in the network for a topic.",
               "Evaluation results with an academic social network demonstrate that our GAUP algorithm can maximize the influence spread on a topic. For the two models of user preferences, experimental results show that the LSI-based model is more accurate. We have compared GAUP with the SVD-based collaborative filtering algorithm and HITS for expert search, and have found that GAUP is more likely to find the most influential domain experts than collaborative filtering. In addition, GAUP is more reliable than HITS, because HITS suffers from the problem of topic drift."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 23,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "text": "References",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Digg.com data and found that? centrality is the best predictor of influence. We have shown that given the right seed set, HITS can identify experts in a domain. However, HITS suffers from the problem of topic drift , which can significantly affect the quality of results.",
               "Our work is different from these two types of approaches, as finding experts is an application of our top-K mining algorithm, which explicitly models user preferences and is based on the influence maximization model."
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 24,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     },
     {
          "head": {
               "n": "5.3.",
               "text": "Collaborative filtering",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Collaborative filtering is a one of the most successful recommendation approaches. Unlike content-based approaches, CF approaches make predictions from large-scale item-user matrices. Generally, CF approaches can be classified into memorybased and model-based approaches. Memory-based schemes achieve high accuracy by exploiting similarity functions of items and users . Model-based CF approaches first cluster all items or users into classes using machine learning algorithms, and then use these classes for prediction. Recently, CF approaches based on matrix factorizations have been shown to be"
          ],
          "paper_id": "237c26c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 25,
          "fromPaper": "Preference-based mining of top- influential nodes in social networks"
     }
]