[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "With the computer being more integrated into daily life, more and more people need to read online information. Online information is often formatted in a similar fashion to printed information. But are they similar in their effectiveness? The present study investigates the effect of information format on user's preference and reading time when people read online information or printed information. The study tested one, two and three-column formats. This study involved forty two participants from three main adult age groups: young (18-40 years), middle-aged (40-65 years) and seniors (65+ years). The overall mean age was 50.0 years (S.D. = 20.44 years). Participants were divided into two reading groups: online and on paper. A balanced number of participants from each age group was assigned to each reading treatment. There was no significant difference in the reading speed and preference between different column formats. In agreement with findings from previous studies, reading on paper was 10-30% faster than reading online. The paper concludes with suggestions to designers of online information. As previous studies showed, some action needs to be taken to improve reading speed, such as using bigger font size or high contrast between the text and the background."
          ],
          "paper_id": "23a30fb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Reading Online or on Paper: Which is Faster?"
     },
     {
          "head": {
               "n": "1",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "With the computer being more integrated into daily life, more and more people need to read online information. Because of the importance of reading online, a large number of studies investigating factors affecting reading of electronic text were conducted. listed a number of differences between reading from paper and screen that may account from the slower reading speeds on screen. Another study also found that reading from papers is 20-30% faster than reading from monitors although suggested that with better screen resolution (300 dpi) the reading speed from the monitor will equal the reading speed from paper.",
               "Ziefle (1998) investigated the effects on reading performance using hardcopy and two resolutions of monitors: 1664x1200 pixels (120 dpi) vs. 832x600 pixels (60 dpi). Participants read from the same 19-inch monitor using black characters on light background. The subjects viewed the material from a distance of 20 inches (50 cm). The study found that reading from hard copy was reliably faster (200 wpm versus 180 wpm on screen).",
               "In terms of online information layout formats, a previous study ) comparing the reading speed in reading one and three column passage found that the majority of the subjects read the three-column passage faster than the one column passage. Another study investigated user preference between one and threecolumn format passages and found that the subjects were significantly more satisfied with the three-column format when the passage was displayed on high-resolution screen (800 and 1000 pixels) and found no significant difference with 600 pixel screen ).",
               "The present study investigates the effect of information layout on the preference and reading time between online and paper reading. The information layouts tested are the one-column, two-column and three-column formats."
          ],
          "paper_id": "23a30fb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Reading Online or on Paper: Which is Faster?"
     },
     {
          "head": {
               "n": "2.1",
               "text": "Hypothesis",
               "type": "introduction"
          },
          "paragraphs": [
               "Based on the findings from previous research, the present study tests the following hypothesis: H-1: Reading speed increases as the number of column increases. H-2: Users are significantly slower when reading from screen. H-3: Users prefer the three-column format compared to the one-column format."
          ],
          "paper_id": "23a30fb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Reading Online or on Paper: Which is Faster?"
     },
     {
          "head": {
               "n": "2.2",
               "text": "Participants",
               "type": "introduction"
          },
          "paragraphs": [
               "This study involved forty two participants from three main adult age groups: young (18-40 years), middleaged (40-65 years) and seniors (65+ years). The overall mean age was 50.0 years (S.D. = 20.44 years). Participants were divided into two reading groups: online and on paper. A balanced number of participants from each age group was assigned to each reading group."
          ],
          "paper_id": "23a30fb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Reading Online or on Paper: Which is Faster?"
     },
     {
          "head": {
               "n": "2.3",
               "text": "Materials",
               "type": "introduction"
          },
          "paragraphs": [
               "The reading material was obtained from an online sample of the ETS (Educational Testing Service) test and formatted using Hypertext Markup Language (HTML) for the online experiment. Three passages (with three different topics) of 160-165 words each were used. The passages have a readability scale between ten and twelve on the Flesch-Kincaid grade level score. A random ordering of the three structures (one, two, and three column treatments) for each participant using a Latin square design was used. The same pages were also printed on paper using a laser printer for the paper reading experiment. A twelve-point Times New Roman font was used in both the online and paper stimulus materials.",
               "For the online experiment, IBM compatible personal computers with 17\" monitors (1024 X 768 pixels) were used. The passage was displayed using a web browser with black characters on a light (white) background. In line with the previous study , participants viewed the text from a 50 cm distance."
          ],
          "paper_id": "23a30fb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Reading Online or on Paper: Which is Faster?"
     },
     {
          "head": {
               "n": "2.4",
               "text": "Procedure",
               "type": "introduction"
          },
          "paragraphs": [
               "Each participant was first presented with general instructions about the experiment and then was asked to sign a consent form. Then, they were asked to answer a short pre-questionnaire (related to their computer and web use for the online reading group and related to newspaper/magazine reading for the paper reading group).",
               "Next, the participants were asked to perform a total of three reading tasks. After completing the reading of each passage, they were asked to answer three basic questions related to the topic of the passage. The total time to perform each task was recorded either using an automatic time stamp on the computer or using a stop watch in the case of reading on paper. After completing his/her last reading task, the participant was asked to record his/her preference of the display format (one, two or three column) and to provide a reason for his/her choice. shows that there was reading speed difference between different column formats both while reading on paper or online. To test the first hypothesis, an analysis of variance (ANOVA) was performed. The mean reading speed comparison showed no significant difference in online reading (F(2,60) = 0.78, p > 0.05) among the different column formats. Similar results were found in paper reading (F(2,60) = 3.02, p > 0.05). Hence, Hypothesis 1 was not supported. It can also be observed that the percentage difference in reading speed diminishes as the number of columns used for displaying the information increases.  also shows that in general the reading speed was higher in paper reading across all column formats. To test the second hypothesis, another ANOVA analysis was done. Paper reading was found to be significantly faster than online reading when the document is presented in a single (F(1,40) = 10.30, p < 0.05) or two column format (F(1,40) = 10.03, p < 0.05). No significant difference (F(1,40) = 3.01, p > 0.05) was found between online reading and paper reading for text presented in a three column format. Hence, Hypothesis 2 was partially supported.  showed the user preference of different column formats. No significant difference was found among user preferences (F(1,37) = 0.11, p > 0.05). Hence, Hypothesis 3 was not supported."
          ],
          "paper_id": "23a30fb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Reading Online or on Paper: Which is Faster?"
     },
     {
          "head": {
               "n": "3.2",
               "text": "User Preference",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Most of the participants who preferred the one-column format said that the reason was because it didn't require a lot of eye-movements, which they thought would result in disorientation (losing track where they were). Those who prefer two-column emphasized that this layout breaks the information into chunks that are more easily comprehended and it reminds them of a layout of books that they are used to. People who prefer three-column format mentioned that this format flows more easily and it chunks the information into even more highly comprehensible than the two and single column formats. Interestingly, some people wrote the reasoning about why they dislike a certain column-format rather than why they prefer a certain layout. The participants who dislike the one-column format complained that this layout required a lot of eye-movements horizontally. Similarly, those who dislike the twoand three-column formats complained about how narrow the columns were, requiring a lot of eye-movements from line to line and from one column to another."
          ],
          "paper_id": "23a30fb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Reading Online or on Paper: Which is Faster?"
     },
     {
          "head": {
               "n": "4",
               "text": "Discussions and Conclusions",
               "type": "conclusion"
          },
          "paragraphs": [
               "Overall, the results of this experiment are in agreement with previous studies, showing a 10-30% slower reading speeds when reading online. The significant difference between paper and online reading for one and two column formats may be associated with users' decline of sense of orientation when reading long lines of text (single wide columns) online, most probably resulting in losing track and having to re-read the same words.",
               "On the other hand, the paper reading group were observed to use different methods to keep track of where they are in the passage. Some used their finger to point to the words they were reading, others tended to use a pencil or a pen to guide them through their reading path. These methods were observed to be used less often when reading online (although some users did use their mouse pointer to guide them in keeping track with their reading location)",
               "Although previous research showed that participants would prefer text presented in three columns than on a single column, there no significant difference was. This might be due to the familiarity of users with single column compared to the two or three column format.",
               "The results of this study suggest that designers of online information should consider that reading online is slower than on paper, and they should take steps (using bigger font sizes, high contrast between text and background) to enhance online reading speed. Further research on this topic is necessary in order to identify and quantify the different parameters that Muter and Maurutto (1991) pointed out as possible reasons for differences in online and paper reading speed."
          ],
          "paper_id": "23a30fb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Reading Online or on Paper: Which is Faster?"
     }
]