[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "With the development of mobile Internet, a variety of mobile application software appeared, the behavior of consumers began to change. Wechat make many enterprises see the commercial value with its strong ties and interactivity, they all want to bid on the platform now. The paper analyses the conversion mode of enterprise Wechat marketing which is based on the SICAS model. From four angles which are channel, need, relationship and value, the paper puts forward the enterprise Wechat marketing strategies of attracting consumers' attention, increasing consumers' interaction and improving consumers' loyalty."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "With the development of science and technology, the focus of marketing media has gradually from the traditional media to enter the stage of the mobile Internet. With the advantages of its strong relationship and interaction, Wechat has quickly become one of the marketing means that enterprises choose. Wechat has become a new tool for their brand promotion and relationship maintenance for the enterprises. But how they do a good job in Wechat marketing, it requires enterprises to understand the users' consuming behavior. According to the consumer behavior model of SICAS, the paper analyzes the Wechat marketing mode of transformation, and puts forward the corresponding Wechat marketing strategy."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "1.1",
               "text": "Wechat",
               "type": "introduction"
          },
          "paragraphs": [
               "Wechat is launched by Tencent Company on January . It is a free application which provides instant messaging services for a smart phone, and free chatting software which provides free instant messaging service similar to Kik.",
               "Users can send voice, video, images and text rapidly by mobile phone, tablet, and web. Wechat provides the public platform, circle of friends, news feeds and other functions. Users can add friends and focus on the public platform by shaking, searching numbers, sweeping qr code and viewing the near people. At the same time, Wechat groups share the contents with their friends and share the contents that users see to the circle of friends ."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "1.2",
               "text": "Wechat Marketing",
               "type": "introduction"
          },
          "paragraphs": [
               "The core of marketing is to increase the positive exposure; the future of marketing is to precise marketing, flow channel of users is formed between each link. Wechat marketing is a kind of innovation of enterprises' marketing mode in the network economy, and a way of network marketing with the rise of hot Wechat. The strong relationship of Wechat contributes to the exposure and trading of high quality, the strong interactivity contributes to the precision marketing. This is its unique advantages which realize the real \"Marketing\" and \"Sales\". With the continuous expansion of Wechat users, Wechat marketing is pushing harder. Now Wechat has occupied the space of marketing."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "1.3",
               "text": "The Model of Analyzing Consumer Behavior--SICAS",
               "type": "modelling"
          },
          "paragraphs": [
               "The Internet has created a brand-new network of marketing communication which is based on the user relationship. Users and friends, users and enterprises will be interconnected; they can be communicated with each other freely. Not only can users get information actively by the social network and the contacts that are distributed in the entire network, but also they can use it as a source of consumption, release the main body of information, experience and share with more friends together. With the change of environment for transmission and user behavior, the users' decision-making process of consumption will change gradually. The SICAS model of consumption tracks and behavior corresponding to the new ecosystem is generating. The model is divided into five stages, S: Sense (brand and users perception each other), I: Interest & Interactive (generate interest and form interaction), C: Connect & Communication (establish connection and communicate interactively), A: Action (take action to buy), S: Share (experience and Share), as shown in .",
               "Real users Faithful users",
               "Seed users",
               "Forming the user closed loop mode of Selfdiffusing by word-of-mouth marketing "
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "2.1",
               "text": "Stage of Infection (Sense-Interest)",
               "type": "modelling"
          },
          "paragraphs": [
               "It is the stage of brand -user perception each other and generating interest-forming interaction. Allowing users to focus on the enterprises is a critical stage; it is in relation to the following stage. First, enterprises should mining exact users. Second, enterprise should do a lot of brand promotion to attract potential users. After getting users' attention, enterprises need to publish some graphic combination, videos and other forms of contents regularly according to the requirements of users such as hot topic, in order to form interaction with users and stimulate user's interest. At this stage, enterprises will get a lot of potential users."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "2.2",
               "text": "Stage of Development(Connect-Communication)",
               "type": "modelling"
          },
          "paragraphs": [
               "It is the stage of establishing connection -communicating interactively. At this time, Wechat's characteristics of point-to-point communication will evident. Enterprises can establish an effective connection with users; carry out some marketing activities to increase the interaction with users. At the same time, enterprises can answer the questions that users raise timely by using the function of automated response. According to the user needs enterprises provide a high level of service and gain the trust of users so as to transform the potential users into real users."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "2.3",
               "text": "Stage of Maturity(Action-Share)",
               "type": "modelling"
          },
          "paragraphs": [
               "It is the stage of taking action to buy and experiencing-sharing, interesting contents and a high level of service is for the enterprise to set up a good image. The purpose is to establish trustful relationship between enterprises and users so that real users transform into loyal users. Users will take the initiative to share contents to the circle of friends, weibo and other web sites at this time in order to attract friends' attention. These actions will win a reputation for enterprises. The conversion rate of sharing between friends is very high; it will form a closed cycle and bring more users for enterprises. This will contribute to return to the SI stage."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "3.",
               "text": "Wechat Marketing Strategy of Enterprises which is based on the SICAS Model",
               "type": "modelling"
          },
          "paragraphs": [
               "The real core of Wechat marketing is able to achieve precision marketing to potential users. In view of the above analysis of Wechat marketing transformation model of enterprises, we can from the channel, demand, relationship and value of the four angles to analyze the Wechat marketing strategy of enterprises.  "
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "text": ".1 The Channel of Mining Users",
               "type": "modelling"
          },
          "paragraphs": [
               "Enterprise users search for a variety of channels. To the platform of Wechat, there are several following ways:",
               "The people nearby: Today the number of Wechat users has reached more than 600 million. So large group of users make the potential users expand gradually. We can use the function of \"The people nearby\" of WeChat to make friends, and then we can use the function of \"mass assistant\" to promote their products or services.",
               "Micro-blog groups or forums: People on these platforms mostly have the same interests and needs in the enterprises' products and services. If enterprises promote on these platforms, they'll get partially effective transformation of users."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "text": "The leader of Wechat:",
               "type": "modelling"
          },
          "paragraphs": [
               "The enterprises can promote their products through leaders of Wechat which have highvolume fans and high degree of vitality.",
               "Leaflets, posters, etc: The spread can be timely and effective with qr code displayed on the traditional media."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "3.1.2",
               "text": "The Channel of Providing Service",
               "type": "modelling"
          },
          "paragraphs": [
               "Enterprises can also set the service number and subscription numbers, targeted to service users through different channels. Service number can only send a message. It is suitable for service and old users. Because old users have an understanding of the enterprises, they will be loyal to the company habitually, without providing a lot of promotions and marketing activities will be able to get their trust. Subscribe number can send a message every day. It is suitable for training new users. Because new users of the enterprises are unclear, companies need to stimulate their interest, often interact with them and let the feelings between enterprises and users sublimation, in order to make the gradual transition to new users and old users."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "3.2",
               "text": "Demand 3.2.1 The Demand of Personalized Contents (1) Contents positioning",
               "type": "modelling"
          },
          "paragraphs": [
               "As the saying goes, \"Getting users is getting the world. \" Every fan that pays attention to you is your users, but how to make them fall in love with you; the key is in the contents. In the age of Wechat, user demand for information can be summarized as the following three sentences:When I have access to the demand of information, I can easily find the information;When I don't have this demand, I don't want to be disturbed by frequent information pushing;If the contents of information is practical, fresh and interesting enough, I don't mind receiving them.",
               "For the publication of enterprises, it can be expressed by a model of \"1+X\", \"1\" is the content of reflecting the core value of the account, and \"X\" represents the contents of Interest, practicality, uniqueness, interaction. In other words, it can use the preferences of users as a starting point, and then carry out 4I theory (Interesting, Interest, Individuality, and Interaction).",
               "Individuality: Enterprises can put the hot news or original projects of an exclusive interview in the forefront of publication. At the same time, making the title abstract, users will not understand the contents by the title.",
               "Interesting and Interest: Interesting and Interest of these two types are the contents that users particularly want to see. In the era of big data, people can get information from different channels, and the numbers of them is increasing. If enterprises want to make their users become faithful users, and even develop into seed users, they must pay attention to strengthening interesting of the contents delivery. First of all, the humorous words and different styles of illustrations can add the reading taste of graphic news. Second, enterprises should let users perceive the value of information. Such as the enterprises of women's clothing, in addition to introducing the products they can also talk about the subjects about women's mentality as well as physical health.",
               "Interaction: strong interaction is an important feature of Wechat, and it is also an irreplaceable advantage. Enterprises can take full advantage of this feature to interact with users. They can set many questions and solicit opinions from users in the contents, let them have the starting point of communication with enterprises."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "text": "(2) The Frequency and Time of Pushing",
               "type": "modelling"
          },
          "paragraphs": [
               "The frequency of pushing: The frequency of pushing is not too much or too little in a week; the best is no more than three times, which aims to weaken the commercialization and gives users a more relaxed and comfortable experience. Pushing too much will disturb users that will contribute to the user's aversion. Pushing too little will lose the presence that will make users feel no useful.",
               "The time of pushing: In the fragmental time like taking bus, subway and having lunch, users will take out their phones to watch the dynamic information of enterprises which they focus on. So the best time to push the contents is at eight o 'clock in the morning, at twelve o 'clock in the afternoon or at six o 'clock in the evening."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "3.2.2",
               "text": "The Demand of Interaction",
               "type": "modelling"
          },
          "paragraphs": [
               "According to the function of Wechat's voice and video chat, enterprises can interact with users at any time and place. Enterprise can increase interaction with users by carrying out meaningful activities. Such as the activity of love drift bottle which is launched by China merchants bank, users can pick up a bottle with a simple CMB interact, contribute to a love of autistic children, this meaningful event quite attractive; but can also carry out some promotions, prize quizzes activities to improve user engagement and stickiness. For example, Olay launched the \"sun shot to win the triple whitening sunscreen restoration\" campaign, users can cut down micro video screen appears Olay and distributed enterprise public numbers, a chance to win the product. Such activities are prizes user needs, but also the user's favorite."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "3.3",
               "text": "Relationship 3.3.1 Customer Service",
               "type": "modelling"
          },
          "paragraphs": [
               "By passing the personalized contents and information to users, enterprises and users will form interaction. Then they should establish effective connection and communication with users. People know that all values derive from communication. The nature of Wechat is communication.",
               "So enterprises should form a long-term stable relationship of interaction with users. The purpose is to improve loyalty of users and give full play to the advantages of Wechat marketing."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "3.3.2",
               "text": "Voice Service",
               "type": "modelling"
          },
          "paragraphs": [
               "Enterprises can transmit multimedia message by the development interface of Wechat, give response to users timely, and monitor the public opinion in order to improve the conversion rate and turnover rate. Millet set up the customer service which is used to record the user behavior of participating in activities specially and solve the problems of users timely. The measures strengthen the connection and form a strong chain between enterprises and the users."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "3.3.3",
               "text": "Establish a System of Keywords Reply",
               "type": "modelling"
          },
          "paragraphs": [
               "The platform of enterprises operates for a long time, there will be a lot of information accumulated, and these contents will sink unfortunately, so it is necessary to build the system of keywords response which is easy to check. It can be easy to help users find what they need. It can bring convenience for users and get the recognition of users meanwhile. Such as NASDAQ: LONG, the booking business of hotels and air tickets, users only need to reply keywords to search hotels, information of air tickets and strategies that they need."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "3.3.4",
               "text": "Establish Database of CRM",
               "type": "modelling"
          },
          "paragraphs": [
               "Friends in Wechat contain different kinds of information resources, such as gender, hobbies, etc. Enterprises can make use of the database to analyze the characteristics of users, push contents directly. According to the different people, enterprises will design different contents in order to achieve an effect of fully-interactive communication."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "3.4",
               "text": "Value 3.4.1 Realize the Closed Loop Transmission of O2O",
               "type": "modelling"
          },
          "paragraphs": [
               "In effect, the real interaction is easier to bring people closer together. The integration of online and offline will cultivate loyal users and even develop into the seeds users of enterprises. By adding qr code in the traditional offline media publicity and scanning qr code to get a favorable activity, offline users will be encouraged to scan. This funny way will not only increase the user experience, but also prompt the user to take the initiative to propaganda around friends which inspires word-of-mouth effect. This will bring more consumer groups for enterprises."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 19,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "3.4.2",
               "text": "Willing to Share, Word-of Mouth Communication",
               "type": "modelling"
          },
          "paragraphs": [
               "When the products and services which enterprises provide meet the needs of users and form certain trustful relationship between each other, users will take the initiative to share contents to their own circle of friends, QQ, renren, weibo, etc. It will form the positive word-of-mouth effect."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 20,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     },
     {
          "head": {
               "n": "4.",
               "text": "Conclusion",
               "type": "conclusion"
          },
          "paragraphs": [
               "Nowadays, the function of Wechat is becoming increasingly strong. From intercom, drift bottle and qr code to Wechat payment, didi taxi and financial links, Wechat raises a hot wave of a wave, its commercial value also gradually highlights. More and more entrepreneurs are already turning to the Wechat marketing. Whether Wechat marketing can bring benefit for the enterprise, it depends on how to make good use of such a platform. In addition to the above model which is based on SICAS marketing strategy analysis of Wechat, enterprises also need to combine with their own characteristics, use the function of Wechat reasonably in order to make out the suitable Wechat marketing strategy of their own. Only in this way, can enterprises reach a certain marketing effect and obtain the expected revenues."
          ],
          "paper_id": "23b44dc0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 21,
          "fromPaper": "Research on Wechat Marketing Strategy of Enterprises which is based on the SICAS Model"
     }
]