[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "There exist two or more competing products in viral marketing, and the companies can exploit the social interactions of users to propagate the awareness of products. In this paper, we focus on selecting seeds for maximizing the competitive influence spread in social networks. First, we establish the possible graphs based on the propagation probability of edges, and then we use the competitive influence spread model (CISM) to model the competitive spread under the possible graph. Further, we consider the objective function of selecting k seeds of one product under the CISM when the seeds of another product have been known, which is monotone and submodular, and thus we use the CELF (cost-effective lazy forward) algorithm to accelerate the greedy algorithm that can approximate the optimal with 1 ? 1/e. Experimental results verify the feasibility and effectiveness of our method."
          ],
          "paper_id": "23b908b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Selecting Seeds for Competitive Influence Spread Maximization in Social Networks"
     },
     {
          "head": {
               "n": "1",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Social networks play an important role as a media for the spread of various information. For example, the diffusion of disease , viruses and even malicious rumors propagation , the information of product diffusion through the viral marketing , etc. Understanding the dynamics of these networks may help us to control the disease (or computer viruses), minimize the spread of rumors and promote products. In this paper, we take the product promotion of social networks (i.e. viral marketing) as the background. Viral marketing takes the advantage of \"word-of-mouth\" among the relationships of individuals to spread the influence of products. The spread of viral marketing in a social network can be described as follows. First, we select some initial nodes (i.e., seeds) with free samples or provide the information of products. Then these initial nodes will tell the information of products to their friends, who then tell it to their friends and so on, which is called as cascade spread. Finally, a large portion of nodes will be influenced by these seeds .",
               "It is known that how to select these seeds to maximize the influence spread is the problem of influence maximization. Domingos and Richardson considered the influence maximization as an algorithmic problem, where the customer network was modeled as a graph and a Markov random field was used to calculate influence propagation among them. Kempe et al. formulated the influence maximization as a discrete optimization problem and proposed two diffusion models based on the early work : Independent cascade model (ICM) and linear threshold model (LTM), under which the focus is to select k seeds to maximize the influence spread. The problem is clearly NP hard, but the greedy algorithm can be used to approximate the optimal result based on the submodularity.",
               "Focusing on how to design a new heuristic algorithm that is easily scalable to large-scale social networks, some researchers have improved the scalability of the Kempe et al.'s greedy algorithm for influence maximization . From the perspective of challenges in the studies of influence maximization, there frequently exists competition among the influences of two or more ideas or product information in a social network , such as the same product of competing companies Apple and Samsung or two political candidates of the opposing parties Bush and Hillary and so on. They all want to attract people's attention and spread their influence as much as possible in a social network. Thus, it is necessary to select the initial nodes to spread the influence via the relationships among individuals, exactly the problem that we will solve in this paper.",
               "In our study, we focus on the problem of selecting the seeds for maximizing the competitive influence spread in a social network, that is, how to select k seeds to maximize the competitive influence spread under certain diffusion model given the seed set of competing product I B and the budget k of one product? For this purpose, we consider the following problems:",
               "(1) How to construct the spread model of competitive influence spread? (2) How to select the k seeds?",
               "We first denote the social network as a directed graph G = (V, E), where V is the set of nodes representing individuals and E is the set of directed edges representing relationships among the individuals. Each edge e(u, v) in G is associated with a propagation probability p(u, v), where 0 < p(u, v)",
               "1. For the problem (1), it is natural to consider the classical IC model, a popular influence diffusion model that describes how influence is propagated throughout the network starting from the initial seed nodes. Chen et al. has proved that computing the influence spread given a seed set under the IC model is #P-hard, where the hardness of calculating the influence is due to the probability P(u, v) of edge e(u, v). If the probability of each edge is deterministic (i.e., the probability of each edge is exactly 1), then the breadth-first-search (BFS) can be used to obtain the influenced nodes incurred by a seed set. Therefore, the linear-time algorithm for computing the influence spread can be obtained in a deterministic graph . In this paper, we can take advantage of possible graphs to effectively obtain the active nodes of the competitive influence spread. We first select top possible graphs from all possible graphs to effectively approximate the optimal result. We further give the competitive influence spread model (CISM) to describe the competitive diffusion process in a possible graph, where the competitive information diffusion process can be well reflected. The construction of CISM can be described as follows. Initially, two sets of nodes in the social network are selected as the seeds of A and B respectively, which are then activated, denoted as A-activated and B-activated respectively. At each step, the nodes of A-activated and B-activated try to activate their out-neighbors with probability 1 by the \"live-edge\" in possible graph, and the influence that A dominates.",
               "For the problem (2), the optimization problem for selecting the most effective k seeds given the seed set of B is NP hard under the CISM. This objective function is monotone and submodular, and propose the CELF algorithm to approximately solve the problem of maximization competitive influence with 1 ? 1/e. The CELF algorithm is an accelerated algorithm, which can avoid evaluations when they are not necessary. The CISM with the CELF algorithm selects a currently best seed iteratively from V ? I B starting from an empty set, which can maximize the competitive influence spread until k seeds are selected.",
               "To test the efficiency and effectiveness of the proposed CELF algorithm for the CISM under the possible graphs, we implement our algorithms and make corresponding experiments to show the feasibility.",
               "The remainder of this paper is organized as follows. In Sect. 2, we introduce the idea to obtain the possible graphs. In Sect. 3, we give the competitive influence spread model of the possible graph. In Sect. 4, we exploit the approximate algorithm to maximize the competitive influence spread. In Sect. 5, we show experimental results and performance studies. Finally in Sect. 6, we conclude and discuss further work."
          ],
          "paper_id": "23b908b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Selecting Seeds for Competitive Influence Spread Maximization in Social Networks"
     },
     {
          "head": {
               "n": "2",
               "text": "Generating Possible Graphs",
               "type": "introduction"
          },
          "paragraphs": [
               "In a social network, the process of calculating the influence spread under the IC model and LT model is #P-hard when the seed set has been given. Similarly, in this paper, the process of calculating the influence of A under the IC model and LT model is also #P-hard given the seed set I B and I A . The hardness derives from the calculation of P A uv and P B uv of edge e(u, v). Therefore, we exploit the approximate algorithm to calculate the influence of A and that of B simultaneously.",
               "Hu et al. proposed possible graphs, similar to the subgraphs proposed by Chen et al. , where the possible graphs are generated by the following idea.",
               "For a given directed graph G = (V, E, P), the number of nodes (or resp. edges) is n (or resp. m), and there are 2 m \"live-edge\" and \"block-edge\" possible graphs in G.",
               "The existence probability of possible graph G 0 is as follows .",
               "Based on the work in , we propose the method for calculating the probability of each possible graph of competitive influence spread, in which each edge e(u, v) has two diffusion probabilities, P A B uv and P uv . In order to generate the possible graphs of competitive influence spread, we consider the following two situations: P A B uv 6 ? P uv and P A B uv ? P uv . If P A B uv 6 ? P uv , then the existence probability of possible graph G 0 A (or resp. G 0 B ) equals to the product of probabilities of all the edges G 0 A (or resp. G , v 1 is selected as the seed at step t = 0. At step t = 1, v 1 tries to active v 2 and v 3 , and v 1 successfully active v 3 , but v 1 fails to active v 2 . In , the edge e(v 1 , v 3 ) is called as \"live-edge\", and the edge e(v 1 , v 2 ) is called as \"block-edge\".",
               "Based on Eq.",
               "(1), we can obtain the probability of possible graph G 0 as follows:",
               "(a) original graph (b) t 1 (c) The possible graph "
          ],
          "paper_id": "23b908b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Selecting Seeds for Competitive Influence Spread Maximization in Social Networks"
     },
     {
          "head": {
               "n": "3",
               "text": "The Competitive Influence Spread Model",
               "type": "modelling"
          },
          "paragraphs": [
               "We now give the diffusion model of the possible graph for competitive influence spread. In a possible graph G 0 ? ?V 0 ; E 0 ?, the diffusion probability of each product by \"live-edge\" is P In the CISM, each node has three states, A-activated (i.e., individual buys product A), B-activated (i.e., individual buys product B), and inactive. In every step, each activated node tries to active its out-neighbors by the live-edge of A and B based on the following rules. The discrete time step t = 0, 1, 2,, n is used to describe the diffusion process. The activation process stops when there are no new active nodes in a time step.",
               "Example 2. Now we give an example of CISM in . is the possible graph G 0 , where e(v 1 , v 3 ), e(v 2 , v 3 ), e(v 2 , v 4 ), and e(v 3 , v 4 ) are the \"live-edges\", and e(v 1 , v 2 ) and e(v 3 , v 2 ) are the \"block-edges\". In , v 2 , as the seed of B, can reach nodes v 3 and v 4 by the \"live-edge\" following the CISM. In , v 2 , as the seed of B, and v 3 , as the seed of A, reach v 4 by the \"live-edge\", and v 4 is activated by v 3 following the CISM. "
          ],
          "paper_id": "23b908b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Selecting Seeds for Competitive Influence Spread Maximization in Social Networks"
     },
     {
          "head": {
               "n": "4",
               "text": "Maximizing the Competitive Influence Spread",
               "type": "modelling"
          },
          "paragraphs": [
               "In this Section, we discuss the objective function that selects k seeds of A under the CISM, when the seeds of B have been known."
          ],
          "paper_id": "23b908b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Selecting Seeds for Competitive Influence Spread Maximization in Social Networks"
     },
     {
          "head": {
               "n": "4.1",
               "text": "Objective Function for Competitive Influence Spread",
               "type": "modelling"
          },
          "paragraphs": [
               "We use Formula (4) to compute the probability P(G i ) of each G i obtained in Sect. 2. In a possible graph G i , we compute the expectation value r G i ?I A ; I B ? of each G i , that is, we compute the number of nodes activated by I A under the CISM when the seed set I A and I B are spread simultaneously. The objective function of graph G can be formally described as follows.",
               "Selecting k optimal nodes to maximize their influence when the initial nodes I B have been known under the CISM is NP hard. The objective function r G (S A , I B ) is monotone and submodular under the CISM and r G (/, I B ) = 0. Based on the theorem given by Nemhauser et al. , we can use a greedy algorithm to approximate the optimal result with 1 ? 1/e (where e is the base of natural logarithm)."
          ],
          "paper_id": "23b908b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Selecting Seeds for Competitive Influence Spread Maximization in Social Networks"
     },
     {
          "head": {
               "n": "5",
               "text": "Experimental Results",
               "type": "experiment"
          },
          "paragraphs": [
               "To test the feasibility and effectiveness of maximizing the competitive influence spread under the CISM in the possible graphs, we conduct experiments on four real-world datasets."
          ],
          "paper_id": "23b908b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Selecting Seeds for Competitive Influence Spread Maximization in Social Networks"
     },
     {
          "head": {
               "n": "5.1",
               "text": "Experiment Setup",
               "type": "experiment"
          },
          "paragraphs": [
               "The NetHEPT and Ca-GrQc are Collaboration networks extracted from the ePrint arXiv (http://www.arXiv.org), which is the same source used in the experimental study in . The former is extracted from the \"High Energy Physics-Theory\" and the latter is extracted from the General Relativity. The nodes in these two networks are authors and an edge between two nodes means the two coauthored at least one paper. The p2p-Gnutella08 record the Gnutella peer to peer network from August 8 2002 where nodes represent hosts in the Gnutella network topology and edges represent connections between the Gnutella hosts. The Wiki-Vote is directed graph that Wikipedia users vote the administrators, where the nodes represent Wikipedia users and a directed edge from node u to node v represents that user u voted on user v.",
               "We use the trivalency cascade model to generate the influence weight of edges. On each edge, we uniformly at random select a probability from {0.33, 0.66, 0.99}, corresponding to high, medium, low influences.",
               "In order to measure the spread effectiveness of influence for different target sets, we compared the CELF algorithm for competitive influence spread with the max-degree heuristic and random heuristic on the above four datasets. The CELF algorithm for competitive influence spread chooses the seeds by Algorithm 1. The max-degree heuristic chooses nodes with the largest degree as the product seeds of A. The random heuristic randomly chooses nodes as the product seeds of A.",
               "In order to exploit the relationship of ration of the number of B (i.e., product B) seeds to the number of A (i.e., product A) seeds (i.e., |I B |/|I A |) with the A-activated nodes, we considered the A-activated nodes under the value of |I B |/|I A | from 0.1 to 1 when the seed set I B is fixed.",
               "First, we tested the effectiveness of Algorithm 1. In this experiment, we select 10 seeds with random algorithm as the initial seeds of B and select 30 seeds of A with the Algorithm 1, max-degree and random algorithm to maximize the spread of A in NetHEPT, ca-GrQc, p2p-Gnutella08 and Wiki-Vote networks. shows that the CELF algorithm outperforms the max-degree algorithm and the random algorithm.  The number of A-activated 0 The number of A seeds This is because some of max-degree seed nodes may be clustered, and selecting all of them as the seeds of A cannot effectively spread the influence of A. By the random heuristic, as a baseline heuristic algorithm, some of selected seeds cannot spread the influence effectively.",
               "Then, we tested the number of I B to the number of I A (i.e., |I B |/|I A |) with the A-activated nodes. In this experiment, we chose 3000, 2598, 3000, 1369 nodes and 7494, 9958, 9014, 16373 edges from NetHEPT, ca-GrQc, p2p-Gnutella08 and wiki-Vote networks respectively and generate four synthetic networks, which are called as NetHEPT-new, ca-GrQc-new, p2p-Gnutella08-new, and Wiki-Vote-new respectively. We select 5, 10 and 15 seeds by the random heuristic as the initial seeds of B respectively and set the value of |I B |/|I A | from 0.1 to 1 to maximize the influence spread of A with the Algorithm 1. shows that the number of A-activated nodes is decreased with the increase of the value of |I B |/|I A | when the seeds of B are fixed. This is because the value of |I B |/|I A | is decreased when the seed set of I A is increased, and thus the number of A-activated nodes is increase. "
          ],
          "paper_id": "23b908b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Selecting Seeds for Competitive Influence Spread Maximization in Social Networks"
     },
     {
          "head": {
               "n": "6",
               "text": "Conclusions and Future Work",
               "type": "conclusion"
          },
          "paragraphs": [
               "The number of A-activated nodes",
               "The number of A-activated nodes",
               "Aiming at the effective of selecting seeds for the competitive influence maximization, we proposed the CISM under the possible graph, under which we can obtain the active nodes by the BFS. The possible graph can overcome the hardness of calculating the influence probability of a social network, and the CISM can well reflect the process of competitive influence. Further, we gave the submodular function and CELF algorithm for solving the problem of competitive influence maximization, which exploit the submodularity to accelerate the Greedy algorithm. The CELF algorithm for a possible graph proposed in this paper can select seeds for competitive influence maximization. However, the CELF algorithm is not effective for large scale social networks. For our future work, we plan to explore more effective algorithms for the competitive influence maximization under the possible graphs. Other than the effectiveness, one interesting direction is to consider the influence quality of competitive products, and another interesting direction is to consider asynchronous product spread in a social network."
          ],
          "paper_id": "23b908b0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Selecting Seeds for Competitive Influence Spread Maximization in Social Networks"
     }
]