[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "General Terms Community detection is an important task for mining the structure and function of complex networks. Generally, there are several different kinds of nodes in a network which are cluster nodes densely connected within communities, as well as some special nodes like hubs bridging multiple communities and outliers marginally connected with a community. In addition, it has been shown that there is a hierarchical structure in complex networks with communities embedded within other communities. Therefore, a good algorithm is desirable to be able to not only detect hierarchical communities , but also identify hubs and outliers. In this paper , we propose a parameter-free hierarchical network clustering algorithm SHRINK by combining the advantages of density-based clustering and modularity optimization methods. Based on the structural connectivity information, the proposed algorithm can effectively reveal the embedded hierarchical community structure with multiresolution in large-scale weighted undirected networks, and identify hubs and outliers as well. Moreover, it overcomes the sensitive threshold problem of density-based clustering algorithms and the resolution limit possessed by other modularity-based methods. To illustrate our methodology, we conduct experiments with both real-world and synthetic datasets for community detection, and compare with many other baseline methods. Experimental results demonstrate that SHRINK achieves the best performance with consistent improvements."
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "text": ".3 [Clustering]: Algorithms",
               "type": "abstract"
          },
          "paragraphs": [
               "Nowadays, many real-world networks possess intrinsic community structure, such as large social networks, Web graphs, and biological networks. A community (also referred to as a module or cluster) is typically thought of a group of nodes with dense connections within groups and sparse connections between groups as well. Detecting communities in a network can provide insight into how network function and topology affect each other and has received a great deal of attention in recent years. For example, communities in a co-authorship network might imply researchers working together with the same interests, and communities in a citation network might indicate related papers on a single topic, meanwhile communities on the Web graph might represent pages of related topics.",
               "Finding communities in complex networks is a nontrivial task, since the number of communities in the network is typically unknown and the communities are often of unequal size or density. Moreover, it has been shown that there is a hierarchical structure of complex networks with communities embedded within other communities. Essentially, small communities group together to form larger ones, which in turn group together to form even larger ones . Taking the co-authorship network extracted from DBLP in as an example, a research field can be composed of many research groups with the same academic interests. For example, there are many groups in DM research field, while a group may consist of several subgroups like \"data stream mining\", \"graph mining\",\"mining moving object\" and so on.",
               "Besides the general nodes that are densely connected with communities, there are some special nodes like hubs (denoted as red diamonds) and outliers (denoted as white triangles) in . For example, some researchers, like \"Ji-comes not only sensitive threshold problem of densitybased clustering algorithm, but also the resolution limit that other modularity-based algorithms suffer from.",
               "The rest of the paper is organized as follows. First we briefly review some related work in Section 2. In section 3, we formulize the notion of hierarchical structural-connected clusters. In section 4, we describe the algorithms in detail. In section 5, we report the experimental results. Finally, we summarize our conclusions and suggest future work in section 6. awei Han\" and \"Philip S. Yu\", have published a large amount of papers in collaboration with people from various research communities. These nodes should be considered as hubs that are closely related to different communities, forming overlapping communities. As we know, hubs play special and important roles in many real-world networks. For example, hubs in the WWW could be utilized to improve the search engine rankings for relevant authoritative Web pages , and hubs in viral marketing and epidemiology could be central nodes for spreading ideas or diseases. Furthermore, there are some nodes that are marginally connected with the community members, such as the white triangles in . In reality, a visiting scholar who only publishes one paper with researchers in the hosted group should not be considered as a member of the group, and meanwhile it is better to be regarded as an outlier. Since outliers have little or no influence in a community, they may be isolated as noise in the network. Therefore, how to detect hierarchical communities as well as hubs and outliers in a network becomes an interesting and challenging problem. However, most existing approaches only study the community detection without considering hubs and outliers. In this paper, we propose a parameter-free hierarchical network clustering algorithm SHRINK by combining the advantages of densitybased clustering and modularity-based methods. The main contributions are summarized in the following:"
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "n": "2.",
               "text": "RELATED WORK",
               "type": "relatedwork"
          },
          "paragraphs": [
               "1. We propose a novel parameter-free network clustering algorithm. Through shrinkage of the local microcommunities into super-node iteratively, our algorithm does not only reveal the meaningful hierarchical community structure in networks, but also identify the hubs and outliers.",
               "2. Our algorithm can find the communities with various densities. Moreover, the clustering result does not depend on the order of processed nodes. Experimental results show that our algorithm is effective and efficient.",
               "3. By combining the advantages of density-based clustering and modularity optimization, our algorithm overCommunity discovery in complex networks has been studied for years in multiple fields, particularly computer science and physics. Traditional graph partitioning methods, such as Kernighan-Lin algorithm , Girvan-Newman algorithm , normalized cut , and spectral bisection methods have been widely applied to find network communities. Recently, significant progress has been archived in this research field and many approaches have been presented for detecting communities in networks.",
               "Modularity-based methods: For evaluating the quality of network partitions, Newman and Girvan proposed the modularity measure Q which has been widely used in community discovery. Modularity-based methods assume that high values of modularity indicate good partitions. But it has been proven that modularity optimization is an NPcomplete problem. Most of the modularity-based algorithms find good approximation of the modularity maximum with high computational complexity such as SA (Simulated Annealing) , FN , and CNM . Recently, Blondel et al. proposed a greedy modularity-based algorithm, called BGLL , for finding communities in weighted networks. This algorithm has a low computational complexity and can discover hierarchical communities. However, the results of the algorithm depend on the order in which the nodes are visited. Actually, the methods of greedy optimization of modularity often tend to form large communities through combination of small ones. Recent research shows that modularity is not a scale-invariant measure, and hence, by relying on its maximization, detection of communities smaller than a certain size is impossible. This serious problem is famously known as the resolution limit of modularity-based algorithms . Compared with the traditional modularitybased methods, our work use the modularity as a quality function to guide the selection of optimal hierarchical communities.",
               "Hierarchical and Overlapping methods: In the presence of hierarchy, the concept of community structure becomes richer. Agglomerative or divisive hierarchical clustering are well-known techniques to solve this problem . Starting from a partition in which each node is its own community, or all nodes are in the same community, one merges or splits clusters according to a topological measure of similarity between nodes. In this way, one builds a hierarchical tree of partitions. Though this type of methods naturally produces a hierarchy of partitions, it needs a metric to stop the algorithm. Recently, some work focused on the problem of identifying meaningful community hierarchies and detecting multiresolution levels .",
               "The issue of finding overlapping communities has become a hot topic. Palla et al. proposed a clique percolation method (CPM) . A complete sub-graph of k nodes, called k-clique, is rolled over the network through other cliques with k ? 1 common nodes. In this way, a set of nodes can be reached, which is regarded as a community. One node can belong to more than one community; therefore, overlaps naturally occur. The CPM algorithm is limited by its assumption that the graph has a large number of cliques. Furthermore, the method is not suitable to detect hierarchical structure. Recently, Nepusz et al. considered the problem of fuzzy community detection in networks, which expands the concept of overlapping community structure . Every node is allowed to belong to multiple communities with different degrees of membership. A measure was introduced to identify regular nodes in a community, hubs that have significant membership in more than one single community, and outliers that do not belong to any of the communities.",
               "In real networks, communities are usually both hierarchical and overlapping. Most existing methods investigate these two phenomena separately. Our work is one of the few methods that try to discover both hierarchical communities and overlapping nodes in a given network.",
               "Density-based methods: Density-based clustering approaches (e.g., DBSCAN and OPTICS ) have been widely used in data mining owing to their ability of finding clusters of arbitrary shape even in the presence of noise. Recently, Xu et al. proposed an efficient structural network clustering algorithm SCAN through extension of the DBSCAN . This algorithm can find communities as well as hubs and outliers in a network. However, it requires a minimum similarity parameterand a minimum cluster size ? to define clusters, and is sensitive to the parameterwhich is difficult to determine automatically. To deal with this problem, Bortner et al. proposed a new algorithm, called SCOT+HintClus , to detect the hierarchical cluster boundaries of network by extending the algorithm OPTICS . However, it does not find the global clustering result and needs an additional pruning process to expose the reasonable hierarchical structure of the networks. Our work tries to develop a parameter-free method to explore the hierarchy of structural-connected communities with multiresolution levels in networks. "
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "n": "3.",
               "text": "DENSELY CONNECTED HIERARCHICAL COMMUNITIES",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The above structural similarity is extended from a cosine similarity used in which effectively denotes the local connectivity density of any two adjacent nodes in a weighted network. It can be replaced by other similarity definitions such as Jaccard similarity, and our experimental results show that the cosine similarity is better.",
               "The density-based clustering algorithm OPTICS shows that the hierarchical cluster structure of a dataset can be obtained from the reachability-similarity values plotted for each object in the cluster-ordering. Here we intend to design a parameter-free algorithm, and we do not use the minimum similarity thresholdand the minimum cluster size ? any more. Actually, the reachability-similarity of any adjacent nodes u and v are equal to their structural similarity when ? = 2 and the clustering results are not sensitive to the parameter ?. In , we give a segment of ordered similarity-plot extracted from the DBLP co-authorship network. It is able to observe that the similarity distribution describes the intrinsic clustering structure accurately with high similarity regions surrounded by low similarity regions. The clusters are clearly discernible as \"mountains\" in the plot, and the hubs and outliers are located in the low regions between the mountains. Thus, if we explore the clusters from the top of each mountain to the plain, we would find not only the nested cluster structure, but also clusters with a variety of densities. Each local maximum of the similarity in the plot corresponds to a densely connected node pair.",
               "The goals of our algorithm are not only to cluster networks hierarchically but also to identify two kinds of special nodes: hubs and outliers. Therefore, local connectivity structure of the network is used in our optimal clustering. In this section, we formalize some notions and properties of the hierarchical structure-connected clusters.",
               "be a weighted undirected network and w(e) be the weight of the edge e. For a node uV , we define w({u, u}) = 1. The structure neighborhood of a node u is the set(u) containing u and its adjacent nodes which are incident with a common edge with u :(u) = {vV |{u, v}E}{u}. The structural similarity between two adjacent nodes u and v is then",
               "is the structural similarity of nodes u and v. If(u, v) is the largest similarity between nodes u, v and their adjacent neighbor nodes:",
               "A dense pair is a pair of nodes with the largest similarity from each other. That is to say, the connectivity density of the two nodes is not less than their surrounding links. As shown in , {9, 13} is a dense pair with density 0.8165 in the example network.",
               "(1)",
               "0.6 708 9 0 .5 0 7 1 12 7",
               "0 .8 1 6 5 0 .8 0 .  clusters, hubs and outliers in networks. A similarity-based modularity gain is adopted to evaluate the quality of microcommunities and to stop the algorithm. In order to reduce the running time, we also introduce a greedy algorithm SHRINK-G which is more efficient with almost the same clustering results. ",
               ".is the density of the micro-community C(a).",
               "The micro-community is an isolated node or a sub-graph that consists of one or more connected dense pairs with certain density. As shown in , the single node set {7} forms a micro-community with density 1 and the nodes set {8, 11, 12} forms a micro-community with density 0.8 in the toy network. For any node vV , v must be in the same micro-community with itself. Obviously, it is symmetric and transitive for the relation of nodes being in the same microcommunity. Thus, a network will be partitioned into one or more local micro-communities by this equivalence relation. The involved properties are introduced in the following theorems.",
               "A metric is necessary for our algorithm to measure the goodness of the discovered hierarchical communities. Many quality functions have been proposed, such as modularity, fitness, etc. Here we select the modularity measure Q as the quality function because of its effectiveness in practice and efficiency for calculation. We use the similarity-based modularity function Qs proposed by . It is extended from the connection-based modularity Q and has a better ability to deal with hubs and outliers. Given a cluster CR = {C1, C2,, C k } of the network G = (V, E), the function Qs is defined as follows:",
               "where k is the number of clusters,",
               "(u, v) is the total similarity of nodes within cluster Ci, DSi =uC i ,vV(u, v) is the total similarity between nodes in cluster Ci and any node in the network, and T S =u,vV(u, v) is the total similarity between any two nodes in the network.",
               "To enhance the efficiency of the algorithm, we calculate the modularity Qs incrementally. Given two adjacent module Ci and Cj, the modularity gain ?Qs can be computed by",
               "where U Sij =According to the partitioning by micro-communities, the original network can be reduced into a smaller super-graph by shrinking the micro-communities into super-nodes. Then a dense micro-community can be regarded as a single node in the following process.",
               "is the total similarity of the links between two modules Ci and Cj.",
               "Based on the equation (3), the gain of modularity Qs for merging a micro-community C = {c1, c2,, c k } into a super-node can be easily computed as",
               "is a partition of the node set V and ?Vi? V , the sub-network Gi = (Vi, Ei) induced by the node set Vi is a local micro-community in G.",
               "When a hierarchical tree of local micro-communities has been built, the following Theorem 3 shows that the density of a local micro-community is not less than the density of the bigger micro-community in which it is embedded.",
               "The similarity-based modularity described above is a metric to evaluate the quality of a partition. Here we use the gain of modularity to control the shrinkage of the microcommunities. If the modularity gain ?Qs of a micro-community C is positive, we argue that the nodes of C should be clustered in the same community. Thus, given a network G, the task of our community discovery algorithms is to find a higher modularity solution under the principle of densitybased clustering, rather than to search a partition greedily maximizing the modularity Qs."
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "n": "4.",
               "text": "THE ALGORITHMS",
               "type": "relatedwork"
          },
          "paragraphs": [
               "In this section, we describe the hierarchical clustering algorithm SHRINK-H which reveals the densely connected",
               "The pseudo-code of our hierarchical clustering algorithm, called SHRINK-H, is given in Algorithm 1. The main process can be divided into two phases that are repeated iteratively, as shown in . Given a network with n nodes, first we initialize each node with a different community label. In this initial partition, the number of communities is the same as the number of nodes. Then, for each node 0 .5 0 7 1 0 .  Cluster Border stop when ?Q s <0",
               "(a) (c) i we find its local micro-community. This process is applied sequentially for all nodes. We record all the different microcommunities which represent a partition of the network and then the first phase is completed. The second phase of the algorithm is to build a super-network. We evaluate the gain of Qs for the shrinkage of the micro-communities found during the first phase. If the gain is positive, the corresponding local community is replaced by a super-node. The above two phases are executed in turns until there is no microcommunity with positive modularity gain. Then the hierarchy of communities naturally occurs, as shown in (b). This algorithm is efficient because the size of the network is reduced rapidly in the process. In each iteration, a node is visited only once and the corresponding local microcommunities do not depend on the order in which the nodes are visited. If one wants to get traditional non-overlapping partitions or overlapping communities without hubs and outliers, a post-process can be employed to deal with the \"homeless\" nodes: hubs and outliers. The homeless nodes whose neighbors are within at most one cluster are outliers. Each outlier can be assigned to its adjacent cluster as a border node. Other homeless nodes are regarded as hubs. If overlapping communities are considered, the hubs can be assigned to their adjacent communities as border nodes shown in . Otherwise, they can be assigned to the adjacent community that harvests the largest positive gain of Qs.",
               "work via greedy shrinkage of the dense pairs. Thus, each dense pair in a micro-community is considered separately. Starting with an arbitrary node u in a network G, we find the dense pair containing u. If there is a node v adjacent to u that forms a dense pair {u, v} and its modularity gain is positive, we merge node v and u to form a super-node u. Then we check whether there exists a dense pair containing uand try to shrink it. The above process is repeated until there does not exist a shrinkable dense pair containing current node. Then the algorithm continues with next unvisited node. The clustering is accomplished when all the nodes in the network G are visited. The pseudo-code of this clustering algorithm is given in Algorithm 2, called SHRINK-G. Since this algorithm needs to visit all the nodes in a network only once, it is much faster than the SHRINK-H. However, the clustering result may rely on the visiting sequence of the nodes. Nevertheless, our experimental results on a large amount of networks show that the clustering results of the above two algorithms are the same in most cases."
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "n": "4.3",
               "text": "Clustering via Greedy Shrinkage",
               "type": "relatedwork"
          },
          "paragraphs": [
               "To enhance the efficiency, we propose a modified greedy algorithm SHRINK-G. Compared with micro-community, the dense pair is a smaller unit which has the largest density among its surrounding links. If we do not consider the hierarchical structure of communities, we can cluster the netIn this section, we evaluate the proposed algorithm SHRINK using some real-world datasets and synthetic benchmark datasets. We compare our algorithms with the density-based network clustering algorithm SCAN and two representative modularity-based methods: CNMand BGLL . Our algorithms are implemented in ANSI C++. All the experiments were conducted on a PC with a 2.4 GHz Pentium IV processor and 2GB of RAM."
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "n": "5.1",
               "text": "Evaluation Criteria",
               "type": "experiment"
          },
          "paragraphs": [
               "In our experiments, we adopt Normalized Mutual Information (NMI), an information-theoretic based measurement,"
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "text": "Input: Network G = (V, E) Output: Set of clusters CR = {C1, C2, �� �� �� , C k }; Set of hubs and outliers N begin",
               "type": "experiment"
          },
          "paragraphs": [
               "CR{{vi}|viV }; while true do // Phase 1:Detect local micro-communities",
               "to evaluate the quality of clusters generated by different methods. It is currently widely used in measuring the performance of network clustering algorithms . Formally, the measurement metric NMI can be defined as",
               "where N is the confusion matrix, Nij is the number of nodes in both cluster Xi and Yj, Ni. is the sum over row i of N and N.j is the sum over column j of N . Note that the value of NMI ranges between 0.0 (total disagreement) and 1.0 (total agreement)."
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "n": "5.2",
               "text": "Evaluation on Real-world Networks",
               "type": "experiment"
          },
          "paragraphs": [
               "To assess the performance of the proposed method in terms of accuracy, we conduct experiments on the DBLP Co-authorship network and two popular real-world networks from Newman 1 . "
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "n": "5.2.1",
               "text": "DBLP Co-authorship Network",
               "type": "experiment"
          },
          "paragraphs": [
               "The DBLP Co-authorship network in four research fields (i.e., DB, IR, DM and ML) was extracted from the DBLP computer science bibliographical dataset. We only consider the authors who have published more than twenty papers. Then we obtain a weighted undirected network with 1,547 nodes and 7,789 edges, in which each node corresponds to a distinct author and the edge between two nodes represents their co-author relationship. The integral weight of an edge denotes the number of papers co-authored by these two authors.",
               "Our algorithms SHRINK-H and SHRINK-G get the same clustering result on this network, where 172 communities as well as 162 hubs and 47 outliers are found. Due to the limited space, we can not present all the extracted communities. We then select six representative communities and list no more than ten cluster members along with two representative hubs and outliers in . Each community represents a group of scientists with the same research interests, such as machine learning community (36) and information retrieval community (147) in . Here we are able to observe that SHRINK can discover meaningful co-authorship communities from a large amount of real academic associations. The identified hubs indicate some famous researchers who have published a large number of papers in collaboration with a variety of research groups. On the contrary, the identified outliers always correspond to those researchers who may only publish one or few papers coauthored with other scholars. Based on the results, we can see that SHRINK is effective to find the meaningful hubs and outliers from the research communities."
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "n": "5.2.2",
               "text": "Zarchary's Karate Network",
               "type": "experiment"
          },
          "paragraphs": [
               "The Zachary's karate network consists of 34 nodes and 78 edges as shown in . This network can be separated into two distinct groups by the dashed line since there is a conflict between one of the administrator (represented by node 1) and the instructor (represented by node 33) of the club.",
               "As shown in , our algorithms SHRINK-H and SHRINK-G can find four communities in this network represented by different colors. The roles of nodes are repre- : Six communities discovered by SHRINK on DBLP Co-authorship network. The last two rows are hubs and outliers associated with the corresponding communities which are labeled by ? andrespectively.",
               "Community Community Community sented by different shapes: two hubs denoted by diamonds, six outliers denoted by triangles in the network, and others are general cluster members. In our algorithms, nodes 10 and 20 are identified as hubs. The reason is that these two nodes connected with two adjacent communities in the same way. Hence, it is better for them to be considered as shared nodes (i.e., hubs). Due to the sparse links of this network, nodes 12, 15, 16, 19, 21 and 23 are identified as outliers which are loosely connected with the communities. In short, the SHRINK algorithm can successfully detect the community and identify the hubs and outliers. Although this partition of four communities in does not match the ground truth of the dataset, many other methods obtain the same result which indicates that it is topologically meaningful. The SCAN algorithm get the same clustering result as our algorithms by using manually detected parameters (= 0.527, ? = 3). The BGLL algorithm also find four communities in this network, but it can not find the hubs and outliers and it assigns the nodes 10 and 20 to the community of administrator. We also cluster this network using the CNM algorithm, but it only detects three communities in this network, among which the group of administrator is divided into two unreasonable sub-groups: {1, 5, 6, 7, 11, 12, 17, 20} and {2, 3, 4, 8, 10, 14, 18, 22}. The result of CNM indicates that the agglomerative hierarchical performs badly in greedy modularity maximization.",
               "are 115 college football teams, which are divided into eleven conferences and five independent teams (Utah State, Navy, Notre Dame, Connecticut and Central Florida) that do not belong to any conference. The network, representing the schedule of Division I-A games for the 2000 season, contains 115 nodes and 613 edges. Now the question is to find out the communities from the graph. (a) illustrates the football network with each vertex represents a school team. The teams belonging to a conference and the independent teams are denoted by circles and diamonds respectively, and teams in the same conference are identified by the same color. There is a link between two teams if they played a game together. The number of teams in a conference ranges from seven to thirteen. Each team plays about ten games in the season. Consequently, the inner link density of each conference is different.",
               "The clustering result of our algorithms SHRINK-H and SHRINK-G is presented in (b). We obtain eleven clusters in this network which demonstrates a good match with the original conference system. Four independent teams are correctly identified as hubs. Although there is an independent team that is falsely merged into a conference, and three misclassified teams (i.e., Louisiana Monroe, Louisiana Lafayette, and Louisiana Tech), our algorithm still performs much better than other methods including the SCAN, CNM and BGLL algorithms, which will be described as follows.",
               "The SCAN algorithm finds thirteen communities as its best result in this dataset with parameters (= 0.53, ? = 2). The teams in the conference denoted by black circles in (a) are divided into two clusters. Meanwhile, five hubs are identified including four correct independent teams: CentralFlorida, Connecticut, Navy, and NotreDame. Another independent team UtahState is misclassified into a conference. The accuracy of SCAN is worse than our algorithm, because it is hard for the SCAN algorithm to detect communities with various densities by using a global density threshold. The modularity-based algorithm CNM and BGLL discover seven and ten communities in this network respectively. The algorithm CNM only finds four clusters matching with the conferences. For the five independent teams, they are assigned to three different clusters."
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "n": "5.2.3",
               "text": "NCAA College-football Network",
               "type": "experiment"
          },
          "paragraphs": [
               "The National Collegiate Athletic Association (NCAA) Collegefootball is a social network with communities (or conferences) of American college football teams. In total, there In summary, SHRINK generates promising clustering results along with hubs and outliers in community detection, consistently outperforming baseline methods including the SCAN, CNM and BGLL algorithms.  "
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "n": "5.3",
               "text": "Evaluation on Synthetic Networks",
               "type": "experiment"
          },
          "paragraphs": [
               "(a) So far, we have presented the experimental results of our algorithms using several real-world networks. Now we also use the Lancichinetti-Fortunato-Radicchi (LFR) benchmark graphs to evaluate the performance of our algorithms. By varying the parameters of the networks, we can analyze the behavior of the algorithms in detail. Some important parameters of the benchmark networks are given in . We generate several weighted undirected benchmark networks with the number of nodes n = 5,000 and 50,000. For each n, two individual networks are generated with different ranges of the community sizes, where S means that the sizes of the communities in the dataset are relatively small and B means that the sizes of communities are relatively big. For each type of dataset, we range the mixing parameter mu from 0.1 to 0.8 with a span of 0.05 and get fifteen networks. Generally, the higher the mixture parameter of a network is, the more difficult it is to reveal the community structure. Some important parameters of the benchmark networks are:",
               "? n: number of nodes Due to the difficulty of detecting the parameterin the benchmark networks for the algorithm SCAN, we only compare our algorithm with two baseline methods of modularity optimization: CNM and BGLL. Because these two algorithms both assign each node to just one community, a post-process is used in our algorithms to assign the homeless nodes into the community with largest positive modularity gain. The clustering results of our algorithms SHRINK-H and SHRINK-G are almost the same or only slightly different in all generated networks. Thus, we report the average values of these two algorithms. The NMI scores of the three methods are plotted in . On most of the benchmark datasets, our algorithm gets NMI = 1 when mu < 0.5, which means a perfect match with the original network structure. We can see that the performances of SHRINK are better than that of BGLL on the generated networks in most cases, because the BGLL algorithm tends to produce small number of big communities on the large-scale networks, due to the well known resolution limit of modularity . For the pure modularity optimization algorithm CNM, it performs worse than both BGLL and SHRINK algorithms. However, the performance of our algorithm is decreased when mu > 0.5, especially in the small-scale network with big communities (e.g. 5000B). This is because our algorithms have to deal with more and more isolated hubs and outliers with the increasing of parameter mu."
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "n": "5.4",
               "text": "Analysis of the Resolution Limit Problem",
               "type": "experiment"
          },
          "paragraphs": [
               "Despite the good performance of the modularity measure on many practical networks, it may lead to apparently un-  : The real-world datasets for analyzing resolution limit of the modularity-based algorithms and the clustering results by SA, CNM, BGLL, and SHRINK.  . In most cases, the numbers of communities obtained by our algorithms are the most accurate results, which are very close to the ground truth.",
               "The reason that our algorithms can overcome the resolution limit is that it combines the density-based clustering principle and the modularity measure. The connected nodes with higher similarity will be considered preferentially as in the same community than the lower ones. Moreover, all of the adjacent nodes with equal similarities will be merged in one community or be staying alone. "
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "n": "5.5",
               "text": "Running Time Complexity",
               "type": "experiment"
          },
          "paragraphs": [
               "reasonable partitions in some cases. It has been shown that modularity contains an intrinsic scale that depends on the total number of links in the network. Communities that are smaller than this intrinsic scale may not be resolved, even in the extreme case where they are complete graphs connected by some single bridges. The resolution limit of modularity actually depends on the degree of interconnectedness between pairs of communities and can reach values of the order of the size for the whole network .",
               "In (a), we show a network consisting of a ring of several cliques, connected through single links. Each clique is a complete graph with n nodes and n(n ? 1)/2 links. Suppose there are c cliques (with c even), the network has a total of N = nc nodes and M = cn(n ? 1)/2 + c edges. According to , modularity optimization would lead to a partition where the cliques are combined into groups of two or more (represented by dotted lines). Here, we use a synthetic dataset with n = 5 and c = 30, called Ring. Another synthetic network is shown in . In this network, the larger circles represent cliques with n nodes, denoted as Kn, and the small cliques with p nodes. According to , we set n = 20, p = 5 and get the network called Pairwise. Modularity optimization merges the two smallest communities into one (shown with a dotted line).",
               "We present the clustering results on the above two datasets in , where n is the number of node, m is the number of edges, and c is the correct number of communities. Our algorithms SHRINK-H and SHRINK-G find the exact communities. For the Ring and Pairwise datasets, the modularitybased algorithms SA (optimized by simulated annealing), CNM, and BGLL all possess the resolution limit problem which result in merging two small cliques into one cluster.",
               "Following , we also conduct experiments on five examFinally, we analyze the computational complexity of our algorithm SHRINK. The running time of SHRINK-H is mainly consumed by finding micro-communities and merging the nodes in them in each iteration. The time complexity is O(m) for the network with m edges. If there are h steps for the algorithm to terminate, the time complexity of is O(mh). Our tests show that h is always linear in logarithm of the number of nodes n (i.e., log n), which results in an overall time complexity of O(m log n).",
               "To illustrate the running time of the proposed algorithms SHRINK-H and SHRINK-G, we generate seven networks with the number of nodes n ranging from 1,000 to 300,000. For each network, the number of edges m is ten times of the number of nodes. The running time for SHRINK-H and SHRINK-G are plotted as a function of the number of nodes in , respectively. It shows that our algorithm SHRINK-H can process the network of 300,000 nodes within an hour. The greedy clustering algorithm SHRINK-G is faster than the hierarchical one. Actually, we are able to reduce more than half running time of SHRINK-H with the similar performance."
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     },
     {
          "head": {
               "n": "6.",
               "text": "CONCLUSIONS",
               "type": "conclusion"
          },
          "paragraphs": [
               "In this paper we present a novel parameter-free network clustering algorithm SHRINK by combining the advantages of density-based clustering and modularity optimization methods. Based on the structural connectivity information, the proposed algorithm can effectively reveal the embedded hierarchical community structure in large-scale weighted undirected networks, and identify hubs and outliers as well. Moreover, it overcomes the sensitive threshold problem of densitybased clustering algorithms and the resolution limit possessed by other modularity-based methods. Experimental results on the real-world and synthetic datasets show that our algorithm achieves the best performance when compared with the baseline methods. It is efficient with time complexity O(m log n). In the future, it is interesting to investigate the local communities in large-scale online networks, and to use our method to analyze complex networks in various applications."
          ],
          "paper_id": "23bc15f0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "SHRINK: A Structural Clustering Algorithm for Detecting Hierarchical Communities in Networks"
     }
]