[
     {
          "head": {
               "text": "Past and present",
               "type": "introduction"
          },
          "paragraphs": [
               "The idea of social computing can be traced back to the 1940s in Vannevar Bush's seminal 1945 Atlantic Monthly paper \"As We May Think.\" In the paper, he conceived a memory and communication device called a memex. He also proposed many far-reaching ideas decades before researchers actively worked on them or they became everyday computing terms, including augmentation, groupware, and computer-supported collaborative work. It wasn't until the 1960s that J.C.R. Licklider headed the Advanced Research Projects Agency (ARPA) and cowrote \"The Computer as a Communication Device\" with Robert Taylor (http://gatekeeper.dec.com/pub/DEC/SRC/publications/ taylor/licklider-taylor.pdf). In this paper, Licklider and Taylor outlined methods of computer-aided group collaboration. ARPA ultimately led to ARPANET, the predecessor to Internet. Meanwhile, Douglas Englebart's lab at SRI created the first hypermedia online system, NLS (oNLine System). The first collaborative software, EIES (Electronic Information Exchange System), was implemented in the 1970s, and groupware appeared in the 1980s (see www.lifewithalacrity. com/2004/10/tracing_the_evo.html).",
               "Early social software had two distinct foci. One was on the technological issues, interfaces, user acceptance, and social effects around group collaboration and online communication. For example, Peter and Trudy Johnson-Lenz defined groupware as \"intentional group processes plus software to support them.\" Other definitions of collaborative work and groupware similarly emphasized the group process and supporting software and technologies. The second focus was on the use of computational techniques, principally simulation techniques, to facilitate the study of society and to test out policies before they were employed in real-world organizational or political situations. For example, Richard Cyert and James March utilized simulation to examine how firms behaved. In recent years, the scope of social computing has expanded tremendously, with almost all branches of software research and practice strongly feeling its impact. lists several recent definitions of social computing and social software. Our definition expands social computing's scope by including computing technologies that support and help analyze social behavior and help create artificial social agents. Here we discuss the theoretical, methodological,  and computing devices), ? computerize aspects of human society, and ? forecast the effects of changing technologies and policies on social and cultural behavior. and technological underpinnings of social computing, review several major application areas, and raise some key research issues."
          ],
          "paper_id": "23ca46c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Social Computing: From Social Informatics to Social Intelligence"
     },
     {
          "head": {
               "text": "Theoretical and infrastructure underpinnings",
               "type": "introduction"
          },
          "paragraphs": [
               "Social computing is a cross-disciplinary research and application field with theoretical underpinnings including both computational and social sciences (see ). To support social interaction and communication, it relies on communication; humancomputer interaction; sociological, psychological, economic, and anthropological theories; and social network analysis. Social informatics studies have revealed that ICT and society influence each other. 8 Thus, social computing has emphasized technology development for society on one hand and incorporating social theories and practices into ICT development on the other. To facilitate the design of social-technical systems and enhance their performance, social computing must learn from sociology and anthropology and integrate psychological and organizational theories. From an information-processing perspective, social computing's technological infrastructure encompasses Web, database, multimedia, wireless, agent, and software engineering technologies.",
               "From a methodological viewpoint, incorporating social theories into technology development often poses the additional requirement of constructing artificial societies using agent modeling techniques, according to specific rules and through the interaction of autonomous agents in the environment. 11 Using simulation can be particularly valuable and ethical when examining policies dealing with matters of life and death, such as in bioinformatics, epidemiology, 12 and terrorism. In addition, due to the difficulties of testing real systems that are inherently open, dynamic, complex, and unpredictable, computational experiments with artificial systems and simulation techniques are usually needed for evaluating and validating decisions and strategies. Combining real and simulated data for the purposes of verification and validation can be a major challenge, particularly when real-world data is incomplete or unavailable. To seek effective solutions, we can execute artificial and real systems in parallel and employ adaptive control methods for the experiments. Finally, social simulations often must be part of a large framework that includes data-and text-mining tools so that real and virtual data can be collected and co-analyzed. 16 illustrates the ideas of artificial societies, agent-based modeling, and computational experiments that have been applied to the development of artificial social systems in transportation, logistics, and ecosystems. Four main application areas exist.",
               "One application is the creation of Web 2.0 services and tools (for example, blogs, wikis, social networks, RSS, collaborative filtering, and bookmarking) to support effective online communication for social communities. Another application is entertainment software, which focuses on building intelligent entities (programs, agents, or robots) that can interact with human users. Both applications emphasize the technology side and use social theories as guidelines for designing and framing computational systems. A third application area is the business and public sector, which includes various e-business, healthcare, economic, political, and digital government systems, as well as artificial engineering systems in domains of significant societal impact. A fourth application area is forecasting, which includes a variety of predictive systems for planning, evaluation, and training in areas ranging from counterterrorism to market analysis to pandemic and disaster response planning."
          ],
          "paper_id": "23ca46c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Social Computing: From Social Informatics to Social Intelligence"
     },
     {
          "head": {
               "text": "Major application areas",
               "type": "introduction"
          },
          "paragraphs": [
               "Social computing applications are driven by the needs to"
          ],
          "paper_id": "23ca46c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Social Computing: From Social Informatics to Social Intelligence"
     },
     {
          "head": {
               "text": "Computer-supported online communities",
               "type": "introduction"
          },
          "paragraphs": [
               "One driving force of social computing is the desire to create more capable computational infrastructures to support collaborative work and online communities and to invent new types of social media for communication. IBM first developed a multiparty chat environment, Babble, in 1997. Babble and its Web-based successor, Loops, can support synchronous and asynchronous textual conversation among small to medium-sized workgroups. Microsoft's Wallop project provides a tool that enables users to author lightweight content online and build conversations in the context of their social networks. In addition to Microsoft and IBM, many research labs and companies, including Intel, FXPAL, HP, PARC, Mitsubishi, MITRE, AT&T, Nokia, NASA, and Google, actively conduct social computing research. Since 2004, Microsoft Research has hosted annual social computing symposiums to help promote this area of research. IBM also hosted services science symposiums during the same time period, part of which has focused on compartmentalizing social computing modules as services.",
               "Social",
               "This shift of computing style also raises lots of social science and design questions, 18 such as the criteria for measuring online communities' success; the relationships between software, social groups, and individuals; privacy versus publicity; and so on. Meanwhile, the progress of online community tools such as social networks can help other research fields in measuring basic human social characteristics, such as trust and social influence. In the next decade, as more people use online collaboration services and tools, the related technologies will improve and become more convenient. We expect to see more social capabilities built into Web services and more social and organizational theories integrated with computing technologies. theHuggable.html) can sense, monitor, and respond to human touch for therapeutic applications. In many aspects, social robots share social agents' underlying framework and technologies."
          ],
          "paper_id": "23ca46c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Social Computing: From Social Informatics to Social Intelligence"
     },
     {
          "head": {
               "text": "Intelligent entities in interactive entertainment",
               "type": "introduction"
          },
          "paragraphs": [
               "It's always desirable to design interactive systems that can socially interact with users. This is particularly true in interactive entertainment applications such as gaming, storytelling, and edutainment. For example, when designing computer role-playing games involving multiple characters, it's crucial to construct convincing social (nonplayer) characters who can respond properly to environmental changes and to other characters' behavior. In recent years, adopting game-like approaches for developing educational and training software (so-called serious games) has become increasingly popular. In entertainment software and its business-driven applications, characters' lack of human-like intelligence is the biggest obstacle to creating engaging gaming experiences.",
               "The key challenge here is the computational modeling of characters' social intelligence on the basis of social and psychological theories. Several virtual training projects at the University of Southern Californiafor example, Mission Rehearsal Exercises and Tactical Language Training (www. tacticallanguage.com/tacticaliraqi)-have implemented social learning environments with embodied conversational agents for practicing leadership skills, foreign language, and culture in rich social interactions. In these applications, coherent emotional, cognitive, and social models enhance the virtual characters' external behavior. One popular form of entertainment software is multiplayer online games, which combine interactive entertainment and online communities. The Sims 2 (http:// thesims2.ea.com), for instance, has fully visualized virtual worlds to model a massive online community. Another popular game, America's Army, provides an online 3D training simulator for millions of registered players (www.americasarmy.com). Future research on interactive entertainment will likely focus more on online multiplayer entertainment, achieved by reducing network latency and increasing bandwidth and networking resources.",
               "A similar research and application area is interactive social robots. At the MIT Media Lab, the electronic Teddy Bear (http://robotic.media.mit.edu/projects/"
          ],
          "paper_id": "23ca46c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Social Computing: From Social Informatics to Social Intelligence"
     },
     {
          "head": {
               "text": "Business and public sector applications and forecasting systems",
               "type": "introduction"
          },
          "paragraphs": [
               "Ideas and specific technologies from social computing have recently found wide applications in business and the public sector. In the business arena, these applications' emergence and growth have largely mirrored those of online communities. One such application is recommender systems, which automate the process of suggesting products, services, and information to potential consumers. Major e-tailers such as Amazon.com, Half.com, CDNOW, and Netflix are increasingly adopting these systems, which have been acknowledged to help increase online and catalog sales and improve customer loyalty. Netflix's recent well-publicized million-dollar competition (www.netflixprize.com) is one indication of the significance and business value of improving recommendation quality. One of the most commonly used successful recommendation approaches is collaborative filtering, which uses consumer-product interaction data in the form of historical sales transaction data to predict future sales. As another example of social computing's business applications, many ecommerce Web sites have adopted online product/vendor feedback/reputation systems. Such systems provide an asynchronous platform for the consumer community to share experiences collectively and influence their purchasing behavior. They also provide a vehicle for eliciting feedback information valuable to the vendors and e-commerce site operators.",
               "In the public sector, many digital government applications can be characterized as social computing applications with varying degrees of sophistication. For instance, in the domain of homeland and national security, 24 social network analysis techniques have been widely applied to analyze organizations ranging from terrorist groups, parties communicating through some means under surveillance, criminal organizations, and resources for fighting crime and terrorist acts. In addition, the methodology of artificial societies and computational experiments is also being applied to study evolutionary group behavior. In other domainssuch as public health, public opinion and political discourse, and public transportation, which involve communities and interactions among them-the social computing framework has provided both a system design methodology and guidelines for specific system functions and how people and the community interact with the system and among themselves. In still other domains, such as health policy and state intervention, social computing applications support decision making by enabling the policy maker to do a series of what-if analyses. ring, planning, and coordinating social activities. The characterization of social structure and relations are typically represented via nodes and ties in network representation, such as social networks. For social networks, the key representational issue is the development of network models whose properties reflect the social reality. Future network models must represent aspects of this reality in a social context, including individual agents' beliefs, goals, and intentions. Because any specific network representation is an abstraction of the real society, it's equally important to find the proper level of abstraction to fit the intended applications. The Semantic Web and ontologies are promising in providing the tools and formalism for such specifications. behavior emerge from micro-level agent interactions. Research gaps exist between individual cognitive modeling and multiagent social simulation. Recent studies have started to explore the two fields' intersection and synergy for a better understanding of individual cognition and sociocultural processes and how to integrate cognitive and social sciences into computing technologies.",
               "From both theoretical and technological perspectives, social computing technologies will move beyond social Social computing research issues information processing toward emphasizing social intelligence.",
               "We now turn our attention to key social computing research issues. Many of these are directly motivated by challenges facing the application of social computing in the domains we discussed earlier, whereas others are theoretical. To facilitate the development of social software, one fundamental issue is the representation of social information and social knowledge. Other important issues are the modeling of social behavior at both the individual and collective levels and analysis and prediction techniques for social systems and software."
          ],
          "paper_id": "23ca46c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Social Computing: From Social Informatics to Social Intelligence"
     },
     {
          "head": {
               "text": "Analysis and prediction",
               "type": "introduction"
          },
          "paragraphs": [
               "Statistical methods have been used to analyze and predict the costs and benefits associated with various strategies, policies, and decision-making methods. These methods include structural equations, cellular automata, Bayesian networks and hidden Markov models, system dynamics, and agentbased approaches. Additionally, progress made in data-mining, machine-learning, and visualization techniques help identify internal relationships and patterns from empirical data. To investigate human social phenomena, other analytic techniques from quantitative and computational social sciences also play a critical role. Social computing enables building social systems and software and allows for embedding actionable social knowledge in applications rather than merely describing social information. Within social network analysis, traditional approaches have focused on static networks for small groups. As the technologies move forward, one major challenge for social network analysis is to design methods and tools for modeling and analyzing large-scale and dynamic networks. Soci al computing represents a new com-"
          ],
          "paper_id": "23ca46c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Social Computing: From Social Informatics to Social Intelligence"
     },
     {
          "head": {
               "text": "Representing social information and knowledge",
               "type": "introduction"
          },
          "paragraphs": [
               "Social information describes societies' features, such as social relations, institutional structure, roles, power, influence, and control. From an individual agent's perspective, social knowledge describes agents' cognitive and social states (for example, actors' motivations, intentions, and attitudes). Social information and social knowledge provide a basis for infer-"
          ],
          "paper_id": "23ca46c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Social Computing: From Social Informatics to Social Intelligence"
     },
     {
          "head": {
               "text": "Agent-based social modeling",
               "type": "modelling"
          },
          "paragraphs": [
               "At the micro level, agent-based social modeling focuses on the cognitive modeling of social behavior and individual agents' interactions. The fundamental research issues include computational modeling and social reasoning of agents' beliefs, motivational goals, emotions, intentions, trustworthiness, social responsibility, and commitments. At the macro level, the agent-based approach models systems comprising autonomous, interactive agents via multiagent social simulation. Simulating complex social processes raises many research issues such as model specification (for example, the basic assumptions, parameters, interrelations, and rules), experimental design, and testing the simulation model. Other research challenges include representing social context, modeling individual and cultural differences, and how social institutions, norms, and group puting paradigm and an interdisciplinary research and application field. Undoubtedly, it will strongly influence system and software developments in the years to come. We expect that social computing's scope will continue to expand and its applications to multiply. From both theoretical and technological perspectives, social computing technologies will move beyond social information processing toward emphasizing social intelligence. As we've discussed, the move from social informatics to social intelligence can be achieved by modeling and analyzing social behavior, by capturing human social dynamics, and by creating artificial social agents and generating and managing actionable social knowledge."
          ],
          "paper_id": "23ca46c0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Social Computing: From Social Informatics to Social Intelligence"
     }
]