[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "We review research on the social influences on creativity. The main focus is on recent research on group and team creativity and the implications of this research for organizational creativity. We propose a broad model of the role of the cognitive, motivational, and social processes involved in creativity and innovation. Using this model as a framework, we highlight the influence of diversity, conflict, emotionally supportive environments, and social comparison processes on group creativity. Future directions for research on group creativity are suggested."
          ],
          "paper_id": "23e12a20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Social influence, creativity and innovation"
     },
     {
          "head": {
               "text": "A MODEL OF THE GROUP CREATIVE PROCESS",
               "type": "modelling"
          },
          "paragraphs": [
               "We will briefly describe the creative process implied by this model. A group member who possesses the task-relevant knowledge, skills, and attitudes (KSAs) and intrinsic motivation to focus on the task (group member variables) may search long-term memory to generate ideas and solutions to the problem (i.e., engage in cognitive processes). The member will only share the generated ideas (social process) if the member is motivated. This can be influenced by external demands (e.g., support for creativity, creative mentors, and models who shared their ideas freely in past group meetings). It is also important that the group climate is psychologically safe and participative (e.g., high levels of trust and support for full participation by all members). The group should be structured to enhance communication and exchange of diverse perspectives (e.g., diverse backgrounds, effective communication channels). Other team members will only attend to the shared ideas (cognitive process) if they are motivated to do so. This attention is affected by how similar or diverse the group member who shared the idea is perceived to be (group structure variable). This perception may be influenced by the group's climate (e.g., shared goals/vision, trust, conflict) and external demands (e.g., organizational structure). If team members do pay attention to the shared ideas, this exposure provides performance information, which may lead to social comparison (social process) to a referent within the group. This social comparison is influenced by group member variables (e.g., creative selfefficacy) and group structure variables (e.g., cohesiveness). Alternatively, team members may attend to a referent outside the group or to an organizationally specified goal (external demand variables), thereby affecting motivation to focus on the task. In addition, exposure to another's ideas may lead group members to combine the shared ideas with their own ideas to create novel solutions (cognitive process). If these solutions are shared (social process) and the group member is rewarded for sharing the idea (external demand variable), the group's climate is perceived to be more psychologically safe and the group member's motivation to share future ideas is increased. This may positively influence the group member's motivation to generate solutions (cognitive process). In addition, having created and shared a ''successful'' idea, the group member's mood is likely to become more positive (group member variable), increasing cognitive flexibility (positively affecting cognitive processes). This may improve the group performance, thereby positively influencing some of the social processes.",
               "The interplay among the group, task, and situational variables, the team processes, and the creative or innovative output makes the creative group process complex and dynamic. We will detail some of the key components of the model to provide a clearer perspective of the processes involved in group creativity."
          ],
          "paper_id": "23e12a20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Social influence, creativity and innovation"
     },
     {
          "head": {
               "text": "Downloaded by [Auckland University of Technology] at 17:53 01 November 2015",
               "type": "modelling"
          },
          "paragraphs": [
               "Motivational processes and creativity Motivation is one of the key elements of our model. It was also a major focus of the first comprehensive analysis of the social context of creativity published by Teresa Amabile . She reviewed evidence for the role of various social factors such as models, mentors, and reward systems. In particular she suggested that a context in which individuals had high feelings of autonomy was important for motivating creativity. She developed measures of the extent to which an organization provided for autonomy and has examined its role in various organizational settings . A major focus of her work is on the inhibiting effects of external rewards or pressures on creativity. However, she has recognized that both intrinsic and extrinsic motivation may be important and that they can complement each other . In particular, during creative/ideational phases, intrinsic motivation may be most important. In subsequent implementation and marketing phases, extrinsic motivation may play a more important role (see also ).",
               "Our own perspective is that task focus is the key ; see also . For individuals to be effective on any task, they need to be focused on the task and its successful completion. This may require a high degree of motivation, since the task may be difficult and there may be frustrations or failures along the way. Intrinsic motivation or interest in the task may wane unless there are some external reasons to persist (e.g., social pressure, monetary gain, hope of eventual success). The extrinsic factors may lead to persistence until some degree of success is achieved. This may rekindle the intrinsic motivation to work on this particular task. Therefore, to the extent that external factors/reward systems take attention away from the creative task, they harm creativity; to the extent that they increase motivation to focus on the creative task, they facilitate creativity.",
               "A similar multi-faceted approached is implied by perspectives in scientific, organizational, and culture creativity. In each case, scholars often cite the importance of freedom, support for creativity, exposure to diverse perspectives, but they also note the importance of external rewards and external challenges such as competition and time pressure (e.g., . This sets up an interesting contradiction. Much of the emphasis suggests the importance of freedom and a supportive environment (psychological safety) due, in part, to the assumption that fear of negative evaluation inhibits individuals' ability and motivation to be creative . This fits nicely with our US cultural bias in rearing children in psychologically safe environments carefully designed to develop and maintain self-esteem and self-efficacy. Yet the irony is that growing up in hard and traumatic times is related to creative genius (cf. , and others have emphasized that ''necessity is the mother of invention.'' It was the realization that the Russians had a big head-start in the space race that motivated President Kennedy to challenge the US to be first to put a person on the moon. Innovations in business often come from end-users, who create solutions to problems they identify (von ). For innovation to occur, it may be that it is important to have the positive social influences or contexts that motivate and make possible creativity, but at the same time a number of negative experiences (such as a childhood trauma or the realization that the status quo will not ensure an organization's survival) may be a motivational basis for creative behavior. It is when highly motivated individuals are in a challenging environment that provides freedom and support, that creativity and innovation thrive. However, it is also true that too much of a good thing may have negative effects. Too much choice or freedom may paralyze creative efforts since individuals may feel overwhelmed by their options . In several creativity studies we have found that subdividing ideational task components over time instead of presenting all of the components at once greatly facilitates the number of ideas generated .",
               "Although some have argued that motivational forces may differentially affect different phases of the creative/innovation process ), we propose that these factors have similar effects in all phases. Consistent with the Creative Problem Solving perspective of , which highlights the various processes from idea generation to implementation, we suggest that creativity is involved in all phases of the problem-solving process (fact finding, problem finding, idea finding, solution finding, and acceptance finding). Each of these phases requires creativity, persistence, and a sense as to when to move from one phase to the other. We believe most of the factors that influence the ideational phase will affect the other phases in a similar fashion. Unfortunately there has been much less research on phases other than the ideational one. West and others have focused on the innovation phase. Our model of group ideation includes many of the factors West has highlighted in his research , so there may be considerable consistency in findings for the ideational and innovation phases of the group creative process."
          ],
          "paper_id": "23e12a20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Social influence, creativity and innovation"
     },
     {
          "head": {
               "text": "GROUP VERSUS INDIVIDUAL CREATIVITY",
               "type": "modelling"
          },
          "paragraphs": [
               "Thus far we have focused on how various social factors influence the creativity of individuals. These individuals are often embedded in groups or teams since many activities are organized around groups or teams. It is presumed that the same principles that apply to solitary individuals will also apply to individuals embedded in groups or teams. Evidence for this comes from the literature on group brainstorming. Much of the experimental literature on group creativity has used the brainstorming paradigm, in large part because this literature has provided an interesting set of issues and has provided a platform for developing cognitive and social models of the creative process. We will highlight some of the major findings from this literature that support the role of social factors in group creativity.",
               "Brainstorming is basically a cognitive activity . Participants have to generate ideas by tapping their long-term memory for relevant issues or topics to connect to the problem being considered. When these are shared in the group, ideas can lead to additional ideas by stimulating associations related to the shared ideas ). Furthermore, shared ideas can be combined in some fashion to generate hybrid ideas . Creative ideas should be particularly likely when the group consists of individuals with varied knowledge or experience relevant to the problem. This would allow the group to come up with a much greater variety of ideas than in the case where the group consists of individuals with similar expertise or backgrounds . From this vantage point, group creativity is a very natural process, and group sharing of diverse knowledge is an obvious route to the production of creative products. No wonder there are so many books and experts who extol the innovative genius of groups (e.g., .",
               "The main fly in the ointment of this perspective comes from the empirical literature on group brainstorming. Many studies have demonstrated that idea sharing in face-to-face groups tends to be less productive than solitary idea generation. For example, when groups of four individuals brainstorm on some topic they typically only generate half as many ideas as four individuals brainstorming alone . Why don't we see the cognitive stimulation dividend that should be expected in those groups? It appears that a lot of social forces inhibit the creative process in groups. Individuals may feel apprehensive about what others think about their ideas in groups and thus may limit their sharing or share only non-controversial ideas . When individuals share ideas in a face-toface situation, they have to share the ''microphone time.'' That is, only one person can speak at a time. So, the larger the group, the smaller the percentage of individuals who can speak at a time. Not surprisingly, the larger the group, the worse the performance of face-to-face brainstorming groups . Moreover, when individuals have to wait their turn to express their ideas, they may forget the ideas or lose their motivation to share . These various inhibitory factors are inevitable in face-to-face groups and thus suggest that such groups will always perform poorly. However, there are a number of perspectives that are a bit more optimistic. Cognitive models of group brainstorming ) have suggested conditions under which group brainstorming can be an effective source of creative ideas. Various social influence factors can also motivate higher levels of creativity in groups. In this paper we will focus on the social influence factors. A detailed discussion of the cognitive perspective can be found in several papers by "
          ],
          "paper_id": "23e12a20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Social influence, creativity and innovation"
     },
     {
          "head": {
               "text": "SOCIAL INFLUENCES IN GROUP CREATIVITY",
               "type": "modelling"
          },
          "paragraphs": [
               "We will summarize the major findings on the role of the various social influence variables on group creativity. In each case we will highlight some of the factors outlined in our summary model . However, we recognize that it is often difficult to distinguish social influence factors from cognitive ones, since the cognitive processes derive from social interaction and the social influence processes are at least in large part cognitively mediated. For example, exposure to diverse perspectives theoretically facilitates creativity and innovation because it increases the knowledge base from which ideas are generated, brings about greater elaboration of taskrelevant information as members try to integrate and reconcile the diverse perspectives, and inhibits premature acceptance of a solution . However, strategies to increase exposure to diverse perspectives are inherently social in nature and sometimes negatively affect other social processes and variables, impairing rather than facilitating creativity."
          ],
          "paper_id": "23e12a20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Social influence, creativity and innovation"
     },
     {
          "head": {
               "text": "Diversity",
               "type": "modelling"
          },
          "paragraphs": [
               "One obvious strategy to increase exposure to diverse perspectives is to assign the creative tasks to teams of diverse individuals. Yet two meta-analyses ) find no consistent evidence that group diversity leads to improved performance. In addition, conclude that diversity on surface-level characteristics (e.g., race/ethnicity, gender, and age) can have negative effects on group processes, leading diverse groups to be less cohesive, have higher turnover rates and lower levels of commitment, and experience more relational conflict than more homogenous groups. According to social categorization theory and social identity theory , salient differences among group members will lead group members to view themselves and others in terms of relevant stereotypes; in-group favoritism can cause friction between the sub-groups, diminishing the perception of a psychologically safe environment and increasing relationship conflict.",
               "Although conclude that diversity on underlying dimensions (e.g., education, personality, and functional background) can have positive effects on creativity and productivity if group processes are controlled, Van Knippenberg and Schippers (2007) find little evidence in support of this conclusion. They suggest that only under conditions in which diversity leads to enhanced awareness of effective group processes (reflexivity), enhanced communication, and elaboration of task-relevant information will diversity positively affect team performance, commitment, and satisfaction. In a laboratory study, found that group members' attitudes toward diverse groups mediated the relationship between group diversity and creativity. That is, only groups composed of those who had a positive attitude toward diversity demonstrated higher-quality ideas in ethnically diverse groups. Possibly, those with a positive attitude toward diversity are more intrinsically motivated to process and elaborate the ideas shared by their diverse group members."
          ],
          "paper_id": "23e12a20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Social influence, creativity and innovation"
     },
     {
          "head": {
               "text": "Conflict",
               "type": "modelling"
          },
          "paragraphs": [
               "Another strategy to increase exposure to diverse perspectives might be to encourage one or two people in the group to disagree with the others. To the extent that minority dissent leads group members to seriously consider the minority's point of view, encouraging extended focus on task-relevant information and exposure to diverse perspectives, minority dissent should improve group creativity ). Perceived minority dissent among team members in private companies increased supervisors' ratings of innovation among teams that had high levels of team reflexivity ) and among those that had high levels of participation ). Although minority dissent appears to be useful in promoting creativity under certain conditions, the effect of task conflict is less clear.",
               "Encouraging task conflict among group members may increase exposure to diverse perspectives, which should increase creativity . However, De Dreu and Weingart's (2003) meta-analysis found that both relationship conflict and task conflict hurt team performance. In addition, analysis of workers' daily diaries suggested that process, relationship, and task conflict are negatively related to perceived team creativity. Other researchers have identified mediating and moderating variables. For example, found that project type moderated the relationship between conflict and innovation. Specifically, among service-driven project teams, relationship conflict hurt creativity and task conflict had no effect on creativity. However, among technology-driven project teams, task conflict helped creativity and relationship conflict had no effect. De reported that collaborative problem solving mediated the positive relationship between task conflict and innovation.",
               "Some research suggests task conflict may be curvilinearly related to creativity and innovation ). Controlling for team size and task interdependence, De Dreu's (2006) analyses suggest that moderate levels of perceived task conflict lead to the highest levels of perceived information exchange and collaborative problem solving, which lead to the highest ratings of innovation by team supervisors.",
               "The management of conflict may be another key factor (Chen, ). To the extent that conflict leads to more information sharing and task-relevant information elaboration ), conflict will facilitate creativity. To the extent that conflict reduces trust in other group members ) and reduces team members' perceptions of psychological safety, conflict will inhibit creativity."
          ],
          "paper_id": "23e12a20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Social influence, creativity and innovation"
     },
     {
          "head": {
               "text": "Emotionally supportive environments",
               "type": "modelling"
          },
          "paragraphs": [
               "Individuals are not likely to share diverse perspectives in an environment that is not psychological safe, thereby reducing group members' exposure to diverse viewpoints. Psychological safety ) allows group members freedom of expression and promotes risk taking, which in turn facilitate creativity. In a psychologically safe environment, participants will not be socially rejected. Baumeister and his colleagues found that social rejection: (1) inhibits self-regulatory functions, reducing one's ability to focus attention and persist in solving difficult tasks, (2) decreases sensitivity to physical and emotional pain, and (3) creates a need to restore social bonds, leading rejected people to rate strangers more positively and prefer group work more than people who have not been rejected . Therefore, socially rejected group members will be less likely to pay attention to the ideas of other group members and more likely to have difficulty staying focused to create new ideas and combine and improve on the ideas previously generated. In addition, their reduced sensitivity may make managing group conflict especially difficult. The rejected group members' propensity to restore social bonds may lead them to develop relationships with people outside the group, which could give other groups a competitive edge. Therefore, we predict that social rejection will inhibit creativity. Groups in which no one is rejected will be more creative.",
               "A team climate that encourages and supports creativity increases team performance and creativity under certain conditions ( . The supportive team environment increases creativity by increasing risk taking ) and by influencing mood . demonstrated that inducing positive mood in students increased their creative problem solving. In a recent field study, Amabile, analyzed daily diaries and selfrated mood and perceived creativity of employees in 26 different project teams in seven companies representing three different industries for the life of the project team. Analyses revealed a simple linear relationship between mood and creativity. The more positive a person's mood, the more creative they were. suggest that the positive mood facilitates ''cognitive variation.'' In a positive mood state individuals are more cognitively flexible; they include more exemplars in the same cognitive category, which can lead to novel associations. The cognitive variation is hypothesized to last even after the mood has changed. During this incubation period, novel, creative solutions continue to be devised. The creative solutions can increase positive mood and provoke reactions from others, which can lead to additional changes in mood.",
               "In a recent meta-analysis including over 100 independent samples examining mood and creativity, conclude that happiness facilitates creativity and fear impairs creativity. Sadness and relaxed mood states had no effect. They interpret their findings within a regulatory focus framework . Activating mood states associated with a promotion focus (e.g., happiness) promote creativity; however activating mood states associated with a prevention focus (e.g., fear) reduce creativity."
          ],
          "paper_id": "23e12a20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Social influence, creativity and innovation"
     },
     {
          "head": {
               "text": "Social comparison",
               "type": "modelling"
          },
          "paragraphs": [
               "When someone is exposed to diverse perspectives of other group members, there is an opportunity for social comparison processes. Sharing of ideas provides opportunities to compare the content, quality, and variety of one's ideas as well as the quantity. Brainstorming classically has focused on motivating a large number of ideas, with the presumption that this would increase the number of good ideas. The basic assumption of social comparison theory is that individuals will tend to move in the direction of the social comparison referent. That is, individuals should to some extent mimic the performance of their co-workers. We have in fact found this to be the case. Performance rates of individuals tend to become more similar over time or move in the direction of the social reference points provided (Roy, . However, if there were simply mimicking of mutually observed performances in groups, group performance should simply converge around the statistical average of the group. This would not explain why groups often show declines in performance or why they sometimes show enhanced performance. To explain these effects, we have invoked upward and downward comparison processes.",
               "In the social comparison literature there is much focus on the object of comparison. In the early models it was emphasized that there is a tendency to compare with those who are similar in opinions or values, but that there would be a tendency to compare upward in the case of abilities . We compare upward in regard to abilities, since slightly superior individuals are a natural reference point for where we might be able to move with some additional effort or training . However, the literature has also noted cases of downward comparison, particularly in situations where individuals need psychological reassurance or are insecure. So those who have been struck by some disaster or disease may focus on those who are still worse off in order to maintain some degree of positivity . In performance situations, individuals who are unsure of their ability or who are unmotivated may use low performers or achievers as a basis of reference . Consistent with this perspective, and have found that individuals in face-to-face brainstorming groups tend toward downward comparison, in that the low performer in the group tends to be more influential than high performers.",
               "Our social comparison perspective led us to do several studies to examine ways in which we could motivate higher performance in brainstorming groups. One obvious way would be to provide high reference points for group members. If group members are made aware that relevant comparison persons or groups have performed at a high level, this should motivate them to work harder to achieve a similar level of performance. found that providing groups with high comparison standards indeed led to a much higher level of performance. However, providing a similar standard for individuals had a similar effect. So motivating upward comparisons has similar positive effects for both individuals and groups, a finding wholly consistent with social comparison theory. A similar result was obtained in a study in which groups and individuals obtained feedback that their performance in a brainstorming session was poorer than that of students at a nearby college ). This motivated both groups and individuals to increase their performance in a subsequent session. Other studies have found that simply providing comparison information about the performance of others can stimulate increased performance , possibly because it increases a sense of competition.",
               "So far we have focused on the generation of number of ideas. However, the type of ideas expressed can also be influenced by social comparison. The type or category of ideas shared by one individual may lead another individual to focus on the same category and domain ). This would in turn cause groups to converge on similar idea categories and possibly be not as diverse in their range of ideas as individuals . This is of course exactly opposite to what one would expect, since groups should increase the diversity of ideas expressed because the collective knowledge range in groups should exceed that of individuals.",
               "The social comparison process is quite complex, with the degree and direction of comparison depending on a broad range of personal and interpersonal factors ). However, this literature suggests that upward comparison processes are most likely when individuals have some degree of self-confidence or expectation of success, and downward comparisons are more likely with low selfconfidence and low expectations. An interesting direction for future research would be the development of a broad-based social comparison perspective for group creativity that integrates the work in these two areas."
          ],
          "paper_id": "23e12a20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Social influence, creativity and innovation"
     },
     {
          "head": {
               "text": "APPLICATION",
               "type": "modelling"
          },
          "paragraphs": [
               "We have presented considerable evidence related to those factors that can enhance and inhibit creativity in groups and teams. There is the obvious question about applicability. Can these findings and the related theoretical ideas be applied in real-world contexts? Unfortunately there is little research in these kinds of situations that documents the applicability. For example, one study found that productivity loss and illusion of productivity occurred for employees of a company brainstorming about how to improve their company . We do not know of any other controlled studies of brainstorming in real-world situations. There are some studies of creativity in work teams, many of which focus on identifying team factors (e.g., or leadership behaviors (e.g., Amabile, ) that increase team members' perceptions that the work environment supports creativity. This research has led to rich models of creativity and innovation (e.g., ) and the creation of at least four valid instruments that measure the innovation or creative quality of the social environment of an organization ). Usually, creativity is not objectively measured and is assessed by the team members or their supervisors (e.g., ). The research performed with actual work teams heavily relies on the survey method and regression analyses to isolate important variables. Due to the fact that many of these variables are correlated and that random assignment of employees to teams is impractical, causal relationships cannot be determined. There is no experimental study performed in an organization that clearly demonstrates the effectiveness of face-to-face team collaboration for creativity and innovation relative to other types of interaction modalities (e.g., working alone and communicating with team members by means of computers and writing). Many studies in work teams have demonstrated the importance of many of the social influence factors we have cited as being important in group creativity, such as norms, goals, diversity, and leadership ), but few have examined the role of cognitive exchange processes.",
               "So what can we conclude? We believe it is premature to make strong conclusions at this point. Almost all of the research that has been done on group creativity has been done in controlled laboratory studies with college students, but there are those who have presented evidence that this type of research can be a strong basis for making predictions in real-world settings . This type of research provides insight into the critical processes and offers an efficient means of assessing theoretical perspectives. The group creativity literature has now provided strong evidence of the importance of a variety of factors in group creativity and theoretical models of the cognitive and social influence processes involved. These provide clear prescriptions for structuring groups for creative activities that have been outlined in some previous papers (e.g., ). For example, training groups to use effective strategies for ideation can increase the quality of ideas generated; providing challenging standards increases the number of ideas generated; brief breaks can increase the number of ideas; the use of writing or computer modalities can increase the effectiveness of group idea sharing; and private ideation sessions after group exchange sessions can allow individuals to reap additional benefits of group interaction.",
               "Although we feel that we have gained much knowledge on how to enhance group and organizational creativity, there remains much to be learned. Few studies have been done in actual organizations or teams. Few studies have examined the combination of various activities over time to determine the best arrangement. There are few studies of long-term groups (for exceptions see . Although the research we have cited has much relevance for organizational, scientific, and educational settings (e.g., , studies are needed in those settings to examine those implications."
          ],
          "paper_id": "23e12a20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Social influence, creativity and innovation"
     },
     {
          "head": {
               "text": "FUTURE DIRECTIONS FOR RESEARCH",
               "type": "modelling"
          },
          "paragraphs": [
               "Although we have made much progress in the past 15 years in the study of the social and cognitive influences in group creative process, there are many unresolved questions that should keep researchers busy for some time to come. Issues that need clarification are:",
               "Downloaded by [Auckland University of Technology] at 17:53 01 November 2015",
               "1. Can the techniques that have been shown to be effective in laboratory settings enhance creativity/innovation in other contexts? For example, will task decomposition, upward social comparison, and positive attitude toward diversity have positive effects on creativity in organizational settings? Is it possible to use the combination of the various techniques to produce ''super creative groups''? 2. What is the appropriate mix of intrinsic and extrinsic ''motivators''? How do they add or subtract from each other's impact? Are they differentially important in different phases of the process? For example, are extrinsic motivators needed in later phases of a creative process when the process of coming up with creative ideas or solutions is more difficult? 3. What is the appropriate balance of structure and freedom for the group creative process? Although freedom to express one's ideas and to experiment are important, it may also be important to have a structure that motivates periodic closure to the creative process to evaluate possible applications or alternatives. Moreover, some structure of the activities and tasks related to creative process may be useful. 4. How can we optimize the potential beneficial effects of conflict? Should conflict be avoided in the early phases of the group process until the group has developed some level of interpersonal trust? 5. How do cultural factors influence the impact of social factors on creativity? In cultures where individuals are relatively reserved in social settings and concerned with propriety, extrinsic motivators may be especially important. 6. What types of leadership styles/behaviors are optimal for creativity?",
               "Possibly the best leaders are ones who know how to vary structure and freedom appropriately in the various phases of the group creativity/ innovation process. 7. How will the impact of social influence factors vary at different phases of the group creative process (from fact finding to implementation)? Will apprehension have negative effects on both the generation and selection components of the process? Will extrinsic motivators have positive effects on all phases of the process? 8. How does the process in one phase of creative process influence the next phase? Will there be a carry-over of the motivational and cognitive stimulation across different phases? Will the ways ideas were generated (e.g., group or individual) affect the subsequent evaluation and innovation processes? What are the factors that influence the evaluation and innovation processes? 9. Do positive moods lead to increased cognitive variation in groups? Does the source of fear or happiness in groups (group context versus external factors) influence the effect of such moods on creativity? 10. What personal and group factors influence upward and downward comparison process in work groups? How will self-esteem, past group experience, and group diversity affect the tendency toward these different comparison processes? "
          ],
          "paper_id": "23e12a20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Social influence, creativity and innovation"
     }
]