[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Social network analysis (SNA) is not a formal theory in sociology but rather a strategy for investigating social structures. As it is an idea that can be applied in many fields, we study, in particular, its influence in the information sciences. Information scientists study publication, citation and co-citation networks, collaboration structures and other forms of social interaction networks. Moreover, the Internet represents a social network of an unprecedented scale. In all these studies social network analysis can successfully be applied. SNA is further related to recent theories concerning the free market economy, geography and transport networks. The growth of SNA is documented and a co-author network of SNA is drawn. Centrality measures of the SNA network are calculated. is one large network is not unrelated to this [2-4]. Social network theory directly influences the way researchers nowadays think and formulate ideas on the Web and other network structures, such as those shown in enterprise interactions [5]. Even within the field of sociology, network studies are becoming increasingly important. In this article we will study social network analysis (SNA) and show how this topic may be linked to the information sciences. Of course, Internet studies will also be mentioned, as the World Wide Web represents a social network of a scale unprecedented in history [5]. Interest in networks, and in particular in social network analysis, has only recently bloomed in sociology [6, 7]. There are, however, many related disciplines where networks play an important role. Examples are computer science and artificial intelligence (neural networks), recent theories concerning the Web and free market economy [8], geography and transport networks [9, 10]. In informetrics, researchers study citation networks, co-citation networks, collaboration structures and other forms of social interaction networks [11-19]. Underlying any concrete network lies a graph, a structure studied by mathematicians since Euler solved the problem of the K?nigsberg bridges."
          ],
          "paper_id": "23f72320-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "The effect of postings information on searching behaviour Social network analysis: a powerful strategy, also for the information sciences"
     },
     {
          "head": {
               "n": "2.",
               "text": "What is social network analysis?",
               "type": "abstract"
          },
          "paragraphs": [
               "Network studies is a topic that has gained increasing importance in recent years . The fact that the Internet Social network analysis, sometimes also referred to as 'structural analysis' , is not a formal theory, but rather a broad strategy for investigating social structures. The traditional individualistic social theory and data analysis considers individual actors making choices without taking the behaviour of others into consideration. This individualistic approach ignores the social context of the actor . One could say that properties of actors are the prime concern here. In SNA, however, the relationships between actors become the first priority, and individual properties are only secondary. Relational data are the focus of the investigations. It should be pointed out, however, that individual characteristics as well as relational links are necessary in order to fully understand social phenomena . Wetherell et al. describe SNA as follows:",
               "Most broadly, social network analysis (1) conceptualises social structure as a network with ties connecting members and channelling resources, (2) focuses on the characteristics of ties rather than on the characteristics of the individual members, and (3) views communities as 'personal communities', that is, as networks of individual relations that people foster, maintain, and use in the course of their daily lives.",
               "to node j. Node i is called the initial node of link e, i = init(e), and node j is called the final node of the link: j = fin(e). If the direction of a link is not important, or equivalently, if existence of a link between nodes i and j necessarily implies the existence of a link from j to i, we say that this network is an undirected graph. A path from node i to node j is a sequence of distinct links (i, u 1 ), (u 1 ,u 2 ), . . ., (u k ,j). The length of this path is the number of links (here k+1). In this article we only use undirected graphs. Consequently, the following definitions are only formulated for that case. A co-authorship network is an example of an undirected graph: if author A co-authored an article with author B, automatically author B co-authored an article with A. An undirected graph can be represented by a symmetrical matrix M = (m ij ), where m ij is equal to 1 if there is an edge between nodes i and j, and m ij is 0 if there is no direct link between nodes i and j.",
               "Another important aspect of SNA is the study of how structural regularities influence actors' behaviour. It is clear that ideas originating in SNA can offer added value to investigations in many disciplines, in particular those mentioned in the Introduction.",
               "One distinguishes two main forms of SNA: the ego network analysis, and the global network analysis. In 'ego' studies the network of one person is analysed. An example in the information sciences is White's description of the research network centred on Eugene Garfield . In global network analyses one tries to find all relations between the participants in the network.",
               "SNA, although considered here mainly within the field of sociology, is an interdisciplinary technique developed under many influences, the most important ones coming from mathematics and computer science. In sociology itself SNA can be described as originating from sociometrics (important names here are Lewin and Moreno), the Harvard School (with W. Lloyd Warner) and the Manchester anthropological school (with Barnes, Mitchell and Bott)."
          ],
          "paper_id": "23f72320-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "The effect of postings information on searching behaviour Social network analysis: a powerful strategy, also for the information sciences"
     },
     {
          "head": {
               "n": "3.2.",
               "text": "Components",
               "type": "abstract"
          },
          "paragraphs": [
               "A component of a graph is a subset with the characteristic that there is a path between any node and any other one of this subset. If the whole graph forms one component it is said to be totally connected.",
               "Next we define some indicators describing the structure (cohesion) of networks and the role played by particular nodes . Many more are described in the literature, but we will restrict ourselves to these elementary ones."
          ],
          "paper_id": "23f72320-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "The effect of postings information on searching behaviour Social network analysis: a powerful strategy, also for the information sciences"
     },
     {
          "head": {
               "n": "3.3.",
               "text": "Definition: density",
               "type": "modelling"
          },
          "paragraphs": [
               "The density is an indicator for the general level of connectedness of the graph. If every node is directly connected to every other node, we have a complete graph. The density of a graph is defined as the number of links divided by the number of vertices in a complete graph with the same number of nodes. For an undirected graph G with N nodes, the density D is defined as:",
               "3. Some notions from graph theory"
          ],
          "paper_id": "23f72320-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "The effect of postings information on searching behaviour Social network analysis: a powerful strategy, also for the information sciences"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "Directed and undirected graphs",
               "type": "modelling"
          },
          "paragraphs": [
               "A directed graph G, a digraph, consists of a set of nodes, denoted as N(G), and a set of links (also called arcs or edges), denoted as L(G). In this text the words 'network' and 'graph' are synonymous. In sociological research nodes are often referred to as 'actors'. A link e, is an ordered pair (i,j) representing a connection from node i",
               "The density is sometimes called the gamma index ."
          ],
          "paper_id": "23f72320-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "The effect of postings information on searching behaviour Social network analysis: a powerful strategy, also for the information sciences"
     },
     {
          "head": {
               "n": "3.4.",
               "text": "Definition: centrality [24, 25]",
               "type": "modelling"
          },
          "paragraphs": [
               "The most important centrality measures are: degree centrality, closeness centrality and betweenness centrality.",
               "Degree centrality of a node is defined as the number of ties this node has (in graph-theoretical terminology, the number of edges adjacent to this node). In mathematical terms degree centrality, d(i), of node i is defined as:",
               "between j and k. Betweenness gauges the extent to which a node facilitates the flow in the network. It can be shown that for an N-node network the maximum value for b(i) is (N 2 ?3N+2)/2. Hence the standardized betweenness centrality is:",
               "where m ij = 1 if there is a link between nodes i and j, and m ij = 0 if there is no such link. In a co-author graph the degree centrality of an actor is just the number of authors in the graph with whom she has co-authored at least one article. The degree centrality in an N-node network can be standardized by dividing by",
               "Closeness centrality of a node is equal to the total distance (in the graph) of this node from all other nodes. As a mathematical formula closeness centrality, c(i), of node i can be written as:",
               "Besides the Wiener index and the BRS compactness measure mentioned above, every centrality measure can be used to derive a centrality measure, C, for the whole network. This is done as follows:",
               "where d ij is the number of links in a shortest path from node i to node j. Closeness is an inverse measure of centrality in that a larger value indicates a less central actor while a smaller value indicates a more central actor. For this reason the standardized closeness is defined as c S (i) = (N-1)/c(i), making it again a direct measure of centrality. Individual closeness measures can be combined to define global measures, characterizing the cohesion of the total network. The best-known ones are the Wiener index and the BRS compactness .",
               "Finally, betweenness centrality may be defined loosely as the number of times a node needs a given node to reach another node. Stated otherwise, it is the number of shortest paths that pass through a given node. As a mathematical expression the betweenness centrality of node i, denoted as b(i) is obtained as:",
               "This formula can be applied for determining degree, closeness and betweenness centrality. The summation goes over all nodes of the network; C max is the largest value obtained in the network under study, and 'max value possible' refers to the maximum value possible for the numerator, given the total number of nodes. It can be shown that the total network C-measure is 1 for a star (one central point and all other nodes connected only to this central node)."
          ],
          "paper_id": "23f72320-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "The effect of postings information on searching behaviour Social network analysis: a powerful strategy, also for the information sciences"
     },
     {
          "head": {
               "n": "3.5.",
               "text": "Definition: cliques g jik",
               "type": "modelling"
          },
          "paragraphs": [
               "A clique in a graph is a subgraph in which any node is directly connected to any other node of the subgraph. and present a simple example of three networks and differences in their characteristics.",
               "The density index, D, indicates that the networks a, b and c (considered in this order) become increasingly dense. All centrality measures show that node u is the centre, and that the other nodes become increasingly central (that is to have a larger centrality value) when considering graphs a, b and c (in this order). The networks themselves, taken as a whole, show less and",
               "where g jk is the number of shortest paths from node j to node k (j, ki), and g jik is the number of shortest paths from node j to node k passing through node i. According to , the purpose is to provide a weighting system so that node i is given a full centrality point only when it lies along the only shortest path  Density and centrality measures for the networks of "
          ],
          "paper_id": "23f72320-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "The effect of postings information on searching behaviour Social network analysis: a powerful strategy, also for the information sciences"
     },
     {
          "head": {
               "n": "4.",
               "text": "The development and growth of social network analysis",
               "type": "modelling"
          },
          "paragraphs": [
               "It is often stated that SNA has recently experienced rapid growth, but this statement has rarely been proved. In order to corroborate the latter, three databases were consulted: CSA Sociological Abstracts Database (SA), Medline Advanced and PsycINFO. It is clear that the first one would have sufficed for the investigation, but it was interesting to find out whether related fields used this technique and, if so, whether a similar growth could be detected there. The yearly number of articles related to SNA was counted, as well as the number of subjects within the field that were discussed. For the latter aspect the subject headings of Sociological Abstracts were used (see Appendix, ).",
               "year were not yet complete. Hence these are also not shown in the graph. clearly shows the fast growth of the field in recent years. More specifically, the real growth began around 1981, and there is no sign of decline. This is most obvious in SA, but Medline Advanced also shows a modest increase. This proves that other fields, besides sociology, have used the term and the techniques.",
               "Next, quantification of this growth was attempted. A linear regression analysis was performed on the SA data. This led to the equation p(t) = ?20.74 + 5.958t",
               "(1) where time t = 1 in 1974 and p(t) denotes the number of published articles as a function of t. The correlation coefficient is 0.956, which is highly significant. An attempt to fit an exponential distribution yielded unsatisfactory results. From this it was concluded that the field has experienced a linear growth over the last 25 years. A similar fitting exercise on the Medline data resulted in the following regression line:"
          ],
          "paper_id": "23f72320-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "The effect of postings information on searching behaviour Social network analysis: a powerful strategy, also for the information sciences"
     },
     {
          "head": {
               "n": "4.1.",
               "text": "Growth in the number of published articles",
               "type": "modelling"
          },
          "paragraphs": [
               "Searching in SA (for the period 1963-2000) 1601 articles were retrieved having 'social network analysis' in the 'Subject heading' field. In Medline Advanced 308 articles were retrieved and in PsycINFO 105. The 1601 articles found in SA have publication dates between 1969 and 2000. There are, however, only two articles from the year 1969 and two from 1971. These are omitted from the graph . Similarly, when the search was performed (beginning 2001) data for the with a correlation coefficient of 0.927. The cumulative number of articles published in the field (SA data only) was next investigated, from the year 1974 on. This is illustrated in .",
               "Applying non-linear regression leads to the equation:",
               "where P(t) denotes the cumulative number of articles in the SA database, with t = 1 for the year 1974 (r 2 = 0.998).  Year of publication articles in Sociological Abstracts articles in Medline Advanced articles in PsycINFO Note that a linear equation for year-by-year data mathematically leads to a square law for cumulative data. Statistical fitting yields an exponent of 2.28 instead of the theoretically expected value of 2, a result that falls within our expectations. The sum of the results from the three databases shows that the development of SNA began later in the fields of medicine and psychology (the graphs split up only from 1984 on). This is no surprise as the method was developed in sociology (at least under that name), and only later adopted in other fields.",
               "The three graphs ) demonstrate the fact that it was only in the early 1980s that SNA started its career. The main reasons for this are the institutionalization of social network analysis since the late 1970s, and the availability of basic textbooks and computer software.",
               "The institutionalization of the field began with the foundation in 1978 by Barry Wellman of the International Network for Social Network Analysis (INSNA). This is the professional association for researchers interested in social network analysis. Its principal functions are the publication of the informal bulletin Connections, containing news, scholarly articles, technical columns, abstracts and book reviews; sponsoring the annual International Social Networks Conference (also known as Sunbelt) and maintaining electronic, web-based services for its members. The society also publishes, in association with Elsevier, the peer-reviewed international quarterly Social Networks.",
               "The    . The development of dedicated software also led to an increase in interest in the field and its methods. The best-known (and very user-friendly) program for the analysis of social networks is UCInet (a free evaluation version can be downloaded from www.analytictech. com/ucinet_5_description.htm). UCInet can easily be combined with Krackplot, a well-known program for drawing social maps. Other examples of computer programs for social network analysis are Gradap, Multinet, Negopy and Pajek."
          ],
          "paper_id": "23f72320-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "The effect of postings information on searching behaviour Social network analysis: a powerful strategy, also for the information sciences"
     },
     {
          "head": {
               "n": "4.2.",
               "text": "Articles dealing with social network analysis and relationships with other subjects",
               "type": "modelling"
          },
          "paragraphs": [
               "It is to be expected that growth in the number of studied subjects follows the growth in the number of articles on social network analysis. In order to study this the following method was applied based on the subject classification scheme of Sociological Abstracts. This scheme divides the field of sociology into 33 subjects, each subdivided into a variable number of subfields (see Appendix, ). Social network analysis is a subfield under the main heading 'Complex Organization'. Articles may be assigned to different subject headings. Most articles found under the heading SNA are also classified under other headings. The fact that an article is classified with the code for social network analysis (0665) and one or more other codes indicates that the author of that article has either discussed relationships between SNA and that other subfield, has applied SNA together with techniques from that other subfield, or has applied SNA in that other subfield.",
               "From 1984 on (for each year) the total number of different subfield codes that were assigned together with the code 0665 for SNA were counted. shows the linear best-fitting function of the number of additional (i.e. together with 0665) codes (Pearson correlation coefficient = 0.89). Further, a striking change was observed in the subjects studied using SNA, or related to it: in the early 1990s most articles dealt with family and socialization, while at the end of E. OTTE AND R. ROUSSEAU this period the SNA articles mostly dealt with the sociology of health and medicine. Indeed, social network analysis is now often applied in AIDS and drug abuse studies."
          ],
          "paper_id": "23f72320-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "The effect of postings information on searching behaviour Social network analysis: a powerful strategy, also for the information sciences"
     },
     {
          "head": {
               "n": "5.",
               "text": "An SNA co-authorship network",
               "type": "modelling"
          },
          "paragraphs": [
               "In this section a network analysis was performed of authors in the field of social network analysis. The central players are pointed out as are the underlying collaborative relationships between authors. Coauthorship, a (strong) form of collaboration, is not the only way to describe relationships between scientific authors. Citation network, for instance, could reveal other relationships, but these are not studied in this article.",
               "In the 1601 articles dealing with SNA there were 133 authors occurring three times or more. Forming an undirected co-authorship graph (of these 133 authors) led to a big connected component of 57 authors, two components of four authors, two components of three authors, seven small components consisting of two authors and 48 singletons. The central cluster of 57 authors will be concentrated on. Most important scientists in the field belong to this cluster. There are, however, exceptions, the most notable one being Ronald S. Burt (University of Chicago), who has 17 articles in the Sociological Abstracts database. As these articles are either written as a single author or with authors who have only one article in the database, they were excluded. Presumably these collaborators were students.",
               "Network analysis was performed using UCInet while the map was drawn with Pajek (Package for Large Network Analysis). shows the network of network analysts.",
               "Density. The density is an indicator for the level of connectedness of a network. It is given as the number of lines in a graph divided by the maximum number of lines (the case where every author is connected to every other one). Hence it is a relative measure with values between 0 and 1. The density for the central network of network analysts is 0.05, so this network is clearly not dense at all, but very loose.",
               "Degree centrality. Degree centrality is equal to the number of connections that an actor (a node) has with other actors. In this network being a central author means that this scientist has collaborated (in the sense of co-authored) with many colleagues. The author with the highest degree centrality is Barry Wellman (University of Toronto), who has a degree centrality of 9. The degree centrality of the whole network is 11%, indicating that many authors are not connected.",
               "Closeness. Another way of studying centrality is using the closeness indicator. This indicator is more general than the previous one, because it takes the structural position of actors in the whole network into account. A high closeness for an actor means that he or she is related to all others through a small number of paths. The most central author in this sense is Patrick Doreian (University of Pittsburgh). The closeness of the whole network is 14%.",
               "Betweenness. This measure is based on the number of shortest paths passing through an actor. Actors with a high betweenness play the role of connecting different groups, as 'middlemen'. Again Patrick Doreian has the highest betweenness. The betweenness of the whole network is 47%.",
               "Cliques. UCInet found 16 cliques, meaning 16 subgraphs consisting of three or more nodes. The largest one consists of six authors: Bernard, Johnsen, Killworth, McCarthy, Shelley and Robinson. The second largest one consists of the five authors: Erger, Lovaglia, Markovsky, Skvoretz and Willer."
          ],
          "paper_id": "23f72320-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "The effect of postings information on searching behaviour Social network analysis: a powerful strategy, also for the information sciences"
     },
     {
          "head": {
               "n": "6.",
               "text": "A bibliometric analysis of the SNA database",
               "type": "modelling"
          },
          "paragraphs": [
               "Barry Wellman is the most prolific author in the field of social network analysis, based on the Sociological Abstracts database. He published 31 articles in the investigated period (21 as first author). shows the most prolific authors (using total counts) in the field of SNA. More details can be found in Otte .",
               "The author publication frequencies can easily be described by a Lotka distribution, which is a power  law. Using the software program available in the journal Cybermetrics , it was found that:",
               "where f(y) denotes the relative number of authors with y publications. According to the Kolmogorov-Smirnov statistic the fit is excellent (D max = 0.009). Counting only first authors (see Appendix, , for data) the following frequency distribution was obtained:",
               "where, now, f (y) denotes the relative number of authors with y first authorships, y >0. Again the fit is excellent (the Kolmogorov-Smirnov D max = 0.004). For the role of Lotka's law in informetrics the reader is referred to Wilson's review article.",
               "As it is the thesis of this article that network analysis is a field equally important to sociology as to the information sciences, the database LISA was consulted in order to find out whether the top scientists in SNA had also published in journals covered by this library and information science database. It turned out that, of the 47 most prolific SNA authors (that is those who wrote at least six articles), 12 had articles in LISA (not necessarily as first author). Articles were published in Most prolific authors in SNA structure in the graph. They were, moreover, especially important for the information transfer and exchange within the graph. These 'middlemen', however, were very often not represented in first author relationships.",
               "In his thesis Pritchard investigated the question whether it is possible to classify information transfer networks on the basis of their topological structure. In his work he noted the close relationship between transport geography and information transfer, and made successful use of graph-theoretic measures. Applications were given for five citation networks: four patent networks and a comprehensive bibliography on bibliometrics. It was found that the bibliometrics network and the patent networks had different patterns.",
               "Martinsons et al. have recently shown that the field of strategic management has entered the mainstream of social science. They studied the network of journals in the field, using an asymmetric theory (journal-to-journal citations are not symmetric), where the notions of feeder and receiver journals are central.",
               "Network sociologists Haythornthwaite and Wellman used a social network approach in their JASIS article studying how work and friendship ties in a university research group were related to the kind of media used for information exchange. They found that face-to-face means of communication were preferred, supplemented primarily by e-mail. Further, those persons who had the most frequent contacts used more different media. In a somewhat similar vein, Kretschmer studied the structure of interpersonal relationships based on co-authorships . She found an increasing social distance with declining similarity (as measured by co-authorships) expressed succinctly as 'birds of a feather flock together'. tion scientists are becoming interested in the Internet (under the names webometrics, cybermetrics), it is clear that social network analysis will find more and more of a place in the information sciences. A perusal of Manfred Kochen's book The Small World clearly shows that more than 10 years ago he was already fully aware of the importance of network theory for sociology as well as for the information sciences. Finally, in conclusion, the relationship between networks, percolation theory and the 'informetric laws' is pointed out ."
          ],
          "paper_id": "23f72320-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "The effect of postings information on searching behaviour Social network analysis: a powerful strategy, also for the information sciences"
     }
]