[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Uncovering community structures of a complex network can help us to understand how the network functions. Over the past few decades, network community detection has attracted growing research interest from many fields. Many community detection methods have been developed. Network community structure detection can be modelled as optimisation problems. Due to their inherent complexity, these problems often cannot be well solved by traditional optimisation methods. For this reason, evolutionary algorithms have been adopted as a major tool for dealing with community detection problems. This paper presents a survey on evolutionary algorithms for network community detection. The evolutionary algorithms in this survey cover both single objective and multiobjective optimisations. The network models involve weighted/unweighted, signed/unsigned, overlapping/non-overlapping and static/dynamic ones.. His current research interests are in the area of computational intelligence and complex network analysis. Lijia Ma received his BS in Communication Engineering from His research interests include evolutionary multiobjective optimisation, data mining and complex network analysis. Maoguo Gong received his BS in Electronic Engineering and PhD in Electronic Science and Technology from Xidian University, Xi'an, China, in 2003 and 2009, respectively. He is currently a Full Professor with the Key Laboratory of Intelligent Perception and Image Understanding of the Ministry of Education, Xidian University. His research interests are broadly in the area of computational intelligence with applications. He has published over 100 research papers in journals and conferences, and holds 12 granted patents as the first inventor. A survey on network community detection based on evolutionary computation 85 Dayong Tian received his BS of Electronic Information Science and Techonology and ME of Circuit and System in Xidian University, Xi'an, China. Currently, he is a PhD student in Biomedical Engneering in University of Technology, Sydney, Australia. His research interests are machine learning theory and applications in face image restoration, recognition and image retrieval."
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "1",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "With the development of science and technology, diverse kinds of networks such as the the computer network, the power system network, the social media network and the biological network, have emerged and are changing our daily life . Network becomes the engine of scientific research activities in the 21st century, and the active topic across disciplines. Many real-world networks are rather complex, characterised by big data volume, dynamics, interactivity and heterogeneity. Network analysis provides an effective tool to probe networks' potential properties such as the small-world property ( , the scale-free property , and improve our understanding of the complex world. In recent years, another outstanding property of networks, i.e., the community structure ( ), has become a hot research topic. Community detection is one of the theoretical underpinnings of network science, social science, physical science, biological science, and so forth. Several surveys on community detection in networks can be found in , , and .",
               "Community detection sheds light on the functionalities of complex networks. Thus far, a large number of community detection methods have been proposed in the literature. However, it is very hard to give a definite classification for the existing avenues. Amongst the existing methods, one category is based on the evolutionary algorithms (EAs). EAs are a class of artificial intelligent optimisation metaheuristics inspired by principles from biology, ethology, etc. These metaheuristics are notable for their good local learning and global searching abilities and have been developed for successfully solving a wide range of optimisation problems. The EAs based community mining methods can automatically determine the clusters of the complex networks which makes it very convenient for practical applications. The essence of the EAs based community detection methods is to first model the network community detection task as different optimisation problems and then design suitable metaheuristics to deal with them. One of the landmark contributions is the work done by . Strictly speaking, the method used in that work is not a metaheuristic, but the stopping criterion, i.e., modularity, first put forward in his early work in , is by far the most used and best known quality function and has rapidly become an essential element of many optimisation metaheuristics based community detection methods. Metaheuristics have found wide applications to solve diverse kinds of complex optimisation problems in many realms. Four recent surveys on optimisation metaheuristics can be found in Reyes- , , , , , , , , Boussa?d .",
               "The focus of the recent survey on network community detection in primarily deals with methods from the scope of physics and EAs have not been taken into account. Although in recent years many EAs have been devised to solve the community detection problem, there is seldom literature that give a macroscopic view on these methods and this is the very motivation for this survey. Thus, the purpose of this paper is to survey the EAs based community detection methods. These methods can be divided into two categories, the single objective optimisation based and the multiobjective optimisation based. Since most if not all of the EAs have similar workflow, this survey lays more emphasis on the algorithm components designing and the optimisation models construction.",
               "The rest of this paper is organised as follows. Section 2 gives some related backgrounds including the fundamentals of network and network community detection. Section 3 depicts some common characters of EAs and briefly illustrates evolutionary multiobjective optimisation. Section 4 exhausts the fitness functions that are to be optimised by the available EAs based community detection methods. Section 5 illustrates the general operators designing of EAs for community detection, including the individual representation scheme, recombination and local search strategy. Section 6 lists some useful resources for network community detection. The conclusions are finally summarised in Section 7."
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "2.1",
               "text": "Graph-based network notation",
               "type": "modelling"
          },
          "paragraphs": [
               "In order to better analyse a complex network, one direct way is to represent a network with a graph denoted as G = {V, E}, where V representing the network objects is the aggregation of vertices, and E representing the relations between the objects is the aggregation of edges. Graph G can be denoted by an adjacency matrix A whose element a ij is defined as:",
               "where L < i, j > represents the link between node i and j andij denotes the weight of L < i, j >.",
               "In the field of social science, the networks that include both positive and negative edges are called signed social networks or signed networks for short. In signed networks, the so called positive links (L + ) denote positive relationships such as friendship, common interests, and negative links (L ? ) may denote negative relationships such as hostility, different interests, and so forth. A signed graph is normally denoted as G = {V, P E, NE}, where P E and NE represent the aggregations of positive and negative edges, respectively, and the element a ij of the corresponding adjacency matrix A is defined as:",
               "? ? S is a community in a weak sense if ",
               "Matrix A is symmetric with the diagonal elements 0, but, if the corresponding network is directed, like the e-mail network, A is asymmetric."
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "2.2",
               "text": "Network community detection",
               "type": "modelling"
          },
          "paragraphs": [
               "Network community detection plays an important role in the networked data mining field. Community detection helps to discover latent patterns in networked data and it affects the ultimate knowledge presentation .",
               "As illustrated above, a complex network can be expressed with a graph that is composed of nodes and edges. The task for network community detection is to separate the whole network into small parts which are also called communities. There is no uniform definition for community in the literature, but in academic domain, a community, also called a cluster or a module, is normally regarded as a groups of vertices which probably share common properties and/or play similar roles within the graph. exhibits the community detection problem under different network scenarios.",
               "From the figure we can notice that community detection under dynamic context is quite different from the others. In a dynamic network, the community structure is temporally changed. How to design algorithms to uncover time-varying communities is challenging.",
               "The above community definition only fits for unsigned networks. In the authors give a definition under signed context. Given a signed network modelled as G = (V, P E, N E), where P E and N E are the set of positive and negative links, respectively. Given that S ? G is a subgraph, let (k",
               "LijN E |A ij | be the positive and negative internal degree of node i, respectively. Then S is a community in a strong sense if",
               "In order to formalise the qualitative community in unsigned network, gave a definition based on node degree. Given a network represented as G = (V, E), where V is the set of nodes and E is the set of edges. Let k i be the degree (the number of links that have connections with node i) of node i and A be the adjacency matrix of G.",
               "Given that S ? G is a subgraph, let k be the negative and positive external degree of node i, respectively. Then S is a community in a weak sense if",
               "S A ij be the internal and external degree of node i, then S is a community in a strong sense if",
               "The above definitions only give the conditions that a community should satisfy, but they have not told how good on earth a community is. Therefore, there should have quantitative indexes that can measure the quality of a community. These indexes will be illustrated in Section 4."
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "3.1",
               "text": "General characters of EAs",
               "type": "modelling"
          },
          "paragraphs": [
               "EAs are originated from the evolution principles and behaviour of living things and have been recognised as effective approaches for solving many NP-Hard optimisation problems. Most if not all of the EAs share the following commom properties:",
               "1 They are population based stochastic searching methods. A population consists of a set of individuals, each individual represents a solution to the optimisation problem. An EA optimises the problem by having a population of initialised solutions and then apply stochastic components to generate new solutions in the decision space.",
               "EAs are effective tools for solving optimisation problems. However, in reality, many optimisation problems involve multiple objectives, i.e., there are more than one objectives to be optimised. For the community detection problems, it is natural to separately model the inter-community and the intra-community properties as two different optimisation objectives. So it is necessary to give a brief introduction to multiobjective optimisation. A multiobjective optimisation problem can be mathematically formulated as :",
               "2 They are recursively iterative methods. These methods iteratively search for optimal solutions in the search space. The search process will not stop untill the maximum iteration number or a prescribed threshold is reached.",
               "3 They have some inherent parameters, like the population size and the maximum iteration number, etc. These parameters are normally set empirically.",
               "which subjects to x = (",
               "Where x is called the decision vector, andis the feasible region in decision space. The objectives in equation often conflict with each other. Improvement of one objective may lead to deterioration of another. Thus, a single solution, which can optimise all objectives simultaneously, does not exist. For multi-objective optimisation problems, the aim is to find good compromises (trade-offs) which are also called Pareto optimal solutions. The Pareto optimality concept was first proposed by . To understand the concept, here are some related definitions."
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "4",
               "text": "Fitness function",
               "type": "modelling"
          },
          "paragraphs": [
               "In the literature, many community evaluation criteria have been proposed and quantities of methods that combine either single objective or multiobjective EAs with community detection have emerged. Most if not all of these methods share the common feature that they model the community detection problem as different optimisation problems and then design different metaheuristics to solve them. This section is dedicated to summarising the fitness functions that are to be optimised by metaheuristics.",
               "to maximise Q is proved to be NP-hard ( ). Second, large Q value does not always make sense. Random networks with no community structures can also possess high Q values ( ). Third, which is also the most important, Q has the resolution limitation ( , i.e., maximising Q cannot discover communities whose sizes are smaller than a scale which depends on the total size of the network and on the degree of inter connectedness of the modules, even in the case scenario where modules are unambiguously defined.",
               "To overcome these demerits, many researchers have devoted themselves to designing efficient operators for the optimisation algorithms to enhance the exploration and exploitation; some scholars make efforts to design new evaluation criteria, such as extended modularity ), multi-resolution index ( , and so forth. Because Q is originally designed for unsigned, unweighted, undirected, nonoverlapped and static networks, thus, many creative jobs have been done to extend Q to handle other types of networks. presented a reformulation of Q that allows the analysis of weighted, signed, and netwoks that have self-loops. The presented Q is formulised as:",
               "where w ij is the weight of the signed adjacency matrix, w"
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "4.1.1",
               "text": "Modularity-based model",
               "type": "modelling"
          },
          "paragraphs": [
               "The most popular evaluation criterion for community detection is the modularity (normally denoted as Q) proposed by . The modularity index can be given in the following form:",
               "i ) denotes the sum of all positive (negative) weights of node i. Based on the Q sw metric, the authors in Cai et al. (2014c) suggested a discrete particle swarm optimisation (DPSO) algorithm to detect communities from signed networks.",
               "Q sw can be easily changed to handle directed, weighted graphs ( , and the expression of directed and weighted Q reads:",
               "i,j",
               "w where n and m are the number of nodes and edges of a network, respectively.(i, j) = 1, if node i and j are in the same group, otherwise, 0. By assumption, higher values of Q indicate better partitions. Q is very popular, a lof of bio-inspired metaheuristics have been utilised to optimise Q to find the community structure with biggest Q value ( ). However, Q has several drawbacks. First, where w out i (w in i ) denotes the out-degrees (in-degrees) of node i. It can be noticed that the factor 2 is removed because the sum of the in-degrees (outdegrees), the number of non-vanishing elements of the asymmetric adjacency matrix, all equal w.",
               "In the case when a node may belong to more than one community, Q has been modified to fit overlapping communities ( , and a general expression reads:",
               "where",
               "is a fuzzy parition of the nodes of the network into k clusters.",
               "where V c is the set of vertices in community c,",
               "The CS metric takes one parameter r which is hard to tune. The author claims that higher values of the exponent r bias the CS towards matrices containing a low number of zeroes, i.e., higher values of r help in detecting communities. put forward the modularity density (D) index. D can break the resolution limitation brought by Q. For an unsigned network, let us define",
               "where S a = ? ? S a . Then D is defined as: The existing overlapping community detection methods can be roughly divided into two categories, the node-based (directly cluster nodes) and the link-based (cluster links and then map link communities to node communities) ones, but the the mainstream for single solution based overlapping community detection is to first utilise soft clustering technique such as fuzzy K-means to find a fuzzy partition of the nodes of a network into k clusters, and then apply a criterion to choose the best overlapping network partition ( ). The key technique lies in the evaluation of an overlapped community. As long as an evaluation criterion is decided, bio-inspired metaheuristics can be easily utilised to solve this problem ). For more information about the fitness evaluation for overlapping communities, please refer to Chira and Gog (2011) and .",
               "Other extended criteria such as the local modularity can be found in Massen and and , the triangle modularity in and the bipartite modularity in .",
               "where[0, 1] is a resolution control parameter. Dcan be viewed as a combination of the ratio association and the ratio cut ( ). Generally, optimise the ratio association algorithm often divides a network into small communities, while optimise the ratio cut often divides a network into large communities. By tuning thevalue, we can use this general function to uncover more detailed and hierarchical organisation of a complex network. Based on modularity density, many algorithms have emerged "
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "4.1.2",
               "text": "Multi-resolution model",
               "type": "modelling"
          },
          "paragraphs": [
               "To overcome the resolution limitation of modularity, many multi-resolution models have been developed. Pizzuti (2008) proposed a genetic algorithm for community detection. The highlight of the work is the suggested community score (CS) evaluation metric. Let",
               "be the fraction of edges connecting node i to the other nodes in S and M (S) = Many real-world optimisation problems involve multiple objectives. From the statement of the community detection problem discussed earlier we can notice that, community detection can also be modelled as multiobjective optimisation problems. Many multiobjective optimisation based community detection methods have been developed in this respect. Each run of these methods can yield a set of community partitions for the decision maker to choose. The most important point for these methods should own to their abilities for breaking through the resolution limit of modularity. As stated earlier, components used in single objective optimisation models, such as the individual representation, recombination, etc., serve multiobjective optimisation models as well. This subsection primarily deals with the multiobjective community detection models.",
               "be the power mean of S of order r. |S| is the cardinality of S, i.e., the number of nodes in S. We further define v S ="
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "4.2.1",
               "text": "General model",
               "type": "modelling"
          },
          "paragraphs": [
               "be the volume of S, i.e., the number of edges connecting vertices inside S, then the score of S is defined as score(S) = M (S)v S . Assume that G has a partition of k subgraphs, i.e., ? = {S 1 , S 2 , ..., S k }, then CS can be written as:",
               "As stated earlier, for an unsigned network, the links within a community should be dense while the links between communities should be sparse, as for a signed network, the inter and intra links should all be dense. On the basis of this property, many multiobjective community models are established.",
               "Pizzuti and proposed a multiobjective genetic algorithm-based method called MOGA-Net. In this method, the author modelled the community detection task as a multiobjective optimisation problem and then applied the fast elitist non-dominated sorting genetic algorithm (NSGA-II) ) framework to solve it. The two objectives introduced are the CS and the CF. Thus, the proposed optimisation model is:"
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "4.2.2",
               "text": "Signed model",
               "type": "modelling"
          },
          "paragraphs": [
               "Many social networks involve friendly and hostile relations between the objects that compose the networks. These networks are called signed networks. In the authors put forward a novel discrete multiobjective PSO framework for community detection. To handle signed networks, the authors have suggested a signed optimisation model which optimises two objectives named as signed ratio association (SRA) and signed ratio cut (SRC). The optimisation model reads:",
               "kCF (community fitness) is a criterion put forward by . CF is formulated as:",
               "From the formulation of CF and CS we may notice that, CF to some extent measures the link density within communities, while CS can be regarded as an index to measure the averaged degrees within communities. An improved version of MOGA-Net can be found in . To optimise the above model, other metaheuristics, such as the multi-objective enhanced firefly algorithm ( , hybrid EA based on harmony search algorithm (HSA, ) and chaotic local search (CLS) ), non-dominated neighbour immune algorithm ( ), have all find their niche in community detection.",
               "In paper ( ) the authors presented a multiobjective evolutionary algorithm based on decomposition (MOEA/D) based method. MOEA/D is proposed by . The highlight of this work is the newly cranked out multiobjective community optimisation model which optimises two objectives termed as NRA (negative ratio association) and ratio cut (RC). The optimisation model is:",
               "where",
               "To minimise SRA and SRC we can make sure that the positive links within a community are dense while the negative links between communities are also dense, which is in accordance with the feature of signed community.",
               "In Amelio and Pizzuti (2013) the authors put forward another signed optimisation model which uses the NSGA-II framework to optimise it. The model reads:",
               "where ). The first objective Q sw measures how good a signed community is and to minimise f rustration we will ensure that the sum of the negative links within a community and the positive links between difference communities are minimum.",
               "Recently, to detect communities from signed networks, the authors in put forward a signed optimisation model based on node similarity. The optimisation model is as follows:",
               "It can be noticed that equation is the decomposition of equation . RC measures the link density between two communities and RA calculates the link density within a community. To minimise NRA and RC we can ensure that the connections within a community is dense and the links between communities are sparse. A similar optimisation model can be found in . Other optimisation models such as maximising the combinations of Q and CS can be found in Agrawal (2011), and maximising the two parts of the Q index, i.e., Q is decomposed into two objectives, can be found in . A three objectives model can be found in . Small surveys on the selection of objective functions in multiobjective community detection can be found in .",
               "where P "
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "4.2.3",
               "text": "Overlapping model",
               "type": "modelling"
          },
          "paragraphs": [
               "In real world, a node of a network may belong to more than one community, just like the friendship network. From the perspective of finding overlapping communities, intuitively, the nodes that connect multiple communities with similar strength are more likely to be overlapping nodes. For instance, if node i has both l links with community a and b, then we can regard i as an overlapping node. From the viewpoint of finding nonoverlapping or separated communities, the less the number of overlapping nodes, the more the separated communities.",
               "Based on the above principle, the authors in put forward a three objectives optimisation model reads:",
               "network, respectively, C is a confusion matrix, C ij equals to the number of nodes shared in common by community i in partition A and by community j in partition B. Then N M I(A, B) is written as:",
               "where k s i denotes the number of edges connect node i and community s, V overlap is the set of the overlapping nodes. To maximise f 2 and f 3 one can get a tradeoff between nonoverlapping and overlapping communities.",
               "where C A (or C B ) is the number of clusters in partition A(or B), C i. (or C .j ) is the sum of elements of C in row i( or column j). N M I(A, B) = 1 means that A and B are identical and N M I(A, B) = 0 indicates that A and B are completely different.",
               "The first objective in equation is the snapshot cost which measures how well a community structure A is at time t and the second objective is the temporal cost which measures how similar the community structure B is at time t + 1 with the previous community structure A.",
               "Another dynamical model which maximises the Min-max cut and global silhouette index can be found in ."
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "4.2.4",
               "text": "Dynamical model",
               "type": "modelling"
          },
          "paragraphs": [
               "In reality, networks may evolve with the time, the nodes and the links may disappear or new nodes may just come out, therefore, the community structures are also changing according to the time. However, traditional approaches mostly focuse on static networks for small groups. As the technologies move forward, in the presence of big data, how to design methods and tools for modelling and analysing big dynamic networks is a challenging research topic in the years to come. To analyse the community structures of dynamical networks will help to predict the change tendency which may give support to the analysis of other network or networked scientific issues. Community detection in dynamic networks is challenging.",
               "Dynamic community detection is normally based on a temporal smoothness framework which assumes that the variants of community division in a short time period are not desirable ( ). According to the temporal smoothness framework, the community detection in dynamic networks can be naturally modelled as a bi-objective optimisation problem. The optimisation of one objective is to reveal a community structure with high quality at this moment, and the optimisation of the other objective is to uncover a community structure at the next moment which is highly similar with that at the previous time ). The commonly used dynamical optimisation model can be written as:"
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "4.3",
               "text": "Model selection",
               "type": "modelling"
          },
          "paragraphs": [
               "It should be pointed out that multiobjective optimisation returns a set of equally good solutions. Each solution is a tradeoff between the objective functions.",
               "For the multiobjective community detection problem, each Pareto-optimal solution represents a network partition which provides great convenience to analyse the structures of a network at different hierarchical levels. However, it is usually required that there exist a criterion so as to automatically select one solution with respect to another.",
               "For the community detection problem, to this end, the modularity index seems to be the most used model selection mechanism. That is to say, choose the very solution from the PF that has the biggest modularity value. If this very solution is more than one (since different network partitions may have the same modularity value), then we use the D, the CF , the CS, etc., indexes as the secondary selection standard. Some other selection models can be found in ."
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "5",
               "text": "Operator designing",
               "type": "modelling"
          },
          "paragraphs": [
               "The above section exhausts the fitness functions that are to be optimised by EAs based community detection methods. This section is devoted to summarising the fundamental operators designing of these methods."
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "5.1",
               "text": "Individual representation",
               "type": "modelling"
          },
          "paragraphs": [
               "NMI, normalised mutual information ( ), comes from the field of information theory. NMI can be regarded as a similarity index. For the community detection problem, given that A and B are two partitions of a Individual representation bridges the gap between metaheuristics and optimisation problems. For the community detection problem, an individual represents a network partition. In the existing research findings, there are two representative individual representation schemas: the locus-based and the string-based. clearly shows the principles of the two schemas. Note: The position of node 3 is selected to carry out the operation.",
               "(a) Note: The position of node 3 is selected to carry out the operation.",
               "It can be seen from the above figure, locus-based coding scheme takes the advantage of network linkage relations, but the corresponding diversity promotion strategies such as the crossover and mutation operations are hard to design. By constrast, the string-based schema is easier to code and decode and it can provide great convenience to the diversity promotion strategies. It should be pointed out that when initialising individuals, one may make full use of network prior knowledge to speed the convergence."
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "5.2",
               "text": "Individual reproduction",
               "type": "modelling"
          },
          "paragraphs": [
               "Whatever kind of individual representation schema we use, our goal is to handle network problems using optimisation metaheuristics. As regard the optimisation metaheuristics, one key factor is the reproduction operation. Reproduction acts as the backbone for preserving population diversity. Generally, different representation schema could lead to different designing of the individual reproduction operators. However, it is strongly recommended that network priori knowledge should be utilised to design efficient individual reproduction operators. With regard to the reproduction, the crossover and mutation operations are two widely used mechanisms to generate offsprings. In the following we will take the string-based individual representation schema as an example to show the crossover and the mutation operations for the community detection problem. give examples of the two-way crossover and the one-point mutation operators, respectively.",
               "Given that x a = (5, 3, 5, 7, 2, 5, 3) and x b = (2, 6, 6, 5, 6, 3, 2) are two individuals. Here we take the position of node 3 as an example. The two-way crossover operation works in the following way: first we determine the 3rd element of x a , i.e., 5; afterward we find out all the positions in x a that have the value 5, these positions are the 1st, 3rd and 6th; then we change the 1st, 3rd and 6th elements of x b into 5, and an offspring x c = (5, 6, 5, 5, 6, 5, 2) is generated. The changes to x a work in the same way, and an offspring x d = (5, 6, 6, 7, 6, 5, 3) is generated. For the one-point mutation operation, we randomly change the element of the permutation in the 3rd position as shown in .",
               "The two-way crossover and the one-point mutation operators shown above are very representative for the community detection problem. Many approaches either adopt these methods or just make some minor changes to them. For different types of networks, these two mechanisms may also be redesigned due to the specific network properties, but the main idea is the same, i.e., recombine two individuals and/or modify some information of an individual so as to produce new solutions."
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "5.3",
               "text": "Individual local search",
               "type": "modelling"
          },
          "paragraphs": [
               "Since metaheuristics are stochastic approaches, they cannot ensure global convergence. Hence, much creative effort has been done to enhance the search abilities of the heuristics based community detection methods, and amongst which, the designing of local search operators has gained much attention.",
               "The local search operator aims to search for promising region around a given solution. In the authors have designed a hill climbing based local search mechanism illustrated in . Graphical illustration of the hill climbing based local search strategy (see online version for colours)"
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "6",
               "text": "Network relevant resource",
               "type": "modelling"
          },
          "paragraphs": [
               "For the network community detection problem, one may need some instances for testing purpose. Also, one may need to visualise maybe the topology or the dynamic changes of a particular network. Besides, one may need to compare with some state-of-the-art community detection methods. Based on such considerations, several useful websites are listed as follows:",
               "? http://www-personal.umich.edu/?mejn/ (mark Newman website)"
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "paragraphs": [
               "? http://deim.urv.cat/?aarenas/data/welcome.htm (Alex Arenas website)",
               "? http://snap.stanford.edu/index.html (Stanford network analysis project. Diverse kinds of network data and graphical visualisation softwares and tools and useful codes are available)",
               "? http://www.correlatesofwar.org/ (the correlates of war project, a large amount of signed networks mainly related to war are free to access)",
               "It can be seen from the figure that the hill climbing based local search is actually a greedy algorithm since each step of the operator assigns a node to the very community that can generate biggest fitness increment. It should be pointed out that the fitness increment may be negative. The authors argue that to accept this kind of deteriorate solution with certain probability may assist exploitation. Based on this idea, they suggested a simulated annealing ) based local search in . However, for a real-life network, the number of communities may be very big, thus, the local search operators in are time consuming and can hardly be applied to real applications. To save the complexity, in they put forward a new local search which is based on the common phenomenon that two objects with no connections are less likely to be in the same community. Therefore, the key component of the newly suggested local search assign a node to one of the neighbour communities (communities that the neighbour nodes belong to) that can bring about largest fitness increment.",
               "For a big network, an optimisation metaheuristic based community detection method is actually facing a large scale global optimisation (LSGO) problem. To further enhance the search ability, multi-level learning strategies have been invented. In the authors have put forward a three-level learning based Memetic algorithm for community detection. The proposed three-level learning strategy takes the advantages of label propagation ) and BGLL ( ) to design local search.",
               "One point we should keep in mind is that, different networks have different properties, and only by taking advantages of these properties can we design metaheuristics with high efficiency.",
               "? http://www.gmw.rug.nl/?huisman/sna/software.ht ml (a collection of softwares for social network analysis)",
               "? http://tuvalu.santafe.edu/?aaronc/hierarchy/ (hierarchical random graphs)",
               "? "
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 18,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     },
     {
          "head": {
               "n": "7",
               "text": "Concluding remarks",
               "type": "modelling"
          },
          "paragraphs": [
               "Network analysis is one of the theoretical underpinnings of social computing and big data. The network community detection serves as the backbone of network analysis. The past decades have witnessed the prosperity of the research on community detection. This paper tries to survey the community detection based on EAs. The main idea of these methods is the same, i.e., they model the community detection as either a single objective or a multiobjective optimisation problem and then design optimisation metaheuristics to solve it. In this survey, the constructed optimisation models and the key components of these methods are exhausted.",
               "Although a lot of EAs have been successfully developed to mine the community structures in complex networks, according to the no free lunch (NFL) theory , there is no one-for-all method that can deal with all kinds of networks. Different networks have different space-time properties. When designing algorithms to solve community detection problem, one should take into account the special characters of the networks. In addition, one thing should be kept in mind that due to the huge volume of data set, metaheuristics based community detection is an LSGO problem. LSGO problems refer to optimisation problems that involve a large number of decision variables. LSGO challenges existing optimisation techniques. Researches on scaling up EAs to solve LSGO problems have attracted much attention ( . For the LSGO community detection problem, in the presence of big data, how to design fast and effective algorithms is worth thinking.",
               "We expect that complex network analysis's scope will continue to expand and its applications to multiply. We are positive that methods and theories that work for community detection are helpful for other network issues such as link prediction, network recommender, network robustness, network resource allocation, anomaly detection, network core detection, network ranking, network compression, network security, network sentiment computing, and so forth. From both theoretical and technological perspectives, network community detection technology will move beyond network structure analysis toward emphasising network intelligence. We do hope that this survey can benefit scholars who set foot in this field. Our future work will focus on more in-depth analysis of network issues. Such analysis is expected to shed light on how networks change the real world."
          ],
          "paper_id": "24035820-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 19,
          "fromPaper": "A survey on network community detection based on evolutionary computation"
     }
]