[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "We consider the budget allocation problem over bipartite influence model proposed by Alon et al. (Alon et al., 2012). This problem can be viewed as the well-known influence maximiza-tion problem with budget constraints. We first show that this problem and its much more general form fall into a general setting; namely the monotone submodular function max-imization over integer lattice subject to a knapsack constraint. Our framework includes Alon et al.'s model, even with a competitor and with cost. We then give a (1 ? 1/e)-approximation algorithm for this more general problem. Furthermore, when influence probabilities are nonincreasing, we obtain a faster (1 ? 1/e)-approximation algorithm, which runs essentially in linear time in the number of nodes. This allows us to implement our algorithm up to almost 10M edges (indeed, our experiments tell us that we can implement our algorithm up to 1 billion edges. It would approximately take us only 500 seconds.). marketing, which is a cost-effective marketing strategy that promotes products by giving \"free\" or \"discounted\" items to a selected group of highly influential individuals, in the hope that through the word-of-mouth effects, a large number of product adoption will occur. In the same papers , Domingos and Richardson (Domingos & Richardson, 2001; Richardson & Domingos, 2002) considered the following problem: Suppose we have data on a social network , with estimates for the extent to which individuals influence one another, and we would like to market a new product that hopefully will be adopted by a large fraction of the network. How should we choose a few \"influential\" members of the network that can \"trigger\" a cascade of in-fluence? This problem, called influence maximization, is to find a small set of the most influential individuals (which is sometimes called a seed node set) in a social network so that their aggregated influence in the network is maximized. The seminal work by Kempe, Kleinberg and Tar-dos (Kempe et al., 2003) provides the first systematic study of influence maximization as a combinatorial optimization problem. The influence maximization problem further motivated the research community to conduct extensive studies on various aspects of the influence maximization problems (e.g., (Chen et al., 2010; 2009))."
          ],
          "paper_id": "24102960-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Optimal Budget Allocation: Theoretical Guarantee and Efficient Algorithm Naonori Kakimura Ken-ichi Kawarabayashi"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Domingos and Richardson ; ) introduced viral Previous work mentioned so far has only focused on the selection of a subset of influencing seeds. But there is one more important factor we have to consider in the context of an algorithmic marketing approach; namely Budgets. Certainly one of the major decisions in a marketing plan deals with the allocation of a given budget among media channels such as TV, newspaper, and webs, in order to maximize the impact on a set of potential customers. This prompts ) to consider the following influence maximization problem with budget constraints (which is called a (source-node) bipartite influence model). First, we may model as a bipartite graph in which one side is the set of possible marketing channels, and the other is the population of customers. An edge between a channel i and a customer j indicates that i may influence j with some probability that depends on the budget allocated to i. Formally, the model consists of a bipartite graph G = (S, T ; E), where S and T are collections of source nodes and target nodes, respectively, and E ? ST is an edge set. Each source node s has a capacity c(s)Z + and probabilities p",
               "where BZ + denotes a total budget capacity. If a source node s is allocated a budget of b(s), the node s makes b(s) independent trials to activate each neighboring target node t. The probability that t is activated by s in the ith trial is p",
               "A set function f is monotone if f (X)f (Y ) for all X, Y with X ? Y . Submodularity often arises in analyzing influence maximization in a social network (e.g., ), and guarantees why a greedy algorithm finds a nearly optimal solution ( . In the budget allocation problem, one may select a node multiple times, and hence the objective function is not a set function. As suggested by Alon et al., however, their algorithm is similar to the one for maximizing a monotone submodular set function subject to a knapsack constraint ), and hence it seems to us that submodularity can explain the problem setting.",
               "s . That is, the probability that t becomes active is",
               "3. Extending the framework. The budget allocation problem needs to be extended to adopt more complicated real settings. Alon et al. only considered the case when cost to allocate a budget is the same for all sources. Since each media channel such as TV, newspaper, and webs has different scales, it would be more natural to consider different costs for each channel. Moreover, a market may often have a competitor against us, and we have to change our allocation according to the competitor's decision.",
               "where(t) denotes the set of source nodes that is adjacent to t. The objective of this model is to distribute the budget among the source nodes respecting the capacities of nodes, and to maximize the expected number of target nodes that become active. We call this problem the budget allocation problem over bipartite influence model."
          ],
          "paper_id": "24102960-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Optimal Budget Allocation: Theoretical Guarantee and Efficient Algorithm Naonori Kakimura Ken-ichi Kawarabayashi"
     },
     {
          "head": {
               "text": "Our Contribution",
               "type": "introduction"
          },
          "paragraphs": [
               "Alon et al. ( ) devised a (1 ? 1/e)-approximation algorithm for this problem. Here, for a positive number1, an-approximation algorithm is one returning a feasible solution whose value is at leasttimes the optimal value. Their algorithm is essentially greedy with some preprocess (i.e., enumerating all the possible allocations with only three source nodes). The algorithm motivates us to consider the following issues.",
               "1. The scalability. Their algorithm adapts a greedy procedure. Therefore, the time complexity is expensive, because in each iteration, the greedy procedure searches all the nodes in the graph as a potential candidate for the next seed node. As a result, the algorithm entails at least quadratic number of steps in terms of the number of nodes. In fact, not only due to this issue, but also due to the expensive preprocess, their algorithm would not work for more than 5K edges, say .",
               "In this paper, we clarify all the issues above. Let us first consider the second and the third issues. To deal with choosing a node multiple times in the model, we extend a set function to a function over the integer lattice, i.e., the set of the integer vectors in the Euclidean space. We define a submodular function over integer lattice, that is, a function f satisfying f (",
               "for all integer vectors x and y, where xy and xy denote the coordinate-wise maxima and minima, respectively. This definition generalizes submodularity of a set function, because if we restrict the domain to the unit hypercube then the submodularity can be identified with one for a set function. Note that a function f over integer lattice is usually supposed to be given as an evaluation oracle, a black box that computes f (x) for any integer vector x.",
               "2. Submodularity. For a finite set S, we say that a set function f : 2 SR is submodular if it satisfies A submodular set function has been studied extensively in combinatorial optimization. There are combinatorial polynomial-time algorithms for minimizing a submodular set function (see ) for details). It is known in ) that these minimization algorithms can cope with submodular functions over integer lattice if bounded, which can be identified with a ring family on some ground set with pseudo-polynomial size, and hence the minimization problem can be solved in pseudopolynomial time. On the other hand, maximizing a submodular function over integer lattice has been done for only special classes with applications to multi-unit combinato-rial auctions .",
               "Having defined submodular functions over integer lattice, our main theoretical contributions in this paper are the following.",
               "? We introduce a general framework using a submodular function over integer lattice. We consider the problem of maximizing a monotone submodular function subject to a knapsack constraint, which is a natural extension of maximizing a submodular set function with constraints ( ).",
               "the previous iterations. Then this algorithm exploits submodularity of influence spread function to reduce the number of Monte-Carlo simulations. Empirical results show 700 times faster than the original greedy algorithm, however it still takes a few hours to compute a solution for graphs with tens of thousands of vertices. Subsequently, various heuristics ( ) have been proposed to avoid using Monte-Carlo simulations, however, these algorithms do not guarantee any theoretical guarantee. Recently, a theoretically fast algorithm is proposed by ).",
               "We then devise a (1 ? 1/e)-approximation algorithm for this problem. Since the budget allocation problem is shown to fall into the problem, this gives a solution of the second issue.",
               "? We show that our framework includes more generalized models in which the source costs are nonuniform and there is a competitor. Our first result implies that the model can also be solved in polynomial time within (1 ? 1/e) approximation factor. The result can be compared to some results in algorithmic game theory ( .",
               "In this paper, we deal with the budget allocation problem with nonincreasing influence probabilities. Let us observe that this problem setting often appears in the real world. Indeed, the impact of advertisement is supposed to be nonincreasing. Using the submodularity of the budget allocation problem, we obtain a faster (1 ? 1/e)-approximation algorithm, which runs essentially in linear time in the number of nodes. This allows us to implement our algorithm up to almost 10M edges (indeed, our experiments tell us that we can implement our algorithm up to 1 billion edges. It would approximately take us only 500 seconds.). As far as we are aware, this is perhaps the first case that the greedy (1 ? 1/e)-approximation algorithm for the submodularity scales up to this large size.",
               "In the competitor model, we aim at allocating our budget against a competitor's allocation, which is known in advance. Such a situation is practical when we consider advertising (i.e., imagine television commercial messages. Companies can prepare their strategies based on competitors' information). This competitor model also considers the case when the competitor spreads information in advance (i.e., the competitor spreads the information even before we start spreading our information). This means that we can take \"start-up delay\" against the competitor into account.",
               "The rest of the paper is organized as follows. In Section 2, we design a (1 ? 1/e)-approximation algorithm for the monotone submodular function maximization over integer lattice subject to a knapsack constraint. In Section 3, we apply it to the budget allocation problems and other problems. Section 4 describes faster algorithms for the budget allocation problem assuming that influence probabilities are nonincreasing. Numerical experiments are presented in Section 5. Finally, Section 6 concludes the paper.",
               "It should be noted that our submodular framework admits a potential applicability to other problems than the budget allocation problem. In fact, classical combinatorial optimization problems such as the maximum coverage and facility location can be naturally generalized to our framework over integer lattice. Such problems can be applied to text summarization and sensor placement in machine learning. These applications will be discussed in Section 3.3."
          ],
          "paper_id": "24102960-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Optimal Budget Allocation: Theoretical Guarantee and Efficient Algorithm Naonori Kakimura Ken-ichi Kawarabayashi"
     },
     {
          "head": {
               "n": "2.",
               "text": "Submodular Maximization over Integer Lattice subject to Knapsack Constraint",
               "type": "introduction"
          },
          "paragraphs": [
               "Let us now consider the first issue. Relatively little work has been done on improving the quadratic nature of the greedy algorithm, even for the influence maximization problem without the budget constraint. Perhaps the most notable work is ( , where submodularity is exploited to develop an efficient heuristic algorithm, based on \"lazy-forward\" optimization in selecting seeds. The idea is that the marginal gain of a node in the current iteration cannot be much better than its marginal gain in Let S be a finite set. We say that a function f over integer lattice is submodular if it satisfies",
               "for all x and y, where xy and xy denote the coordinate-wise maxima and minima, respectively, i.e.,",
               "for all x and y with xy. We assume that f (0) = 0 without loss of generality.",
               "Let cZ S + , wR S + and B be a nonnegative integer. Consider the problem to find bZ S + maximizing a monotone submodular function f subject to 0bc and",
               "We call this problem the monotone submodular function maximization over integer lattice subject to a knapsack constraint. We may assume without loss of generality that w(s) > 0 for each s in S."
          ],
          "paper_id": "24102960-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Optimal Budget Allocation: Theoretical Guarantee and Efficient Algorithm Naonori Kakimura Ken-ichi Kawarabayashi"
     },
     {
          "head": {
               "text": "10:",
               "type": "introduction"
          },
          "paragraphs": [
               "end if 11: end while It is well-known that for a set function f , submodularity is equivalent to the diminishing marginal return property, i.e., f (X{s})?f (X)f (Y{s})?f (Y ) for all X ? Y ? S and sY . However, submodularity over integer lattice does not imply the diminishing marginal return property:",
               "for arbitrary b and sS. On the other hand, a weaker version of this inequality does hold, whose proof can be found in the extended version of this paper ( ). Lemma 2.2. Let f be a monotone submodular function over integer lattice. For arbitrary sS, kZ + , x and y with xy, we have",
               "Let us leave some remarks on our algorithm. Although the worst case complexity of our algorithm is quite expensive, Algorithm 1 can be accelerated using a \"lazy evaluation\" technique given in , and thus it runs more efficiently in practice. Also, there is another approach to reduce the time complexity at the expense of a good approximation ratio. We can apply ideas similar to those for maximizing a submodular set function to make practical simpler algorithms with somewhat worse approximation factors . For example, as in (Alon et al., 2012), if we enumerate solutions with only one positive support before performing GREEDYPROCEDURE, then we can find a 1/2(1 ? 1/e)-approximate solution in",
               "The (positive) support of b, denoted by supp + (b), is the set of elements s in S such that b(s) > 0. Lemma 2.3. Let f be a submodular function. For arbitrary x and y, we have"
          ],
          "paper_id": "24102960-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Optimal Budget Allocation: Theoretical Guarantee and Efficient Algorithm Naonori Kakimura Ken-ichi Kawarabayashi"
     },
     {
          "head": {
               "n": "3.2.",
               "text": "Budget Allocation Problem with a Competitor",
               "type": "introduction"
          },
          "paragraphs": [
               "Theorem 2.4. For the submodular function maximization over integer lattice, if f admits the diminishing marginal return property and w is uniform, then we can find a (1 ? 1/e)-approximate solution in O(B|S|) time."
          ],
          "paper_id": "24102960-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Optimal Budget Allocation: Theoretical Guarantee and Efficient Algorithm Naonori Kakimura Ken-ichi Kawarabayashi"
     },
     {
          "head": {
               "n": "3.",
               "text": "Applications of Submodular Maximization",
               "type": "introduction"
          },
          "paragraphs": [
               "In this section, we focus on the budget allocation problem (as defined in Section 1), and we show that more generalized models fall into our framework. We also mention applications to other problems such as text summarization and sensor placement in Section 3.3.",
               "We extend the budget allocation problem with nonuniform costs to the two-player case. In the model, there is a competitor against an advertiser. The competitor allocates his/her budget to S in advance, and will try to influence target nodes at the same time as the advertiser's trials. Under this situation, the advertiser aims at allocating a budget to source nodes to maximize the expected number of target nodes influenced by his/her trials. We suppose that the trials of the two players are made in a discrete time step: At each time step i, first the competitor makes the ith trial, and then the advertiser makes the ith trial. The trials will be repeated until both budget allocations run out."
          ],
          "paper_id": "24102960-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Optimal Budget Allocation: Theoretical Guarantee and Efficient Algorithm Naonori Kakimura Ken-ichi Kawarabayashi"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "Budget Allocation Problem with Nonuniform Costs",
               "type": "introduction"
          },
          "paragraphs": [
               "We extend to the bipartite influence model with nonuniform costs. That is, in addition to an instance of the budget allocation problem, each source node s has a cost w(s) > 0.",
               "The objective is to distribute the budget respecting the capacities of nodes and sS w(s)b(s)B such that the expected number of activated nodes is maximized. We call this problem the budget allocation problem over bipartite influence model with nonuniform costs.",
               "Thus each target node t of T has the following three states: inactive, positively active (influenced by an advertiser), and negatively active (influenced by a competitor). Since an advertiser is a follower, we assume that it has a chance to activate positively both an inactive node and a negatively activated node. Note that when a node is already influenced by the competitor, the probability to activate it should be smaller than one to activate an inactive node. In contrast, we suppose that the competitor can activate an inactive node, but not a positively active node. Thus the model is progressive with respect to positively active nodes.",
               "More specifically, the model is defined as follows. For a bipartite graph G = (S, T ; E), an advertiser is given a capacity c(s), a cost w(s) and two probabilities p In the model, the probability that t becomes active is equal to (1). Let f t be a function of an allocation vector b defined as (1). We note that we define f t (b) = ?if b does not satisfy 0bc. It is easy to see that the function f t is monotone for each tT . In addition, the following lemma asserts that f t is submodular. In addition, a competitor has already allocated his budget to source nodes, which is denoted by?bby?by?b(s) for each source node sS. The competitor also has probabilities?pprobabilities? probabilities?p (i) Lemma 3.1. For any tT , the function f t is submodular. s for i = 1, . . . , ? b(s) for each s in S. The probability that t is activated by s in the ith trial depends on the status of t as follows. If t is inactive, then the probabilities that t is positively/negatively activated are p ",
               "is supermodular. Let:= g t (xy),:= g t (x)/and:= g t (y)/. We can easily check that,,[0, 1] and g t (xy) =¦. Then we obtain g t (xy)",
               "s , respectively. If t is already negatively active, then the probability that t is positively activated is q (i) s . In this setting, we aim at maximizing the expected number of positively active nodes. For tT and k with 1k1 + max sS?bsS?sS?b(s), let E t,k be the event that t becomes negatively active in the kth trial (when k = 1 + max sʦ(t) ? b(s), E t,k means the event that t never become negatively active). Conditioned on E t,k , the probability that t becomes positively active is",
               "Since the expected number of activated nodes for an allocation b is equal to f (b) := tT f t (b), the expected number is also submodular as a function of b. The fol-",
               "The probability that t becomes positively active equals kt,k f t,k (b), wheret,k := Pr(E t,k ). Therefore, the expected number of positively active nodes, denoted by f (b), is equal to tice. Thus a (1 ? 1/e)-approximate solution can be found in polynomial time by tT kt,k f t,k (b). Similarly to Lemma 3.1, f t,k is shown to be monotone and submodular for any t and k. Since f is a nonnegative linear combination of f t,k 's, f is also monotone and submodular. Thus this problem can be reduced to the monotone submodular function maximization over integer lattice.",
               "Theorem 3.3. For the budget allocation problem with a competitor, the objective function is monotone and submodular. Thus we can find a (1 ? 1/e)-approximate solution in polynomial time."
          ],
          "paper_id": "24102960-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Optimal Budget Allocation: Theoretical Guarantee and Efficient Algorithm Naonori Kakimura Ken-ichi Kawarabayashi"
     },
     {
          "head": {
               "n": "3.3.",
               "text": "Other Applications",
               "type": "introduction"
          },
          "paragraphs": [
               "Sensor Placement In a standard sensor placement scenario, we can put at most one sensor in each spot to maximize the area covered by sensors. Here we can consider a more general problem where to place sensors with some specified power in a field subject to budget constraint, where the area covered by a sensor depends on its power setting. This problem is almost equivalent to the maximum coverage problem with multiple choices as discussed before, and hence we can apply our approximation algorithm for the problem. A similar sensor placement problem where we can put two kinds of sensors in each spot is studied in .",
               "In this section, we present applications of our framework to problems other than the budget allocation problems. Submodular set functions arise in several applications (see, e.g., ). Such applications can naturaly be extended to our framework allowing multiple choices.",
               "Maximum Coverage Let us first see that our framework includes a generalization of the well-known maximum coverage problem. In the maximum coverage problem, we are given a finite set V and a family of subsets C 1 , . . . , C m in V , and the objective is to choose k subsets from C 1 , . . . , C m so that the number of the covered elements in V is maximized. Here consider covering functions p j : Z +2 V (j = 1, . . . , m), each of which is monotone, and we would like to maximize the number of the elements covered by p j 's, i.e., |m j=1 p j (b j )|, subject to m j=1 b jk. Note that the covering function p j corresponds to the situation where choosing j multiple times makes the covered set larger. This problem clearly generalizes the maximum coverage problem, that corresponds to the case when we can only choose each p j at most once. It is not difficult to see that the objective function is a monotone submodular function over integer lattice, and therefore a (1 ? 1/e)-approximate solution can be found in polynomial time by Theorem 2.1."
          ],
          "paper_id": "24102960-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Optimal Budget Allocation: Theoretical Guarantee and Efficient Algorithm Naonori Kakimura Ken-ichi Kawarabayashi"
     },
     {
          "head": {
               "text": "Text Summarization",
               "type": "introduction"
          },
          "paragraphs": [
               "The objective of text summarization is to find a small set of words that summarizes the feature of a given text as well as possible. Recently, it is shown that a variety of objective functions used in summarization admits submodularity and that submodular-based approaches outperform in practice ( . For example, in the concept-based summarization ), we are to find a subset S of sentences maximizing the total credit of concepts covered by S, i.e., maximize iʦ(S) c i , where(S) is the set of the concepts covered by S and c iR + is the credit of a concept i. Indeed, this objective function is submodular. We now extend the submodular summarization model to the one that incorporates \"confidence\" of sentences, i.e., we can choose a sentence in various confidence level like \"low\", \"mid\" or \"high\" rather than just choose or not. As in the maximum coverage, let us introduce a monotone covering function p j for each sentence j. Then the objective function of the extended model is defined to be the total credit f (b) = c i , where the sum is taken over concept i covered byj p j (b j ). Again, this objective function is a monotone submodular function over integer lattice, and hence we can use our approximation algorithm for the extended model."
          ],
          "paper_id": "24102960-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Optimal Budget Allocation: Theoretical Guarantee and Efficient Algorithm Naonori Kakimura Ken-ichi Kawarabayashi"
     },
     {
          "head": {
               "text": "Facility Location",
               "type": "introduction"
          },
          "paragraphs": [
               "We are given a set V of facilities, and we aim at deciding how large facilities are opened up in order to serve a set of m customers, where we represent scale of facilities as integers 0, 1, . . . , c (\"0\" means we do not open a facility). If we open up a facility j of scale b j , then it provides service of value p i,j (b j ) to customer i, where p i,j : Z +R (j = 1, . . . , m) is a given monotone function. We suppose that each customer chooses the opened facility with highest value. That is, when we assign b j to each facility j, the total value provided to all customers is given by f (b) = m i=1 max jS p i,j (b j ). It turns out f is monotone and submodular over integer lat-"
          ],
          "paper_id": "24102960-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Optimal Budget Allocation: Theoretical Guarantee and Efficient Algorithm Naonori Kakimura Ken-ichi Kawarabayashi"
     },
     {
          "head": {
               "n": "5.",
               "text": "Experiments",
               "type": "experiment"
          },
          "paragraphs": [
               "We now verify our theoretical results by implementing Algorithm 2 for the budget allocation problem over bipartite influence model with nonincreasing influence probabilities.",
               "To demonstrate that the greedy choice indeed performs"
          ],
          "paper_id": "24102960-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Optimal Budget Allocation: Theoretical Guarantee and Efficient Algorithm Naonori Kakimura Ken-ichi Kawarabayashi"
     },
     {
          "head": {
               "text": "Figures 1 and 2 are our simulation results on Yahoo! Search",
               "type": "experiment"
          },
          "paragraphs": [
               "Marketing Advertiser Bidding Data (Yah). It is a bipartite graph between 1,000 search keywords and 10,475 accounts, where each edge represents one \"bid\" to advertisement on the keyword. Note that this data originally does not represent influence relationship, but it encodes the information \"who is interested in what\" relationship in the real world. The motivation of the experiment is to find a good choice of \"what\" set that maximizes the influenced \"who\"s, that is, a set of keywords that is maximally associated to advertisers. This would be useful for the publisher to promote keywords to advertisers. For the purpose, we only use the graph, although the original data contains bid prices or time data. The graph has 52,567 edges (representing 'who bid at least once to what' relation Degree-prob Degree Random 0 0 100 200 300 400 500 600 700 800 900 1000 Influenced nodes: f (b) 0 100 200 300 400 500 600 700 800 900 1000 sX, where X is a random value between 0 and 1, generated for each i and s. show the results on P = 1 and P = 0.1 cases.",
               "In order to implement our algorithms for larger scale graphs, we have also run our experiments on artificially generated graphs. are simulation results on synthesized graphs with |S| = 200, 000 and |T | = 2, 000, 000 nodes with around 8, 000, 000 edges between them. The graphs are generated so that the degree distribution of the source nodes obey the power law of= 2.0. After assigning the degrees to each source node s, it is connected to deg(s) nodes uniformly chosen from T . Allocation of 1, 000 budgets in the greedy algorithm took 3.36 seconds (including the graph generation time) in average on a machine with Xeon E5-2690 2.9GHz CPU and 64GB memory.",
               "performed degree-based strategies. \"Degree-prob\" also showed a comparable result on the synthesized graphs. Interestingly, the \"greedy-unaware\" strategy in the competitive setting, which is to allocate budgets greedily without taking the existence of the competitor into account at all, is showing a very close performance to the competitor-aware one. This may be explained as follows; except for the extreme situation that p (i) (i) s is very high and q s is very low, a highly influential set of source nodes would be taken by the advertiser, even after some part of it is grabbed by the competitor."
          ],
          "paper_id": "24102960-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Optimal Budget Allocation: Theoretical Guarantee and Efficient Algorithm Naonori Kakimura Ken-ichi Kawarabayashi"
     },
     {
          "head": {
               "n": "6.",
               "text": "Conclusion",
               "type": "conclusion"
          },
          "paragraphs": [
               "We have also implemented the algorithm when a competitor exists. We have started with the situation that the competitor already allocated 100 budgets by the \"degree\" strategy. The probability q In this paper, we have defined a submodular function over integer lattice, extending a submodular set function, and introduced the problem of maximizing a monotone submodular function subject to knapsack constraint. This problem includes the budget allocation problem ( ) and more general budget allocation problems with nonuniform costs and a competitor. Also, this problem has applications to sensor placement and text summarization. We have devised a (1 ? 1/e)-approximation polynomial-time algorithm for the problem. In addition, based on the diminishing marginal return property, we have devised a faster algorithm for the budget allocation problem under some natural scenario, and have carried out numerical experiments.",
               "In all the configurations, the greedy algorithm out-"
          ],
          "paper_id": "24102960-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Optimal Budget Allocation: Theoretical Guarantee and Efficient Algorithm Naonori Kakimura Ken-ichi Kawarabayashi"
     }
]