[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Learning in multiagent systems suffers from the fact that both the state and the action space scale exponentially with the number of agents. In this paper we are interested in using Q-learning to learn the coordinated actions of a group of cooperative agents, using a sparse representation of the joint state-action space of the agents. We first examine a compact representation in which the agents need to explicitly coordinate their actions only in a predefined set of states. Next, we use a coordination-graph approach in which we represent the Q-values by value rules that specify the coordination dependencies of the agents at particular states. We show how Q-learning can be efficiently applied to learn a coordinated policy for the agents in the above framework. We demonstrate the proposed method on the predator-prey domain, and we compare it with other related multiagent Q-learning methods. in uncertain environments. In principle, it is possible to treat a multiagent system as a 'big' single agent and learn the optimal joint policy using standard single-agent reinforcement learning techniques. However, both the state and action space scale exponentially with the number of agents, rendering this approach infeasible for most problems. Alternatively, we can let each agent learn its policy independently of the other agents, but then the transition model depends on the policy of the other learning agents, which may result in oscillatory behavior. On the other hand, in many problems the agents only need to coordinate their actions in few states (e.g., two cleaning robots that want to clean the same room), while in the rest of the states the agents can act independently. Even if these 'coordinated' states are known in advance, it is not a priori clear how the agents can learn to act cooperatively in these states. In this paper we describe a multiagent Q-learning technique , called Sparse Cooperative Q-learning, that allows a group of agents to learn how to jointly solve a task when the global coordination requirements of the system (but not the particular action choices of the agents) are known beforehand."
          ],
          "paper_id": "2416b910-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Sparse Cooperative Q-learning"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "A multiagent system (MAS) consists of a group of agents that can potentially interact with each other . In this paper, we are interested in fully cooperative multiagent systems in which the agents have to learn to optimize a global performance measure. One of the key problems in such systems is the problem of coordination: how to ensure that the individual decisions of the agents result in jointly optimal decisions for the group.",
               "We first examine a compact representation in which the agents learn to take joint actions in a predefined set of states. In all other (uncoordinated) states, we let the agents learn independently. Then we generalize this approach by using a context-specific coordination graph ( ) to specify the coordination dependencies of subsets of agents according to the current context (dynamically). The proposed framework allows for a sparse representation of the joint state-action space of the agents, resulting in large computational savings.",
               "Reinforcement learning (RL) techniques ) have been applied successfully in many single-agent systems for learning the policy of an agent"
          ],
          "paper_id": "2416b910-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Sparse Cooperative Q-learning"
     },
     {
          "head": {
               "n": "2.",
               "text": "MDPs and Q-learning",
               "type": "introduction"
          },
          "paragraphs": [
               "In this section, we review the Markov Decision Process (MDP) framework. An observable MDP is a tuple A, T, R where S is a finite set of world states, A is a set of actions, T : SAS[0, 1] is the Markovian transition function that describes the probability p(s|s, a) of ending up in state swhen performing action a in state s, and R : SAIR is a reward function that returns the reward R(s, a) obtained after taking action a in state s. An agent's policy is defined as a mapping: SA. The objective is to find an optimal policy* that maximizes the expected discounted future reward",
               "averages over reward and stochastic transitions and[0, 1) is the discount factor. We can also represent this using Q-values which store the expected discounted future reward for each state s and possible action a:",
               "and R i : SAIR is the reward function that returns the reward R i (s, a) for agent i after the joint action a is taken in state s. As global reward function R(s, a) = n i=1 R i (s, a) we take the sum of all individual rewards received by the n agents. This framework differs from a stochastic game in that each agent wants to maximize social welfare (sum of all payoffs) instead of its own payoff.",
               "Within this framework different choices can be made which affect the problem description and possible solution concepts, e.g., whether the agents are allowed to communicate, whether they observe the selected joint action, whether they perceive the individual rewards of the other agents, etc. In our case we assume that the agents are allowed to communicate and thus are able to share individual actions and rewards. Before we discuss our approach, we first describe two other learning methods for environments with multiple agents."
          ],
          "paper_id": "2416b910-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Sparse Cooperative Q-learning"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "MDP Learners",
               "type": "introduction"
          },
          "paragraphs": [
               "The optimal policy for a state s is the action arg max a Q * (s, a) that maximizes the expected future discounted reward.",
               "Reinforcement learning (RL) can be applied to estimate Q * (s, a). Q-learning is a widely used learning method when the transition and reward model are unavailable. This method starts with an initial estimate Q(s, a) for each state-action pair. When an exploration action a is taken in state s, reward R(s, a) is received and next state sis observed, the corresponding Q-value is updated by",
               "(2) where(0, 1) is an appropriate learning rate. Under conditions, Q-learning is known to converge to the optimal Q * (s, a) .",
               "In principle, a collaborative multiagent MDP can be regarded as one large single agent in which each joint action is represented as a single action. The optimal Q-values for the joint actions can then be learned using standard single-agent Q-learning. In order to apply this MDP learners approach a central controller models the complete MDP and communicates to each agent its individual action, or all agents model the complete MDP separately and select the individual action that corresponds to their own identity. In the latter case, no communication is needed between the agents but they all have to observe the joint action and all individual rewards. Moreover, the problem of exploration can be solved by using the same random number generator (and the same seed) for all agents . Although this approach leads to the optimal solution, it is infeasible for problems with many agents since the joint action space, which is exponential in the number of agents, becomes intractable."
          ],
          "paper_id": "2416b910-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Sparse Cooperative Q-learning"
     },
     {
          "head": {
               "n": "3.2.",
               "text": "Independent Learners",
               "type": "introduction"
          },
          "paragraphs": [
               "The framework discussed in the previous section only involves single agents. In this work, we are interested in systems in which multiple agents, each with their own set of actions, have to collaboratively solve a task. A collaborative multiagent MDP (Guestrin, 2003) extends the single agent MDP framework to include multiple agents whose joint action impacts the state transition and the received reward. Now, the transition model T : SAS[0, 1] represents the probability p(s|s, a) the system will move from state s to safter performing the joint action aA =At the other extreme, we have the independent learners (IL) approach ) in which the agents ignore the actions and rewards of the other agents in the system, and learn their strategies independently. The standard convergence proof for Qlearning does not hold in this case, since the transition model depends on the unknown policy of the other learning agents. Despite the lack of guaranteed convergence, this method has been applied successfully in multiple cases .",
               "In many problems, agents only have to coordinate their actions in a specific context ). For example, two cleaning robots only have to take care that they do not obstruct each other when they are cleaning the same room. When they work in two different rooms, they can work independently.",
               "In this section, we describe a reinforcement learning method which explicitly models these types of contextspecific coordination requirements. The main idea is to learn joint action values only in those states where the agents actually need to coordinate their actions.",
               "We create a sparse representation of the joint stateaction space by specifying in which states the agents do (and in which they do not) have to coordinate their actions. During learning the agents apply the IL method in the uncoordinated states and the MDP learners approach in the coordinated states. Since in practical problems the agents typically need to coordinate their actions only in few states, this framework allows for a sparse representation of the complete action space, resulting in large computational savings. updates its individual Q-value Q i using Eq. (5).",
               "There are four different situations that must be taken into account. When moving between two coordinated or between two uncoordinated states, we respectively apply the MDP Learners and IL approach. In the case that the agents move from a coordinated state s to an uncoordinated state swe back up the individual Qvalues to the joint Q-value by",
               "In terms of implementation, the shared Q-table can be either stored centrally (and the agents should have access to this shared resource) or updated identically by all individual agents. Note that in the latter case the agents rely on (strong) common knowledge assumptions about the observed actions and rewards of the other agents. Furthermore, all agents have to coordinate their actions in a coordinated state. In the remainder of this paper, we will discuss a coordinationgraph approach which is a generalization of the described algorithm in this section. In that framework the coordination requirements are specified over subsets of agents and the global Q-value is distributed among the different agents. Before we discuss this generalized approach, we first review the notion of a context-specific coordination graph.",
               "Conversely, when moving from an uncoordinated state"
          ],
          "paper_id": "2416b910-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Sparse Cooperative Q-learning"
     },
     {
          "head": {
               "n": "5.",
               "text": "Context-Specific Coordination Graphs",
               "type": "introduction"
          },
          "paragraphs": [
               "A context-specific coordination graph (CG) represents a dynamic (context-dependent) set of coordination requirements of a multiagent system ( ). If A 1 , . . . , A n is a group of agents, then a node of the CG in a given context represents an agent A i , while an edge defines a dependency between two agents. Only interconnected agents have to coordinate their actions at any time step. For example, the left graph in ",
               ": 5 a2a1 : 4 . Initial CG (left), after conditioning on the context s = true (center), and after elimination of A3 (right).",
               "In ( ) the global payoff function is distributed among the agents using a set of value rules. These are propositional rules in the form c : v where c (the context) is an element from the set of all possible combinations of the state and action variables cC ? SA, and(c) = vIR is a payoff that is added to the global payoff when c holds. By definition, two agents are neighbors in the CG if and only if there is a value rule c : v that contains the actions of these two agents in c. Clearly, the set of value rules form a sparse representation of the global payoff function since not all state and action combinations have to be defined.",
               "on the context (center , the agents are eliminated from the graph one by one. Let us assume that we first eliminate A 3 . This agent first collects all rules in which it is involved, these are 1a 3 : 4 3a 2 : 5 Next, for all possible actions of A 1 and A 2 , agent A 3 determines its conditional strategy, in this case equal to 2 : 5 1a 2 : 4 and is then eliminated from the graph. The algorithm continues with agent A 2 which computes its conditional strategy 1 : 11 1 : 5 and is then also eliminated. Finally, A 1 is the last agent left and fixes its action to a 1 . Now a second pass in the reverse order is performed, where each agent distributes its strategy to its neighbors, who then determine their final strategy. This results in the optimal joint action {a 1 , a 2 , a 3 } with a global payoff of 11. shows an example of a context-specific CG, where for simplicity all actions and state variables are assumed binary"
          ],
          "paper_id": "2416b910-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Sparse Cooperative Q-learning"
     },
     {
          "head": {
               "n": "6.",
               "text": "Sparse Cooperative Q-learning",
               "type": "introduction"
          },
          "paragraphs": [
               "1 . In the left graph we show the initial CG together with the corresponding set of value rules. Note that agents involved in the same rules are neighbors in the graph. In the center we show how the value rules, and therefore the CG, are updated after the agents condition on the current context (the state s = true). Based on this information about state s, rule5 is irrelevant and is removed. As a consequence, the optimal joint action is independent of A 4 and its edge is deleted from the graph as shown in the center of .",
               "The method discussed in section 4 defined a state either as a coordinated state in which all agents coordinate their actions, or as an uncoordinated state in which all agents act independently. However, in many situations only some of the agents have to coordinate their actions. In this section we describe Sparse Cooperative Q-learning which allows a group of agents to learn how to coordinate based on a predefined coordination structure that can differ between states.",
               "In order to compute the optimal joint action (with maximum total payoff) in a CG, a variable elimination algorithm can be used which we briefly illustrate in the example of . After the agents have conditioned As in (Guestrin et al., 2002b) we begin by distributing the global Q-value among the different agents. Every agent i is associated with a local value function Q i (s, a) which only depends on a subset of all possible state and action variables. The global Q-value equals the sum of the local Q-values of all n agents:",
               "1 Action a1 corresponds to a1 = true and action a1 to a1 = false."
          ],
          "paper_id": "2416b910-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Sparse Cooperative Q-learning"
     },
     {
          "head": {
               "text": "i=1",
               "type": "introduction"
          },
          "paragraphs": [
               "Suppose that an exploration joint action a is taken from state s, each agent receives reward R i (s, a), and next state sis observed. Based on the decomposition (6) the global Q-learning update rule now reads value rules:",
               "We still have to discuss how the local Q-functions are represented. In our notation, we use the value rule representation of section 5 to specify the coordination requirements between the agents for a specific state. This is a much richer representation than the IL-MDP variants since it allows us to represent all possible dependencies between the agents in a context-specific manner. Every Q i (s, a) depends on those value rules that are consistent with the given state-action pair (s, a) and in which agent i is involved:",
               "j Furthermore, assume that a = {a 1 , a 2 , a 3 } is the performed joint action in state s and a * = {a 1 , a 2 , a 3 } is the optimal joint action found with the variable elimination algorithm in state s. After conditioning on the context, the rules1 and5 apply in state s, whereas the rules3 and6 apply in state s. This is graphically depicted in . Next, we use Eq. (10) to update the value rules1 and5 in state s as follows:",
               "where n j is the number of agents (including agent i) involved in rulecan be regarded as a linear expansion into a set of basis functions",
               ", each of them peaked on a specific state-action context which may potentially involve many agents. The 'weights' of these basis functions (the rules' values) can then be updated as follows:",
               "Note that in order to update5 we have used",
               "is based on a coordinated action of agent A 2 with agent A 1 (rule3 ), whereas in state s agent A 2 has to coordinate with agent A 3 (rule5 )."
          ],
          "paper_id": "2416b910-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Sparse Cooperative Q-learning"
     },
     {
          "head": {
               "n": "7.",
               "text": "Experiments",
               "type": "experiment"
          },
          "paragraphs": [
               "where we add the contribution of each agent involved in the rule.",
               "In this section, we apply our method to a predatorprey problem in which the goal of the predators is to capture a prey as fast as possible in a discrete gridlike world . We concentrate on",
               "As an example, assume we have the following set of situation of looks as ; prey(0, ?1)pred(1, ?1)a 1 = move nonea 2 = move west : 75 a coordination problem in which two predators in a 1010 toroidal grid have to capture a single prey. Each agent can move to one of its adjacent cells or remain on its current position. The prey is captured when both predators are located in an adjacent cell to the prey and only one of the two agents moves to the location of the prey. A possible capture situation is depicted in . When the two predators move to the same cell or a predator moves to the prey position without a nearby predator, they are penalized and placed on random positions on the field. The policy of the prey is fixed: it stays on its current position with a probability of 0.2, in all other cases it moves to one of its free adjacent cells with uniform probability.",
               "This results in the generation of 31,695 value rules for the first predator (31,200 for the 1,248 coordinated states and 495 for the 99 uncoordinated states 2 ). The second predator holds only a set of 495 rules for the uncoordinated states since its action is based on the rules from the other predator in the coordinated states.",
               "During learning we use Eq. (10) to update the payoffs of the rules. Each predator i receives a reward R i = 37.5 when it helps to capture the prey and a negative reward of ?50.0 when it collides with another predator. When an agent moves to the prey without support the reward is ?5.0. In all other cases the reward is ?0.5. We use an ?-greedy exploration step of 0.2, a learning rateof 0.3, and a discount factorof 0.9.",
               "The complete state-action space for this problem consists of all combinations of the two predator positions relative to the prey and the joint action of the two predators (almost 250,000 states). However, in many of these states the predators do not have to coordinate their actions. Therefore, we first initialize each predator with a set of individual value rules which do not include the state and action of the other predator. An example rule is defined as We compare our method to the two Q-learning methods mentioned in section 2. In case of the independent learners, each Q-value is derived from a state that consists of both the position of the prey and the other predator and one of the five possible actions. This corresponds to 48, 510 (= 99985) different state-action pairs for each agent. For the MDP Learners we model the system as a complete MDP with the joint action represented as a single action. In this case, the number of state action-pairs equals 242, 550 (= 99985 2 )."
          ],
          "paper_id": "2416b910-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Sparse Cooperative Q-learning"
     },
     {
          "paragraphs": [
               "; prey(?3, ?3)a 1 = move none : 75",
               "The payoff of all value rules are initialized with a value of 75 which corresponds to the maximal reward at the end of an episode. This ensures that the predators explore all possible action combinations sufficiently. Next, the specific coordination requirements between the two predators are added. Since the predators only have to coordinate their actions when they are close to each other, we add extra value rules, depending on the joint action, for the following situations: shows the capture times for the learned policy during the first 500,000 episodes for the different methods. The results are generated by running the current learned policy after each interval of 500 episodes five times on a fixed set of 100 starting configurations. During these 500 test episodes no exploration actions were performed. This was repeated for 10 different runs. The 100 starting configurations were selected randomly beforehand and were used during all 10 runs.",
               "? the (Manhattan) distance to the other predator is smaller or equal than two cells",
               "? both predators are within a distance of two cells to the prey Both the independent learners and our proposed method learn quickly in the beginning with respect to the MDP learners since learning is based on fewer state-action pairs. However, the independent learners do not converge to a single policy but keep oscillating. This is caused by the fact that they do not take the action of the other agent into account. When both predators are located next to the prey and one predator moves to the prey position, this predator is not able to distinguish between the situation where the other 2 Note that creating value rules based on the full state information, and only decomposing the action space, would result in 8,454 (= 9998 ? 1, 248) uncoordinated states",
               "The value rule for which the prey is captured in the other, but already coordinating in these states might have a positive influence on the final result. These constraints could be added as extra value rules, but then the learning time would increase with the increased state-action space. Clearly, a trade-off exists between the expressiveness of the model and the learning time. "
          ],
          "paper_id": "2416b910-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "experiment"
          },
          "paragraphNo": 9,
          "fromPaper": "Sparse Cooperative Q-learning"
     },
     {
          "head": {
               "n": "8.",
               "text": "Discussion and Conclusions",
               "type": "conclusion"
          },
          "paragraphs": [
               "predator remains on its current position or performs one of its other actions (e.g., an exploration action).",
               "In the first case a positive reward is returned, while in the second case a large negative reward is received. However, in both situations the same Q-value is updated.",
               "These coordination dependencies are explicitly taken into account for the two other approaches. For the MDP learners, they are modeled in every state which results in a slowly decreasing learning curve; it takes longer before all state-action pairs are explored. The context-specific approach has a quicker decreasing learning curve since only joint actions are considered for these coordinated states. As we we see from , both methods result in an almost identical policy.",
               "In this paper we discussed a Q-learning approach for cooperative multiagent systems that is based on context-specific coordination graphs, and in which value rules specify the coordination requirements of the system for a specific context. These rules can be regarded as a sparse representation of the complete state-action space, since they are defined over a subset of all state and action variables. The value of each rule contributes additively to the global Q-value and is updated based on a Q-learning rule that adds the contribution of all involved agents in the rule. Effectively, each agent learns to coordinate only with its neighbors in a dynamically changing coordination graph. Results in the predator-prey domain show that our method improves the learning time of other multiagent Q-learning methods, and performs comparable to the optimal policy. shows the average capture times for the different approaches for the last 10 test runs from and a manual implementation in which both predators first minimize the distance to the prey and then wait till both predators are located next to the prey. When both predators are located next to the prey, social conventions based on the relative positioning are used to decide which of the two predators moves to the prey position.",
               "The context-specific learning approach converges to a slightly higher capture time than that of the MDP Learners. An explanation for this small difference is the fact that not all necessary coordination requirements are added as value rules. In our construction of value rules we assume that the agents do not have to coordinate when they are located far away from each Our approach is closely related to the coordinated reinforcement learning approach of ). In their approach the global Q-value is also represented as the sum of local Q-functions, and each local Q-function assumes a parametric function representation. The main difference with our work is that they update the weights of each local Q-value (of each agent) based on the difference between the global Qvalues (over all agents) of the current and (discounted) next state (plus the immediate rewards). In our approach, the update of the Q-function of an agent is based only on the rewards and Q-values of its neighboring agents in the graph. This can be advantageous when subgroups of agents need to separately coordinate their actions. From this perspective, our local Q-learning updates seem closer in spirit to the local Sarsa updates of .",
               "Another related approach is the work of ( ) in which each agent updates its local Qvalue based on the Q-value of its neighboring nodes. A weight function f (i, j) determines how much the Qvalue of an agent j contributes to the update of the Q-value of agent i. Just as in our approach, this function defines a graph structure of agent dependencies. However, these dependencies are fixed throughout the learning process (although they mention the possibility of a dynamically changing f ). Moreover, in their approach Q-learning involves back-propagating averages of individual Q-values, whereas in our case Qlearning involves back-propagating individual components of joint Q-values. We applied their distributed value function approach on our predator-prey problem with a weighting function that averaged the value evenly over the two agents. However, the policy did not converge and oscillated around an average capture time of 33.25 cycles since the agents also affect each other in the uncoordinated states. For instance, an agent ending up in a low-valued state after taking an exploratory action influences the individual action taken by the other agent negatively. ordinated reinforcement learning. Proc. 19th Int.",
               "Conf. on Machine Learning. Sydney, Australia."
          ],
          "paper_id": "2416b910-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Sparse Cooperative Q-learning"
     }
]