[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Stable matching studies how to pair members of two sets with the objective to achieve a matching that satisfies all participating agents based on their preferences. In this research, we consider the case of matching in a social network where agents are not fully connected. We propose the concept of D-neighbourhood associated with connective costs to investigate the matching quality in four types of well-used networks. A matching algorithm is proposed based on the classical Gale-Shapley algorithm under constraints of network topology. Through experimental studies, we find that the matching outcomes in scale-free networks yield the best average utility with least connective costs comparing to other structured networks. This research provides insights for understanding matching behavior in social networks like marriage, trade, partnership, online social and job search."
          ],
          "paper_id": "2418dbf0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Knowledge Management and Acquisition for Intelligent Systems"
     },
     {
          "head": {
               "n": "1",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "Stable matching can be best explained by the example of marriage and thus also known as the stable marriage problem (SMP). It aims to find a stable matching between two equally sized sets of elements given an ordering of preferences for each element. Two sets can be illustrated as an equal number n of men and women, in which every man ranks the n women according to how desirable of each is to him, without ties. Similarly, every woman ranks the n men based on their willingness ( . Ideally, a perfect match would pair every man with the woman he likes best and vice versa. However, preferences expressed by men and women rarely allow for a perfect match. But we can go for a stable match, such that there is no man and woman that both like each other better than their current partners. In order to obtain a stable match, we can start with random matching, exchange the unstable pairs by switching their partners until no pairs have motivation to change. Such a solution is known as the Gale-Shapley (G-S) algorithm (Gale 2013)."
          ],
          "paper_id": "2418dbf0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Knowledge Management and Acquisition for Intelligent Systems"
     },
     {
          "head": {
               "text": "The classical Gale-Shapley",
               "type": "introduction"
          },
          "paragraphs": [
               "1 algorithm assumes that all the information is known to public as complete information. Some works have reported to study the stable matching with incomplete information ( ), such incompleteness may have a significant impact on the matching results. In social and economic interactions, an agent's well being depends on his or her own actions as well as on the actions taken by his or her neighbours. Such neighbouring relations can form a network and its structure decides the direct interaction. In recent years, the games played in networks have been studied extensively . A general framework for the study of games in such an incompleteinformation setup has been developed in and . Some related research has even developed into an independent area known as Algorithmic Game Theory ( . However, few work has been done to study stable matching in networks. In this paper, we assume that the acquaintance between agents can be modeled by a network, a fully connected network indicates the ideal complete information. We are interested in stable two-sided matching in networks of different structures and the cost of matching within a network. We hope to understand how the patterns of social connections shape the choices that individuals make in matching.",
               "The remainder of the paper is structured as follows. In Sect. 2, we introduce the basics of graph theory and four classical network structures that we will test later. In Sect. 3, we define D-neighbourhood for an agent in network and the cost of matching. A simple matching algorithm for network is proposed based on the classical G-S algorithm. Experimental results are given and analyzed in Sect. 4. In Sect. 5, we conclude this research and discuss the possible future work."
          ],
          "paper_id": "2418dbf0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Knowledge Management and Acquisition for Intelligent Systems"
     },
     {
          "head": {
               "n": "2",
               "text": "Network Structures",
               "type": "introduction"
          },
          "paragraphs": [
               "A social network is a social structure made of a set of agents and a set of the dynamic ties between them. In this paper, we mainly consider the following four types of well-studied networks: scale-free networks (Barabsi-Albert model) ( , random networks (Erd?s-Rnyi model) , small world networks (Watts-Strogatz model) ) and nearest-neighbor coupled network (NCN model). The reason for choosing these four structures is because they are representative social networks in other studies including (Li and Qin 2014) and ( ). In graph theory, a network can be viewed as a graph G = (V, E), which is composed of a set of nodes V and edges E. Node number N = |V |, where |.| represents the cardinality of a set, and the number of edges is M = |E|.",
               "Barabsi-Albert (BA) model is a typical scale-free network generation algorithm using a preferential attachment 2 mechanism. It reflects how normal social networks are formed, particularly online ( ). The network is . Average path length (APL) of four classical network models.",
               "log N log log N seeded with two random links. Each link is given a weight equal to the degree of the target node it connects to, and a link is chosen in proportion to these weights. In the Erd?s-Rnyi model, ER(N, p) is a graph constructed by connecting N nodes randomly with probability p independently from every other edge ( ). As a transition from the completely regular network to the completely random network, the introduction of a little randomness into regular network can generate a network with small world characteristics, known as Watts-Strogatz (WS) small-world network model . Nearest neighbor-coupled network NCN(N, k) of periodic boundary condition forms a ring of N vertex, where each node and its neighbors around are connected, k is an even number.",
               "The topology of the network decides the dynamics of the network, two parameters characterizing complex network topology are well used (Wang and Jiang 2011): degree distribution, the average path length (APL). The degree k i of the node i refers to the number of edges connected to the node i. The average degree of all nodes in a network is denoted by",
               "Degree distribution is the probability distribution of node degrees over the whole network. Distance between two nodes i and j, d(i, j) is defined as the number of edges in the shortest path connecting the two nodes using Dijkstra's algorithm , also referred to the Dijkstra distance. APL of the network is defined by Dijkstra distance:",
               "The equations of calculating average path length (d) of four network models are shown in (Wang and Jiang 2011)."
          ],
          "paper_id": "2418dbf0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Knowledge Management and Acquisition for Intelligent Systems"
     },
     {
          "head": {
               "n": "3",
               "text": "Matching Model in Networks",
               "type": "modelling"
          },
          "paragraphs": [
               "We will be concentrating on two-sided matching markets ( ) in this paper. Two-sided refers to the fact that agents in such games belong to one of two disjoint sets. In the real-world, regional limitation and attenuation of information flow help us to develop neighbourhoods, it also implicitly divided agents into groups and it is always costly to interact with agents far away. This fact inspires this study in order to understand how the changes in network structure will reshape the matching outcomes."
          ],
          "paper_id": "2418dbf0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Knowledge Management and Acquisition for Intelligent Systems"
     },
     {
          "head": {
               "n": "3.1",
               "text": "D-neighbourhood",
               "type": "modelling"
          },
          "paragraphs": [
               "Definition 1 . D-neighbourhood defines the nodes within the maximum permissible contact range. Given a maximum depth (D) for agent i, agent j satisfies that the Dijkstra distance d(i, j) is less than D could achieve mutual acquaintance.",
               "calculates how many nodes are with distance D to the node i in a given network. Given d(i, j) = l (0lD), the least path is a sequence from the starting node i (for mathematical convenience, it can be denoted by0 ) to the end node j (denoted byl ) through some specific intermediate nodes, or formally: shows an example of a network with the starting node i (in green) and the end node j. The nodes with distance 1 from node i are in blue and the nodes with distance 2 are in red. The shortest path between nodes i and j",
               "3 ) or other alternative paths. Wheret s represents the sth node in the set of nodes with distance t to the starting node. In order to find the least length path in whole network, we need to choose1 2 from five blue nodes within node i's distance 1, the probability to choose1 2 is P (1 2 ) = 1/5. The next node has to be chosen from 3 red nodes with distance 2 to the starting node i (0 ), but only two of them have the distance 1 to1 2 . So P (2 3 ) = 1/2, or formally, the probability of a node appearing in the least length path can be calculated by:",
               "s.t. : P (0 ) = 1 (4) "
          ],
          "paper_id": "2418dbf0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Knowledge Management and Acquisition for Intelligent Systems"
     },
     {
          "head": {
               "text": "Definition 2 (Connective Cost). Connective cost of a matched pair c i,j measures the cost for agent i to know j through the intermediated nodes (Eq. (2)) between them.",
               "type": "modelling"
          },
          "paragraphs": [
               "The connective cost is constructed by considering two factors:",
               ", the lower probability a node has, the larger cost for it to get connected. c i,jexp(d) implies that, the increase of cost grows exponentially with the increase of depth. The reason of using logarithm is to re-scale the cost (which increases exponentially) when the network gets really large. The average connective cost between all matching pairs in a network with N nodes (N/2 probable matched pairs) is:",
               "ij Definition 3 (Network Connectivity). Network connectivityof a network refers to the proportion of the number of paths whose lengths are less than the maximum depth (D) to the number of all possible paths in the network.",
               "Connectivity for the classical G-S algorithm is considered asGS = 1. Actually, APL in each social network forms the difference in connectivity at the start. The distribution of the shortest path length of the random network (ER) obeys Poisson distribution:",
               "whereis APL. Then, the connectivity can be formulated by D, d and:= D",
               "Through theoretical derivation, APL of random network (ER) is negatively correlated with connectivity (i.e.,). From this, APL is basic and intrinsic characteristics of a network. Relationship of APL and connectivity in the four types of models will be tested in experimental studies."
          ],
          "paper_id": "2418dbf0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Knowledge Management and Acquisition for Intelligent Systems"
     },
     {
          "head": {
               "n": "3.2",
               "text": "Matching Model",
               "type": "modelling"
          },
          "paragraphs": [
               "There is a large collection of literatures on the matching models for markets with two-sided heterogeneity, such as the matching problems of students and schools, husbands to wives, and workers to firms ) . Typical assumption of complete information makes the analysis tractable but stringent. Let us reconsider the problem in the marriage setting: there is a finite set of women, I, with an individual woman is denoted by iI. There is also a finite set of men, J, with an individual man jJ. A matching pair function: IJ,() is a bidirectional symmetrical mapping between I and J. If woman i's preference to man j is denoted by R w i,j , and man j's preference over woman i is R m i,j . Women or men can only give preferences of the ones within his (her) D-neighbourhood, it is an incomplete preference list comparing to the classical stable marriage problem. The satisfaction of an agent in matching can be defined as the following."
          ],
          "paper_id": "2418dbf0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Knowledge Management and Acquisition for Intelligent Systems"
     },
     {
          "head": {
               "text": "Definition 4 (Satisfaction of Agent). Satisfaction of an agent measures how well his (her) preference list is meet in matching. The satisfaction for the woman",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "The satisfaction for a man j(jJ) is",
               "where n = N/2 is the number of men (or women).",
               "To avoid trivial cases, unmatched agents are assigned with zero satisfaction: s i? = s ?j = 0. We then define a utility function of a matching pair through the A stable matching in a social network means there is no woman-man combination (i, j) such that u i,j > u i,(i) and u j,i > u j,?1 (j) for all (i, j) satisfying(i, j|D) = 1. It is stable if there is no unmatched man-woman pair that could increase both their utility by matching each other within their Dneighbourhoods. Comparing to the stability with complete information, our model may end with some men and women unmatched as they are not acquainted to each other. In the following experiments, we ensure every network is implemented under the same conditions with N and k are fixed. "
          ],
          "paper_id": "2418dbf0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Knowledge Management and Acquisition for Intelligent Systems"
     },
     {
          "head": {
               "n": "4",
               "text": "Experimental Studies",
               "type": "experiment"
          },
          "paragraphs": [
               "As we have discussed in previous sections that network topology may influence the matching outcomes significantly. In this section, we conduct matching experiments in small-scale networks with different structures. In each round, each agent is assigned with a preference list over all potential partners: R. While these networks are considerably smaller than the real networks, we set D = 3 as the maximum depth between any recognizable participants. Four types of networks introduced in Sect. 2 (NCN, ER, WS and BA) are tested and the results of average utility against on total numbers of agents is shown in the left-hand side of . The average utility is relatively stable given different number of agents, but BA is obviously with much higher average utility (indicates better matching) comparing to the other 3 models. The right-hand side figure shows the relation of average utility and node degrees. As we can see from the figure, given N is fixed, the larger k yields better utility of matching outcome. When k becomes large enough, all networks become fully connected and it converges to the situation of complete information as well as the average utility. Over all, BA still has the superior performance comparing to other 3 models.",
               "As we have discussed in previous sections, the connective cost for knowing someone through others within your D-neighbourhood is calculated by Eq. (6). There is a trade-off between average utility and average connective cost defined based on the radius of one's D-neighbourhood. In , for each network model, we depict the average utility by circled blue curves and negative connective cost by squared red curves in double coordinates. Utility is increased, the connective cost is also increased (negative cost decreases) significantly. For each network model, we can focus on the intersection between the utility and cost curves. Comparing to other networks, the BA model has the most desired properties that the utility can reach 8 with cost of 80 at the depth of 3. For other three networks, the best utility values are less than 7. Though the NCN model has lower cost, the increase of utility is slow. Most importantly, such performance comparisons are conducted among four network models, even the definition of connective cost is modified with different parameters. The superiority of the BA model still holds.",
               "In order to enlarge one's D-neighbourhood, we can either increase breadth (node degrees) k or the maximum depth D. When these two parameters are big enough, the network can be fully connected and becomes the classical stable matching problem with complete information. gives the relations between connectivity () and average utility (U ) in four networks under different population sizes. No matter in which networks, the larger connectivity always indicates larger average utility of matched agents. We have discussed that enlarged D-neighbourhood can make matching more efficiently. To give more quantitative and direct analysis, the scatter plots of average path length (APL) and connectivity of all four network models are shown in . Connectivity is negatively correlated to APL of a network. It means that more connected a network is, the shorter ALP we have. The connectivity of BA is much bigger than other networks which means that the agents have more opportunities to know other agents given the same radius of D-neighbourhood. It has shorter APL also means the less connective cost in matching. It gives a clue why BA may yield the best matched utility with less connective costs."
          ],
          "paper_id": "2418dbf0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Knowledge Management and Acquisition for Intelligent Systems"
     },
     {
          "head": {
               "n": "5",
               "text": "Conclusion",
               "type": "conclusion"
          },
          "paragraphs": [
               "In this paper, we propose a stable matching algorithm by considering incomplete information in structured networks, where agents in both sides are not fully connected to each other. In reality, it can be interpreted as a marriage problem with limited acquaintances within a community. We considered four types of well-used networks and defined the D-neighbourhood and connective cost to imitate a real social network. Through simulated matching experiments, we found that the BA model has the most desired average utility with less connective costs. Thus it is the most efficient network among the four types of well-used networks in our experiments. We also investigated the relations among the network connectivity, average path length and average utility of matching. Empirical studies indicates that the reason BA is superior to others is mainly because it has a better connectivity allowing more matching opportunities for unmatched agents. Given the proposed matching algorithm, scale-free network has the best efficiency with low cost in matching. We will consider the case of one-to-many (school-student or job search) matching in structured networks as our future work."
          ],
          "paper_id": "2418dbf0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Knowledge Management and Acquisition for Intelligent Systems"
     }
]