[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "There has been considerable investigation into the nature, effectiveness and performance of virtual organizations, virtual teams and virtual collaboration (Cogburn, Santuzzi, & Espinoza, 2011) based on the affordances of information and communications technology (ICT). The recent emergence of location-based social network technologies has resulted in new modes of ad hoc virtual organizations. Developers appear to improvise systems by cobbling together existing applications and technologies, almost overnight, with uncoordi-nated contributions rather than traditional designs or project plans. Heylighen theorizes that stigmergic self-organization explains this kind of system development (Heylighen, 2007a, 2007b). As defined by the biologist Grasse, stigmergy has been defined as a sequence of indirect stimulus and response behaviors that contribute to the coordination of actions among insects through their environment, for example termites coordinating their nest building activities (Theraulaz & Bonabeau, 1999). Heylighen likens human cognitive self-organization to stigmergy. In recent years, the advent of distributed ICTs like worldwide internet computing and pervasive ubiquitous networks have made traditional top-down techniques of system development increasingly irrelevant for software application development. Instead, modular, adaptable and self-managing end-user components are combined in mash-ups (Merrill, 2009). Similarly, software development teams are spontaneous and ad hoc, functioning as virtual organizations. In this study, the actions leading to the creation of the Ushahidi software platform and its subsequent adaptations are identified using longitudinal case study methodology and content analysis methods applied to newspaper, magazine, website, journal and social networking publications. Based on a socio-technical theoretical framework, the Ushahidi system is framed as a dynamic, ad hoc virtual organization in the context of emergency response. The actions leading to the instantiation of the Ushahidi system are examined as examples of human cognitive stigmergic response to critical incidents and naturalistic development of complex adaptive systems."
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "In late 2007 in Kenya, US educated Kenyan journalist Ory Okolloh became one of the main sources of information about the unrest and violence that broke out soon after the Kenyan presidential election. Because of the government's ban on live reporting and the censorship of mainstream media, Okolloh solicited information about incidents of violence from ordinary people in the form of comments posted on her personal weblog (blog). The mainstream media was not reporting on the violence because of the government ban, and Okolloh was quickly overwhelmed by the numbers of emails and messages that she received. In order to focus on the immediate need to get the information out , in early January Okolloh posted a request on her blog for help to develop a website where people could post anonymously online or via mobile phone text messages, the most widely accessible type of communications technology in Kenya. Within a day the Ushahidi ('testimony' in Swahili) domain was registered and the website went live within less than a week. Built by 15-20 mainly Kenyan volunteers using open source software based on Google Maps and Frontline SMS, the project was funded entirely by donations, with many volunteer developers. More than 250 people began using the Ushahidi site immediately to share information. Participants eventually grew to 45,000 users, and even included radio stations.",
               "Okolloh initiated a simple manual report verification process. If a reporter could be identified, they were contacted for verification; if anonymous, a certain volume of similar reports was considered verification . Because of the tense political situation and the mainstream media blackout, many people were reluctant to identify themselves. Unverified reports were posted in any case, but were tagged as unverified. Within weeks hundreds of incidents of violence had been documented in detail that otherwise would have gone unreported. The website received hundreds of thousands of visits from around the world, sparking global media attention . shows the appearance of the Ushahidi website as it was originally used in Kenya.",
               "Following the events in Kenya, Humanity United, a non-profit organization dedicated to ending modern slavery and mass atrocities, offered to fund redevelopment of Ushahidi as a broadly available platform for collecting and visualizing information. Ushahidi was transformed from its early origins as a personal blog by journalist Ory Okolloh, into a non-profit tech company specializing in developing free and open source software for information collection, visualization and interactive mapping . The goals of Ushahidi the company are to build tools for democratizing information, increasing transparency, and lowering the barriers for individuals to share their stories . Ushahidi defines itself as a disruptive organization that is willing to fail in the pursuit of changing the traditional way that information flows . In late 2008 the alpha version was released and tested in the Democratic Republic of Congo, among other places . The beta version, utilizing Frontline SMS, free software that turns a laptop and a mobile phone or modem into a central communications hub, was released in 2009. The Frontline SMS software can be used on a single laptop computer without the need for the internet, allowing users to send and receive text messages with large groups of people through mobile phones. Since its original release in 2005, it has been widely adopted in the grassroots non-profit community and nominated for several awards .",
               "The development of the Ushahidi software has continued. Presently there are three free open source products available: the Ushahidi platform, the Crowdmap application, and the SwiftRiver platform. The basic Ushahidi plat- form is a downloadable software product that enables crowdsourcing 1 information using mobile phones, email or the internet; and uses OpenStreetMaps or Google Maps to create geocoded 2 event archives. Ushahidi is serverbased (i.e. it must be installed on a server) and can be configured for different locations and situations. Temporal data is captured through the use of timestamping and geospatial data is captured through geocoding. The Crowdmap application is a version of the Ushahidi platform that is hosted by Ushahidi and is available via the cloud to allow the platform to be very quickly deployed without the need for a server installation . CrowdMap has an add-on feature similar to Foursquare to allow users to add their own tags to its sites.",
               "The SwiftRiver platform is a downloadable software product built from real-time information processing APIs (application programming interfaces). The impetus for developing SwiftRiver was the need to rapidly handle the overwhelming quantities of data reported in the early hours of a disaster. SwiftRiver is designed to accomplish three tasks: structure unstructured data, conditionally filter and prioritize real time content, and provide context, especially location. SwiftRiver accomplishes these tasks through applications for natural language/artificial intelligence processing, SMS and Twitter data-mining, and information source verification. In 2008, Ory Okollah wrote, We anticipate that the platform will revolutionize how many organizations handle their data and also democratize how information is collected and shared in crisis situations. She characterized the Ushahidi development strategy as: embrace the rapid prototype model and focus on pushing the boundaries of the various areas that the platform focuses on -crowdsourcing, visualization, mapping, and mobile phone platforms . and management on a staggering scale such as the Haiti and Fukushima earthquakes, by United Nations organizations specializing in crisis management for decades. The significance of these attributes lie in their applicability to two areas of interest: information systems development (particularly open source software development) and emergency response. These two areas are related by the affordances of the Ushahidi platform, and the process of Ushahidi's development offers valuable insights into both.",
               "The research questions include: What phenomena explain the development and success of Ushahidi? What may we infer about information system development from the Ushahidi example? Is the role of human cognitive stigmergy significant in the development of Ushahidi, and how is it apparent?"
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     },
     {
          "head": {
               "n": "2.",
               "text": "Research questions, theoretical framework and constructs",
               "type": "introduction"
          },
          "paragraphs": [
               "The purpose of this study is to empirically examine the role of human cognitive stigmergy in the rapid, spontaneous initial development of the Ushahidi platform and its evolution, including the SwiftRiver platform and the CrowdMap applications. The initial development of Ushahidi is remarkable for several reasons. First, Ushahidi in its original form was developed and implemented in a single week. Second, it was developed largely by Kenyans, in Kenya, an African country with minimal cyberinfrastructure, technical resources or computer literacy. Third, it was in use by thousands of people within days of being launched. Fourth, as of 2011, the Ushahidi and SwiftRiver platforms have been cited for effectiveness, robustness, and ease of use in multiple contexts, including crisis response Information systems and software development have been investigated for many years, from many disciplinary perspectives, but there is not yet a strong theoretical framework of information systems, and much of the research is issue -rather than theory-driven ). The advent of emergent and converging technologies has changed approaches to system design and development, making traditional top-down techniques increasingly irrelevant, Sophisticated end user tools offer new opportunities for rapid prototype development, while the emergence of location-based social networking has created spontaneous new modes of virtual organization. Recently, the migration of network connectivity to handheld smart devices utilizing pervasive ubiquitous networks have created an environment of distributed ICT and worldwide internet computing. Developers can improvise systems by mashing together existing applications and technologies, almost overnight, with uncoordinated contributions rather than traditional design processes and project plans. Increasingly systems are based on combining existing end user tools rather than original code development. Instead of meticulous requirements definitions and long hours of code testing and debugging, these modular, adaptable and flexible components are able to handle unanticipated dynamic situations. Similarly, software development teams are fluid, spontaneous and ad hoc, functioning as virtual organizations.",
               "Heylighen theorizes that stigmergic self-organization explains this kind of development and coordination, calling it an evolutionary process of human cognitive self-organization, or global complex system building driven by enlightened self-interest ). In Heylighen's framework, this evolutionary progress is facilitated by stigmergy, which Heylighen defines as the unintended collaboration between agents resulting from their actions on a shared environment. Heylighen believes stigmergic self-organization reduces social friction through the creation of institutions; and that the Internet is a near ideal medium for stigmergic interaction because it transcends the traditional barriers of time and distance to enable virtual organizations to emerge ).",
               "As originally defined by the biologist Grasse in 1959, stigmergy is a sequence of indirect stimulus and response behaviors that contribute to the coordination of actions among insects through their environment, for example termites coordinating nest building activities through scent trails (Dorigo, ). Marsh and Onof state that in its most generic sense, stigmergy refers to the phenomenon of indirect communication mediated by modifications of the environment and outline a framework for social stigmergy: If social epistemology has the formation, acquisition, mediation, transmission and dissemination of knowledge in complex communities of knowers as its subject matter, then its third party character is essentially stigmergic . Bonabeau and Meyer apply the concept to solving business management challenges, terming it 'swarm intelligence' ). Bolici et al., investigating the role of self-organization in open source software development, found that the qualitative analysis of this evidence shows the paradox that, even if the developers do not seem to communicate explicitly, the software is nonetheless built as the result of a collective effort, apparently without central coordination and that stigmergy explains how actors can affect the behavior of other members of the community through the traces that their activities leave in shared artifacts .",
               "The role of cognitive stigmergy has been identified in both commercial and free open source software development ( ). The conceptual framework of this inquiry is based on Ricci et al's definition of stigmergy as a technique for creating coordination in multi-agent systems (MAS). Ricci et al. distinguish human cognitive stigmergy as supporting high-level, knowledge-based social activities from traditional stigmergy as antlike, nonrational . In terms of Ricci et al.'s definition, the agent working environment is provided by the Ushahidi software platform, including its components, interfaces and affordances to participants. The development environment used by the developers to build the software is one agent working environment, as the platform itself is a working environment for end user agents. We can distinguish several classes of agents at work in the environment, utilizing the available tools for their own goals: developers, users, managers, etc. There are multiple system artifacts of the development activity: development tools, software modules, utilities, webpages, map interfaces, etc., including the entity of the system itself. And there are content artifacts: text messages, reports, pictures, videos, etc., the products of the use of the system. Ricci's definition includes interactions between the artifacts and the world. To understand the complexities of the phenomenon of human cognitive stigmergy in the context of the development of Ushahidi, we must look beyond the system itself to the broader environment in which the Ushahidi system functions. For example, the end users perform their activities through the system's stigmergic mechanisms, acting through the environment abstractions (e.g. messaging, texting, and map interfaces) provided by the Ushahidi platform artifacts. They may understand their work as an act of communicating information to emergency responders (for example), but they are working through and with the developers of the platform. The developers perform their activities through the affordances of the development environment, understanding their own efforts and the work of others through the apprehension of test results, a shared understanding of source code modules, and other environment abstractions that compose the artifact that is the system. These abstractions of the world are understood by participants as real interactions of knowledge sharing and coordination based on shared perceptions and understandings of the work environment, the external environment represented by the system, and the goals and purposes pursued within the functionality of the system."
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     },
     {
          "head": {
               "n": "2.2.",
               "text": "Virtual organizations, virtual collaboration and human cognitive stigmergy",
               "type": "introduction"
          },
          "paragraphs": [
               "In their work defining virtual organizations, Cogburn et al. utilize the National Science Foundation's (NSF) definition: A virtual organization is a group of individuals whose members and resources may be dispersed geographically, but who function as a coherent unit through the use of cyberinfrastructure. NSF uses the term cyberinfrastructure to describe research environments that support advanced data acquisition, data storage, data management, data integration, data mining, data visualization and other computing and information processing services distributed over the Internet beyond the scope of a single institution. At this point in time, the term can obviously be expanded to include many other activities beyond research.",
               "Cogburn et al. point to two key characteristics of virtual organizations:",
               "1. Virtual organizations maintain their structure without sharing a physical space. 2. Virtual organizations use computer-mediated communication to function (Cogburn, 2011).",
               "Cogburn et al.'s 10 factor socio-technical model is intended to guide the identification or the development of effective virtual organizations. The model combines social and technical elements identified through analysis based on a broad multi-disciplinary literature review of more than 400 peer-reviewed articles, including seminal empirical studies of virtual organizations. shows the Virtual Organizations as Socio-Technical Systems (VOSSs) Model.",
               "Okolloh's identified development strategies: Rapid Prototype Model, Crowdsourcing, Visualization, Mapping, Socio-technical model for geographically distributed collaboration in global virtual teams )."
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     },
     {
          "head": {
               "text": "Virtual Organizations as Socio-Technical Systems (VOSS) model Technical factors Telepresence",
               "type": "modelling"
          },
          "paragraphs": [
               "An environment created by means of an electronic communication medium that provide a mediated environment for shared activities Technology scaffolding A training method based on engaging trainees in a task above their skill level with demonstration and help when necessary"
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     },
     {
          "head": {
               "text": "Accessibility",
               "type": "modelling"
          },
          "paragraphs": [
               "The ability to provide access to information, resources and other people to a geographically distributed group Digital literacy An individual's ability to recognize when information is needed and to locate, evaluate, and use it effectively via digital technology"
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     },
     {
          "head": {
               "text": "Social factors",
               "type": "modelling"
          },
          "paragraphs": [
               "Culture The collective programming of the mind common among groups of people that facilitates communication and knowledge sharing, and which distinguishes one group or category of people from another Motivation",
               "Factors leading people to engage in a particular behavior Trust",
               "The willingness of a party to be vulnerable to the actions of another party irrespective of the ability to monitor or control that other party Leadership",
               "The ability of a person or persons to promote and engage in practices that establish team norms, facilitate relationship building and develop trust. Collaborative learning",
               "The ability of a group to engage actively in a discovery process and collaboratively construct meaningful and worthwhile knowledge Social system",
               "The way in which individual members within an organization relate to each other and to the organization as a whole",
               "and Mobile Phone Platforms, appear to map perfectly to the technical factors of the VOSS model. Telepresence is the mediated environment created through a communication technology to provide an environment for shared activity. Ushahidi's map-based visual interface fulfills the telepresence factor. Technology Scaffolding refers to teaching people to perform a new task through demonstration and help when needed. By using simple text messaging in conjunction with a website map interface, Ushahidi leverages users' knowledge of two basic existing technologies to enable them to quickly master the skills they need to collaboratively build a visual archive of an event.",
               "Accessibility is the ability to provide access to information, resources and other people across a geographically distributed group. The Internet in conjunction with mobile phone platforms constitute the most readily and affordably accessible communications technologies anywhere in Africa and elsewhere .",
               "The VOSS model's social factors are also effectively fulfilled. Digital literacy refers to an individual's ability to recognize when information is needed and to locate, evaluate, and use information via digital technology. The rapid and broad use of the Ushahidi platform in multiple situations points to a capable critical mass of participants, implying that Ushahidi's technology choices optimize digital literacy.",
               "Culture is a complex construct, but as defined by Cogburn et al.; it refers to a common, collective programming of the mind among groups of people that facilitates communication and knowledge sharing, and which distinguishes one group or category of people from another. The collective communication and knowledge sharing aspects of Ushahidi's culture are exemplified by crowdsourcing, a mechanism of self-selection and affiliation that brings like-minded people together virtually. This definition of culture coincidentally resembles Heylighen's definition of human cognitive stigmergy.",
               "Motivation is a multi-faceted construct referring to factors that lead people to engage in a particular behavior. Herzberg, in his seminal article on intrinsic vs. extrinsic motivation, explains that external factors such as rewards and punishments (aka the stick or carrot approach) are not effective long term motivations for most people . Keller's four factor ARCS (Attention, Relevance, Confidence and Satisfaction) model of intrinsic motivation for instructional design is broadly applicable for stimulating intrinsic motivation ).",
               "The ARCS model is hierarchical. The Attention factor is primary. People must first know something exists in order to use it. As more people gain access to the Internet and social media as a means of distance communication and access to information, the reach and spread of websites like Ushahidi are more readily known. The Relevance factor means users recognize the purpose and availability of the system at the critical time when they need it. In an emergency situation, people must know that the system exists and can meet their need.",
               "The Confidence factor refers to a person's belief that they will be able to use the system. Observation of others' activities and having the basic knowledge of how to perform the simple messaging, posting and tagging functions of Ushahidi meet the confidence factor.",
               "The Satisfaction factor is the user's fulfillment in accomplishing their task. The Ushahidi visual interface gives immediate acknowledgement that the task has been accomplished.",
               "Trust is the willingness of a party to be vulnerable to the actions of another party irrespective of the ability to monitor or control that other party. Although Ushahidi has been used maliciously in some cases to spread false infor-mation and to mislead, crowdsourcing and the verification tools included in SwiftRiver have been effective for verifying reports and identifying false information .",
               "Leadership refers to the ability to promote and engage in practices that establish team norms, facilitate relationship building and develop trust. Ushahidi's demonstrated leadership is apparent in the company's history and mission of providing Tools for democratizing information, increasing transparency and lowering the barriers for individuals to share their stories .",
               "Collaborative learning is the ability of a group to engage actively in a discovery process and collaboratively construct meaningful and worthwhile knowledge. This construct is demonstrated in Ushahidi by crowdsourcing at the end user level and by the rapid prototype development model at the developer level. Crowdsourced information combines with the feedback provided by the visual reporting interface to enable collaborative knowledge construction among the participant users. The event archive that is created is available for observers, who can comment and otherwise participate. In the case of the development of Ushahidi, many of these non-participant observers became involved in other ways: as volunteer developers or funders of the development of the Ushahidi platform, or as supporters of emergency response.",
               "Finally, the social system construct of the model refers to how individual members of an organization relate to each other and to the organization as a whole. Ushahidi's complex social system has at least two levels: the not-forprofit software company, and the various social systems instantiated by end users on the Ushahidi platform. The social system enabled by the platform includes the relationships and interactions between the end users and the company employees, and the interactions and relationships among end users in the context of an event response. Multiple deployments of the platform with respect to emergency events and responses means that there are multiple instantiations of the social system. When the Ushahidi software platform is downloaded and installed on a local server, there is a new cadre of support and maintenance staff and a new set of users. Any of these organizational entities can be examined either separately or as parts of a whole. There is clearly a complex organizational entity known either singly or collectively as Ushahidi that operates virtually as well as physically, and includes multiple virtual collaborations at several levels. However, there is also a complex organizational entity enabled in each instance by Ushahidi and known variously as 'the Fukushima earthquake' or 'the Haiti earthquake' emergency response, for example.",
               "In terms of Cogburn et al.'s definition of virtual organizations, the Ushahidi platform has created and continues to create and support ad hoc virtual organizations in a variety of contexts. The social and technical factors of the VOSS model explain how human cognitive stigmergy is activated and enabled by the Ushahidi development strategies: the Rapid Prototype Model, Crowdsourcing, Visualization, Mapping, and Mobile Phone Platforms. The Ushahidi platform provides easily accessible technologies that mediate participants' interactions, enabling virtual collaborations that produce the shared knowledge upon which the emergent coordination processes are based."
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     },
     {
          "head": {
               "n": "2.3.",
               "text": "Crowdsourcing, situation awareness and system intelligence",
               "type": "modelling"
          },
          "paragraphs": [
               "Seminal work on situation awareness has been utilized for simulation, decision support, automation and intelligent system design. characterize the process of developing human cognition of situation awareness as essential for people to perform tasks effectively. Traditionally, people relied on experience and training to recognize cues provided in the environment to guide their responses to risk and emergencies. A major challenge is identifying and disseminating information crucial for decision making and action within the huge torrents of data produced by information systems today. In some cases, the volume of available information has overwhelmed people's ability to process and utilize what is needed for effective action. The disconnect between the available information and the needed information is termed the 'information gap', i.e. the ability of the system to provide what is needed when it is needed ). The perspective of this approach to emergency response relies on traditional top-down system development approaches which focus on identifying requirements, then designing, testing and implementing systems. However, in emergency situations, it is impossible to fully anticipate potential information and communication needs, as was demonstrated by the Haitian earthquake and the Fukushima tsunami. Emergency situations often occur in places where there is little infrastructure, or existing infrastructure may be destroyed. Exactly where and how a disaster will occur is often not predictable; and it is not feasible to have resources universally deployed 'just in case.' What is needed is agile, flexible and portable response strategies.",
               "The term crowdsourcing was first coined by journalist Jeff Howe in a Wired magazine article: 'The Rise of Crowdsourcing': It's not outsourcing; it's crowdsourcing ). The term is a portmanteau of the words 'crowd' and 'outsourcing'. Howe described the phenomenon of companies and others taking advantage of the talent of the public through technological advances and inexpensive consumer electronics narrowing the gap between professionals and amateurs in many fields. Problem-solving, scientific research and other work has been 'crowdsourced' using websites such as Amazon's Mechanical Turk that matches online workers with human intelligence tasks (HITs) . The use of the Ushahidi platform in the Kenyan election crisis is an example of the public replacing the traditional media though the use of cellular telephone and Internet-based electronic communications media on an ad hoc basis. Because the government ban on traditional news outlets rendered the normal news outlets non-functional, people turned to what was available and usable to share information and testimony with each other and the world at large about what was happening."
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     },
     {
          "head": {
               "n": "2.4.",
               "text": "Maps, collaborating and virtual organizations",
               "type": "modelling"
          },
          "paragraphs": [
               "Maps, like letters and books, have undergone the same evolution from practices that were in place for centuries, to instantiation via information technologies and systems of geospatial technologies (GSTs) that enable virtual collaboration. As information-rich simulations, models and visualizations, maps are essential problem-solving and collaborative tools for understanding the complex dynamic systems of our world.",
               "Maps have been traditionally understood as legal contracts, political statements, historical documents and works of art. Like books, maps are often included in library and museum collections, and are considered to be both information repositories and communication tools. There is considerable evidence to support the belief that human use of maps predates any written language , and are found in every human culture . Maps serve as a mode of communication and bridge language barriers across diverse regions, cultures and societies. In a real sense they are universal communication devices, offering great utility for representing any information that has spatial dimensionality, from neural networks to solar systems. Maps are truly pictures worth a thousand words. The recent development of digital geospatial technologies has fundamentally changed the production, maintenance and scope of spatial information in ways that are just as profound as the impact of information technology on letters or books. Similarly, these changes and how they may affect society, human interactions, and the future are not well understood at this time, even as they are changing us, our local and world views, and our work. Like other information systems, maps are highly abstracted representations of reality, using selected attributes of the reality they represent to construct knowledge, illuminate understanding, perform work and communicate . As artifacts of environment abstractions, maps mediate and contextualize communication and interaction, enabling coordination.",
               "Although maps have served as human communication media for centuries, the production and modification of maps has traditionally been slow, laborious and time intensive. Recent advances in geographic information systems and technologies (GISTs) have moved map production to the desktop and the network. This has led to an explosion of activity utilizing these technologies, but the work has largely focused on answering discipline-specific questions within different fields. Initiatives such as the National Spatial Data Infrastructure (NSDI) and the National Map , have aimed at providing consistent and reliable data for research, focusing on information delivery in a direct flow from producers to consumers. Interactive mapping systems such as Google Maps and OpenStreetMap enable the general public to produce, share and use spatial knowledge, leading the recognition of maps as contextualizing, collaborating and coorienting media by the public. GIST has advanced tremendously, with fundamental improvements in accessibility and interactive capabilities, making readily accessible to many technologies that until recently were largely the domain of subject matter experts.",
               "In Wanted: A Concise List of Neurologically Defensible and Assessable Spatial Thinking Skills, Gersmehl and Gersmehl offer a set of ten spatial thinking skills which are cognitively based, three spatio-temporal thinking skills and two spatial model constructs. Their list is solidly grounded in a literature review of nearly 1000 articles from a broad range of scholarly journals dealing with cognitive and neurological research on spatial thinking skills. Based on their review of the literature, they characterize these skills as combining basic cognition of spatial information gained from early childhood with more complex and abstract understanding developed as people grow and learn . In terms of cognitive development, spatial thinking skills are analogous to language skill acquisition in that they begin to develop at a very early age: Neuroscience research, however, is unambiguous about two facts: the human brain does every one of these kinds of spatial thinking more or less automatically, and it begins doing so in very early childhood. Moreover, the skills of spatial thinking, like those of mathematical or verbal reasoning, appear to be at least somewhat cumulative. People who begin to develop mastery of spatial-thinking skills in early childhood will be able to use those skills to acquire and organize additional information throughout their lives . The use of a map-based visual interface for Ushahidi provides an intuitively meaningful collaboration environment.",
               "In 2004 MacEachren and Brewer defined a conceptual framework for studying geocollaboration: a visuallyenabled collaboration using geospatial information through geospatial technologies. The three elements of the framework: visualization of data and information, virtual collaboration, and the use of map-based interfaces for virtual collaboration, are enablers for advances in virtual collaboration. They predicted that developments in geographic information science, and in computer graphics and visualization, suggest that we are on the cusp of a substantial increase in the role of maps, images, and computer graphics as mediators of collaboration, in a range of contexts including scientific inquiry, environmental and urban planning, resource management, and education ).",
               "Couclelis and Monmonier advocate using Spatial Understanding Support Systems (SUSS), a map-based information system, as an analysis and communication tool for resolving contentious land use issues. Interactive scripts allow users to query, zoom, pan or review. SUSS is defined as a problem-structuring system rather than decision-making or decision-support systems, i.e. SUSS is meant to be used for understanding complex or contentious problems from multiple perspectives. The approach is to develop map-based interfaces and use them to test the role of geovisualization in contextualizing problembased scenarios for virtual collaboration . In studies conducted on the use of simulations for teaching and learning, both teachers and students have reported that the use of information visualizations and simulations in a collaborative problemsolving situation can afford a highly engaging, collaborative learning experience that is compatible with multiple information-seeking and problem-solving styles . The importance of visual cues for achieving cooperation and agreement in collaborative actions, either virtual or faceto-face, is well-documented ( . The selection of a map-based, visual interface for the Ushahidi platform meets many of the accessibility challenges presented by the participants in an emergency event.",
               "participation in community development in Cape Town, South Africa ) have been based on the FrontlineSMS API used for Ushahidi as well. Emerging technologies such as wearable mobile devices ( ) that access cellular networks; and mobile video systems deployed from moving vehicles that capture video of buildings and structures, then use orthorectification 3 software to render three dimensional map images suitable for display ) suggest new capabilities. As these and other technologies migrate from servers in labs to desktops to laptops to smart phones to wearable devices; and as information system development becomes more and more the province of end users; the potential is ever greater for platforms such as Ushahidi to become even more accessible and ubiquitous, offering communications and connectivity anytime, anywhere."
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     },
     {
          "head": {
               "n": "2.5.",
               "text": "Technology review",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Ushahidi is an example of an emergency response support system enabled by new and emerging technologies. Some of the APIs used for Ushahidi were first used for other purposes, and new geospatial, interactive mapping and social networking tools are entering the marketplace. This short technology review is not comprehensive. These examples are selected to identify a few relevant emerging technology trends.",
               "The first is the CyberTracker software developed by Louis Liebenberg at the University of South Africa to enable Bushman wildlife trackers to record field observations ( ). Liebenberg wrote an icon-driven interface using images of animals instead of text so it could be used by illiterate or semi-literate trackers employed to observe wildlife and record data. In his published research, Liebenberg made it his practice to include his Bushman trackers as co-authors. CyberTracker is installed on a handheld computer and is available as a free download if used for conservation or education purposes. The software has proliferated beyond its original purpose as a software program used in the US called BioKIDS, developed to teach science to school children using a modified version of CyberTracker . A wireless extension to the software was proposed in 2006 to enable data uploads from the field ). The use of a visual interface with minimal text improves accessibility and utilization for a broad range of participants.",
               "A reporting network based on handheld and cellular devices for epidemiological prevention and control in the Congo ), and for managing public This study traces the evolution of Ushahidi from its original implementation during the Kenyan elections unrest in 2007-2008, through subsequent instantiations such as the earthquake in Haiti in 2010 and the recent earthquake and tsunami in Fukushima, Japan. The development of Ushahidi is examined in relation to the theoretical construct of human cognitive stigmergy and its role in the creation and function of information systems and the virtual organizations supported by them. There is a focus on understanding how the development strategies named by Okolloh (crowdsourcing, visualization, mapping, and mobile phone platforms) can be understood as tools to examine the role of MAS-based human cognitive stigmergy in information system development. The Ushahidi platform is used as an example of an improvised, adaptable system development driven by a loose, ad hoc aggregation of highly motivated contributors.",
               "The methodology utilized for the study is a longitudinal case study based on a literature search strategy. The strategy for identifying and analyzing relevant literature uses a modified version of Critical Incident Technique (CIT), and includes contemporary first person accounts, recorded media interviews, news items, journal articles and historical documents. The selection of the data focuses on items recounting the development and use of Ushahidi, its precursors, projects and deployments, plus scholarly articles examining the effects and impacts of Ushahidi initially and as it evolved. Collected items fell into two main groups: (1) scholarly articles and research, and (2) news media reports, first and second person accounts and recorded interviews. Following data collection, a timeline of Ushahidi's development was constructed using the news and media items. For the scholarly articles, content analysis was used to analyze the selected studies."
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "The critical incident technique",
               "type": "relatedwork"
          },
          "paragraphs": [
               "addition to its original application for task analysis and training improvement, today it is also recognized as an effective exploratory and investigative tool ).",
               "The critical incident technique (CIT) is a set of procedures used to identify and analyze critical incidents from a behavioral-cognitive perspective. The technique was developed during WWII by Col. John C. Flanagan to better understand effective and ineffective behaviors for aviation training. The technique is essentially a semistructured interview or questionnaire which asks participants to describe a critical incident in detail, defined by Flanagan as any observable human activity that is sufficiently complete in itself to permit inferences and predictions to be made . The participant may be an actor in the incident or an observer. In contrast to other research methods that may examine normal practices and procedures, CIT focuses on specific incidents which are unusual or outside of the norm to quickly identify problems or opportunities. According to Butterfield et al. CIT started out as a task analysis tool and, although it is still used as such within industrial and organizational psychology, it has expanded its use in counseling psychology, nursing, education, medicine, and elsewhere to also become an investigative and exploratory tool ). Since Flanagan's original publication in Psychology Bulletin, his article has been cited more frequently by organizational and industrial psychologist than any other. CIT has become a standard technique in counseling psychology, and over five decades of use the technique has expanded to measure and improve job performance and professional practice in a wide range of disciplines, including healthcare, education and business, and it has proved to be a robust and reliable research method. Since its development the technique has been applied hundreds of times in dozens of fields, with relatively few and minor changes to Flanagan's original procedure. In"
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     },
     {
          "head": {
               "n": "3.2.",
               "text": "Data collection",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Data collection for this study included searches of newspaper, magazine, website, journal and social networking publications and archives, including: Formal project documentation, such as published statement of mission, vision, goals and objectives; copies of contemporaneous and retrospective communications (e.g. text messages, emails, tweets, meeting minutes), memos, letters, discussion boards, chat rooms, transcribed or recorded telephone/internet conversations, etc.); copies of map and text materials produced and used by the participants; published media reports of events; published interviews with participants.",
               "A multidisciplinary review of scholarly literature in which Ushahidi was a subject of study was undertaken and journal articles from political science, sociology, linguistics and communications, among other fields, were included in the data analysis."
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     },
     {
          "head": {
               "n": "3.3.",
               "text": "Data analysis",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Following data collection, critical incident technique was used as a lens to analyze the series of events and actions that led to the development of the Ushahidi platform. The first step was to construct a timeline based on first person accounts and other information sources. below shows the sequence of events and associated software development activities in phases."
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     },
     {
          "head": {
               "n": "4.",
               "text": "Summary of results",
               "type": "conclusion"
          },
          "paragraphs": [
               "In the course of analyzing the path of Ushahidi's development, it became apparent that human cognitive stigmergy was involved in the function and affordances of the system as well as its development. The activities of the developers on the project are shown to demonstrate cognitive stigmergic self-organization in the context of free open source software development; and the manner of utilization of the Ushahidi software product by end users is shown to exemplify human cognitive stigmergy in the context of virtual communication and collaboration. Based on the VOSS model, the technical and social factors affecting virtual organizations are closely interconnected. Also, the VOSS model offers a convincing explanation for the success of both the Ushahidi platform and the Ushahidi notfor-profit company, in that the criteria the model identifies for an effective virtual organization are present in the Ushahidi not-for-profit company and the Ushahidi ad hoc virtual organization instantiations.",
               "The following quote is from the Harvard University Berkman Center for Internet & Society case study of Ushahidi: \"Far and away the most prominent and successful digital civic campaign was Ushahidi\" . Ory Okolloh initiated the project with the following post to her blog:",
               "Google Earth supposedly shows in great detail where the damage is being done on the ground. It occurs to me that it will be useful to keep a record of this, if one is thinking long-term. For the reconciliation process to occur at the local level the truth of what happened will first have to come out. Guys looking to do something -any techies out there willing to do a mashup of where the violence and destruction is occurring using Google Maps? .",
               "David Kobia and Erik Hersman, two technologists with roots in Kenya, answered Okolloh's request. Leading a small group of volunteers, they designed Ushahidi in one week and launched the initial Ushahidi platform. Ushahidi was originally a mashup or blending of two Internet applications, Google Maps and Frontline SMS ). In its earliest form, Ushahidi used Google Maps mapping services to display manually added text messages and emails to map locations. Ushahidi developers then added FrontlineSMS to the Google Maps interface to allow users to zoom in and view orthorectified satellite photography images of Kenya, and created tools for users to report incidents of violence on the map via mobile phone or Internet browser and to create visualizations of the data.",
               "The FrontlineSMS messaging tool is an open source API released in 2005 that enables users to utilize any computer as a communications hub for simple text messaging via internet or cell phone. FrontlineSMS can operate without an internet connection. It was originally developed to monitor wildlife in nature preserves and parks, and has been adapted for use as to provide healthcare in Africa, the FrontlineSMS:Medic version of the API . FrontlineSMS is free software that turns a laptop and a mobile phone or modem into a central communications hub, allowing users to send and receive text messages with large groups of people through mobile phones. The softwareoriginally developed in 2005 and updated in 2007 -is being used around the world for a wide range of non-profit activities including the sending of market prices and other agricultural data to smallholder rural farmers in Aceh, Cambodia and El Salvador, the dissemination of news in Iraq, the sending of security alerts to fieldworkers in Afghanistan, for human rights work in places such as Zimbabwe, Pakistan and the Philippines, and the running of a rural healthcare network for 250,000 people in Malawi. Because the software can be used on a single laptop computer without the need for the internet, it has been widely adopted among the grassroots non-profit community and nominated for several awards. Real time situation awareness, visualization, verification . The accessibility of the technology is exemplified by the results in Kenya, where 45,000 people worldwide accessed the Ushahidi website in the first month, most of them international; but the greatest value is the ability to mobilize outside help, as demonstrated by the high number of international users.",
               "As can be seen in , Ushahidi was most strenuously tested in the aftermath of the earthquake centered in Portau-Prince, Haiti. One of the biggest challenges was the need to translate messages to and from Haitian Kreyol, French, English, and other languages spoken by emergency workers. Very quickly, Ushahidi was able to crowdsource thousands of volunteer translators: The average turn-around from a message arriving in Kreyol to it being translated, categorized, geolocated and streamed back to the responders was 10 min. In the first week alone more than 1000 people came online to help translate the messages as they arrived . According to the UN, Ushahidi was the only emergency reporting and response service available to people within Haiti following the earthquake and it saved hundreds of lives and directed first aid to tens of thousands . Ushahidi assisted in directing aid through coordinating crowdsourced volunteers participating all over the world: The translators and Ushahidi mappers were both aided by a parallel crowdsourcing effort. Volunteers combined satellite imagery, offline maps and reports from people in Haiti using GPS devices to add thousands of data points to OpenStreetMap, taking the number of labeled roads and landmarks from dozens to thousands in just a few days .",
               "These anecdotes illustrate what Yochai Benkler, a legal and political scholar from Harvard's Berkman Center, calls the 'networked public sphere', the notion that our information environment is characterized by both the potential for many-to-many communications (instead of just one-to-one or one-to-many), and the near elimination of the cost of communication ). Benkler's characterization aligns neatly with Heylighen's framework of stigmergic self-organization."
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     },
     {
          "head": {
               "n": "5.",
               "text": "Conclusion",
               "type": "conclusion"
          },
          "paragraphs": [
               "A study of the evolution of the Ushahidi software presents strong evidence of cognitive stigmergy at two levels. The first level is the development of the Ushahidi platform, both initially and through the creation of the SwiftRiver and CrowdMap enhancements. The development of the software using a Rapid Prototype Model and crowdsourcing on widely available mobile phone platforms follows examples of some FLOSS development teams that have been shown to use cognitive stigmergy as a tool to organize and coordinate ). The utilization of the software by end users as volunteers and contributors demonstrates the role of cognitive stigmergy at the level of group action and virtual collaboration. The occurrences of crowdsourcing also demonstrate human cognitive stigmergy.",
               "The reasons for the success of Ushahidi lie precisely in its raison d'etre: it was conceived as a way for people to give testimony to the world about a crisis they were experiencing. Although the aphorism: Necessity is the mother of invention is apropos, there is more to Ushahidi's inception than simple necessity. Ushahidi was meant to empower, to give voice, and was specifically designed to do so, but a host of underlying technologies were necessary before Ushahidi's 'spontaneous' development could occur. Heylighen and Benkler point out that the inexpensive cost of information via the internet is a major force for the increase in all forms of information, easy access to it and voluntary creation and sharing of forms of it. The combination of easy access, low cost, and a compelling social concern lead to powerful motivations for many to participate. Use of the Rapid Prototype Model meant that the functionality was timely; it could be delivered while there was still an urgent need for it, before the crisis passed and life returned to normal. The use of Visualization and Mapping was crucial. Human cognitive stigmergy is based on people perceiving changes in their environment and responding to them. Visual images and information are more meaningful when the place is not known, but even more powerful when it is. Testimony has more power when it is visualized. The ability to present testimony visually is very powerful to participants, and draws outsiders into the experience. Crowdsourcing as a resource for development, support and the generation of information within the context of emergency response is an example of stigmergic self-organization; and the use of Mobile Phone Platforms via FrontlineSMS effectively maximized crowdsourcing: In Africa, cellphone penetration -the number of phones as a percentage of the population -is still the lowest in the world, but it is growing quickly. In 2010, an estimated 41% of the population on the continent had cellphones, compared with 76% globally. That's double what it . Worldwide, it is estimated that there are five billion mobile phones in use as of 2010, and for many users, these are the only access they have to computing or telecommunications capability .",
               "Heylighen, referring to stigmergic self-organization in open source software development, believes these developments are revolutionizing our society. On the one hand, they put into question one of the foundations of the present-day market economy, the idea that intellectual property is necessary to stimulate innovation. On the other hand, they open up huge opportunities, which include: freely providing software, technical know-how, scientific knowledge and general education to the countries and people that need it most, but can least afford to pay for it; empowering and stimulating ordinary people to be intellectually creative and thus help others; reducing the danger of commercial monopolies that control software standards or news distribution; and creating and distributing information much more quickly and widely than before, when it is needed and where it is needed. . To these should be added the democratization of access to information, volunteerism, altruism, and charity."
          ],
          "paper_id": "241de500-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Stigmergic self-organization and the improvisation of Ushahidi"
     }
]