[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "We study the strategic formation of multi-layer networks, where each layer represents a different type of relationship between the nodes in the network and is designed to maximize some utility that depends on the topology of that layer and those of the other layers. We start by generalizing distance-based network formation to the two-layer setting, where edges are constructed in one layer (with fixed cost per edge) to minimize distances between nodes that are neighbors in another layer. We show that designing an optimal network in this setting is NP-hard. Despite the underlying complexity of the problem, we characterize certain properties of the optimal networks. We then formulate a multi-layer network formation game where each layer corresponds to a player that is optimally choosing its edge set in response to the edge sets of the other players. We consider utility functions that view the different layers as strategic substitutes. By applying our results about optimal networks, we show that players with low edge costs drive players with high edge costs out of the game, and that hub-and-spoke networks that are commonly observed in transportation systems arise as Nash equilibria in this game."
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "text": "The Strategic Formation of Multi-Layer Networks Ebrahim Moradi Shahrivar and Shreyas Sundaram",
               "type": "abstract"
          },
          "paragraphs": [
               "Abstract-We study the strategic formation of multi-layer networks, where each layer represents a different type of relationship between the nodes in the network and is designed to maximize some utility that depends on the topology of that layer and those of the other layers. We start by generalizing distance-based network formation to the two-layer setting, where edges are constructed in one layer (with fixed cost per edge) to minimize distances between nodes that are neighbors in another layer. We show that designing an optimal network in this setting is NP-hard. Despite the underlying complexity of the problem, we characterize certain properties of the optimal networks. We then formulate a multi-layer network formation game where each layer corresponds to a player that is optimally choosing its edge set in response to the edge sets of the other players. We consider utility functions that view the different layers as strategic substitutes. By applying our results about optimal networks, we show that players with low edge costs drive players with high edge costs out of the game, and that hub-and-spoke networks that are commonly observed in transportation systems arise as Nash equilibria in this game.",
               "Index Terms-Multi-layer network formation, NP-hardness, best response network, game theory, Nash equilibrium, transportation networks ?"
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "n": "1",
               "text": "INTRODUCTION",
               "type": "introduction"
          },
          "paragraphs": [
               "E XAMPLES of complex networks abound in both the natural world (e.g., ecological, social and economic systems), and in engineered applications (e.g., the Internet, the power grid, etc.). The topological structure of such networks (i.e., the relationships and interactions between the various nodes) plays a fundamental role in the functioning of the network. Early research on the structure of complex networks primarily adopted a stochastic perspective, postulating that the links between nodes are formed randomly , . An alternative perspective, driven by the economics, computer science and engineering communities, has argued that optimization (rather than pure randomness) plays a key role in network formation. In such settings, edges are formed strategically (either by a designer or by the nodes themselves) in order to maximize certain utility functions, resulting in networks that can be analyzed using game-theoretic notions of equilibria and efficiency , , , . A particularly well-studied utility function is the so-called distance-based utility introduced in , , where the objective is to purchase edges to minimize the distances between all pairs of nodes in the network. Subsequent works on strategic network formation have looked at issues such as individual decision making, price of anarchy, and directed network formation , , , .",
               "While the existing literature on strategic network formation focuses predominantly on the construction of a single set of edges between the nodes, many real-world networks inherently consist of multiple layers of relationships between the same set of nodes. Examples include friendship and professional relationships in social networks, policy influence and knowledge exchange in organizational networks , and coupled communication and energy infrastructure networks , . While there has been growing research on different aspects of multi-layer networks in recent years , , , , , , the problem of strategic multilayer network formation has started to receive attention only recently; aside from our initial work in , the paper considers a model where each node can construct edges to a second high-speed network in order to minimize communication costs.",
               "Here, we begin a study of strategic multi-layer network formation by generalizing distance-utility network formation to the case where one layer (or network) is formed by optimizing the distances between nodes that are neighbors in another layer (or network). As a motivating example, consider the problem in , where both the physical infrastructure network and the traffic flow network between a group of cities are studied. Interpreting traffic flow as the weight of the connection between the endpoint cities, the objective is to design an optimal infrastructure network between cities with respect to the given traffic flow pattern. In the simplest case, this problem can be modeled as a network formation problem with a distance-based utility function where only the distances between specific pairs of nodes matter (i.e., those pairs with sufficiently high traffic flow between them). We address this class of problems by first defining a network G 1 capturing an existing set of relationships between nodes, and then studying the formation of an optimal second network G 2 based on G 1 . We call the optimally designed network G 2 with respect to G 1 the best response network (BRN) to G 1 . Distance-based utilities have also been used to study social networks (where each node is an individual and the edges indicate relationships) , and the Internet (where each node represents a router and the edges indicate communication links) . Our formulation generalizes the settings presented in those papers by allowing only distances between certain pairs of nodes (e.g., individuals in the social network or routers in the Internet) to matter when evaluating the utility of the network. For instance, in the case of the Internet or other communication networks, the reference layer G 1 represents the virtual communication network indicating which pairs of nodes wish to exchange information, and the designed layer G 2 represents the physical communication network.",
               "While the best response networks have been completely characterized in the case where G 1 is the complete network , , we show in this paper that finding a best response network with respect to an arbitrary graph G 1 is NP-hard. We characterize some useful properties of the optimal networks that arise in this setting, including upper bounds on the number of constructed edges, lower and upper bounds on the utility of the best response networks, and conditions for the empty network to be a best response. These properties enable us to find best response networks with respect to certain specific reference networks, i.e., forests and networks with a star subgraph.",
               "We then use the notion of the best response network to model a scenario with multiple network designers, each of whom is building a different layer of the network. An example of this is when multiple transportation companies build their individual service networks among a group of cities, and each company prefers to provide service between pairs of cities that are not already covered by other companies. We capture these scenarios by defining a non-cooperative multi-layer network formation game where each player corresponds to a specific layer of the network. We develop a notion of distance-based multi-layer network formation based on strategic substitutes, where the presence of an edge in one layer makes it less desirable to have that edge in another layer. Despite the complexity of calculating best response networks, we characterize the Nash equilibrium networks that arise in this setting. In particular, we show that players with low costs for building edges drive out players that have relatively high costs, and that our framework gives rise to the \"hub-and-spoke\" networks commonly seen in various transportation systems . graph is connected if there is a path from every node to every other node. A subgraph",
               "0 is connected and there are no edges in G between nodes in N 0 and nodes in N n N 0 . A tree is a connected acyclic graph. For a connected graph G ? ?N; E?, a connected acyclic subgraph T ? ?N; E T ? of G is called a spanning tree of G. A spanning forest of a disconnected graph is a collection of spanning trees of each of its components.",
               "We denote the complete graph (i.e., the graph with an edge between every pair of different nodes) by G c ? ?N; E c ?. We use G e ? ?N; f? to denote the empty graph. Finally, G s ? ?N; E s ? is a star graph, which is a tree graph with one node that is connected to all other nodes. The complement of graph G ? ?N; E? is denoted by $ G ? ?N; $ E?, where $ E , E c n E. Two graphs on the same set of nodes are said to be disjoint if their edge sets are disjoint."
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "n": "3",
               "text": "DISTANCE-BASED UTILITY",
               "type": "introduction"
          },
          "paragraphs": [
               "A canonical problem in network formation introduced by Jackson and Wolinsky involves distance-based utilities . In this model, there is a net benefit of b?k? for each pair of nodes that are k hops away from each other in the network, where b : f1; 2; . . . ; n ? 1; 1g ! R !0 is a real-valued nonincreasing nonnegative function (i.e., nodes that are further away from each other provide smaller benefits) and b?1? ? 0. There is a cost c 2 R > 0 for each edge in the network. The outcome of the network formation process is a graph G ? ?N; E? 2 G N . The utility (or value) of a given graph G 2 G N is given by the utility function"
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "n": "2",
               "text": "DEFINITIONS",
               "type": "modelling"
          },
          "paragraphs": [
               "An undirected network (or graph) is denoted by G ? ?N; E? where N ? fv 1 ; v 2 ; . . . ; v n g is the set of nodes (or vertices) and E f?v i ; v j ?jv i ; v j 2 N; v i 6 ? v j g. The set of all possible graphs on N is denoted by G N . Two nodes are said to be neighbors if there is an edge between them. The degree of a node v i 2 N is the number of its neighbors in graph G, and is denoted by deg i ?G?. A leaf node is a node that has degree one, i.e., it has only one neighbor. A path from node v 1 to v k in graph G is a sequence of distinct nodes v 1 v 2 ? ? ? v k where there is an edge between each pair of consecutive nodes of the sequence. The length of a path is the number of edges in the sequence. We denote the shortest distance between nodes v i and v j in graph G by d G ?i; j?. If there is no path from v i to v j , we take d G ?i; j? ? 1. The diameter of the graph G is max v i ;v j 2N;v i 6 ?v j d G ?i; j?. A cycle is a path of length two or more from a node to itself. A graph",
               "In this formulation, there is an inherent trade-off faced by the designer: adding links to a larger number of nodes provides a larger benefit (by reducing the distances between nodes), but also incurs a larger cost invested in links. An optimal (or efficient) network G satisfies u?G? ! u?G 0 ?, 8G 0 2 G N . The following result from , shows that when b??? is a strictly decreasing function, there are only a few different kinds of efficient networks, depending on the relative values of the link costs and connection benefits. Proposition 1. Assume that b??? is a strictly decreasing function. In the distance-based utility model, if c < b?1? ? b?2?, then the complete network is the unique efficient network; if b?1? ? b?2? < c < b?1? ? ?n ? 2?b?2?=2, then the star is the unique efficient network; if b?1? ? ?n ? 2?b?2?=2 < c, then the empty network is the unique efficient network.",
               "In the above proposition, whenever c is equal to one of the specified upper or lower bounds, there will be more than one efficient network: if c ? b?1? ? b?2?, then the complete network and star network are both efficient, and if c ? b?1? ? ?n ? 2?b?2?=2, the star network and the empty network are both efficient networks with zero utility. Furthermore, for the more general case where b??? is nonincreasing, the three networks given by the above result are still optimal for the corresponding ranges of costs and benefits, although they may no longer be unique.",
               "In the next sections, we will generalize the distance utility framework to the two-layer network formation setting. We will characterize the complexity of determining efficient networks in such settings and provide properties of such networks. We will then apply these results to study a multi-layer network formation game with multiple network designers. . Illustration of potential best response networks with respect to network G 1 ."
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "n": "4",
               "text": "TWO LAYER DISTANCE-BASED UTILITIES: BEST RESPONSE NETWORK",
               "type": "modelling"
          },
          "paragraphs": [
               "In the traditional distance-based network formation problem described above, the objective is to minimize the distances between every possible pair of nodes. However, in many settings, one is only interested in minimizing distances between certain pairs of nodes. For example, consider a communications system where each node only wishes to exchange information with a subset of the other nodes, and the task is to design a physical network to provide short paths between those pairs of nodes. To handle these types of scenarios, in this section we generalize the study of distance-based network formation to a multi-layer setting. Specifically, suppose that we have a layer (or graph)",
               "where the edge set E 1 specifies a type of relationship between the nodes in N. Our objective is to design another layer (or graph) G ? ?N; E? on the same set of nodes, where the utility of the graph is given by",
               "Note that the summation is only over edges in set E 1 , capturing the fact that only distances between those pairs of nodes matter in graph G; the traditional distance utility function in (1) is obtained as a special case when G 1 is the complete graph. Assume G 2 ? ?N; E 2 ? is a network that maximizes (2); we say G 2 is a best response (BR) network to G 1 , or equivalently, an efficient network with respect to the utility function (2).",
               "3) Any subgraph of G 1 with k edges, where k < 5, has utility k?b?1? ? c? ? k. Thus, when b?5? > , the best subgraph of G 1 is the path graph with the utility given above. Now, the star graph shown in has utility 2b?1? ? 4b?2? ? 5c. This is better than the path graph if 4b?2? ? 3b?1? > b?5?, which holds, for example, when b?2? is sufficiently close to b?1? and b?2? > b?5?. Therefore, for utility functions that satisfy this property, no subgraph of G 1 can be a BR to G 1 .",
               "For certain benefit functions a star is not a BR either. The graph G 3 given in has utility 4b?1? ? 2b?3? ? 5c. This is better than the path graph if 2b?3?? b?1? > b?5?, and better than the star if b?3? > 2b?2? ? b?1?. For instance if c ? 1, b?1? ? 1:01; b?2? ? 0:85; b?3? ? 0:8; b?4? ? 0:2 and b?5? ? 0:1, then the graph G 3 is better than the star graph or any subgraph of G 1 , i.e.,",
               "In this example, one can verify (e.g., using a brute-force search) that G 3 is in fact a BR network to G 1 .",
               "It is also instructive to consider the case where b?1? ? b?2? ? b?3? > maxfc; b?4?g. In this case, the graphs shown in Figs. 1b and 1c are both best response networks to G 1 and have higher utility than any subgraph of G 1 .",
               "Remark 1. The utility function (2) does not necessarily have a unique maximizer; indeed, in many cases, there are multiple best response networks with respect to a given network, as demonstrated by Example 1 below.",
               "When G 1 is the complete network, the best response is trivially a subgraph of G 1 . However, the following example demonstrates that the best response network to a general network G 1 does not necessarily have to be a subgraph of that network.",
               "The above example illustrates that BR networks to an arbitrary graph G 1 are very sensitive to the relative values of the benefit function b??? and the cost c. Indeed, the shape of the entire benefit function can play a role in determining the best response to general graphs, whereas only the value of b?1? and b?2? matter when G 1 is the complete graph (as shown in Proposition 1). One of the main results of this paper is to formally characterize the complexity of finding a best response network to a given graph. To do this, we first cast it as a decision problem (i.e., a question to which the answer is yes or no) as follows. ",
               "Assuming that the input size to a problem is n, if there is an algorithm that solves the problem in O?n k ? time (for some positive constant k), the problem is said to be in the complexity class P. A decision problem is said to be in the class NP if every \"yes\" answer has an accompanying certificate that can be verified in polynomial-time. Consider two decision problems A and B and assume that there exists a polynomial-time transformation from any instance b of problem B into some instance a of problem A such that the answer to b is \"yes\" if and only if answer to a is \"yes\". If such a transformation from B to A exists, it is called a reduction and problem B is said to be polynomial-time reducible to problem A. A problem A is NP-hard if for all problems B 2 NP, B is polynomial-time reducible to A; in particular, A is NP-hard if some other NPhard problem B is polynomial-time reducible to A . An NP-hard problem that is also in the class NP is said to be NP-complete. The following theorem is one of our main results and shows that finding a BR with respect to an arbitrary graph with arbitrary cost and nonincreasing benefit functions does not have a polynomial-time solution, unless the answer to the long-standing open question of whether P = NP is affirmative.",
               "Proof. Let u and v be two nodes that are neighbors in G 1 . By way of contradiction assume that there is no path between u and v in the BR network",
               "contradicting the assumption that G 2 is a BR network. Now consider the case that u and v are connected through a path in G 1 . Then there must be a path from u to v in G 2 , since we showed that any two nodes that are directly connected in",
               "Remark 2. When b?1? ? c, the above proof can be applied to show that there exists a best response network in which any two nodes that are connected by a path in G 1 will also be connected by a path in G 2 (although this does not have to be true of every best response network).",
               "We will develop the proof of Theorem 1 over the rest of this section. We will require some intermediate properties of best response networks, given by the following results.",
               "y? t for all ?x; y? 2 E 1 , i.e., the distance between each pair of nodes that are neighbors in G 1 is not more than t in H . A subgraph T ? ?N; E T ? of the graph G 1 that is both a t-spanner and a tree is called a tree t-spanner (TtS). The following important lemma characterizes a BR to graphs that have a 2-spanner."
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "n": "4.1",
               "text": "Some Properties of Best Response Networks",
               "type": "modelling"
          },
          "paragraphs": [
               "then the number of edges in G 2 is less than or equal to the number of edges in G 1 . If b?1? > b?2?, then G 1 and G 2 have an equal number of edges if and only if",
               "Proof. We use contradiction to prove the first part. Suppose that G 2 is a BR and has more edges than G 1 . Then",
               "Proof. Assume that G 1 has m components where m ! 1.",
               "Since F is a spanning forest, jE F j ? jNj ? m. Using the fact that d F ?x; y? 2 for all ?x; y? 2 E 1 , we have",
               "which contradicts our assumption that G 2 is a BR to G 1 . To prove the second part, note that if G 2 ? G 1 then the number of edges in G 2 and G 1 are equal. So we only need to show that when b?1? > b?2?, if the number of edges in G 2 is equal to the number of edges in G 1 , then ",
               "?jNj ? m??b?1? ? c? ? ?jE 1 j ? ?jNj ? m??b?2?",
               "The next lemma discusses the connectivity of BR networks.",
               "Lemma 2. Suppose that G 2 is a best response network to G 1 and b?1? > c. Then any two nodes that are connected by a path in G 1 will also be connected by a path in",
               "The next lemma provides lower and upper bounds on the utility of BR networks when b?1? ? b?2? c b?1?.",
               "1. Whenever G 1 is a connected network, by a spanning forest of G 1 we mean a spanning tree.",
               "Lemma 4. Suppose that b?1? ? b?2? c b?1? and G 2 ? ?N; E 2 ? is a BR network with respect to an arbitrary connected network",
               "This means that T is a subtree of G 1 and d T ?x; y? 4 for all ?x; y? 2 E 1 . Thus we have that",
               "Proof. The lower bound follows from the fact that u?G 2 jG 1 ? ! u?G 1 jG 1 ? ? jE 1 j?b?1? ? c?, by virtue of G 2 being a BR network. For the upper bound, note that since b?1? ! c, G 2 can be assumed to be a connected graph (by Lemma 2 and Remark 2) and thus jE 2 j ! jNj ? 1. The rest of the proof follows the same procedure as in the proof of Lemma 3 with m ? 1. t u",
               "Remark 3. The inequalities given in the above lemma are sharp. As we will show later in this paper, a BR to a tree is the same tree if b?1? ! c. For a tree, the left and right hand sides of inequality are equal. Also, for a graph G 1 with a tree 2-spanner T , we know that T is a BR to G 1 by Lemma 3 with utility equal to the right hand side of inequality (6).",
               "Note that we used the fact that b?2? ? b?3? ? b?4? to go from the first line to the second line in the above equation. Therefore, the answer to the defined instance of the BRN problem is also \"yes\".",
               "To complete the proof, we have to show that if the answer to the constructed instance of the BRN is \"yes\", then the answer to the instance of the TtS is \"yes\". In other words, we have to show that if there exists a graph"
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "n": "4.2",
               "text": "Proof of NP-Hardness of the BRN Problem",
               "type": "modelling"
          },
          "paragraphs": [
               "We now return to the BRN problem (Definition 1) and the claim of NP-hardness given in Theorem 1. To prove this theorem, we will construct a reduction from the Tree t-spanner Problem , defined below. where b??? and c satisfy and r is given by (8), then G 1 has a tree 4-spanner. We claim that any G 2 with utility at least r must be a tree 4-spanner of G 1 .",
               "Assume that G 2 ? ?N; E 2 ? is a graph with u?G 2 jG 1 ? ! r. Since r is equal to the upper bound of the utility of the BR (by Lemma 4), G 2 must be a best response to G 1 . Since b?1? > c, by Lemma 2 we know that G 2 is a connected graph. Therefore, jE 2 j ! jNj ? 1. First consider the case that jE 2 j > jNj ? 1. Then similar to Equation The TtS problem is in P for t ? 2, but NP-complete for all t ! 4; the complexity of the problem for t ? 3 is still unknown . We are now in place to prove Theorem 1.",
               "Proof of Theorem 1. We will construct a reduction from the TtS problem to the BRN problem, which will then imply that the BRN problem is NP-hard. Consider an instance of the TtS problem with graph G ? ?N; E? and t ? 4. Any spanning tree of G with jNj 5 is a tree 4-spanner which is easy to find. Thus, we assume that jNj ! 6. Define the corresponding instance of the BRN problem as follows.",
               "The network G 1 ? ?N; E 1 ? is the same as the graph G, i.e., G 1 ? G. The benefit function b??? and edge-cost c are chosen to satisfy which is a contradiction. Thus consider the case that",
               "b?1? > b?2? ? b?3? ? b?4? > b?5?; b?1? ? b?2? < c < b?1?:",
               "? g?b?1? ? c? ? ?jNj ? 1 ? g??b?2? ? c? ? ?jE 1 j ? ?jNj ? 1??b?2?:",
               "For example c ? 2, b?1? ? 3, b?2? ? b?3? ? b?4? ? 2 and b?k? ? 0 8k ! 5 satisfies these conditions. Finally set If g < jNj ? 1, since b?1? ? c > b?2? ? c, by Equation we have that",
               "Clearly we can construct the above BRN instance in polynomial time. Now assume that the answer to the instance of the TtS problem is \"yes\", i.e., graph G has a tree 4-",
               "which is again a contradiction. Therefore, jE 2 \\ E 1 j ? g ? jNj ? 1. This means that G 2 is a subtree of G 1 . Now will show in Proposition 3 in Section 6, G 3 is a best response network to G 1 . We have",
               "?n ? 1??b?1? ? c? ? ?n ? 2?b?2? 2?n ? 2??b?1? ? c? ? b?2? ? 1: . Performance of a greedy algorithm. Graph G 1 in (a) is the reference network. Graph G 2 in (b) is the output of the greedy algorithm discussed in Example 2. Graph G 3 in (c) is a best response to G 1 .",
               "if there exists ?u; v? 2 E 1 such that d G 2 ?u; v? > 4, then we have Note that the same conclusion is reached even if we start with the complete graph, i.e., we can remove the edges in such a way that we end up in network G 2 . Thus this greedy algorithm can perform arbitrarily poorly in comparison to the optimal solution.",
               "An important avenue for further research is to find approximation algorithms (and achievable approximation ratios) for the BRN problem.",
               "< ?jNj ? 1??b?1? ? c? ? ?jE 1 j ? ?jNj ? 1??b?2? ? r;"
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "n": "4.3",
               "text": "Comparison to Other Network Design Problems",
               "type": "modelling"
          },
          "paragraphs": [
               "where the last inequality follows from the fact that b?2? ? b?3? ? b?4? > b?d? for all d > 4. Therefore, for all ?u; v? 2 E 1 , d G 2 ?u; v? 4 which means that G 2 must be a tree 4-spanner for the graph G 1 . Thus the answer to the instance of the TtS problem is \"yes\". This shows that the NP-hard problem TtS (for t ? 4) is polynomial-time reducible to BRN, and therefore BRN is NP-hard.",
               "t u",
               "There are certain NP-hard optimization problems (e.g., minimum vertex cover) whose solutions can be approximated to within a constant factor by simple greedy algorithms . The following example considers a natural greedy algorithm where edges are added or removed one at a time, and shows that this algorithm can produce results that are arbitrarily far away from the optimal network.",
               "Example 2. Consider a greedy algorithm where at each step, we add or remove a link that provides the highest increase in the utility until no further improvements can be made. The following scenarios illustrate the pitfalls of such an algorithm. Consider a reference network G 1 . Suppose we attempt to build a BR network by starting with an empty network G and repeatedly adding edges. If b?1? < c, then adding any single edge to G will result in negative utility, and thus the algorithm stops with the empty network. Since there can exist nonempty BR networks when b?1? < c whose utility is unbounded in n (e.g., see Proposition 1), the network produced by the above algorithm can be arbitrarily bad in comparison to the true BR network. Now suppose that we attempt to build a BR network by starting with the reference network G 1 and removing edges one at a time. Consider the graph G 1 depicted in and define c ? 1, b?1? ? The problem of optimally designing networks is classical in the computer science and algorithms literature. Perhaps the most common instance is the minimum spanning tree (MST) problem which is to find a spanning tree of a weighted graph that has the least overall weight; there are greedy algorithms that solve MST in polynomial time . Here, we compare the BRN problem to two canonical network design problems that also attempt to minimize distances between pairs of nodes: the Optimal Communication Spanning Tree (OCST) problem introduced in , and the Simple Network Design problem (SNDP) introduced in .",
               "In the OCST problem, for each pair of nodes v i ; v j 2 N, there is a communication requirement r ij 2 N. The goal of the network designer is to construct a tree T on the node set N such that P i6 ?j r ij d T ?i; j? is minimized. This problem is polynomial-time solvable for any set of r ij .",
               "In the SNDP problem, one is given an undirected graph G ? ?N; E? and a criterion C 2 N. The objective is to determine if there exists a subgraph G 0 ? ?N; E 0 ? of G with at most jNj ? 1 edges such that P i6 ?j d G 0 ?i; j? C. It was shown in that this problem is NP-complete.",
               "The relationships between the BRN, OCST and SNDP problems are as follows. Starting with G 1 , removing any of the edges increases the utility by b?2? ? ?b?1? ? c?. Thus any edge is a candidate for removal. Consider removing the edge ?v 1 ; v 2 ? which results in network G 2 . Now no further improvements are possible by adding or removing a single edge. Next, consider network G 3 shown in the . As we",
               "The OCST and SNDP problems explicitly constrain the number of edges in the designed network, whereas the BRN problem includes the cost of edges in the utility function. The SNDP problem requires the designed network to be a subgraph of another given network, whereas the BRN and OCST problems place no such constraint. The objective of the SNDP problem is to minimize the sum of distances between all pairs of nodes, whereas the BRN and OCST problems allow the objective function to only depend on distances between selected pairs of nodes (the OCST problem does this by setting r ij ? 0 for those pairs that do not wish to communicate). Despite the apparent similarities between the BRN problem and the OCST problem, Theorem 1 shows that the BRN problem is NP-hard, even though the OCST problem can be solved in polynomial-time. This increase in complexity is a byproduct of the additional flexibility afforded by the general nonincreasing benefit function in the BRN problem (as opposed to the scaled distances in the utility function for the OCST problem), which allows it to capture the treet-spanner problem as a special case.",
               "In the next section of this paper, we will characterize further properties of BR networks; these will allow us to find BR networks with respect to certain specific classes of graphs, which in turn will allow us to formulate and study a multi-layer network formation setting with multiple network designers.",
               "of Proposition 1 (obtained in ) as a special case of Lemma 7. Suppose that G 1 ? ?N; E 1 ? is a tree. Since any induced subgraph of a tree is a forest (it is a tree when the subgraph is connected), we have jE G 1 ?S; S?j jSj ? 1 for any non-singleton S N. Thus"
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "n": "5",
               "text": "FURTHER PROPERTIES OF BEST RESPONSE NETWORKS",
               "type": "modelling"
          },
          "paragraphs": [
               "The proofs of all results in this section are given in Appendix A. The following lemma considers the case when there are isolated nodes in G 1 .",
               "This means that a ? 0 (which happens for any S that induces a connected subgraph on G 1 ). Therefore, we can conclude that the BR network to a tree is the empty network when c > b?1?. Consider a cycle graph G 1 ? ?N; E 1 ? with n nodes.",
               "3 Any induced subgraph of G 1 on a nonsingleton node set S & N is an acyclic graph and thus jE G 1 ?S; S?j jSj ? 1. For S ? N, we have",
               ", and the BR network to G 1 is the empty network for c > b?1? ?",
               "The properties described above are independent of the relative values of the benefit function and edge costs. The following set of results provide more details of the BR networks for certain ranges of benefits and costs. n?1 b?2?. Remark 4. Note that when b?2? ? 0, Lemma 7 indicates that for b?1? > c, G 1 is a unique BR to itself (for any network G 1 ), and when b?1? < c, the empty network is a unique best response (both G 1 and the empty network are best responses with utility 0 when b?1? ? c). Thus, in the rest of the paper, we will assume that b?2? > 0.",
               "Lemma 7. Let G 1 ? ?N; E 1 ? be an arbitrary graph.",
               "1) If b?1? ? c > b?2?, then the unique BR network to G 1 is G 2 ? G 1 . 2) If b?1? < c, then G 1 is not a BR network to G 1 , unless G 1 is the empty network."
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "text": "3) Define",
               "type": "modelling"
          },
          "paragraphs": [
               "In the next lemma, we consider the case that we have nodes with degree one in the graph.",
               "Lemma 8. Let G 1 ? ?N; E 1 ?, and suppose v 2 N is a leaf node. Define the induced subgraph of G 1 under the node set N n fvg as G 11 ? ?N n fvg; E 11 ? (i.e., the graph obtained by removing node v and its incident edge). Then a BR to G 1 can be obtained by first finding a BR to G 11 and then adding v as an isolated node if b?1? c, or adding v together with a single edge to its neighbor in G 1 if b?1? ! c.",
               "where E G 1 ?S; S? denotes the set of edges in G 1 that have both of their endpoints in the set S, i.e., E G 1 ?S; S? ? E 1 \\ ?S ? S?. If c > b?1? ? ab?2?, then the unique BR network with respect to G 1 is the empty network.",
               "The parameter a is a measure of the edge density of the underlying graph, and thus the threshold to have the empty network as the best response network increases as the underlying graph becomes more dense. The following example illustrates the implication of a for various graphs.",
               "The above lemma provides the following method to simplify the task of finding a best response network. Given a graph G 1 , we recursively remove nodes of degree 1 until we are left with a graph where all nodes have degree two or larger (this is known as peeling the graph, and the resulting subgraph is known as a 2-core ). A best response to the 2-core can then be found using whatever means necessary, and then the removed nodes can be recursively added back as isolated nodes (if b?1? c), or with the single edge that was removed (if b?1? ! c).",
               "Example 3. In the following, we define jNj ? n."
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "n": "6",
               "text": "BEST RESPONSES TO SPECIFIC NETWORKS",
               "type": "modelling"
          },
          "paragraphs": [
               "Assume that G 1 ? ?N; E 1 ? is the complete graph.",
               "for any (non-singleton) S N and thus a ? n?2 2 in Equation (10). This",
               "We will now apply the above results to characterize best responses to acyclic networks and networks with a star subgraph. The latter models, for example, sensor or communication networks where one or more base stations or fusion 2. There exist efficient algorithms to find maximally dense subgraphs in networks .",
               "3. A cycle graph with n nodes consists of only one cycle of length n.",
               "centers wish to communicate with all nodes, while the other nodes only need to communicate locally amongst themselves. The proofs of the following two propositions are provided in Appendix B. functions A i . Here, as a starting point for studying such games, we will focus on distance-based utilities (thereby building on our results from the first part of the paper). The reference networks for the distance-based utility function for each player will depend on the networks constructed by the other players. In the remainder of the paper, we will explore functions that view different layers of the network as strategic substitutes, where the presence of a link in one layer makes it less desirable for that link to appear in another layer; this captures the notion that the different network layers are attempting to fill gaps in connectivity left by the other layers. As a motivating example, consider competing transportation companies offering services between a common set of cities. Suppose that for economical reasons, each company would prefer to design its transportation network to provide short routes between those cities that are not directly serviced by any other company. In other words, each company designs its network with respect to the complement of the transportation networks provided by all other companies. If we impose further structure on such games by assuming distance-based utility functions, we obtain the game defined below. In the following definition, for a set of graphs G j ? ?N; E j ?, j ? 1; 2; . . . ; m, on a common set of nodes, we use the notation [ In the previous sections, we considered the scenario where a network designer chooses an optimal graph (or layer) G 2 with respect to a given graph G 1 . In this section, we will build on this formulation to consider a scenario where multiple network designers are building layers, with a utility for each layer that depends on the structure of that layer and the layers constructed by the other designers. This models, for instance, different mail and courier service companies designing their individual networks to service their customers, or different transportation networks (air, rail, bus) arising between a set of cities , , . We start by defining an m-player game where each player corresponds to one of the layers. ",
               "where the function u i is defined in (2); the benefit functions b i ??? are nonnegative, nonincreasing and satisfy b i ?1? ? 0, and all costs c i are positive. The benefit functions and costs can be different for the different players.",
               "Definition 3. A Multi-Layer Network Formation Game has a set of m players P ? fP 1 ; P 2 ; . . . ; P m g. The strategy space for each of the players is defined to be G N where N ? fv 1 ; v 2 ; . . . ; v n g, i.e., the set of all graphs on node set N. For each i 2 f1; 2; . . . ; mg, let G i ? ?N; E i ? 2 G N denote the action of player P i . The utility of player P i is given by a function The characteristics of the game and the optimal strategies for each player will depend on the form of the utility j?1;j6 ?i G j ? for the utility function (2). Although we showed in Theorem 1 that finding a BR network with respect to this utility function is NP-hard in general, we now show that certain insights can nevertheless be obtained in the multiplayer setting (regardless of the number of nodes and players). To develop our results, we partition the set of players P into three sets: high-cost players S H ? fP i 2 P jc i > b i ?1?g, medium-cost players S M ? fP i 2 P jb i ?1? ! c i ! b i ?1? ? b i ?2?g and low-cost players S L ? fP i 2 P jb i ?1? ? b i ?2? > c i g. We start by considering the case where the game contains lowcost players. . One can also consider a strategic complements version of this class of games where each player wishes to provide short paths between those pairs of nodes that share an edge in each of the other layers. The analysis of such games is relatively straightforward and thus we focus on strategic substitutes in this paper."
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "n": "7.1",
               "text": "Games Containing Low-Cost Players",
               "type": "modelling"
          },
          "paragraphs": [
               "Define the index i 1 as Proposition 4. Suppose jS L j ! 1. Then in every Nash equilibrium, every player in S H chooses the empty network. Furthermore, any vector of disjoint networks ?G 1 ; G 2 ; . . . ; G m ? forms a Nash equilibrium when fG k jP k 2 S M g is a set of disjoint forests and",
               "Next, define i 2 , max i 2 f1; 2; . . .",
               "Proof. Let ?G 1 ; G 2 ; . . . ; G m ? be any vector of networks in Nash equilibrium. Since there exists at least one player P i whose edge cost satisfies c i < b i ?1? ? b i ?2?, the Nash equilibrium vector must satisfy [",
               ". .",
               ". where i r satisfies i r < k 1 (so that no further sets of this form can be defined). The above indices satisfy 1 i r < i r?1 < ? ? ? < i 1 m. Partition the set of players and nodes as follows ",
               "By Lemma 1, a BR to a graph cannot be a strict superset of that graph, and thus we have that G k is a best response to itself with respect to the utility function of player P k . Now if P k 2 S H , we know from Lemma 7 that G k must be the empty network, completing the first part of the proof. For the second part, note that for any vector of networks satisfying the given properties, Proposition 2 and Lemma 7 indicate that a best response to G k is indeed G k for P k 2 S M [ S L , completing the proof. t u",
               "Also define H 0 ? fP i 1 ?1 ; P i 1 ?2 ; . . . ; P m g and V 0 ? fv i 1 ?1 ; v i 1 ?2 ; . . . ; v n g.",
               "Proposition 5. For each player P j 2 H l (for 1 l r), define the network G j to be the star network centered on node v j with peripheral nodes [ l?1 t?0 V t , where H l and V t are defined as in Equation . For each player P j 2 H 0 , define G j to be the empty network. Then the set of networks ?G 1 ; G 2 ; . . . ; G m ? forms a Nash equilibrium.",
               "The above result shows that the presence of a player with low edge costs (relative to its own benefit function) guarantees the existence of a Nash equilibrium in the game, and furthermore, such low-cost players drive players with sufficiently high edge costs out of the game; the proposition provides the threshold for costs at which this occurs (namely b i ?1? < c i ). Players with medium edge costs, on the other hand, can obtain certain nonempty networks in equilibrium, and the players with low edge costs split all of the remaining edges amongst themselves.",
               "We now study the situation where there are no low-cost players in the game (i.e., S L ? ;). We start by considering games that contain only high-cost players.",
               "The proof of the above proposition is given in Appendix C. The following example illustrates the structure of the Nash equilibrium specified by the above proposition.",
               "Example 4. Suppose that there are eleven nodes and nine high-cost players with k i ? 3 for 1 i 5, k 6 ? 4; k 7 ? 5 and k 8 ; k 9 ! 5. From the equations in (12), we get i 1 ? 7; i 2 ? 5; i 3 ? 3 and i 4 ? 1. demonstrates the networks of players P 1 , P 2 , P 4 and P 6 in the Nash equilibrium defined in Proposition 5. Player P 3 has a similar network to player P 2 (except that the star of her network is centered on v 3 ). Players P 5 and P 7 have similar networks to that of P 4 and P 6 , respectively (the only difference being that player P 5 has a star centered on v 5 , and P 7 has a star centered on v 7 ). Players P 8 and P 9 each have the empty network."
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "n": "7.2",
               "text": "Games Containing Only High-Cost Players",
               "type": "modelling"
          },
          "paragraphs": [
               "Suppose P ? S H (i.e., S L ? S M ? ;). For each player P i 2 P , define the index k i as",
               "Since c i > b i ?1?, we have k i ! 3 for all P i 2 P . If k i > n, by Lemma 7, the empty network is a BR of player P i to any set of networks G ?i (since a in (10) satisfies a n?2 2 for any reference graph). Thus without loss of generality, assume that all players have 3 k i n and players are sorted according to their k i , i.e., k 1 k 2 ? ? ? k m n. We will now partition the set of players P into different sets. Despite the stylized nature of the multi-layer network formation game in Definition 4, it is of interest to note that the \"hub-and-spoke\" networks that arise in the above Nash equilibrium are predominant in real-world transportation systems (airline networks, in particular) , , . While previous work has shown that such networks are optimal in the single-layer setting (e.g., Proposition 1 ), our analysis shows that these structures also arise when players selfishly optimize their individual networks in competitive environments. We will now consider games with a mix of medium-cost and high-cost players, and show that such structures also arise as a Nash equilibrium in that setting. . 4a demonstrates the partition of the set of nodes into six sets. The first set (denoted M) contains nodes that will form the centers of the star networks chosen by the medium cost players P 1 and P 2 . These star networks are depicted in 4(b) and 4(c). The networks of the remaining highcost players have the same structure as the networks shown in , and 3(e), with v 1 and v 2 as isolated nodes. and focus on showing that the subgraph of G j induced by the node set fv m?1 ; v m?2 ; . . . ; v n g is a BR to the graphs ?G m?1 ; G m?2 ; . . . ; G m ? on that node set. This is true by construction, and thus the given set of networks is a Nash equilibrium. t u . A multi-layer network formation game considered in Example 4 with nine high-cost players and 11 nodes. Nodes are partitioned into five sets as shown in 3(a), based on the characteristics of the players. Each node in each of the sets V 1 ; V 2 ; V 3 ; V 4 will be chosen by a different player as the center of a star subgraph in the Nash equilibrium. The Nash equilibrium networks of players P 1 , P 2 , P 4 and P 6 are shown in 3(b), 3(c), 3(d) and 3(e), respectively. The networks of players P 3 , P 5 and P 7 are not shown; they have stars centered on v 3 , v 5 and v 7 , respectively, with the same peripheral nodes as P 2 , P 4 and P 6 , respectively. Players P 8 and P 9 choose the empty network."
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "n": "7.3",
               "text": "Games with Medium and High-Cost Players",
               "type": "modelling"
          },
          "paragraphs": [
               "Proposition 6. Suppose that S L ? ;, and assume without loss of generality that the first m players in P are medium-cost players, with 1 m n. For j 2 f1; 2; . . . ; mg, define the network G j to be the star network centered on node v j with peripheral nodes fv j?1 ; v j?2 ; . . . ; v n g. For the set of high-cost players S H , let ?G m?1 ; G m?2 ; . . . ; G m ? be the Nash equilibrium networks on node set fv m?1 ; v m?2 ; . . . ; v n g defined in Proposition 5. Then the set of networks ?G 1 ; G 2 ; . . . ; G m ? is a Nash equilibrium.",
               "Example 5. Consider a game with thirteen nodes, two medium-cost players (P 1 and P 2 ) and nine high-cost players (P 3 ; . . . ; P 11 ). Assume that the nine high-cost players are the same as the high-cost players in Example 4. Based on Proposition 6, each of the medium-cost players P 1 and P 2 will have a star network centered on node v 1 and v 2 , with peripheral nodes V n fv 1 g and V n fv 1 ; v 2 g, respectively. These networks are shown in Figs. 4(b) and 4(c), respectively. The networks of the remaining players (which have high costs) have the same structure as in Example 4 with two extra isolated nodes, v 1 and v 2 . Once again, we see that hub-and-spoke networks arise as a Nash equilibrium in this setting.",
               "The following corollary immediately follows from Propositions 4, 5 and 6.",
               "Proof. In the proof, we will use the fact that each network G j , 1 j m, only contains edges from node v j to nodes with index larger than j. For each player P j , let G j;ref , S m i?1;i6 ?j G j be the union of the networks of the other players.",
               "Consider a medium-cost player P j , where j 2 f1; 2; . . . ; mg. Since all players with index smaller than j are medium-cost players, for each node v i with i < j, G j;ref contains an edge from node v i to v k for all k > i. Furthermore, G j;ref contains no edge from v k to v j for any k > j. Thus, in the network $ G j;ref , nodes v 1 ; v 2 ; . . . ; v j?1 are isolated, and there is an edge from v j to each node v k with k > j. By Lemma 6, the isolated nodes in $ G j;ref remain isolated in the BR; applying Proposition 3, a star network centered at v j with edges to fv j?1 ; . . . ; v n g is a BR with respect to $ G j;ref . Thus, G j is a BR to $ G j;ref . Now consider a high-cost player P j , where j 2 fm ? 1; m ? 2; . . . ; mg. Arguing as above, nodes v 1 ; v 2 ; . . . ; v m are isolated in the network $ G j;ref . Thus by Lemma 6, those nodes remain isolated in the BR to $ G j;ref . Since this is true for all high-cost players, we can remove the nodes v 1 ; v 2 ; . . . ; v m from consideration, Corollary 1. The multi-layer network formation game with strategic substitutes and distance-utilities has a pure Nash equilibrium for any set of players."
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "n": "8",
               "text": "SUMMARY AND FUTURE WORK",
               "type": "conclusion"
          },
          "paragraphs": [
               "In this paper, we introduced and studied the problem of strategic multi-layer network formation. We generalized distance-based network formation to multi-layer networks, and showed that the problem of finding an optimal network in this setting is NP-hard. We characterized certain properties of optimal networks, and found the optimal networks for certain special cases of reference graphs. Next, we formulated a multi-layer network formation game where each player builds a different layer of the network. When the layers are viewed as strategic substitutes, we showed that the Nash equilibria of the game exhibit certain natural characteristics. Specifically, the presence of low-cost players pushes high-cost players out of the game, and hub-and-spoke networks arise in the Nash equilibrium when there are no low-cost players.",
               "There are many interesting avenues for further research. (1) Deriving approximation algorithms with provable performance guarantees is a natural approach to dealing with the inherent complexity of finding optimal networks; a deeper investigation of the connections between t-spanners and the best response network design problem might lead to such algorithms. (2) Our initial simulations show that sequential best response dynamics converge to the Nash equilibria that we identified in this paper; providing formal proofs of convergence and understanding other non-simultaneous variants (such as Stackelberg games) is an important avenue for research. While we have focused on distance-based utilities with strategic substitutes in this paper, it would also be of interest to study other classes of utility functions in the multi-layer network formation game. (4) A mechanism to incorporate stochasticity and partial information into the network formation process would be of value in modeling and gaining further insights into the formation of realistic networks. the graph. Suppose that the shortest path between some pair of nodes in N n fvg passed through v in G 2 ; the shortest path now passes through v j 1 in G 3 , and is at least as short as the original shortest path. Thus u?G 3 jG 1 ? > u?G 2 jG 1 ? which contradicts the assumption that G 2 is a BR network to G 1 . Therefore, v must be an isolated node in G 2 .",
               "t u For the second property note that if G 2 ? G 1 6 ? f, then u?G 2 jG 1 ? ? jE 1 j?b?1? ? c? < 0 due to the assumption that b?1? < c. Thus it must be the case that G 2 6 ? G 1 , or G 1 is the empty network.",
               "Finally in order to prove the third property, consider an arbitrary graph G 1 ? ?N; E 1 ? with n nodes. By way of contradiction assume that G 2 6 ? f is a BR network with respect to G 1 . Let G 21 ? ?N 1 ; E 21 ? be a component of network G 2 with 1 < jN 1 j n. By Lemma 5, we know that G 21 must be a BR to the subgraph induced by the node set N 1 on G 1 , which we denote by G 11 ? ?N  ? jE 21 j?b?1? ? c ? ab?2??",
               "? jE 21 j jE 11 j jE 21 j ? ?1 ? a? b?2?:",
               "Now, if G 2i is not a BR to G 1i for some i 2 f1; 2; . . . ; kg, replace it with a BR. This will increase the utility, contradicting the fact that G 2 is a BR. t u",
               "Due to the assumption that c > b?1? ? ab?2?, the first term in is negative. Also, we have that"
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "text": "A.2 Proof of Lemma 6",
               "type": "conclusion"
          },
          "paragraphs": [
               "Proof. Let G 2 ? ?N; E 2 ? be a BR network with respect to G 1 , and suppose by way of contradiction that v is not isolated in G 2 . If v is a leaf node in G 2 (i.e., it has a single neighbor), then the edge incident to v is not used in any of the shortest paths between nodes in N n fvg. Removing that edge increases the utility of G 2 by c, contradicting the fact that it is a BR. Now suppose that v has two or more neighbors in G 2 , and denote those neighbors by the set J ? fv j 1 ; v j 2 ; . . . ; v j l g N n fvg with l ! 2. Construct a new network G 3 ? ?N; E 3 ? with",
               "The first inequality above follows from the fact that G 21 is a component and thus has at least jN 1 j ? 1 edges. Thus the second term in Equation  i.e., we remove the l edges from v to its neighbors and add edges from v j 1 2 J to the other nodes in J. This results in a net removal of at least one edge from",
               "Proof. Let the neighbor of v in G 1 be denoted by u, and assume that network H ? ?N; E H ? is a BR to network G 1 . We reason as we did in the proof of Lemma 6, with a few additional details.",
               "Consider the case that b?1? c. Suppose that node v is not isolated in H, and let J ? fv j 1 ; v j 2 ; . . . ; v j l g N n fvg be the neighbors of v in H. If l ? 1 (i.e., v has a single neighbor in H), the edge ?v; v j 1 ? is not used in any of the shortest paths between nodes in N n fvg. Removing that edge saves a cost of c, and loses at most a benefit of b?1? (due to the loss of the path from v to u in H). Since b?1? c, the resulting graph has utility at least as large as H.",
               "Now suppose l > 1. Construct the new network H 1 ? ?N; E H 1 ? with edge set"
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "text": "B.2 Proof of Proposition 3",
               "type": "conclusion"
          },
          "paragraphs": [
               "Proof. The first statement is a direct result of In order to prove the second statement we use Lemma 3. Let G s be the star network centered at node v. Since G s is a 2-spanner tree of G 1 , it is a BR to G 1 . Next, we prove the third statement. Define G s as the star network centered at node v. By Equation  . Arguing as above, the utility of H 2 is at least as high as the utility of H, and thus H 2 is a BR to G 1 . Since the edge ?v; u? cannot be in the shortest path between any pair of nodes in N n fvg, we see that the subgraph of H 2 induced by N n fvg must be a best response to the corresponding subgraph of G 1 . This proves the result. t u u?G 2 jG 1 ? jE 2 j?b?1? ? c? ? ?jE 1 j ? jE 2 j?b?2?:",
               "Using Equations and  According to the assumption of the Proposition, c ? b?1? ! 0 and thus the right hand side of Equation is nonnegative for all jE 2 j ! jNj ? 1. Therefore, the utility of G s with respect to G 1 is as high as any other connected network.",
               "Thus assume that G 2 is a non-empty disconnected network. Suppose that it has g components G 2k ? ?N k ; E 2k ? for k 2 f1; 2; . . . ; gg. Denote by G 1k ? ?N k ; E 1k ?, k 2 f1; 2; . . . ; gg, the subgraphs induced by N k on G 1 . Without loss of generality, let v 2 N 1 . Then, since G 11 contains a star subgraph (centered on v), and G 21 is a BR to G 11 (by Lemma 5) and connected, we can take it to be a star by the above argument. Next, we aim to show that there exists a BR (constructed based on G 2 ) such that all of the components are isolated nodes except G 21 .",
               "Suppose that some component of G 2 (not containing v) has more than one node and take this component to be G 22 without loss of generality. We know that G 22 is a BR to G 12 based on Lemma 5. Arguing as in Equation Proof. When b?1? < c, we use part 3 of Lemma 7. Following the same argument as in Example 3 for trees, we have a ? 0 for G 1 . Thus the unique BR network to a forest is the empty network when b?1? < c. For b?1? ? b?2? > c, the unique best response to any network is the same network by the first part of Lemma 7. For b?1? ? b?2? c b?1?, note that G 1 is a 2-spanner forest of itself, and thus G 1 is a BR to itself by Lemma 3, proving the second statement. Since this BR has a utility of zero when b?1? ? c, the empty network is also a BR for this value of c, proving the third statement.",
               "Finally, we prove the uniqueness of the BR when b?1? > maxfb?2?; cg. If G 1 has r connected components, then jE 1 j ? jNj ? r. By Lemma 2, we must have jE 2 j ! jNj ? r. By Lemma 1, we know that jE 2 j jE 1 j ? jNj ? r. Thus jE 2 j ? jE 1 j and since b?1? > b?2?, we have",
               "If G 22 has zero utility, we can replace it by the empty network and subsequently, we have the result. Thus assume by way of contradiction that it has some positive utility. Therefore, the right hand side of Equation  Now consider a graph ^ G 2 obtained by removing all edges of G 22 and connecting all of its nodes to node v. Since b?1? ? c ? ?jN 2 j ? 1?b?2? > 0 we have,",
               "i?1 N i ; E F ? be a BR to G. Suppose by way of contradiction that F contains a non-empty component F 1 ? ?W; R? with nodes from p different N i where p ! 2. Let G F 1 ? ?W; E F 1 ? denote the subgraph induced by W on G and T be a 2-spanner forest of G F 1 . The spanner forest T has q components where q ! p. Also note that jRj ! jW j ? 1 > jW j ? q. Then we have ",
               "where the first inequality follows from the fact that the induced subgraph of N 1 [ N 2 on ^ G 2 is a connected network and we neglect the benefit (if any) from indirect connections between nodes in N 1 n fvg and N 2 . The second term in the first inequality captures the direct benefits and costs of the jN 2 j edges from nodes in N 2 to v, and the third term captures the benefits due to each pair of nodes in N 2 having a distance of 2 from each other in ^ G 2 (via v). Next, note that where the first inequality comes from the fact that at most jRj pairs of nodes that are neighbors in G F 1 have direct connections in F 1 and the remaining pairs of nodes are at a distance of at least 2 in F 1 . The second inequality is due to b?1? ? c < b?2?.",
               "Inequality means that by replacing F 1 with T , we can increase the utility of network F which is a contradiction to the assumption that F is a BR to G. Therefore, no component of F contains nodes from multiple components in G and thus by Lemma 6, the subgraph of F induced by N i must be a BR to G i for 1 i r, yielding the result. t u",
               "We are now in place to prove Proposition 5.",
               "? ?jN 2 j ? 1??b?1? ? c? ? ?jE 12 j ? ?jN 2 j ? 1??b?2?:",
               "Proof (Proposition 5 a best response of player P j to any of these complete networks is the empty network (by Proposition 1 or Lemma 7). Every induced subgraph of G has a star network on its non-empty components (which means it has a 2-spanner forest). Thus using Lemma 9, the empty network G j is a BR to the network of the other players.",
               "Next, we prove that for player P j 2 H l where 1 l r ? 1, the network G j is a BR to the other players' networks. From the definition of the sets H l in , we have that i l?1 < j i l . Note that G ?$ [ The structure of the network C can be described as a set of complete networks of size n ? i 1 ? 1; i 1 ? i 2 ? 1; . . . ; i l?1 ? i l ? 1; i l ? i l?1 where all of them have the common node v j . These complete networks are on node sets V 0 [ fv j g; V 1 [ fv j g; . . . ; V l?1 [ fv j g; V l . Network G satisfies the condition of Lemma 9 and thus a BR to G can be obtained by finding a BR network to each component. Since of size n ? i 1 ? 1; i 1 ? i 2 ? 1; . . . ; i r?1 ? i r ? 1; i r with the common node v j . These complete networks are on node sets V 0 [ fv j g; V 1 [ fv j g; . . . ; V r?1 [ fv j g; V r . By an argument similar to the one above, since k j ! k 1 > i r and",
               ". . ."
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     },
     {
          "head": {
               "text": ". . .",
               "type": "conclusion"
          },
          "paragraphs": [
               "k j k ir i r?1 ? i r ? 1;",
               "a star network centered on v j with peripheral nodes fv ir?1 ; . . . ; v n g ? [ r?1 the best response of player P j to each of the complete networks on node sets V l?1 ; . . . ; V r in G is the empty network.",
               "Network C has a star subgraph centered at node v j and hence by Proposition 3, there exists a BR network S ? ?[ t?0 V t (i.e., G j ) is a BR to the network of the other players.",
               "Therefore, for each player P j 2 P , G j is a BR to G ?$ [ m t?1;t6 ?j G t and thus the given networks are in Nash equilibrium.",
               "t u l t?0 V t ; E S ? that is a star network centered at node v j with potentially some isolated nodes. Now assume that in the network S, there are edges from v j to a nonempty strict subset of nodes R q & V q for some 0 q l, and the set of nodes in V q n R q are isolated. Note that edges between node v j and the set of nodes R q are only useful for connections between nodes in R q [ fv j g and produces a utility of ACKNOWLEDGMENTS Shreyas Sundaram is the corresponding author. This material is based upon work supported by the Natural Sciences and Engineering Research Council of Canada. A portion of the results in this paper appeared at the 52nd IEEE Conference on Decision and Control .",
               "where the inequality follows from the fact that this graph has utility at least as large as that of the empty network. Now construct a new network S 0 ? ?[ l t?0 V t ; E S 0 ? by connecting a node u 2 V q n R q to v j , i.e., E S 0 ? E S [ f?v j ; u?g. Then we have that u?S 0 jC? ? u?SjC? ? b j ?1? ? c j ? jR q jb j ?2? which must be a positive value by inequality (25). This contradicts the assumption that S is a BR to C. Therefore, for each 0 t l, node v j is either connected to all of the nodes in V t or to none of them. Since",
               "a BR to all of the complete networks on nodes V t [ fv j g in C is the star network for 0 t l ? 1. However, since k j ! k i l?1 ?1 > i l ? i l?1 , the BR to the complete network on the set of nodes V l is the empty network and thus all of the nodes in V l n fv j g must be isolated nodes.",
               "Therefore, we can conclude that a star network centered on the node v j with peripheral nodes fv i l ?1 ; . . . ; v n g ? [ l?1 t?0 V t , and all other nodes being isolated is a BR to the network of the other players; this is precisely the network G j given in the statement of the proposition.",
               "Finally, we have to show that players P j , 1 j i r (i.e., P j 2 H r ) are in Nash equilibrium. As argued above, for player P j , G ?$ [ m t?1;t6 ?j G t consists of complete networks"
          ],
          "paper_id": "24269790-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "The Strategic Formation of Multi-Layer Networks"
     }
]