[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "The micro-macro link is a central issue of human movement sciences because it directly refers to coordination and scalability of movement behaviour at different levels of analysis in a complex system. This aspect of complexity is a key feature to consider decisions and actions as transitional behaviours at different levels during performance. Transitions expressed through bifur-cations are an important part of a universal decision-making process. Phase transitions analysis also provides a means to understand the micro-macro link. In this position paper, we explain how individuals perform decision-making behaviours in a minimal social performance unit (compet-ing dyads), how groups or teams perform decision-making behaviours, and how these two levels are linked, originating system transitions at the macro level, i.e., the team level. Finally we discuss some applications of the understanding of the micro-macro link for the design of training programmes in sport."
          ],
          "paper_id": "2445df60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "The micro-macro link in understanding sport tactical behaviours: Integrating information and action at different levels of system analysis in sport"
     },
     {
          "head": {
               "n": "1",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "The challenge of understanding how individual actions and group or team behaviours emerge during interactions is a foundational issue for several sciences, including sport sciences. Developing understanding of the link between these micro and macro levels of analysis would result in substantial advances in training methods for enhancing dynamic and group-based social cooperation and competition. The result would be a deeper understanding of how individual, dyadic and group behaviours emerge during performance. The micro-macro linkage is a central issue of human movement sciences because it directly refers to problems such as coordination and scalability of behaviours. Conceptualisation of performance at a macro level often seeks to abstract from the individual and synthesize certain features of behaviours of a group of performers (performance, communication, division of labour, etc.). Alternatively it is aimed at enhancing understanding of organizational structures (e.g., in coach leadership and management processes). Also, the macro level is itself a structure, which possesses to a certain degree its own autonomy (cf., the superorganism concept, see Duarte, Arajo, , maintaining such a system beyond individual behaviours ). Apart from the solely individual-oriented (e.g., schema theory; ) or socialoriented theories (e.g., social systems theory, , other approaches, such as ecological dynamics, have the potential to explain the connection between individual actions and social structure. This position paper aims to present ecological dynamics as a framework for explaining the micro-macro linkage in sport behaviours.",
               "The ecological dynamics of behaviour is rooted in an integration of key ideas from Gibsonian ecological psychology and dynamical systems theory ), emphasizing the laws and symmetry conditions at nature's ecological scale of analysis. This approach signifies that behaviour emerges from an environment-performer system, and is not an output determined solely by the ideas, perceptions and actions of an individual. The implication is that cognition (such as strategic and tactical behaviours in sports) cannot be conceived as something that occurs in the mind between a stimulus and the initiation of an action. Cognition is the capacity to use information which is ecologically specific to the control of action , i.e., it is the capacity to actualize affordances (opportunities for action, . In 2006, presented the performer-environment system as a dynamical system coupled by both mechanical forces (action) and information flow fields (perception). From intending-perceivingacting cycles behavioural dynamics emerges (see Arajo, , for applications to sport performance). In this conceptualised system, attractors (stable system regions) are intended states, while repellers are states that the system seeks to avoid, and bifurcations (decision points) give rise to transitions in behaviours.",
               "During intending-perceiving-acting cycles transitions in action modes may emerge. A phase transition is an impressively sudden shift in a system's behaviours. Some time ago, we proposed that decision-making could be explained as a phase transition where initial increases in an identified control parameter have little or no effect on system behaviours . However, at a critical threshold point, small increases in the value of that control parameter can suddenly induce massive changes in system behaviours. Importantly, fine-grained time scales of measurement analysis expose details in the transition itself, uncovering the processes that enable the emergence of decision-making behaviours . If a dynamical system actually allowed extreme parameter changes from one instant in time to the next it would run the risk of oscillating around, rather than settling in a rgime that is moving forward during a phase transition . Accordingly, most dynamical systems that appear to undergo sudden phase transitions from one stable rgime to another, may actually be functioning on a finer time scale than is being measured. The processes that underlie the transition itself are doing so at an iteration-by-iteration scale that has the system spending a number of time steps in a region of parameter space that is in between two identified phases. Importantly, it is the interaction of components at one (micro) scale that allows the phase transition in the other (macro) scale. In this position paper, we explain how individuals perform decision-making behaviours in competing dyads, how groups or teams perform decision-making behaviours, and how these two levels (individual and team) are linked, originating system transitions at the macro level, i.e., the team level. We conclude by discussing some applications of the understanding of micro-macro links for the design of training programmes in sport. Before that, in the next two sections, we discuss how the phenomenon known as 'phase transitions' may explain the micro-macro link of the individual and team decision-making in sport."
          ],
          "paper_id": "2445df60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "The micro-macro link in understanding sport tactical behaviours: Integrating information and action at different levels of system analysis in sport"
     },
     {
          "head": {
               "n": "2",
               "text": "The micro-macro link explained:",
               "type": "introduction"
          },
          "paragraphs": [
               "The process of phase transitions",
               "In this section we provide a detailed explanation of phase transition processes. Due to the interaction among their (microscopic) subsystems, open systems are able to (self) organize themselves by forming coherent, that is, spatially and temporally ordered patterns . The resulting patterns are macroscopic in nature and may be described by a small number of collective variables, conventionally referred to as order parameters, as we observe in this section. In many instances, spontaneous switches between macroscopic patterns occur as non-equilibrium phase transitions in equivalence with similar qualitative, structural changes in dynamical systems (where the term \"phase\" refers to a system's state) . Switches in macroscopic patterns are a hallmark property of self-organization processes, as they involve no \"dedicated organizers\" imposing order from the outside. Phase transitions abound in both the inanimate and animate world, exemplified by spontaneous shifts in gait patterns that are observed when velocity of locomotion gradually increases (e.g. from walking to jogging in humans).",
               "The importance of non-equilibrium phase transitions can be appreciated when it is understood that qualitative changes in macroscopic patterns are accompanied by loss of stability of an original pattern. The stability of a system's state (or phase) is predicated on the notion that every perturbation out of that state causes a system to return to it; when stability is lost, the system does not return but rather switches to another stable state (or phase). Close to points of (macroscopic) instability, the time to return to stability increases tremendously. As a result, the macroscopic state evolves rather slowly in response to perturbation, whereas the underlying microscopic components maintain their individual time scales of behaviour. The implication is that, from the perspective of the slowly evolving macroscopic state, the microscopic components change so quickly that they can adapt instantaneously to macroscopic changes. Thus, even though macroscopic patterns are generated by the subsystems, they order the subsystems or, put metaphorically, they \"enslave\" their generating microscopic structures . Ordered states can always be described by very few variables (at least in the close neighbourhood of macroscopic changes), and consequently the state of the originally high-dimensional system can be summarized by a few, or even a single, collective variable(s): the order parameter(s). The relationship between the subsystems and the macroscopic structure, the latter generated by individual subsystems, and which in turn enslave the individual subsystems, implies a circular causality. This process effectively provides a lowdimensional description of the dynamical properties of system under study ). Next we discuss how these concepts from physics can be used in explanations of decision-making behaviours in sport."
          ],
          "paper_id": "2445df60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "The micro-macro link in understanding sport tactical behaviours: Integrating information and action at different levels of system analysis in sport"
     },
     {
          "head": {
               "n": "3",
               "text": "Transitions in tactical behaviour",
               "type": "introduction"
          },
          "paragraphs": [
               "Transitions among stable performer-environment system states occur as a result of dynamic instability ). This process is the universal decisionmaking process for switching between, and selecting among, polarized states. Therefore, bifurcations function as selection mechanisms. If more functional action solutions exist to fit performance circumstances, fluctuations will help performers discover, and harness them.",
               "In more detail, decision-making or tactical behaviours emerge from the performer-environment system when, during the path of this system, they collapse into a more attractive (stable) state in a landscape of possibilities for action ) available to a system. This process can occur without an explicit involvement of additional inference mechanisms or mediating rules located within the performer, as some organismic-centred theories of decision-making argue. We have previously shown that searching for options (task solutions) during performance takes place within a landscape of attractors, all with various depths or stabilities ). From this viewpoint, the importance of each individual's exploratory behaviours is emphasised as they actively seek to discover functional regions of the attractor landscape of action possibilities to achieve a stable, performance solution. Normally, the strongest attractor is the option to be selected by the performanceenvironment system. If the task is \"familiar\" to the performer, this influence is reflected in the intrinsic dynamics of the individual. That is, the individual, through learning and task experience, becomes perceptually attuned to sources of information that specify goal achievement, making some attractors (conceptualised as affordances) stronger than others. Thus, a selected option is an affordance that is picked up, simply because it emerges as being the strongest attractor at a certain moment during performance (see also Fajen, . Ignoring other options is a dynamical consequence (i.e., a collapse of options), since if a system relaxes to one attractor it concomitantly ignores other remaining options (attractors). That is, an emergent decision is not a consequence of a \"costs-benefits\" balance analysis calculated in a performers' head , but rather a selection that emerges from the continuous interactions of an individual and a performance environment. The fact that there is a stronger attractor does not completely eliminate the influence of other attractors in the dynamic landscape of action possibilities. Under dynamic performance conditions, other attractors (i.e., other options) can emerge and exert their attraction, emphasising the continuous nature of performerenvironment reciprocity.",
               "As mentioned earlier, from an ecological dynamics perspective, the same principles can describe the properties observed at different levels of the system, capturing its fractal nature . This idea has important implications for understanding team sports performance since it captures the interdependence between individual and (sub)group levels of analysis. That is, changes at one level (individual) may influence performance at other levels (sub-groups and the team). Next, we present data from some previous studies that have exemplified how the decision making behaviours of performers (e.g., attackers or defenders in dyads) and sub-groups or teams might be constrained by environmental sources of information, and how all system levels are linked."
          ],
          "paper_id": "2445df60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "The micro-macro link in understanding sport tactical behaviours: Integrating information and action at different levels of system analysis in sport"
     },
     {
          "head": {
               "n": "4",
               "text": "Ecological constraints on dyadic behaviour in sports",
               "type": "introduction"
          },
          "paragraphs": [
               "The work of Lagarde and colleagues ) in boxing captured performers' head motions as the basis to measure patterns of interpersonal behaviours that emerged between competing individuals. Data revealed that despite the random motions of the boxers, head radial distance oscillated between periods of contraction and expansion, which expressed continuous decision-making behaviours, sustained by information that was locally available from the continuous interactive movements of the performers. concluded that preferred modes of interaction (i.e., attractors) in competing boxing dyads could be characterized by the speed of change of head radial distance. Moreover, based on values of the boxers' head velocity, results demonstrated patterns of interactive behaviours between the performers. This observation was supported across a wide set of combined individual actions, leading the authors to suggest the existence of degeneracy in the boxer-boxer system, meaning that different system solutions were found for the same performance outcome ). Similar evidence of emergent decision making behaviours has been reported in studies of sailing, a sport with different task constraints than boxing. Arajo and colleagues ) analysed the interactive behaviours of two competing boats during the start in competitive regattas. Task and environmental constraints, such as wind shift tendencies (intensity and direction), and the positioning of competing boats during the start period, influenced racers' decision-making behaviours. During the starting procedures, each sailor needed to continuously perform adaptive manoeuvres aiming to achieve the most advantageous position at the precise moment of starting the race. A boat's relative position (constrained by the direction and intensity of the wind), at the starting moment, is crucial for gaining an advantage that is related to successful performance in sailing regattas.",
               "In team ball games, such as basketball, futsal, soccer and rugby union, distances between opposing players, between teammates, and distances to a target (basket or goal) are task constraints that provide relevant information to guide players' decision-making behaviours.",
               "Original research in basketball highlighted how a task constraint, like the value of interpersonal distance between an attacker and a defender, bounded their decisionmaking behaviours in relation to the distance of the attacker-defender dyad to the basket To understand these emergent decision-making behaviours, direct manipulation of task constraints has been very informative (e.g., . In basketball, Cordovil and colleagues sought to establish the influence of task constraints, such as specific coaching instructions, on a ball carrier's decision-making behaviours. The results pointed out that conservative coaching instructions constrained the ball carrier to keep the ball for longer, increasing the diversity of dribbling displacement trajectories, and taking more time to cross the mid-line of the court during play. Another important task constraint was the different height relationship that exists in specific attacker-defender dyads (e.g., tall players linked with shorter opponents). Cordovil and colleagues reported that the tallest attackers adopted a more conservative approach to dribble past the defenders (before mid-line court). The authors argued that the tallest attackers tend to gain an advantage as they move closer to the basket, and thus they do not need to take unnecessary risks (e.g., losing ball possession) at a distance from the basket. Individual constraints such as the specific posture of the defender (i.e., right foot advanced, left foot advanced or neutral positioning) have also been observed to influence an attacker's decision on the side to dribble past a defender, in a 1v1 basketball sub-phase ). In addition, the time of exercise throughout a training session has been reported to positively influence the quality of the decision-making behaviours in a 3v3 basketball game. More time on the task (possibly inducing fatigue) was accompanied by a higher shooting efficacy, which with other performance indicators, highlighted the self-organizing, emergent tendencies of team decisional processes .",
               "Still in team sports, several studies have investigated how players regulate their behaviours by using spatialtemporal information about their relative positioning (i.e., interpersonal distances) to the nearest opponent and the goal . The work of Headrick and colleagues (2012) investigated how the proximity to a goal influenced the decision-making behaviours of both a ball carrier and an immediate defender. The task design was a typical 1v1 soccer subphase performed at three different locations on the pitch: i) attacking the goal (i.e., at the edge of the defender's penalty area; ii) in midfield; iii) advancing away from the goal (i.e., at the edge of the attacker's penalty area). Results demonstrated that the players' decisionmaking behaviours were highly constrained by the location on the pitch where the ball carrier-defender interactions occurred. The defenders tended to display more conservative behaviours closer to the goal (i.e., maintaining a higher value of interpersonal distance than when he/she was located further away from the goal). This decision making process was emergent since no specific instructions were provided to any of the participants.",
               "An important task is to search for other variables that synthesize the dynamics of the dyad decision-making behaviours. This empirical strategy has led to the proposal of the angle composed by the attacker-defender vector with respect to the try line, as a key performance variable in rugby union (e.g., . Data from this body of research have highlighted that the decision-making processes of attackerdefender dyads were consistently captured by this variable. Specifically, three different possible attractor states of an attacker-defender system were identified. In the same study, there was a tendency for greater irregularity in the movement of the dyad in successful tackles situations (i.e., providing the basis for a successful move by the defender) and smaller levels of irregularity when tries emerged (i.e., providing the basis for a successful move by the attacker) (see Arajo, for the complete mathematical model).",
               "Examining the role of information manipulation, studies of performance rugby union by Correia, Arajo, Craig and Passos (2011) showed how the manipulation of initial starting locations (i.e., starting values of interpersonal distances) between two defenders near the try line influenced the ball carrier's decision-making, and viceversa. Results demonstrated how changes in the defenders' starting values of interpersonal distance influenced their decision-making. The manipulation consisted of decreasing the space made available, between the defenders. For instance when there was a higher value of interpersonal distance between defenders, they tended to approach each other (i.e., decreasing interpersonal distance) and only after this procedure they moved forward towards the ball carrier. The data from the study of Correia and colleagues is in agreement with other studies in rugby union that showed that the value of interpersonal distance between attackers is a relevant task constraint to explain decision making and action . Decreasing interpersonal distance values seem to move a dyad towards critical performance regions, i.e., regions where contextual dependence is very high . Within these regions other key system parameters tend to exert strong influence over the behaviours of a dyadic system , such as the relative velocity of the competing players. Data have revealed that, if the value of relative velocity is increasing, a performance advantage tends to emerge for an attacker. If, on the other hand, it tends to decrease, a performance advantage often emerges for a defender. These data from previous research have clearly demonstrated how information is locally created and explored by players' continuous interactions during performance. The component parts of a team (the players) do not have any central commander that dictates players' decisionmaking behaviours . The findings clarify how dyadic system behaviours in sport are emergent and predicated on selforganized tendencies. A most important empirical point to observe is that in all studies, no specific performance instructions are provided to participants apart from general information on scoring or preventing scoring within the laws/rules of each game. This empirical requirement in our work ensures that all perceptions, cognitions, decisions and actions are emergent in nature. In the next section we show how team behaviours can be captured, and team decision-making processes understood, following the same principles of ecological dynamics."
          ],
          "paper_id": "2445df60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "The micro-macro link in understanding sport tactical behaviours: Integrating information and action at different levels of system analysis in sport"
     },
     {
          "head": {
               "n": "5",
               "text": "Ecological constraints on team decision-making in sport",
               "type": "introduction"
          },
          "paragraphs": [
               "Team ball sports are comprised by two opposing teams, which interact in order to fulfil their mutually exclusive goals ). These interactive behaviours, within and between teams, lead to the emergence of collective actions that characterise different game sub-phases (e.g., 1vs1, 2vs2, 3vs2). Due to continuous interactions between teammates and opponent players, the totality of behaviours of such a complex system cannot be explained solely by a reductionist assumption of its individual contributions . These macro (team) behaviours are captured by order parameters (i.e., collective variables) that accurately describe a system's patterns of behaviour and their dynamics ). Considering the micro-macro link between levels of analysis, it is apparent that, in contexts of sport performance, the interaction between performers (micro level of analysis) propels transitions between configurations of play (macro level of analysis) ). Remarkably, these transitions express emergent team decisions. Interpersonal dynamics directly influence the emergence of collective patterns of behaviour by destabilizing or (re)stabilizing the state of the system ). Importantly, the coupling between performers (the elements of the system) is based on information as well as by forces ). It is context dependency that guarantees stability of information over time. Therefore, spatial-temporal information can stabilize or destabilize the team-team system depending on the performance context.",
               "Specific constraints like the players' individual characteristics, a team's traditions in a sport, strategy, coaches' instructions, etc., may impact on the goal-directed synergies formed by the players in a team and shape the emergence of a particular performance behaviour. Crucially, in the assembly of synergies, informational constraints shape shared-affordances available to be perceived by interactive agents (e.g., players), reducing the number of independent degrees of freedom and enabling fast, regulating actions . Another feature of a synergy is the ability of one of its components (e.g., a player) to lead changes in others ). Thus, decision-making behaviours of the players forming a synergy should not be viewed as independent. In this context, social interpersonal synergies can be proposed to explain how multiple players can act in accordance with changing dynamic environments within fractions of a second. Therefore, the coupling of players' degrees of freedom into interpersonal synergies is based upon a social perception-action system that is supported by the perception of shared affordances . Next, we present some examples from previous research to illustrate these theoretical ideas.",
               "Bourbousson and colleagues examined space-time patterns of basketball performers by decomposing their displacements into lateral (i.e., side-to-side) and longitudinal directions (i.e., basket-to-basket; see . In this study, oscillatory movement patterns in both lateral and longitudinal directions were analysed during performance in a 5v5 basketball game. Attackers and defenders in dyads exhibited stronger attraction to an in-phase coordination mode for longitudinal displacements, constrained by a man-toman marking system. In contrast to these results, in analysis of 5-vs-4+GK futsal game, Travassos and colleagues ) reported an in-phase attraction, in a lateral direction, but not longitudinal direction, of attacker-defender dyadic system displacements. Specific differences in the constraints of the game of futsal, in comparison to basketball, like the effects of a zonal marking defensive strategy, may explain these different results.",
               "Moreover, in 5vs4+GK Futsal subphases, reported that defenders needed to continuously regulate their velocity in order to intercept opposition passes. Particularly, the values of the distance of the first defender and second defender to the ball, at the moment of pass initiation, acted as informational constraints for the successful interception of the ball. Similarly, in rugby union, passing behaviours have been investigated using a spatiotemporal variable \"tau\". This informational variable equates to changes in the value of the distance of the gap between an attacker and immediate defender . Results revealed that the initial value of tau was correlated with pass distance and pass duration and, consequently, with the type of pass performed (i.e., shorter and longer pass). This finding signifies that the decision on which pass to perform was informed by the closing value of the distance to the defender.",
               "Several attempts have been made to identify collective variables that capture the evolving dynamics of a whole team during performance in sport. For example, in soccer, values of the geometrical centre of the team (i.e., mean positional coordinates of all players in each team), and the surface area of the team (i.e., polygonal covered area of each team), were analysed in a four-a-side game of association football by selecting attacking situations that resulted in goal-scoring opportunities . Results showed a tendency for the geometrical centre of teams (i.e., centroid) to overlap, accompanied by a sudden decrease in surface area of the attacking team or a decrease in surface area of the defensive team. It was also demonstrated that the crossing of centroids between teams, in a longitudinal direction, was related to emergence of goal scoring opportunities. A similar analysis was conducted on performance in 5v5 basketball games. Results indicated a stronger attraction to an in-phase coordination mode of the geometrical centre of both teams, for both lateral and longitudinal directions, with a higher stability in the longitudinal direction ). In the same study, the stretch index, which measures the mean deviation of each player in a team from its spatial centre, indicating the expansion and contraction in space of a team as the game unfolds, revealed an attraction for in-phase coordination in a longitudinal, but not lateral, direction ).",
               "Based on these key ideas from ecological dynamics to explain emergent decision-making behaviours in individuals and teams, in the next section we discuss how individual and team behaviours are linked during performance."
          ],
          "paper_id": "2445df60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "The micro-macro link in understanding sport tactical behaviours: Integrating information and action at different levels of system analysis in sport"
     },
     {
          "head": {
               "n": "6",
               "text": "The interdependence between individual and team decision-making behaviours",
               "type": "introduction"
          },
          "paragraphs": [
               "Dynamical patterns observed in a game are created by the collective behaviours of the individual system elements. But at the same time, the behaviours of each individual element are constrained by the collective behaviours of the whole group. To understand how any selforganized pattern arises in a complex, dynamical system, one needs information about at least three levels ). At the \"upper level\", the team, there are the constraints and parameters that act as boundary conditions on the potential patterns the system may produce. At the \"lower level\" are the individual elements (e.g., the players), each possessing his/her own intrinsic dynamics. At a middle level lie the patterns themselves (match subphases). Each level evolves on its own differing time scale, the upper level evolving most slowly and the bottom level evolving at the quickest rate due to quickly and unpredictably changing constraints between competing individuals. Under given performance constraints, a pattern is formed from the interactions among the elemental subsystems. Importantly, there is no ultimate preferred route or direction (top-down or bottom-up) to understand behavioural patterns in team ball sports, because the idea is to view patterns as a complementary circular relation resulting from mutually reciprocating influences of different scales (both above and below). Interestingly, these principles of soft-assembled (or self-organized) multilevel dynamics in sports teams are in play as they are during individual performer-environment interactions . When individual parts and processes come together to form a team, novel patterns of behaviour arise. As a result of self-organization, the large number of microscopic degrees of freedom is reduced to a much smaller set of relevant collective variables. Thus the information . Scheme of the GK+5vs5+GK small-sided games utilised in the field experiment reported in Duarte, . In the first condition, teams used zone defence, while in the second condition they used man-to-man defence.",
               "needed to describe the system's behaviour is highly compressed. In order to capture the interdependence between individual and collective tactical behaviours in team sports, the cluster phase method was recently introduced in sports sciences ). The cluster phase method was developed to analyse synchrony within systems with a small number of oscillating components . This method is based on the Kuramoto order parameter , which has been used to investigate phase synchronisation in systems with large number of oscillating components (e.g., the emergence of collective clapping in theatre audiences ). The Kuramoto model describes the collective synchronisation of oscillatory movement components (e.g., team players' movement displacement trajectories) in a single collective variable. have adapted this model and showed its applicability using a rocking chair paradigm of only six oscillatory units (i.e., six individuals coordinating rocking chair movements). This method has also been used to assess the synchronisation dynamics emerging within association football teams during an entire match . With this method, a specific measure of collective synchronisationthe cluster amplitude -is obtained, which captures how players collectively synchronise their on-field movement displacement trajectories. In that study, teams showed higher levels of collective synchrony in the longitudinal direction, than in the lateral direction of the field. Also, the relative phase of individual and whole group synchrony can be derived from this method, which can be a useful means to analyse the relationship between individual and collective (team) decision-making behaviours.",
               "To illustrate how key performance constraints may influence decision-making behaviours at individual and team levels of analysis, it is useful to interpret data from an in situ experiment using small-sided games . Twelve under-17 yrs elite footballers were divided into two teams, with a GK+1+3+1 diamond shape formation, with players assigned to their common positions . Teams performed two small-sided games in a 4042 m of pitch size, in which the defensive playing method was manipulated. In the first condition/game, both teams used a zonal defence. In the second condition/game, the same players were paired and both teams used a personal marking defensive system. Positional data from the 10 outfield players were gathered using a Global Positioning System (GPSports SPI Elite system, GPSports, Canberra, Australia) with a sampling rate of 15 Hz .",
               "Time-series data of cluster amplitude (i.e., collective synchrony) are presented in the left panel of . Mean data showed considerable higher values for zone defence (0.630.24) than for personal marking (0.470.21). These data indicated that zonal defending constrained players to collectively synchronise their on-field movement displacements trajectories in space and time. Acting according to a zonal defensive strategy seems to imply more cohesiveness within a team and to promote highly aggregated collective decision-making behaviours.",
               "Frequency histograms analyses presented in the right panel of also reveal important differences in the way individual players synchronised their movement displacement trajectories with the whole group. Adopting a personal marking defensive system implied less attraction for any specific mode of relation with greater dispersion within the entire spectrum of coordination possibilities. Also, we observed a slight shift for negative values compared with the zone defence condition, which suggested a lead-lag relationship attributed to the individual players' movements. On the contrary, adopting a zonal defence strategy promoted higher attraction for relative phase values near in-phase mode of coordination (49.8% between ?30 and 30 degrees). These data indicated that performance constraints imposed with a zonal defence influenced the players to be more synchronised with the collective movements of the team.",
               "From a functional perspective, data showed that distinct performance constraints imposed on team players may change the emergent individual and team decisionmaking behaviours required to perform as a synchronised social unit. The relationship between individual and team decision-making behaviours revealed that, overall, by adopting zonal defence strategies, team players are more liable to achieve stable relationships with the collective behaviours of the whole team. These conclusions can inform us how to apply understanding of the micromacro link for the design of training programmes in sport."
          ],
          "paper_id": "2445df60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "The micro-macro link in understanding sport tactical behaviours: Integrating information and action at different levels of system analysis in sport"
     },
     {
          "head": {
               "n": "7",
               "text": "Applications",
               "type": "introduction"
          },
          "paragraphs": [
               "A founding statement of ecological dynamics approach to learning is that it can only occur through changes in properties to which players' perceptual systems are attuned . This means that, to improve decision-making behaviours, learning designs should manipulate those constraints, which induce changes in tobe-perceived properties or, in other words, the emergence of learning is coupled to the kind of informational (and other task) constraints presented in a specific performance context . The design of representative practice tasks requires an understanding of the interaction between key individual, task and environmental constraints of specific sports . Due to the characteristics of complex systems, there is no ideal decision that can be determined in advance . Through interactions with specific ecological constraints in learning environments, cognition, decision-making and actions emerge during performance. An important design strategy is the use of different types of variability (noise) to channel the learning process into meta-stable regions of the \"learner-learning environment\" system to encourage adaptive behaviours. Here learners can be exposed to many functional and creative performance solutions during training. Functional variability in behaviours, invited by practice task design, is an important pedagogical principle, enabling players to become more adaptable, with concomitant repercussions at the individual, group and team levels of complexity.",
               "Another important pedagogical principle is task simplification, where modified tasks in practice preserve the information-movement couplings used during performance . Key performance variables in team games such as the velocity of the displacement of the ball and opponents, number of players in the game and size of playing areas are often manipulated to simplify a task for learners (e.g., in small-sided and conditioned games). Players' decision-making behaviours are ruled by a nonlinear contextual dependence among neighbouring players, which affords new opportunities for behaviour when trying to adapt to upcoming circumstances . In practice sessions, making information available, or directing players' attention to specific information sources relevant for governing interpersonal interactions, is a key feature of the learning process, particularly when system complexity increases, e.g., adding to the number of players involved, and manipulating time-to-act or space-to-act.",
               "To promote this type of individual-to-team adaptations a nonlinear pedagogy ) continues to be developed. Nonlinear pedagogy proposes that athletes exhibit purposive adaptive behaviours from the spontaneous patterns of interactions between system components. Nonlinear pedagogy emphasizes the manipulation of key task constraints (particularly informational constraints on action) during learning to allow functional movement behaviours to emerge in specific sports and physical activities. These manipulations require skilful construction by pedagogists according to the theoretical principles of ecological dynamics, especially representative learning design.",
               "One such principle is 'repeating without repetition' , where the learning system does not repeatedly practice the same movement pattern when seeking to resolve a specific performance problem (i.e., a particular situation of the game). Rather, this principle advocates that pedagogists induce a search in learners for new, functionally adaptive movement solutions for the same problem. The promotion of such functional variability is a crucial condition so that players can adapt to the unknown, emergent challenges of each, specific competition. During a match, teams have to make continuous adjustments to constraints such as the changing tactical landscape, stress, fatigue, weather conditions, injury or reduced performance of individual players, to maintain performance levels. The implication is that, rather than reducing variability, learning designs may increase the functional variability in practice conditions, in order to facilitate emergent decision-making behaviours and promote adaptability to changing constraints. At the same line, over-emphasizing prescription might lead learners to quickly stabilise their behaviours, but decreasing their ability to adapt to dynamic performance environments. By varying the constraints of the task, e.g., via smallsided and conditioned games, it is possible to influence key properties of the system, so that the individualenvironment system produces different task solutions. The main concern and challenge when designing learning tasks is to ensure that task constraints are not so rigid that different possible behavioural solutions become severely reduced ). Rather task constraints conducive to learning in sport should facilitate emergent behaviours at all times. In sum, to attain representative learning design, practitioners should design dynamic interventions that ensure that: (a) the degree of success of a performer's actions are controlled for, and compared between contexts, and (b), performers are able to achieve specific goals by actively exploring learning contexts designed to present affordances representative of those in the performance environment. increase functional variability in practice conditions, in order to facilitate emergent decision-making behaviours and promote adaptability to changing performance constraints."
          ],
          "paper_id": "2445df60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "The micro-macro link in understanding sport tactical behaviours: Integrating information and action at different levels of system analysis in sport"
     },
     {
          "head": {
               "text": "Bibliography",
               "type": "introduction"
          },
          "paragraphs": [
               "Arajo, D., Davids, K., Rocha, L., . Decision making in sport as phase transitions. The theory of ecological dynamics can explain sport behavior such as individual decision-making, team decisionmaking, as well as the link between individual (micro) and (macro) team behaviours. Phase transitions are the explanatory mechanism, providing a common language for understanding order-order transitions in individual and team behaviours, as well as a means to understand the micro-macro links that following circular causality constrains both levels. The consequence for practice is that, if sport performance is emergent under the influence of many interacting constraints, rather than reducing performance variability, learning designs should attempt to"
          ],
          "paper_id": "2445df60-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "The micro-macro link in understanding sport tactical behaviours: Integrating information and action at different levels of system analysis in sport"
     }
]