[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "The notion of electronic word-of-mouth (eWOM) communication has received considerable attention in both business and academic communities. Numerous studies have been conducted to examine the effectiveness of eWOM communication. The scope of published studies on the impact of eWOM communication is large and fragmented and little effort has been made to integrate the findings of prior studies and evaluate the status of the research in this area. In this study, we conducted a systematic review of eWOM research. Building upon our literature analysis, we used the social communication framework to summarize and classify prior eWOM studies. We further identified key factors related to the major elements of the social communication literature and built an integrative framework explaining the impact of eWOM communication on consumer behavior. We believe that the framework will provide an important foundation for future eWOM research work."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "n": "1.",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "The rise of new media channels during the last few years has offered fertile ground for electronic word-of-mouth (eWOM) communication. More and more consumers use Web 2.0 tools (e.g., online discussion forums, consumer review sites, weblogs, social network sites, etc.) to communicate their opinions and exchange product information . This new form of word-of-mouth (WOM) communication can contain positive or negative statements made by potential, actual, and former customers about a product or a company via the Internet .",
               "Industry research reports have shown that when making purchase decisions, Internet users trust online reviews posted by unknown consumers more than they trust traditional media . In addition, user-generated content in the form of online customer reviews was found to significantly influence consumer purchasing decisions . 91% of respondents mentioned that they consult online reviews, blogs, and other user-generated content before purchasing a new product/service, 46% of which are then influenced in the way they to purchase. Froster predicted that over 50% of total retail sales will be affected by web (e.g., online reviews) by eWOM has undoubtedly been a powerful marketing force. In recent years, we witnessed an explosion of literature focusing on the effectiveness of eWOM communication . However, the scope of published studies on the impact of eWOM communication is large and fragmented. It is difficult to draw meaningful conclusions from these studies. In addition, researchers have adopted various research approaches for investigating the eWOM phenomenon, and little has been done to integrate the findings of prior studies . According to our review of prior research work, studies on the impact of eWOM communication can be classified into two levels: market-level analysis and individual-level analysis . At the market-level analysis, researchers focused on market-level parameters (e.g., product sales). This line of investigation used objective panel data (e.g., the rate and the valence of consumer reviews) extracted from the websites or online product review platforms to examine the impact of eWOM messages on product sales . At the individual-level analysis, researchers postulated eWOM as a process of personal influence, in which communications between a communicator (sender) and a receiver can influence consumer purchase decision .",
               "In this study, we first identified individual-level eWOM studies and summarized their corresponding theoretical foundations. We then presented the social communication framework and classified key factors of eWOM communication. We further proposed an integrative framework of the impact of eWOM communication on online consumer behavior, and presented propositions concerning the relationships among the key elements of social communication.",
               "The paper is structured as follows. First, we define eWOM communication and compare the concept with traditional WOM communication. Second, we describe the research procedures and present a quantitative summary of prior eWOM communication research. Third, we present the results of paper classification based on the social communication literature. Finally, we propose an integrative framework of the impact of eWOM communication and present a set of propositions. We then conclude the paper by discussing the implications of the research framework for further theoretical and empirical investigations."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "n": "2.",
               "text": "Electronic word-of-mouth communication",
               "type": "introduction"
          },
          "paragraphs": [
               "The power of interpersonal influence through word-of-mouth communication has been well recognized in the consumer literature . Prior studies have found that consumers perceive WOM as more trustworthy and persuasive than traditional media, such as print ads, personal selling, and radio and TV advertising. The influence on purchase decision through WOM communication was further extended with the advent of the Internet, which extended eWOM communication to various additional virtual settings. On the internet, consumers can post their opinions, comments and reviews of products on weblogs (e.g. xanga.com), discussion forums (e.g. zapak.com), review websites (e.g. Epinions.com), e-bulletin board systems, newsgroups, and social networking sites (e.g. facebook.com) .",
               "While eWOM communication has some characteristics in common with traditional WOM communication, it is different from traditional WOM in several dimensions. These dimensions all contribute to the uniqueness of eWOM communication. First, unlike traditional WOM, eWOM communications possess unprecedented scalability and speed of diffusion. As with traditional WOM, sharing of information is between small groups of individuals in synchronous mode . Information in traditional WOM is usually exchanged in private conversations or dialogs. It is therefore rather difficult to pass along the information to any individual who is not present when and where the information is exchanged. In contrast, eWOM communications involve multi-way exchanges of information in asynchronous mode . Information in the form of eWOM does not need to be exchanged at the same time when all communicators are present . For instance, users of forums are able to read and post comments after the \"threads\" are created, not necessary at the time when the threads are being created. Second, unlike traditional WOM, eWOM communications are more persistent and accessible. Most of the text-based information presented on the Internet is archived and thus would be made available for an indefinite period of time . Third, eWOM communications are more measurable than traditional WOM . The presentation format, quantity, and persistence of eWOM communications have made them more observable. Word-of-mouth information available online is far more voluminous in quantity compared to information obtained from traditional contacts in the offline world . In other words, researchers can easily retrieve a large number of eWOM messages online and analyze their characteristics such as the number of sentimental words used, position of the messages, style of messages, and the like. A final key difference is that traditional WOM emanates from a sender who is known to the receiver of the information, thereby the credibility of the communicator and the message is known to the receiver. electronic word-of-mouth (eWOM). We used two methods to identify relevant papers. First, we conducted a systematic electronic search using a number of index databases, which were: Academic Search Premier (EBSCO), ABI/INFORM Global (ProQuest), Social Science Citation Index (SSCI), Science Citation Index (SCI), PsycINFO, CSA Illumina, Education Resources Center, and Emerald. The research team did the search based on keywords including \"electronic word-of-mouth\", \"ewom\", \"online reviews\", \"online recommendations\", \"marketing buzz\", and \"online consumer reviews\". Second, we reviewed four MIS journals (Decision Support Systems, Information Systems Research, Journal of Management Information Systems, and Management Information Systems Quarterly) and three Marketing journals (Journal of Consumer Research, Journal of Marketing, and Journal of Marketing Research) manually to ensure that no major eWOM articles were ignored.",
               "Following the guidelines of the conventional systematic review methodology , inclusion and exclusion criteria were applied to the initial set of articles. These were done to ensure that the sample of articles used for analysis was appropriate for the current research. The inclusion criteria was the following: (1) publication was academic and peer reviewed in nature; (2) eWOM was the main focus of investigation in the paper; (3) researchers had a defined sample; (4) publication that addressed impacts of electronic word-of-mouth (eWOM); and (5) publication dealt with investigation of eWOM in business-to-consumer settings. The exclusion criteria were applied to: (1) papers with an entirely conceptual or theoretical background and no research design; and publications that dealt with the investigation of eWOM in the form of a recommendation agent (system agent). At the article analysis stage, two authors independently reviewed and eliminated articles that were not pertinent to the current focus.",
               "A total of 47 eWOM communication articles published between 2000 and 2010 were identified. Research on the impact of eWOM communication can be classified into market-level analysis and individual-level analysis . In this review, 47% (22 out of 47 articles) of the articles adopted the market-level approach, while 53% (25 out of 47 articles) focused on the individual-level analysis (see ). As a number of researchers have already conducted a review on prior studies of market-level eWOM communication , we only focused on individual-level eWOM studies in the current analysis."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "n": "4.1.",
               "text": "Types of eWOM",
               "type": "introduction"
          },
          "paragraphs": [
               "The popularity of Web 2.0 has empowered consumers to influence others through a variety of platforms to post user-generated content (UGC) tools (e.g., blogs, microblogs, forums, chat rooms, and social networking sites). Our literature review showed that a majority of eWOM studies focused on online consumer reviews made on e-commerce websites, discussion forums or rating sites (see ). Other forms of eWOM have received far less attention A two-stage process was used in searching the available articles -article identification and article analysis. Before the synthesis of findings in various studies could be done, relevant studies first needed to be identified. This research study involved collecting academic and peer reviewed journal articles that addressed impacts of ? The communicator (source) refers to the person who transmits the communication. ? The stimulus (content) refers to the message transmitted by the communicator. ? The receiver (audience) is the individual who responds to the communication. ? The response (main effect) is made to the communicator by the receiver. Online brand/ shopping sites",
               "Amazon.com in academic research. study was one of the few research papers that focused on the effects of eWOM in the form of a personal blog.",
               "In this literature analysis, we reviewed prior individual-level based eWOM papers on the impact (responses) of electronic word-of-mouth (eWOM) communication. eWOM represents a new form of social communication content (stimuli) involving both information-seeking customers (receivers) and information sharing customers (communicators). In this section, we review the 25 individual-level eWOM studies and identify variables related to the four key elements (responses, stimuli, receivers, and communicators) of social communication. We further build an integrative model and discuss the interrelationships among the key elements. depicts our integrative framework. summarizes the theories adopted in prior eWOM communication studies. Among the 25 identified eWOM papers, a dual-process theory of human information processing such as the Elaboration Likelihood Model (ELM) and the Heuristic-Systematic Model (HSM) was the most commonly used theoretical foundation in the study of the impact of eWOM communication. In addition, a significant number of studies adopted the source credibility literature to explain the characteristics of this new form of word-of-mouth communication. Researchers also explained the impact of eWOM on consumer purchase decision using the perspective of interpersonal influence."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "n": "4.2.",
               "text": "Theoretical foundation",
               "type": "introduction"
          },
          "paragraphs": [
               "The response is made to the communication by the receiver. As shown in , attitude, purchase intention, and purchase are the most commonly investigated outcomes (responses) of eWOM communication. The relationships between attitude, purchase intention, and purchase have been well-established and validated in online consumer behavior research. For example, Chang et al. found that attitude consistently exhibits significant impact on online purchase intention in prior online shopping literature, while online purchase intention has a positive impact on online purchase. These relationships are basically supported by theory of reasoned action and theory of planned behavior . Therefore, we have the following propositions:",
               "P1. Purchase intention is positively associated with purchase.",
               "5. An integrative framework of the impact of eWOM communication P2. Attitude is positively associated with purchase intention.",
               "Hovland , one of the founding fathers of social communication research, defined social communication as \"the process by which an individual (the communicator) transmits stimuli (usually verbal symbols) to modify the behavior of other individuals (communicatees)\" (p. 317). Working within a framework of \"who says what to whom and with what effect\", social communication includes four major elements:",
               "eWOM adoption, which may be considered as the adoption and use of eWOM communication for making a purchase decision , was also frequently examined in the 25 existing eWOM communication papers. Among existing eWOM studies, Cheung et al. and Liu and Zhang found that information usefulness has a direct positive impact on eWOM adoption, while Cheung et al. showed that eWOM credibility has a positive effect on eWOM adoption. Information usefulness, eWOM credibility, and eWOM adoption are theoretically related and explained by the information adoption model . The information adoption model is widely used to explain how people are influenced to adopt the information posted in computer-mediated communication (CMC) contexts. This model was adapted from the Elaboration Likelihood Model (ELM) ; the impacts of information quality and source credibility on eWOM adoption are mediated by information usefulness. Building on the information adoption model, we believe that both information usefulness and eWOM credibility have positive relationships with eWOM adoption. Theoretical foundations of prior eWOM studies."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "text": "Theory Studies",
               "type": "introduction"
          },
          "paragraphs": [
               "Dual-process theory -Elaboration Likelihood Model (ELM) -Heuristic-Systematic Model (HSM) "
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "text": "36,78] Interpersonal theory",
               "type": "introduction"
          },
          "paragraphs": [
               "P3. Information usefulness is positively associated with eWOM adoption.",
               "-Persuasive -Conformity P4. eWOM credibility is positively associated with eWOM adoption."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "text": "-Informational cascade",
               "type": "introduction"
          },
          "paragraphs": [
               "Similar to traditional WOM studies, eWOM communication is usually considered as a type of social influence that affects consumer purchase decision. That is, information from external sources can enhance consumer purchase decision, similar to the role of social influence in theory of reasoned action. Therefore, we expect that eWOM adoption will have a direct effect on purchase intention.  P5. eWOM adoption is positively associated with purchase intention"
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "n": "5.2.",
               "text": "Stimuli",
               "type": "introduction"
          },
          "paragraphs": [
               "The stimulus refers to the message transmitted by the communicator. In the traditional word-of-mouth marketing literature, the valence (positive, negative, or neutral) and the volume (the quantity of the information) have received a lot of attention. Particularly, researchers focused on the impact of extremely positive and extremely negative WOM . Because of the nature of traditional WOM communication, most of these studies examined the impact of WOM messages by manipulating WOM messages in an experimental setting. Some recent eWOM studies also adopted this approach in examining the impact of eWOM on consumers' purchasing intention . summarizes the factors related to the stimulus.",
               "In eWOM communication studies, researchers considered valences (e.g., positively framed eWOM vs. negatively framed eWOM) to be persuasive effects. Positively framed eWOM highlights the strengths of a product/service and encourages people to adopt a product/service, while negatively framed eWOM emphasizes the weaknesses/problems of a product/service and thus discourages people to adopt them . Past research in the area of consumer behavior has shown that consumers pay more attention to negative information than positive information. They also tend to weigh negative information more than positive information during evaluation and decision making . Similarly, Park and Lee showed that negative eWOM has a stronger influence on eWOM effect than positive eWOM. Researchers referred to the differing effect of negatively and positively valenced events as negativity bias or negativity effect. Baumeister et al. found that the principle of \"bad is stronger than good\" is consistent across a broad range of phenomena, and suggested that people tend to react more strongly to bad things as the adaptive response to their physical and social environment. Building on this line of literature, we believe that eWOM valence has a positive relationship with eWOM credibility .",
               "P6. eWOM valence is positively associated with eWOM credibility.",
               "In this review, we also notice that recommendation sidedness and number of recommendations (volume) were the two most studied stimulus cues in eWOM communication. A one-sided message presents either positive or negative valenced information. A two-sided message includes both positively and negatively valenced information. Prior marketing literature suggested that two-sided information enhances the completeness of information, and thus is perceived to be more credible. Existing eWOM studies have also examined the relationship between sidedness of eWOM and eWOM credibility . Therefore, we believe that eWOM sidedness has a positive influence on eWOM credibility.",
               "P7. eWOM sidedness is positively associated with eWOM credibility.",
               "A considerable number of market-level studies have found that the volume of reviews is significantly associated with product sales . Most of these studies even showed that review ratings are not associated with product sales, but that the number of reviews Factors associated with the response. Repurchase intention",
               "The willingness to purchase a product again in the future Argument quality refers to the persuasive strength of arguments embedded in an informational message Relevance refers to the extent to which the messages are applicable P8. eWOM volume is positively associated with purchase intention."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "text": "eWOM review credibility",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The perceived degree to which an eWOM review provides accurate and truthful information.",
               "When applying the dual-process theory of human information processing, including the Elaboration Likelihood Model (ELM) and Heuristic-Systematic Model (HSM) in the eWOM context, researchers tended to consider quality of reviews (argument quality) as the central route, while source credibility and quantity of reviews were considered as the peripheral cues (see ). The central/ systematic route involves careful examination of the messages before forming an attitude, whereas the peripheral/heuristic route relies on environmental cues of the message to decide whether to accept the message or not. In this integrative framework, argument quality refers to \"the strength or plausibility of persuasive argumentation\" . The quality of argument (information) is basically evaluated in terms of the information content, accuracy, format, and timeliness . The information adoption model explains the relationship between argument quality and information usefulness . The extent to which an eWOM message is able to offer necessary information which helps readers understand the product Perceived product quality Perceived level of product quality Willingness to recommend",
               "Willingness to recommend products in the future Helpfulness Perception of the helpfulness of reviews is significantly associated with product sales. Berger et al. have empirically illustrated that \"any publicity is good publicity\". They found that even negative publicity (e.g., negative eWOM) can increase purchase likelihood. Duan et al. argued that online consumer reviews convey the existence of the product and thus create an awareness effect. Therefore, eWOM volume exhibits a positive relationship with purchase intention.",
               "P9. eWOM quality is positively associated with information usefulness."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "n": "5.3.",
               "text": "Communicators",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The communicator refers to the person who transmits the communication. Traditional WOM primarily emanates from a sender (source) who is known to the receiver of the information, thereby ensuring that the credibility of the communicator and the message is known to the receiver. In the traditional WOM literature, marketing scholars have demonstrated that a personal source of information has a strong impact on consumer preferences and choices . In the offline world, people judge communicators based on a number of attributes, including credibility, attractiveness, physical appearance, familiarity, and power.",
               "In the context of eWOM communication, consumers exchange opinions and experiences outside their personal social network. They usually share and exchange product/brand information with a vast and geographically dispersed group of strangers through blogs, online consumer review platforms, shopping bot sites, social networking sites, and the like . This has the potential to raise receivers' concern about the credibility of this form of reviews . It was also reflected in our literature analysis that source credibility is the most frequently investigated factor associated with the communicator. Source credibility refers to a message receiver's perception of the credibility of a message source, reflecting nothing about the message itself . It is defined as the extent to which an information source is perceived to be believable, competent, and trustworthy by information receivers . Source credibility includes two major dimensions: expertise and trustworthiness . summarizes the key factors associated with the communicator in the literature of eWOM communication.",
               "In the context of eWOM communication, online reviews are usually shared by unknown individuals. Park et al. argued that online reviews may have less credibility than traditional WOM messages. Park and Lee also suggested that receivers may have difficulty in determining the source credibility of eWOM messages. Though some studies have doubted the role of source credibility in the context of eWOM communication , we noticed that most studies found that source credibility has a significant direct influence on eWOM effects (see ). The results are consistent with the traditional source credibility literature and thus, we postulate that source credibility has a positive relationship with eWOM credibility. P11. Attribution (non-stimulus related) is negatively associated with eWOM credibility."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "n": "5.4.",
               "text": "Receivers",
               "type": "relatedwork"
          },
          "paragraphs": [
               "P10. Source credibility is positively associated with eWOM credibility.",
               "The receiver is the individual who responds to the communication. The actual impact of the information received may vary from person to person. The same content can engender very different responses in different recipients , depending on the recipients' perceptions, experience, and sources. This has led researchers to gain interest in the information adoption process to understand the extent of informational influence on people's minds. In the information adoption literature, Sussman and Siegal found that the receivers' experience and knowledge moderates both the central influences (the nature of arguments in the message) and peripheral influences (the subject matter of the message) on information adoption in computer-mediated communication contexts. In the eWOM literature, consumers' characteristics, such as consumer expertise and involvement, also play an important moderating role in determining the impact of eWOM content (e.g., type and number of online consumer reviews) on purchase intention . Researchers further investigated other factors related to personal characteristics, such as gender, consumer skepticism, and cognitive personalization. provides a summary of factors associated with the receiver.",
               "Dual-process theory suggests that people who have the motivation and ability are more likely to process information via the central route . In this literature analysis, we observed that researchers examined how receivers' characteristics affected the likelihood of elaboration and moderated the impact of eWOM messages on consumer purchase decision. Among the 25 individual-level eWOM studies, involvement (motivation) and prior knowledge (expertise) are the two most widely studied characteristics of the receivers . As shown in , the receivers' characteristics are usually postulated as moderators affecting both central and peripheral routes on consumer purchase decisions.",
               "Involvement refers to personal relevance or importance of a product/service. A meta-analysis found that involvement is associated Attribution theory explains how people make causal inferences regarding why a communicator advocates and behaves in a certain way . When receivers attribute the communicator's review to product reasons (stimulus), they will perceive the review to be credible, and will consider it useful. On the other hand, when receivers attribute the review to reviewer reasons (non-stimulus), they suspect his/her underlying motives of writing such a review, and are less likely to be persuaded by that review . In other words, how receivers attribute the communicator's message has an effect on the persuasiveness of the message.  Consumer skepticism",
               "The tendency toward disbelief Homophily",
               "The degree to which pairs of individuals are similar in age, gender, education, and social status Cognitive personalization",
               "How people interpret events in a self-referential manner with information processing . Our review found that prior studies have already empirically shown how involvement moderates the eWOM effect in consumer decision process. For example, Lee et al.",
               "demonstrated that as involvement increases, the effect of negative eWOM is greater for high-quality eWOM than for low-quality eWOM. Park and Lee also found that for high involvement receivers, the perceived informativeness of an eWOM message has a higher effect on purchasing intention than the perceived product popularity. When individuals have higher involvement, they have greater motivation to engage in effortful cognitive activity through the central route. When individuals have lower involvement, they tend to rely on peripheral cues during information processing. Therefore, in our integrative framework, consumer involvement exhibits a moderating effect upon the relationship between eWOM quality and information usefulness, as well as upon the relationship between eWOM quality and purchase intention.",
               "P12. Consumer involvement moderates the relationship between eWOM quality and information usefulness.",
               "P13. Consumer involvement moderates the relationship between eWOM quality and purchase intention. Receivers' ability (prior knowledge/consumer expertise) determines the degree of effortful information processing. The relationship between consumer expertise and traditional WOM is under-researched and existing studies tend to generate inconsistent results. argued that the inconsistency may be related to the type of WOM message. They built on cognitive fit theory and argued that the efficiency of information processing depends on whether receivers are able to use appropriate cognitive processes from given information. Building on the dual-process theory, we believe that consumer prior knowledge has a moderating impact on the relationship between eWOM quality and information usefulness."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "text": "P14. Consumer prior knowledge moderates the relationship between eWOM quality and information usefulness",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Source credibility is also defined as a peripheral cue in consumer information processing. Peripheral cues are variables that allow an individual to arrive at a judgment of an argument without processing the message arguments themselves . In other words, a peripheral cue is an element in a message that is not directly related to the merit of the product and typically required less effort to process . Thus, we expect both consumer involvement and consumer prior knowledge will moderate the impact of source credibility on eWOM credibility in the current study. and we also proposed an integrative framework for the study of the impact of eWOM communication.",
               "The integrative framework is composed of five essential components -communicators, stimuli, receivers, responses and contextual factors. As mentioned earlier, unlike traditional WOM communication, eWOM communication possesses unprecedented speed of diffusion and enables multi-directional exchanges of information between communicators and receivers. Thus, the contextual factor, namely the platform in which people exchange information, is what distinguishes eWOM from traditional WOM. Due to the rapidly changing nature of the Internet, the contextual factor -the platform -is expected to be one of the most crucial factors impacting the eWOM adoption process in the future. As Web 3.0 becomes the new generation of the World Wide Web, information and most of the behaviors of users will be captured and stored in a huge database further enhancing the visibility, accessibility, and legibility of eWOM data. We expect that the migration of Web 2.0 to Web 3.0 could facilitate eWOM communication and play a more important role in influencing consumer purchase decision."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "n": "6.1.",
               "text": "Contributions and future research directions",
               "type": "introduction"
          },
          "paragraphs": [
               "P15. Consumer involvement moderates the relationship between source credibility and eWOM credibility.",
               "P16. Consumer prior knowledge moderates the relationship between source credibility and eWOM credibility."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "n": "5.5.",
               "text": "Contextual factors",
               "type": "introduction"
          },
          "paragraphs": [
               "Since receivers are mostly unfamiliar with the credentials of communicators in the context of eWOM communication, they tend to look for a variety of cues that are present within the review (e.g., characteristics of a stimuli) and associated with its environment (e.g., credibility of websites/platform) when determining the quality of eWOM messages . Hovland and Weiss suggested that information from a source that is perceived to be more trustworthy can lead to increased persuasiveness of that information. In recent years, researchers attempted to compare the trustworthiness of information on different platforms. Bickart and Schindler found that consumer reviews are more influential than marketer-generated information on corporate websites. They suggested that consumer reviews usually have greater credibility, greater relevance, and greater ability to evoke empathy. Park and Lee also found that the effect of product reviews on established websites is greater than their effect on under-established websites. Based on prior studies, we believe that the nature of review platform relates to eWOM adoption.",
               "P17. Type of review platform is positively associated with eWOM adoption."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "n": "6.",
               "text": "Discussion and future research directions",
               "type": "introduction"
          },
          "paragraphs": [
               "The main objective of the present study is to provide a systematic review of the existing literature on eWOM communication. Research on eWOM communication is large and fragmented. There are two main levels of analysis: market-level analysis and individual-level analysis. In this study, we focused on the individual-level analysis and summarized prior studies based on the social communication literature. Through a rigorous search of several mainstream MIS and marketing journals, as well as key electronic databases, we identified 25 papers using the individual-level analysis in the investigation of the impact of eWOM communication on online consumer behavior. Based on the social communication literature, we identified and summarized factors related to the key elements of eWOM communication,",
               "This study provides a comprehensive overview of the current status of knowledge within the domain of eWOM communication research. We synthesized the findings of our literature analysis and derived a theoretical model for the study of the impact of eWOM communication at the individual level.",
               "This paper advances our knowledge of eWOM communication. First, we conducted a thorough analysis of the literature in the area of eWOM communication. A wide range of factors related to the key elements of social communication were identified and classified. To our knowledge, this is the first study that builds on the social communication framework to classify eWOM research papers and develop an integrative model. This theoretical model provides an important foundation for future research as it integrates key factors of the major elements of eWOM communication.",
               "Second, our literature analysis shows that the literature on the impact of eWOM communication is rather fragmented. Attitude, purchase intention, purchase, and eWOM adoption are the four most investigated response variables in eWOM communication. Most existing studies focused only on one or two of these key response variables, and the interrelationships among key variables have not been systematically reviewed and studied. In the current study, we theoretically postulated the interrelationships among the key response variables. We strongly believe that future research could use our framework as a basis to explore empirically how the characteristics of other key elements (stimuli, communicators, receivers, and contextual factors) of social communication affect the response variables.",
               "Third, we have identified a wide range of variables related to the key elements of social communication (see ). However, we notice that a majority of these variables have only been studied once. Of those which have been studied more often, their impact has often been inconclusive. We attempted to provide an overview of how the key elements are related to each other and derive a set of propositions for future research work. The current framework is built on prior studies and integrates research findings across existing studies. We therefore encourage researchers to explore theories from different disciplines and to use them to study how other key elements of social communication affect eWOM communication. For example, researchers can further investigate how other factors related to receivers' characteristics, such as gender, consumer skepticism, and cognitive personalization affect the eWOM adoption as well as consumer purchase decision. Finally, researchers should continue to explore the impact of contextual factors, such as how the nature of different UGC platforms and their credibility influence eWOM adoption and consumer purchase decision."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "n": "6.2.",
               "text": "Limitations",
               "type": "introduction"
          },
          "paragraphs": [
               "Some limitations should be noted. The results and analyses of this study were limited to the pool of journals that satisfied our selection criteria. For instance, we built our conceptual model on the social communication literature and we did not include market-level studies. From our preliminary review of market-level studies, we noticed that these studies adopted a very different theoretical research approach in examining the eWOM phenomenon. Future studies should expand the literature analysis and the number of classified studies based on different levels of analysis. Research on the impact of eWOM communication is still emerging. Because of a limited number of empirical studies, we were not able to perform a quantitative meta-analysis. A meta-analysis is strongly recommended in the future, so as to improve our understanding of the relative impacts of the three elements (communicators, receivers, and stimuli) on the responses to eWOM communication, and the moderating roles of the contextual factors."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     },
     {
          "head": {
               "n": "7.",
               "text": "Conclusions",
               "type": "conclusion"
          },
          "paragraphs": [
               "To conclude, this literature analysis provides an overview of the current status of knowledge in the domain of eWOM communication research. Furthermore, we present a conceptual framework, and identify the key variables of each of the four elements in the social communication. We believe that this study will stimulate future research on the impact of eWOM communication on consumer purchase decision by drawing attention to the variables and linkages that need further investigation."
          ],
          "paper_id": "2437fcb0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "The impact of electronic word-of-mouth communication: A literature analysis and integrative model"
     }
]