[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "1. INTRODUCTION"
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "n": "2.",
               "text": "RELATED WORK",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The study of groups and communities is central to many research problems on mining and analytics of sociological data. There have been two major lines of research in this domain: one focuses on the static snapshots of social graphs and seeks to infer and identify tightly-connected group of members -also known as community detection in literature ; another line of research focusing on the group dynamics -the growth and evolution of social groups -is more related to our work here. Below we highlight a few and exlpain how ours contribute to the existing research.",
               "Group Dynamics. To understand the process of how social groups form and evolve over time, previous work has extensively investigated the growth and longevity of various forms of online communities such as Facebook apps , game communities , knowledge sharing communities and social networks communities . A more generalized work of investigates the group growth dynamics by encompassing a broad range of 22 membership-based websites.",
               "Our work focuses on studying the group dynamics of a rather understudied realm -the social messaging services. Although researchers have recently begun interpreting the group messaging behavior from a social science perspective (e.g., ), research community still knows little about the formation and evolution of social messaging groups with concrete and empirical measurement. Fo-cusing on the Yahoo! instant messaging traffic data, Aral et al. considers the individual-level dynamics from the perspective of peer influence and homophily, yet it is unclear how the groups as a whole evolve over time -their lifecycles, their structural dynamics etc. Our work contributes to the current research by discovering a strong dichotomy among social messaging groups in terms of their lifecycle. By taking into account a broad range of group-level structural and behavioral features, we develop a separability model that distinguishes between long-term groups and short-terms groups, as well as an early prediction model that forecasts the longevity of groups.",
               "Cascades. The second half our of work on group membership cascade prediction builds on previous literature that studies diffusion processes . In recent years, scientiests have been able to observe and quantify large-scale diffusions from the richness of online data, including blog space , marketing , social sites such as LinkedIn , Flickr , Twitter , Facebook , LiveJournal . In work that aligns more closely to our focus on social messaging, Aral et al. have looked into the effects of peer-influence and homophily during the diffusion processes. Our work has a more comprehensive scope than by integrating both individual-level and group-level features into our cascade prediction model.",
               "The membership cascade process in the context of social messaging groups differs from previous work in two folds. First, in terms of cascade size, in contrast to previous findings on the structural virality in global-scale cascades , we observe a relatively smaller scale of cascade in message groups and find a siginificant fraction of short-term group memerbship cascades terminate at the depth of 2 or 3. Such difference is caused by the social messaging group nature of maintaining a compact community size than going \"viral\" . Second, due to mechanics specific to application, the cascade process we consider here is locally dependent, with unidirectional contagion dominated mostly by the existing group members. In WeChat, all the groups are by default only visible to group members and grow in a invitation-only fashion. Only the one-hop neighbors of current group members can be invited to the group chat. And this is very dissimilar to the diffusion models in previous work by Backstrom et al. which assumes that users can make their own decision to join based on the group influence, even if they are not friends with any of the current group members. The UI of inviting friends to the group chat. Users can browse and select contacts to add, and click \"OK\" to send invitations. When group size is under the capacity 40, invited users will be automatically added into the current group chat without requiring further confirmation. However, under the circumstances that group size exceeds the capacity limit, invited users will have to manually click through the invitation message in order to join the group. The largest WeChat group can have as many as 500 members by default. Sourced from WeChat official feature site .",
               "a successful invitation if user v joins group C invited by user u at timestamp T . After being a member of a chat group, one can send various forms of messages (e.g., text, photo and voice) to the entire group. We use the tuple (u, C, T ) to denote the a group chat record if user u send a message to group C at timestamp T ."
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "n": "3.",
               "text": "DATA",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Preliminaries. Before describing the details of the dataset, we first give a brief overview about WeChat's Group Chat feature that is central to our study here. While WeChat supports many other important features including Moments for photo sharing, Friend Radar for searching nearby friends and Sticker Gallery, it is important to note that those are beyond the scope of our research focus in this paper.",
               "On WeChat, each user keeps a brief profile, including demographical information (e.g., gender, age and region) and address book which saves the contact list of user's friends. We use the tuple (u, v, T ) to denote a friend relationship record if user u becomes friend with user v at timestamp T .",
               "A chat group on WeChat can be analogy to a community, where one can chat with several friends all at once. There are two ways in which a user can involve in a chat group: one can either initiate a new chat group, or get invited by an existing member of the group. illustrates an example of the WeChat user interface of inviting friends to group chat. We consider (u, v, C, T ) as Data Collection and Cleaning. The data for this study comes from anonymized logs of complete WeChat group messaging activities, collected between July 26th, 2015 to August 28, 2015. We first collect all the 2.3 million groups generated on July 26th, 2015, as our group set of interest. We preprocess the data by ignoring groups with less then 5 chat logs-i.e., we only consider groups that are not born to be dead; and also filtering groups with users that are in list of monthly spam users (MSU) or monthly inactive users (MIU). The list is maintained and updated by WeChat on a monthly basis. All the initial groups in consideration consist of at least three members.",
               "Data Description. After preprocessing the initial group set, we are left with 474,726 groups for further analysis. We then collect four datasets of interest listed below. Tabel 1 summarizes statistics of the dataset used for this study.",
               "? Group Activity Records G: It consists of all the temporal group activity records (u, C, T ) for each of the sampled group, with T running between July 26th, 2015 to August 28, 2015.",
               "? User Set U: It consists of all the members belonging to the sampled groups as well as their one-hop neighbors, as of August 28, 2015. Note that we further remove users in the list of MSU or MIU from the user set.",
               "This implies a strong dichotomy exists among groups in terms of their lifecycle, and we accordingly make a conceptual difference between two types of groups:",
               "? Invitation Records I: It consists of tuples (u, v, C, T ) where user u successfully invites v to join group C at timestamp T during our data collection period.",
               "? Short-term groups: this type of groups emerge and die very quickly, and usually have lifespan ranging from hours to a few days. For example, (b) shows that almost 40% of groups stop interaction within only a week.",
               "? Friendship Records F: It consists of all the tuples (u, v, T ) where u and v (u, vU) become friends with each other at time T . The friend relationships in WeChat are undirected, and we have both (u, v, T )F and (v, u, T )F .",
               "? Long-term groups: this type of groups can survive a much longer period of time than short-term groups. shows that about 30% groups fall into this category and can sustain longer than 30 days. The phenomena of lifecycle dichotomy also leads us to the question of how does the lifecycle and growth pattern of social messaging groups correlate with the social functions it is serving? To address this, we manually examine 100 randomly selected groups, among which 60 are long-term groups and 40 are shortterm groups, respectively. We categorize these groups according to their social functions (the title of groups) by hand, and list the details in . Quite interestingly, we find that most shortterm groups are event-driven (e.g., travel groups, meeting groups and dining groups), while long-term groups are more relationshipdriven (e.g., family groups, colleague groups and friend groups)."
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "n": "4.",
               "text": "GROUP LIFECYCLE DICHOTOMY",
               "type": "relatedwork"
          },
          "paragraphs": [
               "One question that we brought up previously is how social messaging groups grow and evolve over time -their lifecycles and their structural dynamics. As a high-level characteristic, social messaging groups can have a relatively shorter lifespan -ranging from several hours to months -as opposed to those online groups seen in social networking sites such as Reddit and Facebook that can sustain up to years. In this section, we start with discussing the phenomena of lifecycle dichotomy we observe from the group activity temporal data. To do this, we define the lifespan of a social messaging group below. We define it by the duration from the timestamp at which a group is initialized, to the timestamp at which no group member sends chat messages anymore. In this subsection, we move on to study the underlying structural change of messaging groups over time. We investigate several representative structural features (e.g., open triad count, closed triad count and edge density), and quantitatively analyze the how these features evolve in a different pattern with respect to the long-term and short-term groups, respectively. "
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "text": "Triad Count.",
               "type": "relatedwork"
          },
          "paragraphs": [
               "The studies about transitivity in social networks suggest that the local structure in social networks can be expressed by the triad count. In WeChat groups, we try to examine whether long-term and short-term groups show different transitivity patterns. We take into account both the open triad count and close triad count, based on the friendship networks structure of sampled WeChat groups. To illustrate this, shows an example of a small WeChat group friendship networks, in which nodes A, B and C form a closed triad; nodes A, C and D is considered an open triad.",
               "Edge Density. We also consider the feature of internal edge density of a group, which is defined by the fraction of edges (friendships) within the group among all the possible edges when the group is fully connected.",
               "To see how these structural features change over time, we take two snapshots for the groups: one at the time when the groups are initialized (we choose ?10 minutes in this study), another after one month being setting up. We consider long-term and short-term  groups separately in order to see the different patterns of structural patterns between these two. We also remark here that although short-term groups may stop messaging interactions at some point, members within the groups are still likely to build friendship as long as they maintain the group membership, and thus affect the underlying friendship network structure for potentially longer period of time. show the results for feature dynamics of open triad count, close triad count and edge density, respectively. Note that if the structure of groups are not changing at all, we would expect to see a scatter plot centering around the diagonal line of y = x (with normalization). From the visualization results, it is interesting to first observe the different evolution patterns exhibited between short-term groups and long-term groups -the long-term ones show stronger dynamics in terms of the underlying friendship structure features while most short-term groups are less likely to develop friendship over time.",
               "We infer such dichotomy in structure dynamics is related to the social roles and functions for the social groups to be setup. For example, a colleague's group served for long-term communications is more likely to develop social connections between members, as opposed to a group setup for some specific social event.",
               "(a) Example of long-term group (b) Example of short-term group for both types of groups. We find that long-term groups tend to have larger size (up to 500 by default) while the size of short-term groups diminishes around 100. This is not very surprising since long-term groups can be advantageous in gaining more members give a longer timespan for growth."
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "n": "4.2",
               "text": "Cascade Tree Pattern",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Beside studying the friendship structure, we also discuss the group formation processes, namely by investigating the group membership invitation cascading tree structure. We start with defining the group cascade tree below. Definition 2. Group Cascade Tree. A directed graph where each group member is a node, and a directed edge from u to v is constructed if u (inviter) successfully invites v (invitee) to the group. The tree is rooted at the user who initiated the group. Cycles are impossible since inviters always join the group earlier than invitees.",
               "Invitation as a Function of Cascade Depth. A natural way to measure the difference in cascade tree between long-term groups and short-groups is to examine the distribution of cascade depth at which the invitation occur. We measure the cascade depth for each of the invitation happens during our observation period, which is defined by the number of steps from the root to the group member in the cascade tree. shows the normalized distribution of cascade depth among all the invitations in our dataset. We observe that more invitations occurs far from the root in long-term groups than that in short-term groups. For example, 10% of invitations in long-term groups occur at depth 3 or greater; whereas for short-term groups, only less than 1% of invitations occur at depth 3 or greater.",
               "To show how long-term and short-term groups differ in terms of cascade tree structure, (a) and show the examples for two types of WeChat group cascade tree. We find that long-term groups tend to exhibit a deeper tree structre with more branchings; whereas many short-term group cascade trees display an approximate star graph structure with most members being the leaves of the root node. In order to quantify such difference, we consider here four representative features concerning the structure of cascade trees.",
               "Invitation as a Function of Subtree Size. Finally, we measure the difference of cascade tree structure between long-term groups and short-term groups by measuring the size of subtree for each node in the cascade tree. In , we show the distribution of the cascade subtree size for each node resides in the cascade tree, aggregated among all the sampled groups. Again, we observe substantial difference between long-term groups and short-term groups. For example, 30% of nodes in the cascade tree of long-term groups have subtree size greater than 10; whereas only 10% of nodes have subtree size greater than 10 in short-term groups.",
               "Cascade Size. We start our analysis on cascade tree by examining the total number of nodes in the cascade tree, i.e., group size. shows the normalized distribution of cascade tree size Structural Virality. We also quantify cascade trees by measuring their structural virality as that used in . Structural virality, also know as Wiener index, is useful for disambiguating between shallow, broadcast-like diffusion and the deep branching structures. Size of group |C|"
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "text": "Subtree size",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Fraction of members in trees of size"
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "n": "1",
               "text": "2 3 4 5 6 7 8 9 10 Depth 2 3 4 5 6 7 8 Wiener Index",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Fraction of groups Wiener index is defined by the average distance between any two nodes in the cascade tree. For example, the cascade trees in (a) and (b) have Wiener indexes of 3.99 and 1.83, respectively. In , we show the distribution of Wiener index of cascade trees for both long-term and short-term groups. We observe that more than 99% of short-term groups have Wiener index smaller than 2, which implies that most membership cascades happen in a broadcast fashion, settled mostly by the root node.",
               "mance by considering only one at a time. And we find that the set of structural features by itself can yield high accuracy, which again confirms that strong distinctions exist between short-term and longterm group structures."
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "n": "4.3",
               "text": "Group Lifecycle Prediction",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Given the strong separability between the long-term and shortterm groups, we pose a fundamental question of how well can we predict if a group can grow and persist in the long run, from the features exhibited in its early age?",
               "The strong dichotomy of group lifecycle and structure dynamics leads us to a natural modeling and prediction questions --how separable are the long-term and short-term groups by taking into account the structural, behavioral as well as demographical features? Can we predict whether a social group will grow and persist in the long run by analyzing the structural and behavioral patterns exhibited by the group at its early stage? In this section, we address both issues through analyzing the snapshots of millions of groups, combining a broad range of features. In this model, we consider the task of predicting whether a group is long-term or short-term, from features including the underlying group network structure, the membership cascade tree properties, and the demographics entropy of group members. The full list of features can be found in , where we are only using grouplevel ones for this task."
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "n": "4.3.1",
               "text": "Separability Model",
               "type": "modelling"
          },
          "paragraphs": [
               "To train the separability model, we construct the training dataset by labeling groups with less than 5 days of lifespan as negative examples, and groups with longer than 25 days of lifespan as positive examples. We represent each group as a feature vector extracted one month after groups are built, and further train the dataset using support vector machine (SVM) with 10-fold cross validation. The way we implement the early prediction model is largely similar to the separability model previously except for the subtle difference that group features (see group-level features in ) are extracted at earlier timestamps. Specifically, for each group in our training set, we take multiple snapshots at the age of 1 hour, 1 day, 5 days, 10 days, 20 days and 1 month, and calculate the feature vector accordingly. We repeat similar procedure to train the dataset with respect to features extracted at various timestamp, and compare the training performance. shows the prediction performance results at different stages. We find that features extracted one day after the groups being set up can yield AUC accuracy as high as 65.08%, which is almost as good as the prediction accuracy of 66.62% when adopting features at timestamp of 1 month.",
               "The results of early prediction model reassure that the likelihood for social messaging group to grow in the future can be well inferred from its very early age (e.g., 1 day). Such predictability is in contrast to previous study on predicting the longevity of online social communities which requires features at the age of months for making short-term prediction and years for making long-term prediction. And again this is partly due to the different nature of social messaging groups and online communities in terms of the lifecycle.",
               "The prediction results are shown in . We find that highest classification accuracy (66.62% AUC) can be obtained with full set of features. We further investigated how each set of features (i.e., structure, cascade and demographics) affects the training perfor-"
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "n": "5.",
               "text": "MEMBERSHIP CASCADE PROCESS",
               "type": "modelling"
          },
          "paragraphs": [
               "Now we have modeled the growth and evolution of social messaging groups from a group-level perspective. In this section, we approach the problem with a focus on the individual-level and study the membership cascade process by which group gain new members.",
               "To start with, we introduce a group membership cascade model, as illustrated in . The model captures two important roles: inviter -a group member who sends invitation to friend(s), and invitee -the individual in the inviter's ego networks who gets invited to the group chat 2 . For instance, the big dotted circle in encompasses all the current members within a group. There are two essential steps behind each invitation: 1) a member in a group become active (denoted by blue in ), and 2) the active member selects his/her friends (denoted by red in ) into the group chat. he/she tends to start invite other people soon. For example, about 80% of the first invitations happen within 5 days after the inviter joining the group. On the other hand, we find that members suffer from a longer latency in sending their first invitations than the invitation interval in general. For example, more than 80% of consecutive invitations happen within 2 days of interval. friendship : Graphical example of WeChat groups' cascade process model. At some timestamp T , some members in a group become active (denoted by blue) and select their friends (denoted by red) to the group chat."
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "n": "5.1",
               "text": "Membership Cascade Pattern",
               "type": "modelling"
          },
          "paragraphs": [
               "In this subsection, we probe into the local structure of group and investigate how the membership cascade process is influenced by the structural features. Specifically, we study how the probability for a user u being invited by his/her friend into a group is affected by the structure of ego networks of u."
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "n": "5.1.1",
               "text": "Behavioral Pattern",
               "type": "modelling"
          },
          "paragraphs": [
               "To have a better understanding of membership cascade pattern, it is important to first study group members' behavioral pattern. For example, an interesting question would be how often do people invite their friends into the group chat once they become a group member? This can also be phrased as how often do membership cascade happen in social messaging groups? In this subsection, we provide some empirical findings concerning members' invitation behavior pattern measured by the concepts of invitation interval and first invitation latency defined below. Definition 3. Invitation Interval is defined as the time interval between any two consecutive invitations from a group member. Additionally, First Invitation Latency is defined as the interval between the timestamp at which a user joins a group (invited by some existing member) and the timestamp when he/she, for the first time, invites another friend to the same group.",
               "Intuitively, investigating the action of a group member's first invitation is useful since it signifies how well has he/she been adapting to the current group, and how strong the sense of relevance he/she has with respect to the current group.",
               "To address above questions, we obtain the distribution of invitation interval and first invitation latency, aggregating over each member in each group. (a) and show the CDF curve of first invitation latency and invitation interval, respectively. We observe the invitations in WeChat groups are highly time-sensitive. On the one hand, when one is invited to a group, Backstrom et al. Revisit. In the context of online social networks, Backstrom et al. introduced the probability that an individual adopts and joins a community with the number of friends already in the group.",
               "As noted earlier, a significant difference in our setting of social messaging group is that new group members are \"passively invited\" to the group rather than \"actively adopt\" the group. To this end, we calculate P (k) -the fraction of user who is invited to a community as a function of the number of k of their friends who are already members, with slightly tweaking the definition in . Specifically, we first take two snapshots of group membership, with 10 days apart. We find tuples (u, C, k) where u /C at the time of the first snapshot and u has k friends in C at that time. We then compute P (k) by looking at the fraction of tuples (u, C, k) that uC at the time of the second snapshot.",
               "The results for WeChat group (see (b)) exhibit an interesting contrast to the curves of LiveJournal and DBLP groups shown in Backstrom, Huttenlocher, Kleinberg and Lan . Instead of observing an increasing trend of the curve with respect to larger values of k, we find a qualitatively different shape where the adoption probability suffers from a slight decrease at moderate values of k, and drastic fluctuations when k exceeds 40. We infer such difference is caused by the mechanism inherent to WeChat, that when a group has more than 40 users, inviting friends to join the group requires their confirmation. We leave the detailed inspection on this for future investigation.",
               "Furthermore, we also observe a strong evidence for the influence of structural locality. In particular when k is small, the fraction of invitee (invited to the group) with 10 friends already in the group (k = 10) is twice as much as the fraction of invitee with 5 friends in the group (k = 5).  The number of connected components (a) Example of local structure being invited to the group(%) (b) #Friend in group The sum of the lengths of the shortest paths between all pairs of vertices, i.e., Wiener index."
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "text": "Demographics",
               "type": "modelling"
          },
          "paragraphs": [
               "Number, fraction of members from country X. Number, fraction of members who stated their gender to be X. Number, fraction of membes who stated their age to be X. Entropy of member's region (country, province, city) distribution, e.g., ? xCountries P (x) log 2 P (x). Entropy of member's age: ? xAges P (x) log 2 P (x). Entropy of member's gender: ? xGenders P (x) log 2 P (x). Inviter Level (for member u in group C at time T )"
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "text": "History Behavior",
               "type": "modelling"
          },
          "paragraphs": [
               "How long has it been since u joined C. How long has it been since u invited others to C. The number of users that u invited to C before time T . The number of chat made by the individual."
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "text": "Local Structure",
               "type": "modelling"
          },
          "paragraphs": [
               "The number of u's friends in the fringe withk friends in the group, The number and fraction of u's friends in the group: |{v|vego(u)vC}|. The number and fraction of u's friends not in the group: |{v|vego(u)vC}|. The number of cross group edges in u's ego networks: |{(v, w)|vCwCu, wego(u)}|. The ratio of cross group edges to cross group edges that could possible exist in u's ego networks. The depth of u in cascade tree.",
               "Invitee Level (for user u in the fringe of group C at time T ) Demographics User u's stated gender. User u's stated age. User u's stated region (country, province and city). The fration of group member who has the same gender as u.",
               "The fration of group member who has the same age as u.",
               "The fration of group member who has the same region (country, province, city) as u."
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "text": "Local Structure",
               "type": "modelling"
          },
          "paragraphs": [
               "Number of friends already in the group. Number of friend in group C who are classified as acitive inviters. Number of connected components formed by friends already in the group.",
               "Structural Diversity. The above analysis informs us that the number of friends in the group can affect whether a user gets invited. Yet it is unclear how it is affected by the local network structure.",
               "In this subsection, we study how structural diversity of user u's ego networks affects the probability for u to be invited by friends into a group. For a given user u with k friends already in a group, we measure structural diversity by counting the connected components in the networks formed by these k friends. For example, as illustrated in (a), user v has four friends (A, B, C and D) already in a group. A, B, C and D form 3 connected components, i.e., {A, B}, {C} and {D}. plots the curves of the probability of being invited to a group with respect to the number of connected components formed by friends already in group. We choose the parameter k (i.e., the number of friends already in group) to be 2, 3, 4, 5, 6-10 and > 10, respectively. Interestingly, we find that given a fixed k, the more closely these k friends are connected, the more likely u will be invited to the group. cross validation. The prediction performance results are shown in . We see that our model is quite effective, with AUC of 95.31% in predicting inviter, and an AUC of 98.66% in predicting invitee. We further investigated how each set of features affects the training performance by considering only one at a time. Quite interestingly, we find that historical behavioral features can be important factors in the task of predicting inviter; while local structural features are the dominant ones in predicting invitee. The information of demographics exert little affect on the performance of predicting invitee, which implies that our model can be generalizable without requiring user-specific attributes."
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     },
     {
          "head": {
               "n": "5.2",
               "text": "Membership Cascade Prediction",
               "type": "modelling"
          },
          "paragraphs": [
               "Now we have seen how the membership cascade process can be affected by both users' behavioral pattern as well as the local structure surrounding a user. In this subsection, we propose a prediction model by integrating a comprehensive set of behavioral and structural features. This can be used in practice to make effective inference on the membership cascade process. Specifically, given the historical behavior of group members as well as the local social structure, can we predict which members in the group are more likely to be active and invite new users to the group chat and to whom will he/she send invitations to?",
               "To address the issue, we separately model the inviter prediction and invitee prediction problems. Inviter Prediction. At some timestamp T , for a given group C and a specified user uC, our learning task here is to predict whether u will become active and invite friends to C during the time interval . Invitee Prediction. At some time T , for a given group C and a user uf ringe(C), our learning task here is to predict whether u (one-hop neighbor of current members) will be invited to C during the time interval (T , T + ?t].",
               "For both prediction task, we construct each training example by randomly selecting T from 10 minutes to 1 month, and fixing ?t = 1 day. We also notice that, on average, only 5.6% of group members have invitation action and fewer than 1% among users in the fringe of groups are invited, causing the number of positive examples and negative examples quite unbalanced. We thus down-sample the size of negative examples and maintain a positive/negative ratio of 1:2 in our training set.",
               "Summary. In this paper, we studied the formation and evolution of chat groups in the context of social messaging -their lifecycles, the change in their underlying structures over time, and the diffusion processes by which they develop new members. We use a large collection of anonymized data from WeChat group messaging platform, providing analysis on dynamics of millions of groups by keeping track of their emergence, growth and demise over time. We discovered a strong dichotomy of groups existed in terms of their lifecycle, and defined two types of groups accordingly: longterm and short-term groups. First, we developed an effective separability model by taking into account a broad range of grouplevel features, showing that long-term and short-term groups are inherently distinct. We also found that the lifecycle of messaging groups is largely dependent on their social roles and functionalities in users' daily social experiences and specific purposes. Specifically, event-driven groups in general have a shorter lifespan as apposed to those friendship groups serving for frequent catching-up purpose. Given the strong separability between the long-term and short-term groups, we further addressed the problem of early prediction in group longevity, and demonstrated that strong prediction results can be obtained even with a group's history up to one day.",
               "In addition to modeling the growth and evolution from a grouplevel perspective, we also investigated the individual-level attributes of group members and study the diffusion process by which groups gain new members. We developed a membership cascade process model in which we consider users' historical engagement behavior as well as the local social network structure that users embedded in. We demonstrated the effectiveness by achieving AUC of 95.31% in the inviter prediction model using all features, and an AUC of 98.66% in the invitee prediction model. Future Research. Ours findings raise many important open questions that would be interesting to take into account in future research. First, our design of membership cascade model can be used for group member recommendation, and may be potentially integrated into current WeChat platform. This can motivate research on conducting online experiments and investigating whether users are likely to adopt the group member recommendations, and under what circumstances. Such studies will also lead to design of better group chat platforms and engage users more effectively. We incorporate both group-level and inviter-level features seen in for training the inviter model; and use instead the grouplevel and invitee-level features for invitee model. We further train the dataset using support vector machine (SVM) with 10-fold"
          ],
          "paper_id": "243da200-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "The Lifecycle and Cascade of WeChat Social Messaging Groups"
     }
]