[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "The problem of influence maximization deals with choosing the optimal set of nodes in a social network so as to maximize the resulting spread of a technology (opinion, product-ownership, etc.), given a model of diffusion of influence in a network. A natural extension of this would be to introduce a competitive setting, in which the goal is to maximize the spread of our technology in the presence of one or more competitors. We suggest several natural extensions to the well-studied linear-threshold model that was used in the single-technology case, and show that the original greedy approach cannot be used. Furthermore, we show that for a broad family of competitive influence models, it is NP-hard to achieve an approximation that is better than a square root of the optimal solution. Also, we show that the same proof of hardness of approximation can also be applied to give a negative result for a conjecture in [2] about a general cascade model for competitive diffusion. Finally, we suggest a natural model that is amenable to the greedy approach."
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     },
     {
          "head": {
               "n": "1",
               "text": "Introduction",
               "type": "introduction"
          },
          "paragraphs": [
               "The problem of influence maximization has long been the focus of study in social science (e.g. ). It has been formally defined and addressed in and as follows: given a social-network as a directed graph, and a prescribed number k, pick the k most \"influential\" nodes that will function as early adopters of a particular influence, so as to maximize the final number number of infected, or activated nodes (the two terms are used in this paper interchangeably), subject to a specified model of influence diffusion. This problem begs the natural extension of a competitive version: given the competitor's choice of early adopters of technology B, maximize the spread of technology A by choosing a set of early adopters such that the expected spread of technology A will be maximal. Indeed, this problem has been the subject of interest in subsequent papers ( , , ) which present competitive extensions for the independent cascade model presented in . In this paper we suggest a few natural extensions to a well-studied model that was also given in for the diffusion of social influence in a social network -the linear threshold model. Formally, an instance of the problem would be composed of a directed, edge-weighted graph G = (V, E), a set of technology B's initial adopters I B ? V , and an integer k. The computational problem is how to choose a set I A ? V ? I B of k nodes such that the expected number of A-active nodes at the end of the process,(I A , I B ), is maximized, given the specific model for competitive diffusion of technologies (when I B is known from context we omit it and simply write(I A )). It is important to note that all of the presented models can be motivated by natural processes. Our models reduce to the original linear threshold model formalized in whenever I B is the empty set. For simplicity of notation, the models presented are stated in terms of only two competing technologies. However, all of the models and results can be easily extended for when there are several competing technologies.",
               "A well-known greedy (1 ? e ?1 )-approximation given in is used extensively for problems of maximizing set-functions, and in particular has been applied to both the original problem and competitive extensions ( , ). The approximation algorithm requires that the set function() at hand, which assigns a real-value to subsets of a ground set U , uphold two basic properties 1 .",
               "? Monotonicity: the value of the function increases as more items are added to the set:(S)(T ) for any two sets S ? T ;",
               "? Submodularity: the impact of adding an element to a set decreases as the set is extended (diminishing returns):(S{x}) ?(S)(T{x}) ?(T ), for any S ? T ? U and xU ? T ;",
               "Except for the last model, described in section 6 -the OR model, all of the models do not satisfy submodularity. In fact, one of them is not even monotone.",
               "Outline The remainder of this document is organized as follows. Sections 2 and 3 describe two competitive threshold models. Section 4 shows that even when applying a final step that A-activates more nodes, the process remains non-submodular. Section 5 shows that the last two models are in general hard to approximate, regardless of the final forcing step or any tie-breaking rules that are used when a node is reached by more than one technology. On a more positive note, in section 6 we suggest a fairly natural and simple model for which the approximation algorithm given in is applicable. Finally, section 7 summarizes our main results along with a few open problems and possible directions for future research."
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     },
     {
          "head": {
               "n": "2",
               "text": "The Weight-Proportional Competitive Linear Threshold Model",
               "type": "modelling"
          },
          "paragraphs": [
               "As in the non-competitive case, the process unfolds in discrete steps, during which new nodes become \"activated\" for a single technology The infection of a node by a technology represents an individual in the social network that has assumed the influence of that technology. The process is progressive: a node that is infected by a technology remains infected by it. As in the noncompetitive case, every edge (u, v) is assigned a weight w u,v[0, 1] which roughly characterizes the weight of influence that u has over v (i.e the impact that u's infection will have over v's likelihood to be infected with the same technology as u). Also, the total weight of incoming edges to every node is bounded: for every vV we have: u w u,v[0, 1]. Each node u initially chooses a thresholdu which represents the minimum fraction of active neighbours necessary for u's activation. As in , in order to make up for our lack of knowledge about each node we assume thatuR [0, 1] (uniformly at random), oruR [a, a ] for 0aa1 to reflect partial knowledge about a node.",
               "In order to describe the process itself, we will use the following notation:",
               "Definition 2.1. For a given step t in the process, lett denote the set of active nodes at the beginning of step t. Furthermore, lett A andt B be the sets of A-active and B-active nodes in step t, respectively.",
               "Given the sets I A , I B of early technology adopters, the process unfolds as follows. First, each node chooses its threshold value at step 0. Then, in each step t, every inactive node v checks the set of edges incoming from its active neighbours. If their collective weight exceeds the threshold values by having uʦt w u,vv , the node becomes active. In that case, the node will adopt technology A with probability equal to the ratio between the collective weight of edges outgoing from A-active neighbours and the total collective weight of edges outgoing from all active neighbours; that is,",
               "Otherwise, it will adopt technology B. Since this problem can be reduced to the singletechnology linear threshold model whenever I B is the empty set, we notice that this problem is NP-hard -as proved in .",
               "Intuitively, it appears that by adding a new node to the set of initial A-adopters, the spread of technology A in the social network can only increase (or remain unchanged). However, this is in fact not always the case, even for some binary rooted trees. We will formalize this somewhat counter-intuitive behaviour.",
               "Theorem 2.1. There exists an instance of the weight-proportional competitive linear threshold problem for which monotonicity does not hold.",
               "Also, it can be shown that submodularity fails to hold in some cases, as the following theorem shows:",
               "Theorem 2.2. There exists a graph G, for which the expected influence of technology A is not submodular.",
               "The proof of the above two theorems is given in appendix A."
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     },
     {
          "head": {
               "n": "3",
               "text": "The Separated-Threshold Model for Competing Technologies",
               "type": "modelling"
          },
          "paragraphs": [
               "In the previous model, the node activation step regarded active nodes as equal, so that a given node is activated by its active neighbours regardless of their technologies. That is, the sum of generally active nodes was used for activating a node. However, one could model the following notion of a spread process. Each individual has separate criteria for becoming active for each technology. A node can be activated by either its A-active or B-active neighbours whenever the sums of their respective edge-weights exceed the required thresholds specified for their technologies.",
               "Formally, consider the following model. For a given network G = (V, E), every edge (u, v)E is assigned a real-valued weight corresponding to each technology",
               ", which reflects node u's impact on v. Two disjoint sets I 0 A , I 0 B ? V denote the sets of initially A-active and B-active nodes, respectively. At step 0, each node vV picks two threshold values",
               "as the sets of A-active and B-active nodes. During every step t, an inactive node v will become A-active if",
               ", and will become B-active if",
               "If for the node v both thresholds are exceeded during the same step t, then a technology would be picked uniformly at random (we can either use a simple coin-flip or employ a more involved tie-breaking function).",
               "In contrast to the previous model, this model is monotone. Its key property, which distinguishes it from the previous model, is that the probability that technology B wll propagate cannot increase as a result of A-activating additional nodes. This stems from the definition of the model, in which each set of technology specific neighbours relate to a separate threshold value.",
               "Let us use the following notation:",
               "Definition 3.1. Given the sets I A and I B , and a node x /I B , definet v , ?t v as the probabilities that a given node v will adopt technology A by step t for the initial sets of early adopters (I A , I B ) and (I A{x}, I B ), respectively.",
               "Theorem 3.1. For a given instance of the problem and a choice of early adopters: I A , I B and node x, ?t vt v for any node v and and for any step t0.",
               "The proof of theorem 3.1 is fairly straightforward, and is given in appendix B for completeness. The process is not submodular in general.",
               "Theorem 3.2. There exist instances of the competitive influence problem where the separatedthreshold competitive model is not submodular.",
               "A corresponding counter-example along with the intuition behind it are given in appendix C."
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     },
     {
          "head": {
               "n": "4",
               "text": "Competitive Threshold Model with Forcing",
               "type": "modelling"
          },
          "paragraphs": [
               "We now introduce a modification which changes the concept of influence in a network: forcing. Specifically, at the end of the previous model, each inactive node v will choose a technology randomly (say, it will choose technology A with probability). This step is natural for cases where individuals have to eventually decide which influence to adopt (e.g. voting when abstentions are not allowed). For convenience we will assume that the \"forcing\" step occurs at step n (the spread can take up to n ? 1 steps), whether or not the spread took n ? 1 steps. Clearly this does not have any effect on the outcome of the process. We show that regardless of the forcing step, this variant does not help us achieve submodularity. However, the process remains monotone as the following theorem can be proven by extending lemma 3 with a case analysis for the forcing step.",
               "Theorem 4.1. For a given instance of the competitive influence with forcing problem, a choice of early adopters I A , I B and node x,",
               "for any node v and for any t."
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     },
     {
          "head": {
               "n": "4.1",
               "text": "Submodularity",
               "type": "modelling"
          },
          "paragraphs": [
               "The following theorem shows that not only is the given model non-submodular, but also regardless of the tie-breaking rule and the forcing rule (if any is used), the model remains non-submodular.",
               "Theorem 4.2. For any tie-breaking rule, and any forcing rule, the separated-threshold competitive model is non-submodular.",
               "A corresponding counter-example is given in appendix D."
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     },
     {
          "head": {
               "n": "5",
               "text": "Hardness of Approximation",
               "type": "modelling"
          },
          "paragraphs": [
               "We show that in any model with separate edge-weights and separate threshold values for each technology the problem is hard to approximate.",
               "Theorem 5.1. It is NP-hard to give an approximation with a ratio better than ?(N 1 2 ? ), for all > 0, for the Separated-Threshold Competitive Influence problem, where N is the number of nodes in the graph.",
               "The actual proof is supplied in appendix E. It is important to note the proof of theorem can be applied to similar competitive cascade models as well. Namely, in it was conjectured that when allowing 2 sets of edge weights for each edge -one for each technology, the process will remain monotone and submodular. The above hardness of approximation result can be easily modified in order to apply for the separate edge-weights case of the Wave Propagation model suggested by Carnes et al., thereby giving a negative answer to their conjecture.",
               "Theorem 5.2. It is NP-hard to give an approximation with a ratio better than ?(N 1 2 ? ), for all > 0, for the Wave Propagation Competitive Influence problem given by Carnes when edges are allowed to have technology-specific probabilities."
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     },
     {
          "head": {
               "n": "6",
               "text": "The OR Model",
               "type": "modelling"
          },
          "paragraphs": [
               "We now introduce a different way of extending the original threshold model, in which each technology diffuses unhindered by the competing technology. Here, the tie-breaking stage will take place after all technologies finish spreading. This model can be considered natural for cases in which individuals have the liberty of being influenced separately and independently by different technologies, but have to choose a single technology eventually.",
               "We will define the OR model as follows. As before, an instance of the model is a graph G = (V, E), a set of edge weights for each technology:",
               "with the same constraints as before), and initial adopters:",
               "are assigned. Let each technology propagate separately throughout the graph w.r.t the original non-competitive linear threshold propagation process, and let R A , R B ? V be the sets of nodes reached by the technologies (independently). As a final step, a node v /I AI B will assume technology A with probability f A v (R A , R B ), technology B with probability f B v (R A , R B ), and no technology with",
               ". We only require the functions f A v (,), for every vV , to be monotone and submodular with respect to the set of initial A nodes.",
               "The following theorem shows that one can efficiently find an approximation for the set that maximizes the spread of one's own technology, given a competitor[s] choice of initial adopters:",
               "Theorem 6.1. Given technology B's early adopters I B , one can find an (1?e ?1 ? for the competitive OR process in a polynomial number of steps, for any > 0.",
               "The proof follows immediately from the following two lemmas which prove the properties required in . We will show that this process is monotone and submodular whenever the function f v (,) is monotone and submodular w.r.t. technology A, for all vV . Lemma 1. The OR model is monotone with respect to the number of nodes influenced by technology A.",
               "Proof. Let r A (I A ), r B (I B ) denote an outcome for a run of the independent propagation processes of the two technologies. Monotonicity w.r.t technology A is satisified if for any two sets",
               "Since until the decision step the two technologies' propagations are independent, we can fix the outcome of technology B, and show that the expected propagation of technology A is monotone. This is immediate since first, the propagation of technology A until the decision step is clearly monotone (follows from the non-competitive threshold model in ). Second, the decision functions f A v (,) and f B v (,) are monotone with respect to technologies A and B, which along with the previous argument yields monotonicity.",
               "Lemma 2. The OR model is submodular with respect to the number of nodes influenced by technology A.",
               "Proof. In order to prove this, we will use a technique given in that suggests an alternative and equivalent model for the propagation of a single technology. For each node vV , instead of choosing a threshold in , choose an incoming edge (u, v) with respective probability w u,v , and no incoming edge with probability u w u,v . A node will become infected if and only if there is a path from the initially infected nodes that consists strictly of such chosen edges. Originally, this equivalent process was used for showing submodularity for the non-competitive case by simply fixing an instantiation of chosen edges. We will do the same in our case. Fix an instantiation R B of the outcome of the propagation of technology B (independent of the propagation of technology A) and a set of chosen edges for the propagation process of technology A. For a set I A of initial A nodes, as before, let R A (I A ) denote the set of nodes reachable from I A in the sub-graph induced by the set of chosen edges. In order to show that the process is submodular, we need to show that for all S ? T ? V ? I B :",
               "for all vV . We will simply use the monotonicity property of the independent propagation process and the submodularity of f A v (,). Let R A (S{x}) = R A (S)? 1 , and similarly, R A (T{x}) = R A (T )? 2 . From the monotonicity and submodularity we get that R A (S) ? R A (T ) and ? 2 ? ? 1 . Therefore:",
               "The first inequality and second inequality follow from the submodularity and the monotonicity of f A v (,), respectively. Taking all possible instantiations gives submodularity since a positive linear combination of submodular functions is submodular.",
               "Mossel et al. show that if we generalize the propagation process by replacing the linear sum (used to decide whether an uninfected node exceeds its threshold) with an arbitrary monotone submodular function, then the resulting process (under any monotone submodular objective function) is again monotone and submodular. This result generalizes to the corresponding competitive process, which we call the generalized OR process.",
               "Theorem 6.2. Given technology B's early adopters I B , one can find an (1?e ?1 ? for the generalized competitive OR process in a polynomial number of steps, for any > 0.",
               "in the main result of . The function ? counts the expected number of A-adopters at the end of the process. It is monotone and submodular because the f A v are."
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     },
     {
          "head": {
               "n": "6.1",
               "text": "Repeating OR processes",
               "type": "modelling"
          },
          "paragraphs": [
               "Finally, we give a natural extension of the OR model. There are cases in which the independent propagation process will repeat several times (e.g. every day, for days). The process can be thought of as being run iteratively, where during each iteration i the previous iteration's turnouts R A and R B are used as the initial adopters for each technology. At the end of the iteration, and only then, the decision step is invoked by using the functions f A v (,) and f B v (,), for all vV . One may notice that this formulation simply defines a composition of OR processes (with a single execution of the decision step at the end).",
               "We can give a natural motivation for such a process: during the course of an election race, voters will spread the word each day. However, once in while, an unaffected voter may change her mind (her threshold value) and thus the process of \"rumor spread\" and social-based recommendation will run again, infecting additional voters as a result.",
               "With this in mind, the following general theorem follows from a simple generalization of the proof in . Theorem 6.3. A process based on the repetitive execution of the generalized OR process with a single decision step at the end is monotone and submodular.",
               "Note that theorem 6.3 holds even the edge weights are modified between each iteration."
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     },
     {
          "head": {
               "n": "7",
               "text": "Conclusions",
               "type": "conclusion"
          },
          "paragraphs": [
               "We have presented a number of fairly natural and general approaches for modelling competitive diffusion of influence in a social network, extending the known threshold model for the spread of a single technology. However, most of our suggested approaches have been shown to be unfit for the Nemhauser et al. approximation technique. For some models, we can show NP-hardness of approximation, while for others we only show that they are not submodular (and not even monotone in one case), leaving open the question to whether an efficient approximation algorithm can be found.",
               "We emphasize that all of the suggested models in this paper have reasonable, natural motivations, which implies that there is no single \"true\" model. Also, as suggested in , we believe that these models can be used in a more game theoretic setting, where players are the competing companies, who place bids on strategic nodes in hope for maximizing their outcome. We suggest the following directions for future research:",
               "? Can the hardness-of-approximation result be extended to other models?",
               "? Are there any other natural competitive models which can be approximated in polynomial time?",
               "? Study some natural game-theoretic setting for the competitive models.",
               "? Suggest models for cases where nodes may adopt more than one technology. "
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     },
     {
          "head": {
               "text": "A Counter Examples for The Weight-Proportional Competitive Linear Threshold Model",
               "type": "modelling"
          },
          "paragraphs": [
               "In section 2 we gave two theorems concerning the monotonicity and submodularity of the model described. These theorems will be proven in this appendix.",
               "Theorem A.1. There exists an instance of the weight-proportional competitive linear threshold problem for which monotonicity does not hold.",
               "Proof. Consider the tree in . We will explicitly calculate the values oft v and?and? and?t v . First, consider the case in whichr0.5. Then r will be A-active if one of the following occurs:",
               "1. v becomes A-active during step 2.",
               "2. v does not become active (hence r will be A-activated in step 4).",
               "Before adding x, the first case cannot happen, and the second case happens only whenv(0.  and  Essentially, this counter-example illustrates an interesting behaviour of the process. First, notice the high ratio of the weight of the edge connecting the B-subtree to the weight of the subtree containing x. Also, notice that the initially B-active node is located higher relatively to initially A-active nodes (only x in the given simple example). These two properties increase the probability that the parent node (v in our case) will adopt technology B, much more, and much more quickly than the probability that it will adopt technology A. This in effect, contributes to the decrease in the probability that the higher node (r in our case) will adopt A. Another point, is that this example shows that in less pathological cases, a node's probability of becoming A-active may increase, but this increase may come at the expense of a much higher increase in the probability of becoming B-active. In other words, by A-activating certain nodes, actually the competitor will benefit the most.",
               "Theorem A.2. There exists a graph G, for which the expected influence of technology A is not submodular.",
               "Proof. Consider the tree depicted in .",
               "It can be easily shown that for S = {w}, T = {w, y} (the set of early adopters of technology B is denoted in the diagram) submodularity does not hold as4 r (S) = "
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     },
     {
          "head": {
               "text": "B Proof of The Monotonicity of The Separated Threshold Model",
               "type": "modelling"
          },
          "paragraphs": [
               "Theorem B.1. For a given instance of the problem and a choice of early adopters: I A , I B and node x, ?t vt v for any node v and and for any step t0. : A counter-example for submodularity",
               "In order to prove the theorem, we will fix the set I B of early technology B adopters and consider a set of early technology A adopters I A and a node x not in I B .",
               "We prove the monotonicity by fixing an arbitrary instantiation of the thresholds vectors,",
               ", and by choosing for every node technology A with probability 0.5 and choosing B otherwise. The outcomes of the tie-breaking fair coin flips will be revealed in cases where the two thresholds chosen for a particular node are exceeded simultaneously. Notice that this defines a deterministic instantiation of the process.",
               "Denote by1 ,2 to be the deterministic processes using the same instantiations of the threshold values and coin-flips, and using (I A , I B ) and (I A{x}, I B ), respectively. Furthermore, let N t A (), N t B () denote the set of A and B active nodes at step t in process, respectively. The following lemma implies theorem 3.1",
               "Lemma 3. For a fixed instantiation of the thresholds values and the tie-breaking coin flips for each node in advance, the following holds for each node vV and every step t0 1. If v is not B-active at step t in1 , then v is not B-active at any step tt in2 .",
               "2. If v is A-active at step t of1 , then v is activated in some step tt in2 .",
               "Proof. We will prove the lemma by induction on t. For step t = 0, the lemma trivially holds since I A ? I A{x}. Assume that the lemma holds up to step t, we will prove the lemma for step t + 1. For proving the first part of the lemma, consider any node v that is not B-active at step t + 1 in1 . By the induction hypothesis, node v was not B-active at step t in2 . Moreover, by the induction hypothesis, none of the neighbours of v that were not B-active at step t in1 are B-active at step t in2 . Therefore,",
               ", which implies the first part of the lemma. For proving the second part of the lemma, let v be a node that is A-activated at step t + 1 in1 . Consider the following cases:",
               "1.  : A counter-example for submodularity for the case of separated thresholds.",
               "2.",
               "This implies that both thresholds were exceeded at step t+1. From part 1 of the lemma,B v cannot be exceeded prior to step t + 1 in2 . By the induction hypothesis",
               "The above observations imply that whereasB v may not be exceeded at, or before step t + 1 in2 ,A v is exceeded by step t + 1 of2 . Since the same instance of coin-flip is used for1 and2 , v will be A-active even in the case thatA v andB v are exceeded in step t + 1 of2 simultaneously."
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     },
     {
          "head": {
               "text": "C Counter-Examples for The Separated Threshold Model",
               "type": "modelling"
          },
          "paragraphs": [
               "Theorem C.1. There exist instances of the competitive influence problem where the separatedthreshold competitive model is not submodular.",
               "Proof. Adding a node x to a set of initial A adopters may directly increase the probability that a node v will be A-activated. This can be seen in the alternative (equivalent) model case: it may lie on the A-edge path ending in v, thereby shortening the existing shortest path or create a path which didn't exist prior to the addition of x. However, it may indirectly increase the probability of A-activation by simply \"eliminating\" the competition as a result of blocking the propagation of technology B. Consider the tree in (the first number in the edge annotation is the A-weight, and the second one is the B weight). Let the two sets of initial A-adopters be: S = {}, T = {v}. For this example we will consider the original threshold model.",
               "? Before adding x to S and T : r had zero probability of becoming A-active when using S, and probability 0.5 when using T .",
               "? After adding x to S and T : The probability that r will become A-active remains 0 when x is added to S (though its probability of becoming B active decreased to 0). When using T on the other hand, the probability is now 1, since by adding x technology B is blocked.",
               "Note: The above counter-example also holds for a model in which the tie-breaking step is a little different: for example if for a node v the two thresholds are exceeded simultaneously, the technology with the highest sum of respective edge-weights is chosen. If all sums of edge-weights are equal, a technology is picked uniformly at random. "
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     },
     {
          "head": {
               "text": "D Counter-Examples for The Competitive Threshold Model with Forcing",
               "type": "modelling"
          },
          "paragraphs": [
               "Theorem D.1. For any tie-breaking rule, and any forcing rule, the separated-threshold competitive model is non-submodular.",
               "Proof. We will give a counter-example in which there are no ties, and the node in question does not remain inactive. Consider the rooted tree in . Let S = {u}, T = {u, y}. The initially B-activated nodes are given in the diagram. Notice that no ties are possible -any uninfected node may be infected by at most one node at any given step. Also notice, that the forcing step at the end would not apply to the root since if its left child remains uninfected or is B-infected, its right child would eventually infect it with technology B. We get a \"race condition\" in which we have to block B's propagation in the left subtree of the root in order to get r A-infected.",
               "When using S,6 r (S) = ?6 r (S) = 0 since r's left child is infected with B first. On the other hand,6 r (T ) = 0 and?and? and?6 r (T ) = 1 since technology B's propagation in r's left child is completely blocked, allowing technology A to propagate to r and infect it before B reaches it through r's right child. Therefore, the probability jumps from 0 to 1, contradicting submodularity."
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     },
     {
          "head": {
               "text": "E Proof of The Hardness of Approximation Result",
               "type": "modelling"
          },
          "paragraphs": [
               "Theorem E.1. It is NP-hard to give an approximation with a ratio better than ?(N  Proof. We are motivated by the counter-example in theorem 4.2. We construct a reduction from vertex cover problem. Recall that in the vertex cover problem the problem is to find a minimal set S of vertices in the graph G such that every edge in G has at least one endpoint in S. In the separated-threshold competitive influence problem the task is to find a set S of k nodes that maximizes(S , I B ) (expected number of A-infected nodes), given a prescribed number k and the competitor's set of nodes I B .",
               "The reduction We are given an instance of the Vertex Cover problem, a graph G = (V, E) and a number k. Let,be constants defined later. Let A 0 be a special source node. For every node vV create a corresponding node A v . For every edge e = (i, j) and t[1, n] create nodes B e,t e,t e,t 0 , X 0 , X 1 , M e,t . Additionally, for every t[1, n] we add nodes B t 1 , P t 0 , P t 1 . Extra nodes are needed for creating paths as depicted in . We create several edge sets E 1 = {(A u , X e,t e,t e,t e,t 1 ), (A v , X 2 )|e = (u, v)E, t[1, n]}, E 2 = {(X 1 , X 2 )|eE, t[1, n}. In addition, for every t we create a set of edges as depicted in . The edge annotation is as follows:",
               "? Dotted edges have A-weight 1 and B-weight 0.",
               "? Dashed edges have A-weight 0 and B-weight 1.",
               "? Plain edges have both weights set to 1.",
               "? Edges with a length annotation are paths of the annotated length; all edges are of the same type.",
               "Finally, let I B be composed of the set of nodes B e,t 0 and B t 1 for every eE and t[1, n]. Claim 1. If there exists a k-cover for the original graph G there exists a set I A ? V ? I B of size k + 1 that yields(I A )n+. Otherwise, for every I A ? V ? I B ,(I A ) = O(max{n+3 , n+1 }).",
               "Consider the first part of the claim. Assume that there is a k-cover S for G. Then simply let I A = {A v |vS}{A 0 }. Since S is a vertex-cover, it implies that the spread of technology B emanating from the vertices B t 0 is completely blocked. Thus, every node on the path from A 0 to P t 0 , for all t[1, n] will be A-infected. This in turn implies that for all t[1, n], every node on the path from P t 0 to P t 1 will be A-infected. Thus, we have at least n+A-active nodes, as required.",
               "Now consider the second part of the claim. Let I A be the optimal set of k + 1 initial A-adopters that either does not contain A 0 or I A{A v } vV is not a vertex cover for G. Each vertex in I A can contribute the most by either one of two optimal choices:",
               "1. Choosing A 0 may contribute at most (|E| + 5)n.",
               "2. Choosing P t 0 will contribute nA-nodes.",
               "Therefore, the contribution of vertices of the first type is at most O(sn+2 ) = O(n+3 ), and the vertices of the second type contribute at most O(sn) = O(n+1 ), which concludes the claim.",
               "Set=+ 2. The total number of vertices in the reduced graph is N = O(n++ |E|n) = O(n 2+2 ). Thus we get that if there is a k-cover for G then the optimal I A yields(I A ) = ?(N ), whereas any I A that does not correspond to a k-cover yields(I A ) = O(N (+3)/(2+2) ). Hence, any algorithm that gives an approximation ratio of o(N 1?(+3)/(2+2) ) can solve the NP-complete vertex cover problem. Therefore we get that the approximation ratio of any poly-time algorithm is ?(N 1/2? ), for all > 0, unless P = N P ."
          ],
          "paper_id": "244d5970-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Threshold Models for Competitive Influence in Social Networks"
     }
]