[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Trust plays a crucial role in helping online users collect reliable information and it has gained increasing attention from the computer science community in recent years. Traditionally, research about online trust assumes static trust relations between users. However, trust, as a social concept, evolves as people interact. Most existing studies about trust evolution are from sociologists in the physical world while little work exists in an online world. Studying online trust evolution faces unique challenges because more often than not, available data is from passive observation. In this work, we leverage social science theories to develop a methodology that enables the study of online trust evolution. In particular, we identify the differences of trust evolution study in physical and online worlds and propose a framework, eTrust, to study trust evolution using online data from passive observation in the context of product review sites by exploiting the dynamics of user preferences. We present technical details about modeling trust evolution, and perform experiments to show how the exploitation of trust evolution can help improve the performance of online applications such as trust prediction, rating prediction and ranking evolution."
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "text": "Trust Evolution: Modeling and Its Applications Jiliang Tang, Huiji Gao, Atish Das Sarma, YingZhou Bi, and Huan Liu, Fellow, IEEE",
               "type": "modelling"
          },
          "paragraphs": [
               "Abstract-Trust plays a crucial role in helping online users collect reliable information and it has gained increasing attention from the computer science community in recent years. Traditionally, research about online trust assumes static trust relations between users. However, trust, as a social concept, evolves as people interact. Most existing studies about trust evolution are from sociologists in the physical world while little work exists in an online world. Studying online trust evolution faces unique challenges because more often than not, available data is from passive observation. In this work, we leverage social science theories to develop a methodology that enables the study of online trust evolution. In particular, we identify the differences of trust evolution study in physical and online worlds and propose a framework, eTrust, to study trust evolution using online data from passive observation in the context of product review sites by exploiting the dynamics of user preferences. We present technical details about modeling trust evolution, and perform experiments to show how the exploitation of trust evolution can help improve the performance of online applications such as trust prediction, rating prediction and ranking evolution.",
               "Index Terms-Multi-faceted trust, preference-based trust evolution, user preference, social recommendation, trust prediction ?"
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "n": "1",
               "text": "INTRODUCTION",
               "type": "introduction"
          },
          "paragraphs": [
               "T HE social concept of trust has attracted more and more attention from the computer science community in recent years . Trust plays an important role in helping online users collect reliable information , and the trustworthiness of the users is often tantamount to the reliability of the information they provide. For example, users in e-commerce are likely to gather information from their trust networks to make decisions. Therefore many online service providers implement the trust mechanism, especially product review sites like Epinions 1 and e-commerce sites such as eBay . Recent years witness many trust related online applications such as intelligent recommender systems , , collaborative filtering , , review quality prediction and viral marketing . Most of them assume static trust relationships between users. However, trust evolves as humans interact based on the findings from social sciences , , . Most existing work about trust evolution is conducted by sociologists in the physical world , while empirical studies of trust evolution in the online world have remained elusive. One reason is the difficulty in obtaining the information that a sociologist collects for trust evolution in the online world. In a physical world, sociologists first invite a group of participants, usually a small group. In order to get trust information among them, people in the group are usually from the same community such as a company or a university. Then sociologists record their sociometric information on interpersonal trust and conditions or situations for the change . In an online world, users are distributed all over the world. Even if one could find a study group, it would be difficult to gather sociometrics on trust. In other words, passive observation is the modus operandi for studying trust evolution.",
               "The data from passive observation in the online world determines that it is difficult to apply methodologies used in the physical world to the online world. Since it is important to study trust evolution, we ask (1) whether we can study online trust evolution based on the data from passive observation; (2) where and how we can gather online information to model trust evolution; and (3) how to apply trust evolution in trust-related applications.",
               "Product review sites such as Epinions implement a trust mechanism where users can add other users into their trust circles if finding their reviews reliable and useful. Such sites provide a sensible platform to study trust in an online world , , , , . shows a simple online rating system from Epinions at two different time points, denoted as T and T ? 1. As illustrated in , users in the online rating system can establish trust relations with others (e.g., u 1 ! u 2 ) and rate their interested items (e.g., u i ! I 1 ). From T to T ? 1, the rating system evolves, highlighted in (1) new users (e.g., u 5 ) and new items (e.g., I 5 ) are added; and (2) new trust relations (e.g., u 2 ! u 1 ) and new ratings (e.g., u 5 ! I 4 ) are created. The dynamic online rating system on product review sites serves an observable environment to investigate online trust evolution. First, except trust networks, product review websites provide rich temporal information including time points when users entered, the trust relations established and ratings created. Second, sources, reflecting the changing of user preferences, are available from product review sites. The dynamics of user preferences can be captured by their rating information, which is widely exploited to improve the performance of collaborative filtering , , .",
               "Ziegler et al. pointed out that there is a strong and significant correlation between trust and user preference similarity. The more similar two persons are, the greater the trust between them exists. This social theory provides a new perspective for the study of trust evolution in the online world via exploiting the dynamics of user preferences. For example, when people are interested in \"Electronics\" at time t, they trust experts in \"Electronics\" while people shift their preferences to \"Sports\" at time t ? 1, they trust experts in this facet. The evolution of people's trust can be witnessed via the changes of their preferences . In other words, trust relationships will evolve with the drifting of user preferences.",
               "In this work, we make a first attempt to study online trust evolution by exploiting the dynamics of user preferences in the context of online product review. Main contributions of this work include: two types of objects with two different actions, as demonstrated in . Let U t ? fu 1 ; u 2 ; . . . ; u n t g be the set of users at time t (e.g., U T ? fu 1 ; u 2 ; u 3 ; u 4 g in ) where n t is the number of users at time t. I t ? fI 1 ; I 2 ; . . . ; I m t g is the set of items at time t (e.g., I T ? fI 1 ; I 2 ; I 3 ; I 4 g in ) where m t is the number of items at time t. Note that new users or new items may be added 3 thus U t U t?1 and I t I t?1 . Users can perform two types of actions in the rating system: establishing new trust relations and creating new ratings. Let X t 2 R n t ?n t denote the trust network at time t where X t ?i; j? ? 1 if u i is trusted by u j at time t and zero otherwise. Let R t 2 R n t ?m t represent the rating matrix at time t and r t ij",
               "Identifying the differences of trust evolution study in physical and online worlds; Providing a methodology to study the evolution of trust in an online world guided by social science theories; Proposing a framework, eTrust, to understand trust evolution by exploiting the dynamics of user preferences in the online product review website; Presenting findings from this eTrust study about the change of user preferences w.r.t. users or items, and trust relations; and Investigating trust evolution applications such as trust prediction, rating prediction and ranking evolution. The rest of the paper is organized as follows. Section 2 introduces the details about our proposed framework, eTrust. Section 3 discusses applications of eTrust. Section 4 presents experimental results and findings about eTrust. Section 5 briefly reviews related work. Finally, Section 6 concludes this study with future work. is used to represent the entity at ith row and jth column, denoting the rating of I j given by u i at time t.",
               "Users may have quite different preferences over items from different facets. For example, a user might be interested in items in the \"sport\" category at time t while prefers items in the \"travel\" category at time t ? 1. We assume that there are K latent facets for items and a user has similar preferences over items in the same latent facet. Let p t i 2 R K ? denote the u i 's preference vector at time t and each element of p t t i , p i ?k?, represent the u i 's preference over the kth facet at time t. Let q j 2 R K ? be the characteristic vector of the item I j and q j ?k? denote the characteristic of I j in the kth latent facet. Let W t 2 R n t ?n t ?K denote the multi-faceted trust relations at time t and w t ivk is used to denote the strength of trust relation from u i to u v in the kth facet at time t.",
               "One challenge to study online trust evolution is lack of conventional sociological data, and passive observation is a common approach to data collection. The dynamic rating system on product review sites provides a new means to the study of online trust evolution. In the next sections, we will introduce a framework of trust evolution, eTrust, with details on modeling and parameter estimation. Important notations in modeling are summarized in ."
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "n": "2",
               "text": "A TRUST EVOLUTION FRAMEWORK",
               "type": "introduction"
          },
          "paragraphs": [
               "It is observed that trust has a strong correlation with user preference similarity in rating systems, reflected in their rating information. Thus most existing work about We first introduce the notations and definitions used in this paper. A rating system in product review sites consists of 3. We do not consider the deletion of existing users or items in this work. where f : R ! ?0; 1? is an active function to control the trust strength, 0 w ivk 1 and b i is a user specific bias of u i . The latent factor model does not incorporate the influence from the trust network while the neighborhood model does not consider the user preferences and item characteristics. Earlier work , , indicated that a proper combination of these two models would help rating prediction. Therefore, we estimate the rating of u i about I j at time t as, r t ij rating of item j from user i at time t ^ r t ij the predicted rating of r t ij p t i the u i 's preference vector at time t q j the characteristic vector of the item I j w t ivk the strength of trust relation from u i to u v in the kth facet at time t s t ivk the preference similarity vector between u i and u v in the kth facet at time t trust is studied in the context of rating prediction , , . In this work, we explore the dynamics of user preferences to model trust evolution for rating prediction. The useritem pairs, ?i; j?, and their known ratings at time t, r "
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "text": "k?1",
               "type": "introduction"
          },
          "paragraphs": [
               "Another approach for rating prediction is based on the trust network, a variant of the nearest-neighborhood model by considering multi-faceted trust relationships between users , ij is to r vj . The second part models the influence from their trusted people. The parameter a 2 ?0; 1? adjusts the contributions from these two parts. Then the trust evolution problem, embedded in rating prediction, can be formulated as the following minimization problem, ",
               "ratings . The closer t vj and t, the more strongly r t vj vj influences r t (6) ij . Thus we choose an exponential time function to allow the influence of past ratings to decay gradually, which is widely adopted in such applications , . Thus r vj in Eq. (2) can be stated as,",
               "where h i ! 0 controls the user specific decay rate for u i and should be learnt from the data. In Eq. (2), w where the parameter b controls the quadratic regularized terms to avoid overfitting, c??? a function to model how user preferences change, and for the speed of change. When ! 0, we do not consider any relations of user preferences at different time points. When ! ?1, the user preference vectors at different time points are restricted to be the same. "
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "n": "2.2",
               "text": "Estimating Parameters for eTrust",
               "type": "introduction"
          },
          "paragraphs": [
               "ivk is the trust strength between u i and u v in the kth facet at time t. There is a strong and significant correlation between trust and user preference similarity . Thus we define s t t ivk 2 R L as the preference similarity vector between u i and u v in the kth facet at time t, based on their preferences in kth facet at time t, i.e., p eTrust requires the following parameters: w, b i , h i , the characteristics vector for each item I j , q j , the user preference vector for each user u i at each time slice t, p In our implementation, we use a projected gradient method to solve Eq. (6) and next we briefly introduce projected gradient methods. We consider the following bound-constrained optimization problem, similar algorithms can be developed for g b i , g h i , g q j ?k? and g p t i min g?x? ?k? . To save space, we ignore the detailed algorithms for g b i , g h i , g q j ?k? and g p t i ?k? .",
               "x2R N (7) s:t: low?i? x?i? up?i? i 2 ?1; N?; Algorithm 1. Searching g w with Goldstein conditions where low 2 R N and up 2 R N are lower and upper bounds of x, respectively. In the kth iteration, x can be updated by projected gradient methods as,",
               "where a k is the learning step in the kth iteration and variants of projected gradient methods differ on selecting a k . Q is a function to map a point back to the bounded feasible region as, 2: Given r 2 ?0; 1?",
               "Next we discuss our choice of f??? and c??? for eTrust.",
               "Q?x?i?? ? x?i? if low?i? x?i? up?i?; low?i? if x?i? < low?i?; up?i? if x?i? > up?i?:",
               "In this scheme, the parameters of eTrust can be updated as,",
               "f??? is an active function to control the estimated trust strength in ?0; 1?. It should be a real-valued and differentiable function and the range of this function is limited in ?0; 1?. However, we still lack the detailed description about this function. In this case, a sigmoid function is often used. It exhibits a progression from small beginnings that accelerates and approaches a climax over the domain, formulated as,",
               "and f are formally stated as,",
               "?? s q j ?k? 0 i f q j ?k? ? g q j ?k? r q j ?k? < 0 q j ?k? ? g q j ?k? r q j ?k? others (10) where r w , r b i , r h i , r q j ?k? and r p t i ?k? are the partial derivatives of the objective function in Eq. (6) with respect to w, b i , h i , q j ?k? and p c??? is used to capture how user preferences change over time. User preferences are usually assumed to change smoothly over time as,",
               "are learning step sizes for updating w, b i , h i and q j ?k?, respectively, which are chosen to satisfy Goldstein Conditions . The Goldstein Conditions ensure that the chosen learning step length achieves sufficient decrease but is not too short. The algorithm for searching g w with Goldstein conditions in the kth iteration is illustrated in Algorithm 1 where and r are two predefined parameters, and g?w? is the objective function of w, including the terms in Eq. involving in w as,",
               "The smooth assumption in our formulation is equivalent to a standard Gaussian distribution assumption on p t t?1 i ?k? ? p i ?k? under the scheme of maximizing log-likelihood function as,",
               "its log-likelihood is,",
               "? and converting the maximization problem to the minimization problem, the smooth assumption and the normal distribution assumption are to solve the same optimization problem."
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "n": "3",
               "text": "APPLICATIONS OF ETRUST",
               "type": "introduction"
          },
          "paragraphs": [
               "As mentioned above, many trust-related applications can benefit from the study of trust evolution. In the section, we discuss the role of eTrust in product review applications to help improve the performance of trust prediction, rating prediction, and ranking evolution. exploited to improve the task of rating prediction. Most existing trust network based methods assume single and static trust relations. However, people might place trust differently to different people, indicating multi-faceted and heterogeneous trust relations. Furthermore, rating systems in product review sites are highly dynamic and user preferences are drifting over time, indicating the evolution of trust relations. Thus eTrust, modeling the trust evolution in multiple facets, can be used to further improve the performance of prediction. Given the previous ratings fO t g T 3.1 Trust Prediction t?1 , the task of trust prediction aims to predict the ratings at time T ? 1, O T ?1 . In this paper, we propose two ways to predict unknown ratings based on eTrust-eTrustRec1 and eTrustRec2.",
               "eTrustRec1 directly follow Eq. to predict unknown ratings. An unknown rating from u i to I j at time T ? 1 can be predicted by eTrustRec1 as, Trust between users is widely exploited by search and recommendation systems. Inferring unknown trust between users attracts more and more attention recently , , . Trust propagation model is a popular model to derive trust relationships based on known trust relationships . However, users' trust relationships usually follow a power-law distribution and 80 percent of users are in the long tail. Thus in practical, there is not enough information to apply this technique. Furthermore, the propagation model is not directly applicable to the new users who have little information. Previous work suggests that models, combining rating similarity with trust networks, can achieve better performance than trust propagation model , . eTrust can be applied to the task of trust prediction.",
               "Given trust networks and ratings before time T , we want to recommend trust relationships at time T ? 1. eTrust learns its parameters by solving the problem in Eq. (6) based on the trust networks and rating information before T . Then the trust strength between u i and u v in the kth facet can be calculated as,",
               "T ?1",
               "where w is learnt by eTrust from the training data. For the existing item, I j , its characteristics vector, q j , is not evolved. For the existing user, u i , b i and h i are independent on time slices, directly applied to T ? 1. However, we have to estimate u i 's preference at T ? 1, p",
               ", from her previous preferences, i.e., fp For example, a user might always interested in \"sports\" while he might change his preferences in \"books\" over time. We define the change speed of u i 's preference in the k-facet, Z ik , as,",
               "then user preference at T ? 1, i.e., p",
               "?k?, can be estimated from that at T by considering the change speed of the user preference as, where w and b i can be estimated by eTrust based on the data before T . User preferences in s T ?1",
               "T ivk can be inferred by previous user preferences learned by eTrust, and more details will be discussed in the following subsection. For a new user, we use the average user preferences of his top-' similar users in terms of profiles to represent his preferences.",
               "After obtaining trust strengths for each facet, the overall strength can be computed as,",
               "we name this strategy as Facet Change. And we will also investigate the following three baseline strategies,",
               "Latest. It assumes that user preferences are likely to change smoothly. Based on this assumption, we use the latest previous user preference as user current preference,",
               "T ?1 i ?k? :"
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "n": "3.2",
               "text": "Rating Prediction",
               "type": "introduction"
          },
          "paragraphs": [
               "Rating prediction is the task of predicting a given user's ratings for a given item based on past ratings or other information, regarded as one of the most important algorithms for recommendation systems. People tend to seek advices from their trusted friends thus trust networks are widely",
               "Average. It assumes that preferences for one specific user should be consistent over time, and thus we represent user current preference as the average of her previous preferences,",
               "t?tu i",
               "Decaying average. It assumes that the older user preferences should have less influence on the current user preference. Therefore, an exponential time function is chosen to gradually decay the influence of past preferences as,",
               "where g i is the decay rate for u i . eTrustRec2 is inspired by SoReg in . SoReg is to solve the following problem,",
               "?i;j?2O i k where u i and v j are the user preference vector of u i and the item characteristics of I j respectively. The social regularization term w ik ku i ? u k k 2 2 is to model trust relation between u i and u k , controlled by their strength w ik . If u i and u k have a strong trust relation, the social regularization term will force their preferences u i and u k to be close to each other. However, SoReg does not consider the evolution of trust relations and user preferences. Hence we propose the following formulations to capture dynamics of both trust relations and user preferences as",
               "where sim?u k ; u i ? is profile similarity of u k and u i . Assume that c k is the vector support model (VSM) of the profile of u k and in this work, we use the cosin similarity of c k and c i to calculate their profile similarity, formally defined as, ik are the user preference of u i , and the trust strength between u i and u k at the time t, respectively. The trust strength between u i and u j at the time t w t ik can be learned by eTrust as shown in . In Eq. , both ratings and trust relations are divided among T time frames, therefore the amount of ratings and trust relations for each time frame may be limited, which may result in inaccurate estimation of u where h?; ?i denotes the inner product of two vectors and k ? k is the ' 2 -norm of a vector. A similar strategy is adopted for each new item: the characteristics of a new item are estimated from its top similar items."
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "text": "t?2",
               "type": "introduction"
          },
          "paragraphs": [
               "The rationale behind the temporal smoothness term is that user preferences tend to evolve gradually; hence, the preferences of a given user between consecutive timestamps should be as smooth as possible. Indeed, we make a Markov assumption here-current user preferences should be similar to these in previous time stamps. In Eq. (28), even if u i does not have any rating and any trust relation at time t, her preference at t can be estimated from her preferences in time t ? 1 and t ? 1. With Eq. and Eq. (28), eTrustRec2 is to solve the following problem:",
               "Ranking nodes in a network is an important problem, and HITS and PageRank are two very popular ranking techniques. Most traditional ranking techniques assume a static network and give higher ranks to nodes with better connectivity. However, except new users added and new relations established, trust networks in product review sites also evolve with the changing of user preferences . It suggests that people's rankings may evolve with the dynamics of the trust network and user preferences. eTrust, modeling the evolution of trust by exploiting the dynamics of user preferences, can be used to better understand the evolution of people's rankings.",
               "Let a t ik denote the facet ranking score of u i in the kth facet at time t. Based on eTrust, a t ik can be iteratively calculated as,  probability that a user would \"jump\" to some users instead of following the trust relationships. We set d ? 0:85 in our current work. The facet specific rankings can be used by advertisers to differentiate effective users for their products propagation or help us to find high quality content in product review sites. .",
               "The earliest rating was published on July 5, 1999 and the latest one was on May 8, 2011. However, the temporal information about the trust relations established before 11th January, 2001 is not available from Epinions. Therefore we split the whole dataset into 11 timestamps, i.e., T ? fT 1 ; . . . ; T 11 g, where T 1 covers the data before 11th January, 2001, T 11 contains data after 11th January, 2010 and for T 2 to T 10 , each of them contains one-year data. For example, T 2 contains data from 12th January, 2001 to 11th January, 2002. In the following experiments, we choose T 1 to T 10 as the training set to estimate the parameters of eTrust.",
               "In Eq. (6), s t In this section, we conduct experiments to evaluate the proposed framework, eTrust. We first introduce the details about the dataset used in the experiments; next describe the findings and results of applying eTrust to online applications, i.e., trust prediction, rating prediction, and ranking evolution.",
               "ivk is the preference similarity vector for u i and u v in the kth facet at time t and in this work, we define the following 9 metrics of preference similarity as, "
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "n": "4.1",
               "text": "Dataset and Experiment Setting",
               "type": "experiment"
          },
          "paragraphs": [
               "To study the evolution of trust, we collect a dataset from a popular product review site, Epinions, in the month of May, 2011. In Epinions, people can rate various products and add members to their trust networks or \"Circle of Trust\". We started with a set of most active users and then did breadthfirst search until no new users could be found. For each user, we collected their profiles (user name, location, real name, registration time, self-description, and favorite websites), product rating entries and trust relations. For each product rating entry, we collected the time point of the entry, product name, category and the rating. For each trust relation, we collected trustee, trustor and the time point when the trust relation established. We compute the trustors and trustees for each user and the distributions are shown in . Most people have few trustors and trustees, while a few users have an"
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "n": "4.2",
               "text": "Findings about eTrust",
               "type": "experiment"
          },
          "paragraphs": [
               "We use the data from T 1 to T 10 as the training dataset to learn parameters in eTrust and some interesting findings are summarized below.",
               "For each trust relation u i ! u v , the evolution speed of this relation in the kth facet (facet speed), f ivk , is defined as,",
               "where t iv is the time point when u i ! u v established and the overall evolution speed, F iv , is defined as the sum of all K facet speeds as, . User preference evolution. Note that x-axis, y-axis and z-axis denote the facet ID, user ID, and user preference, respectively."
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "text": "k?1",
               "type": "experiment"
          },
          "paragraphs": [
               "We find that the evolution speed varies with facets: some facets evolve much faster than others. Trust relations within an open triad are more likely to evolve than those within a closed triad. On average, the evolution speed of trust relations within an open triad is 6:12 times of the speed of those within a closed triad. Users with similar preferences are more likely to trust each other, demonstrating the existence of homophily in the trust network. For example, the average preference similarity between trusted users is 3:44 times as that of users without trust relations at T 10 and we have similar observations in other time slices. User preferences drift over time which can be observed in , depicting user preferences from 2001 to 2009, i.e., ffp z-axis denote the facet ID, user ID and user preference, respectively. Different people have different speeds of change while user preferences change much faster for some facets than others. For example, the average changing speed for the 13th latent facet is almost 60 times of that for the 2th latent facet. People have multiple and heterogeneous trust relations with others. For each facet, people only trust a part of their networks strongly. For example, on average, people trust only 15:8 percent of their trust networks for a specific facet when the number of latent facets is 20 at T 10 . We also observe heterogeneous trust relations including heterogeneous pairs of reciprocal trust relations, transitive relations and co-citation relations. These observations are very consistent with the findings of our previous multifaceted trust research .",
               ". The change of user preference from t to t ? 1, Y t?1 t , is defined as,  shows the average speed of change from 2001 to 2009 w.r.t. different users and different facets. Note that in , x-axis, y-axis and We also divide data from T 1 to T 1 0 into 20 segments where each segment contains half-year data. Then we use this dataset to learn parameters in eTrust and we find that observations and findings with 20 segments are very consistent to these with 10 segments."
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "n": "4.3",
               "text": "Trust Prediction",
               "type": "experiment"
          },
          "paragraphs": [
               "Trust plays an important role in helping collect reliable information for users in online communities. If trust relations can be predicted accurately, users can use these relations to make decisions on the reliability of information. For eTrust, trust relations can be inferred by user preferences with estimated w and user specific bias fb i g by Eq. (4). Data from T 11 is treated as the testing set, separated into two parts: E-trust relations established among existing users and N -trust relations involved in new users, covering 23:51 percent of the whole trust relations at T 11 . We follow the metric used in to evaluate the performance of trust prediction. Let A be the set of pairs of users, having no relations at time T 10 , and B denote the set of pairs of users, establishing trust relations at time T 11 , as demonstrated in . Assume that D is the set of pairs of users, including pairs from B and 10 percent of pairs, sampled from A ? B (Since we might sample different pairs from A ? B, we repeat the experiments 10 times and report the average results.). Each trust predictor ranks pairs in D in decreasing order of confidence and we take the first jBj pairs as the set of predicted trust relations, denoting as C. Then the prediction accuracy (PA) can be calculated as,",
               "where j ? j denotes the size of a set.",
               "The PA results are shown in and the trust predictors mentioned in the table are defined as follows:",
               "Similarity. It ranks the pairs according to their rating similarity (if available) and profile similarity, which only considers profile information or rating information. TP. The trust relations are inferred through trust propagation by four atomic propagations, i.e., direct propagation, co-citation, transpose trust and trust coupling . This predictor only considers the existing trust network information. TP + Similarity: A combination of Similarity and TP, integrating both the existing trust network and rating or profile similarity . Classification. This method first obtains an extensive set of relevant features from user attributes and the existing trust network, and then converts trust prediction problem into a binary classification problem where the existence of trust relations is considered as class labels . eTrust. Trust relations are predicted by eTrust through Eq. (4) and details are shown in the Section 4.2. Note that parameters in all predictors are determined through cross-validation. For eTrust, we choose facet change to estimate user preferences at time T 11 from user preferences at T 1 to T 10 (more details about the strategy selection will be presented later) and the parameters are set as:",
               "Trust propagation always obtains the worst performance. TP predicts trust relationship between two users when there are existing trust relationships connecting them indirectly. However, connectivity information is not always enough for correct trust prediction, especially when trust connectivity is not high enough for applying propagation techniques. For example, TP cannot be applied to the dataset N . Similarity obtains better performance than TP, demonstrating that users with similar ratings or profiles are likely to trust each other. When considering both existing trust networks and similarity, Similarity+TP outperforms both TP and Similarity, indicating similarity information and existing trust networks are complementary with each other for trust prediction.",
               "Classification trains a classifier based on the features extracted from ratings, profiles and existing trust networks, achieving better performance than Similarity+TP. However, this method has inherent limitations. The huge disproportion of pairs of users with and without trust relations makes the classification problem extremely imbalanced and the performance is sensitive to the sampled negative samples . eTrust performs consistently best. For example, comparing to the second best performance, eTrust gains 4:74 and 13:83 percent relative improvement in terms of accuracy in E and N , respectively. There are two main reasons: (1) eTrust performs trust prediction facet by facet, overcoming the problem of the heterogeneous trust relations ; and (2) trust relations are inferred based on user current preferences.",
               "We observe that the performance of all predictors decreases in N . However, eTrust obtains much better ",
               "1.0566( ? 0.0488) 1.1375( ? 0.0187) 1.0646( ? 0.0460) eTrustRec1",
               "1.0299( ? 0.0755) 1.0783( ? 0.0779) 1.0347( ? 0.0759) eTrustRec2",
               "1.0228( ? 0.0826) 1.0672( ? 0.0890) 1.0272( ? 0.0834)",
               "Note that \"Imp\" denotes the performance improvement comparing to the performance of Mean. performance than other predictors in N . For example, comparing to the performance of Classification, eTrust gains 13:83 percent relative improvement in N while 4:74 percent improvement in E. These results indicate that eTrust is more robust to the cold-start problem in trust prediction problem. We also note that based on profile similarity, Similarity still obtains 28:94 percent in terms of prediction accuracy, much larger than a random predictor whose accuracy is less than 1 percent. This observation demonstrates the existence of homophily in trust networks: similar users are more likely to trust each other. Impact of different strategies. We investigate how the performance of eTrust in terms of trust prediction varies with different strategies. A similar way as rating prediction is adopted to determine the parameters of Decaying Weight for trust prediction. The performance with different strategies is demonstrated in . We have similar observations as these for rating prediction: (1) user preferences change but smoothly; (2) older user preferences have less influence on current user preferences; (3) user preferences change differently for different facets."
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "n": "4.4",
               "text": "Rating Prediction",
               "type": "experiment"
          },
          "paragraphs": [
               "eTrust can be naturally applied to the online application of rating prediction, as discuss in Section 4.1. T 11 is the testing set in this experiment and we further divide it into two parts: the ratings involved in new items or new users(coldstart problem), denoted as N ; the remaining ratings from T 11 denoted as K. We closely examine T 11 and find that N contains 10:06 percent of the ratings at T 11 .",
               "We use Root Mean Squared Error (RMSE), a common metric, to evaluate prediction accuracy .",
               "Mean: the rating of an item is predicted by the mean of known ratings of the product; MF: this method is based on user preferences and item characteristics, however it assumes that user preferences do not evolve over time ; NN: this model is a simple nearest-neighbor algorithm, assuming that a user has the similar ratings as his trust network for the same item ; MF+NN: this model is a combination of NN and MF, however, it considers heterogeneous strengths of trust relations ; SoReg: this method is also based on matrix factorization and defines social regularization to capture local social context as shown in Eq. (26) ; mTrust: this model considers the multi-faceted trust relations between users and assumes people place trust differently on different people . All baseline methods cannot tackle the cold-start problem thus we adopt the similar strategy as eTrust by considering their top-' similar existing users (items) based on their profiles. For example, for Mean, the rating of a new item is predicted by the average rating of its top-' similar items. The parameters of all methods are determined through cross-validation. For our proposed methods, we choose Facet Change as the strategy to estimate user preferences in time T . More details about the impact of different strategies on rating prediction will be presented later. Note that \"Imp\" in the denotes the performance improvement comparing to the performance of Mean.",
               "We notice that RMSE values for all methods are very close to each other. However, small improvement in RMSE terms can have a significant impact on the quality of the top few recommendation . As reported in , when the performance improved from 0:9025 to 0:8870 w.r.t. RMSE, it gains more than 50 percent relative improvement in terms of top few recommendation.",
               "We have the following observations:",
               "where jMj is the size of the testing set, M. Note that eTrust can be easily applied to other rating prediction methods thus we aim to investigate whether considering dynamics of trust relations and user preferences allows us to improve the prediction performance, instead of comparing different rating prediction methods.",
               "The prediction results are shown in the and the baseline methods listed in the table are defined as follows:",
               "Mean obtains better performance than NN. There are two main reasons. First, most of the time, the majority of users actual ratings are close to the average and by closely examining the dataset, we find that more than 70 percent users give a score of 4 or 5. Second, NN treats all trust relations equally, however, people may trust a part of their trust networks more strongly than others. When considering heterogeneous trust strengths, MF +NN outperforms both MF and NN, further demonstrating that people trust their friends differently while only give similar ratings with their strongly trusted friends. mTrust considers multi-faceted trust relations and obtains better performance than MF+NN. NN and MF+NN assume single and homogeneous trust relations, however, people with multi-faceted interests and experts of different types suggest multiple and heterogeneous trust relations . eTrustRec1 and eTrustRec2 consistently outperforms all other methods and we believe that this improvement is contributed by exploiting the dynamics of both trust relations and user preferences. The performance of all methods degrades in N . However, our proposed frameworks obtain much better performance than other methods. For example, comparing to Mean and the second best performance of other predictors, eTrustRec1 gains 0:0779 and 0:0592 absolute improvement in terms of RMSE, respectively. These results demonstrate that our proposed frameworks are more robust to the coldstart problem.",
               "Impact of '. We investigate how the performance of our proposed frameworks varies with the number of selected top similar users or items, ', and the results are shown in . Note that we only show results of eTrustRec1 since we have similar observations about eTrustRec2. The performance first increases, reaches its peak value and then decreases. This pattern can be used to help us determine the optimal value of ' in practice. We also note that the performance with ' ? 1 is always the worst, even worse than that with all users or items. It suggests that users (items) with most similar profiles do not necessarily have most similar user preferences (item characteristics).",
               "Impact of different strategies. We study the impact of different strategies on the performance of our proposed frameworks in rating prediction. Among the four strategies, Latest, Average and Facet Change are parameterfree while Decaying Average needs decay rate parameters. For each user u i , there is a specific decay rate g i . It is impossible to manually determine the optimal values for all g i s while also very difficult to prune g i via cross validation. Therefore, we use the data from T 1 to T 9 to estimate parameters for eTrust, and then use the data in T 10 as the training data to learn g i automatically by solving the following optimization problem,",
               "where p",
               "is estimated through decaying average strategy as Eq. . The performance of eTrustRec1 with different strategies is demonstrated in . Since we have similar observations about eTrustRec2, we omit the results of eTrustRec2.",
               "Latest obtains better performance than Average. Current user preferences are more likely to be similar as the latest ones instead of the average of all their previous ones. These results support that user preferences really evolve but change smoothly. When considering that older user preferences should have less influence on current user preferences, Decaying Average gains better performance than Latest. We check the learned decay rates g i s and they range from 0 to 7. We can conclude: (1) some people keep their preferences over time while others change their preferences with different speeds; and (2) we should not totally eliminate the influence from older user preferences. Facet Change always performs best. Facet Change considers people have varied preference changing speeds in different facets. This observation suggests that user preferences change differently for different facets."
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "n": "4.5",
               "text": "Ranking Evolution",
               "type": "experiment"
          },
          "paragraphs": [
               "Ranking evolution is one of important online applications of eTrust. This application is important for advertisers to find effective users for product propagation and also useful for helpful review recommendation systems where helpful reviews may be buried in a large number of spam reviews .",
               "We use the data from T 1 to T 10 to train eTrust. After getting parameters of eTrust, we can calculate the multifaceted trust relations such as W t at time t. Based on W t , the facet ranking score of u i in the kth facet at time t, a  shows the trust evolution of users in Epinions, ranked top-10 in 2001 and shows the distributions of numbers of ratings of a part of the chosen users.",
               "First, we observe that trust truly evolves over time. For example, the user \"4-1-1\" was ranked first in 2001 while ranked 1;092 in 2010; although \"jo.com\" is always among the top-20 users, her rankings are also drifting over time. There are two timestamps when the rankings of these users changed dramatically, i.e., . This might be related to two big events happened in Epinions: Epinions was acquired by Shopping.com in 2003 and in turn was acquired by eBay in 2005, as mentioned before.",
               "We closely check the trust evolution results of these users from Epinions, the ranking results seem reasonable. After ranked 8 in 2001 and 39 in 2002, the rankings of \"soothsayer\" dramatically degraded from 39 in 2002 to 2;752 in 2010. soothsayer\" moved to Amazon. com and rarely wrote reviews in Epinions. For example, \"soothsayer\" only contributed 5 reviews during 2003 to 2005 and since 2006, he/she did not post reviews any more, as shown in . We have similar observations for the user \"4-1-1\". Before 2003, he wrote 1;025 reviews, from 2003 to 2005, only 65 reviews were posted and since 2006, \"4-1-1\" stop writing reviews in Epinions, 5 demonstrated in . \"surferdude7\" and \"shantel575\" become less and less active in Epinions, although every year they contribute some reviews.",
               "\"jo.com\", \"dkozin\" and \"Bryan_Carcy\" are consistently the top-20 users in Epinions during 2001 to 2010. It is beyond the scope of this paper to probe further why they keep their rankings. However, we observe some commonalities among them: reviewer in \"Electronics\" and \"jo.com\" is the top reviewer in \"Sports & Outdoors\". They consistently have new trust relations established every year. For example, more than 40 trust relations are established with \"Bryan_Carcy\" every year."
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "n": "5",
               "text": "RELATED WORK",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Trust has attracted more and more attention from computer science community , . In recent years, many trust related online applications are proposed and we next briefly review some of them related to our work."
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "n": "5.1",
               "text": "Trust Prediction",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Trust plays an important role in helping online people collect reliable information . If trust relations can be predicted accurately, users can use these relations to make decisions on the reliability of information. Guha et al. developed a formal framework of trust propagation schemes . It first separates trust and distrust matrix and then performs operations on them to obtain the transitive trust between two nodes. The connection between trust and user similarity was studied in , and a strong and significant correlation is found between trust and similarity. The more similar two people are, the greater the trust between them is. In , rating similarity is exploited to enrich traditional trust propagation methods. This work demonstrated that predicting trust is more successful for pairs of users that are similar to each other if we combine the topology of the trust network They consistently contribute many reviews every year. For example, \"Bryan_Carcy\" posts more than 200 reviews every year, as shown in , and 91:7 percent of them are voted as very helpful reviews. They contribute many popular reviews. For example, \"jo.com\", \"dkozin\" and \"Bryan_Carcy\" have 332, 253 and 275 popular reviews, respectively. They are usually the leaders or top reviewers in some categories. For example, \"dkozin\" is the lead with rating similarity. By obtaining an extensive set of relevant features from user attributes and user interactions, trust prediction problem is converted into a classification problem . Yao et al. exploited the multi-aspect property of trust and developed a multi-aspect inference model ."
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "n": "5.2",
               "text": "Rating Prediction",
               "type": "relatedwork"
          },
          "paragraphs": [
               "People are likely to seek advices from their trust networks thus trust networks are widely exploited in the task of rating prediction. In , several methods for incorporating trust networks are proposed to improve the performance of rating prediction. Jiang et al. integrated social context (individual preference and interpersonal influence) into a matrix factorization model. Matsuo and Yamamoto studied and modeled the bidirectional effects between trust relations and product rating. Koren introduced some innovations to both latent factor models and neighborhood models. The factor and neighborhood models can now be smoothly merged, thereby building a more accurate combined model . It reported that a proper combination of these two models can significantly improve the prediction performance. All these methods do not consider the changes of user purchase interest. However, customer preferences for products are drifting over time . Ding et al. presented a novel algorithm to compute the time weights for different items by assigning a decreasing weight to old data . Koren proposed a methodology and specific techniques for modeling the dynamics of user preferences in recommender systems . It claimed that temporal dynamics in the data can have more significant impacts on accuracy than designing more complex learning algorithms.",
               "sociologists to study trust evolution in the physical worlds, cannot be directly applied to studying trust evolution in online worlds. By exploiting the correlation between user preferences and trust relations, we propose a framework, eTrust, to understand the evolution of trust in an online world by exploiting the dynamics of user preferences. We present technical details about modeling trust evolution based on data from passive observation and show how to apply eTrust to various online applications such as rating prediction, ranking evolution and trust prediction. Interesting findings are observed in our experiments using real-world product review data, Epinions; and eTrust can be applied to improve various online trust applications such as rating prediction, ranking evolution and trust prediction.",
               "Although we choose product review sites as the environment to study trust evolution, the methodology proposed in this paper can be generalized to other online environments. For example, although some sites such as Amazon and Netflix do not provide trust networks, inferring implicit trust networks has been extensively studied and we can still apply eTrust into Amazon and Netflix with available ratings and implicit trust networks. Therefore one direction of our future work is to generalize eTrust into other online worlds. Many interesting findings are revealed by the study of trust evolution such as trust evolves with different speeds in different facets, different people change their user preferences with different speeds and heterogeneous trust relations. These findings can be modeled to improvement the performance of trust-related applications such as ranking prediction and high-quality content recommendation ."
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     },
     {
          "head": {
               "text": "ACKNOWLEDGMENTS",
               "type": "acknowledgement"
          },
          "paragraphs": [
               "Trust strength prediction is another direction of related research, which differs from trust prediction. The former focuses on modeling the strength of existed links rather than link existence. In a latent variable model is developed to estimate relationship strength from various interaction activities and user similarities. In this model, relationship strength is modeled as the hidden effect of user similarities and it also impacts the nature and frequency of online interactions. Au et al. show heterogeneous trust strengths of trust relations in product review sites and a modified matrix factorization technique is proposed to estimate strengths of trust relations. Trust, as a social concept, naturally has multiple facets, indicating multiple and heterogeneous trust relations between users. Our previous work, mTrust, investigated multi-faceted trust relations between users. People place trust differently on different people and the work of mTrust demonstrates that trust strength can be inferred under the context of rating prediction .",
               "YingZhou Bi received the BS degree in applied mathematics from Northwestern Polytechnic University, Xian, China, in1989, the MS degree in computer science from Guangxi University, Nanning, China, in 2003, and the PhD degree in computer science from Wuhan University, Wuhan, China, in 2008. He was a visiting scholar with the Department of Computer Science and Engineering, Arizona State University, Tempe, AZ, in 2012. He is currently a computer science professor with the College of Computer & Information Engineering, Guangxi Teachers' Education University, Nanning. His research interests include intelligent computing, intelligent information processing and social computing.",
               "Huan Liu received the BEng degree in computer science and electrical engineering from Shanghai JiaoTong University, Shanghai, China, and the PhD degree in computer science from the University of Southern California, Los Angeles, CA. He is currently a professor of computer Science and Engineering at Arizona State University (ASU), Tempe, AZ. Before he joined ASU, he worked at Telecom Australia Research Labs and was on the faculty at the National University of Singapore. He was recognized for excellence in teaching and research in Computer Science and Engineering at Arizona State University. His research interests are in data mining, machine learning, social computing, and artificial intelligence, investigating problems that arise in many real-world, data-intensive applications with high-dimensional data of disparate forms such as social media. His well-cited publications include books, book chapters, encyclopedia entries as well as conference and journal papers. He serves on journal editorial boards and numerous conference program committees, and is a founding organizer of the International Conference Series on Social Computing, Behavioral-Cultural Modeling, and Prediction (http://sbp.asu.edu/). He is a fellow of the IEEE and an ACM Distinguished Scientist."
          ],
          "paper_id": "247aab00-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "Trust Evolution: Modeling and Its Applications"
     }
]