[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "In this paper, I show that persons reach unanimous opinions even when they have different initial opinions and different social influences in social influence networks. Friedkin and Johnsen introduced a model of social influence networks, and identified conditions for initially diverse opinions to converge. However, they did not examine conditions of \"unanimous\" convergence. Hence, I provide sufficient conditions of such unanimous consensus by focusing on three typical but conflicting social influences: the equal influence, the influence of the lowest opinion, and no influence. I show that unanimous opinions occur even when persons have antagonistic social influences such as the equal influence and the influence of the lowest opinion. I also demonstrate that the most cooperative type is the equal influence, but the most central type is the no influence."
          ],
          "paper_id": "248113a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "Unanimous opinions in social influence networks"
     },
     {
          "head": {
               "n": "1.1",
               "text": "Unanimous Opinion Formation",
               "type": "abstract"
          },
          "paragraphs": [
               "Downloaded by [Auckland University of Technology] at 18:04 01 November 2015 Suppose that persons have initially different opinions, but change them and converge to an identical opinion. Clearly, they will agree with each other and hence accept the final unanimous opinions without any objections. If we can specify conditions of such unanimous opinion formation, it may enable us to solve social conflicts such as racial conflicts.",
               "The process of opinion formation is modeled by , but they do not focus on unanimous opinion formation. They study how people change opinions when they change opinions repetitively in social influence networks. Although they clarify the general condition for opinions to converge, they treat unanimous convergence as a special case of convergence and hence only give some examples. Note that if we do not examine the process of unanimous opinion formation in itself, we will fail to capture what consensus formation is. This is because the process is the extreme case of successful consensus formation."
          ],
          "paper_id": "248113a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "Unanimous opinions in social influence networks"
     },
     {
          "head": {
               "n": "1.2",
               "text": "Three Types of Social Influences",
               "type": "abstract"
          },
          "paragraphs": [
               "In this paper, I answer the question of how persons reach unanimous opinions when they have different initial opinions and have one of the following social influences: the equal influence (the utilitarian influence), the influence of the lowest opinion (the maximin influence), or no influence.",
               "? The utilitarian influence means the equal influence of others' opinions. A person changes her opinion to the average of opinions of all the members since she treats them equally.",
               "? The maximin influence means the influence of the lowest opinion.",
               "A person changes her opinion to the lowest opinion of the members because she sympathizes with it.",
               "? The no influence means sticking to her own opinion and neglecting others' opinions. She never changes her opinion.",
               "I focus on these types because they represent typical and conflicting social influences. For example, the utilitarian influence and the maximin influence indicate antagonistic public policies. While the utilitarian influence suggests egalitarian policies such as equal taxation and equal redistribution, the maximin influence supports welfare policies such as progressive taxation and weighted redistribution. Besides, the no influence contrasts well with these two types in that it has no social influences. In the history of social theory, the utilitarian influence was proposed by , the maximin influence was advocated by , and the no influence was defended by I organize this paper as follows. In Section 2,1 will develop a model of unanimous opinion formation by modifying Friedkin and Johnsen's model. In Section 3, I will derive sufficient conditions of reaching unanimous opinions. In the last section, I will summarize my argument and provide its substantive implications. I put all proofs in Appendix. I provide only sufficient conditions of unanimous convergence because its necessary and sufficient condition has already been given mathematically for finite Markov chains (see )."
          ],
          "paper_id": "248113a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "Unanimous opinions in social influence networks"
     },
     {
          "head": {
               "n": "2.1",
               "text": "Opinion Formation",
               "type": "abstract"
          },
          "paragraphs": [
               "To model the process of unanimous opinion formation, I use the following Assumptions 1-3 based on . Note that I omit any exogenous conditions, and that persons can change weights on members during the process. For convenience, I focus on one issue. To analyze this process, I can use results of finite Markov chains. But the process differs from them in that vectors compose with matrices on the right."
          ],
          "paper_id": "248113a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "Unanimous opinions in social influence networks"
     },
     {
          "head": {
               "n": "2.2",
               "text": "Social Influences",
               "type": "abstract"
          },
          "paragraphs": [
               "I limit social influences to the following three types. The first and the third types are independent of time period t. if she fixes her opinion as y'j = y) for every t."
          ],
          "paper_id": "248113a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "Unanimous opinions in social influence networks"
     },
     {
          "head": {
               "n": "3.1",
               "text": "Sufficient Conditions of Unanimous Opinion Formation",
               "type": "abstract"
          },
          "paragraphs": [
               "I show that, even though persons have diverse initial opinions, some combinations of social influences lead to unanimous opinions (either unconditional or conditional), but some cannot. I test all possible Downloaded by [Auckland University of Technology] at 18:04 01 November 2015 combinations of the three social influences, and provide three theorems. I summarize these results in the following (symmetric) table. While Theorem l(i) means democratic consensus formation, Theorem l(ii) and 2(i) represent that in welfare states. Theorem 2(ii) and 2(iii) express decisions in the monarchy or autocracy. THEOREM 1 (Unanimity from single influence) (i) If all players have the utilitarian influence, players attain unanimous opinions as the average of the initial opinions whatever the initial opinions are.",
               "(ii) If all players have the maximin influence, players attain unanimous opinions as the lowest initial opinion whatever the initial opinions are.",
               "(iii) If all players have the no influence, players cannot attain unanimous opinions.",
               "THEOREM 2 (Unanimity from two influences) (i) Suppose that some players have the utilitarian influence and the rest have the maximin influence. Then, players attain unanimous opinions as the lowest initial opinions whatever the initial opinions are.",
               "(ii) Suppose that some players have the utilitarian influence and the rest have the no influence, (a) If one player has the no influence and the rest have the utilitarian influence, players attain unanimous opinions as the initial opinion of the player having the no influence whatever the initial opinions are. (b) If two or more players have the no influence, players cannot attain unanimous opinions.",
               "(iii) Suppose that some players have the maximin influence and the rest have the no influence, (a) If one player has the no influence and she has the lowest initial opinion, players attain unanimous opinions as the lowest initial opinion (i.e., the initial opinion of the player having the no "
          ],
          "paper_id": "248113a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "Unanimous opinions in social influence networks"
     },
     {
          "head": {
               "n": "3.2",
               "text": "Generalization",
               "type": "abstract"
          },
          "paragraphs": [
               "We can easily generalize these results as follows. To change opinions, players used convex combinations, and had no exogenous effects (Assumption 2). Such opinion changes were repeated infinitely (Assumption 3). (iii) Results: I obtained the following results. They are generalized to wider types of social influences (Corollary). Unanimity results from the utilitarian influence or the maximin influence, but does not from the no influence (Theorem 1). Unanimity results from the combination of the utilitarian influence and the maximin influence, and also results from the combination of the utilitarian influence and the no influence. But the combination of the maximin influence and the no influence results only in conditional unanimity (Theorem 2). If all the three social influences are combined, conditional unanimity results (Theorem 3)."
          ],
          "paper_id": "248113a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "Unanimous opinions in social influence networks"
     },
     {
          "head": {
               "text": "(i) Unanimous opinions from various social influences: The results",
               "type": "abstract"
          },
          "paragraphs": [
               "show that persons can reach unanimous opinions if they keep changing opinions. This holds true even when people have antagonistic social influences, especially the utilitarian and the maximin influences. So far they are regarded as antagonistic (see , but the utilitarian influence gives way to the maximin influence when combined.",
               "(ii) Cooperative type: In addition, suggests that the utilitarian influence is the most cooperative, and the no influence is the least cooperative. The utilitarian influence always results in unconditional unanimity, yet the no influence sometimes yields conditional unanimity or nonunanimity. This is because the utilitarian influence can give way to other social influences (by weighting all the members), but the no influence cannot (since it weights only itself). (iii) Central type: However, if we pay attention to the final unanimous opinions in the table, we should note that the utilitarian influence is the least central and the no influence is the most central. While the utilitarian influence cannot realize its opinion (i.e., the average) as the final unanimous opinions when it meets other influences, the no influence always realizes its opinion as the final unanimous opinions, if any. This happens because the utilitarian influence always gives way to other influences, yet the no influence never does so. Downloaded by [Auckland University of Technology] at 18:04 01 November 2015 (iv) Conditions of unanimity: I identified several sufficient conditions for opinions to converge to one. provided examples of unanimous opinion formation, and other papers on opinion formation have examined network effects (for instance, or experimental support (for instance, ). However, they have not examined general conditions of unanimous opinion formation.",
               "(v) Combinations of social influences: To specify such conditions, I accommodated more than one social influence in a single process and tested their combinations. So far, empirically, it has been known that individuals have social influences (see , but the literature has not studied what will happen when different social influences are combined. Theoretically, social influences have been modeled as social welfare functions in welfare economics, but their combinations have not been dealt with. Each social welfare function has been axiomatized (the utilitarian function by d' ; the maximin function by , and modeled the case where all persons have the utilitarian influence."
          ],
          "paper_id": "248113a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "Unanimous opinions in social influence networks"
     },
     {
          "head": {
               "n": "4.3",
               "text": "Discussion",
               "type": "abstract"
          },
          "paragraphs": [
               "(i) Fixed social influences: I assumed that persons fixed their social influences, but a rational person would switch her influence strategically to manipulate the final opinions. She can manipulate them if she knows other members' social influences. Thus, the next step should be to check whether such manipulation is possible or not. To relax the assumption of fixed social influences, we can develop a model of switching social influences either rationally or evolutionarily. If persons change social influences rationally, we need to use repeated games or extensive games. If persons change them evolutionarily, we can use evolutionary game theory. finite time, but the simulation shows that opinions converge to almost the same one at the fourth or fifth time. (iv) Preference formation: From a general viewpoint, if we regard opinion formation as preference formation, we can apply our model to the process of preference formation. So far many papers have suggested that we should examine its process (for example, , but convincing models have not been proposed yet. (iii) Let I be the n x n identity matrix. By Definition 3 and by exchanging rows, W = I. Clearly, WW = W = I. By (4), W 00 = W = I. This means that (3) does not hold.",
               "? Proof (Theorem 2) (i) Let {1,..., m] be a set of players having the maximin influence. Also let fc = argmin/=i i ... )B .yj. Then, we can express influences at time 2, 3, and more as follows. This means that (3) does not hold. This argument holds true also when three or more players have the no influence.",
               "(iii) (a) Suppose that player 1 has the no influence and she has the lowest initial opinion. Also suppose that the rest have the maximin influence. By (4), we obtain W and W 00 as follows, and hence  Suppose, next, that players 1 and 2 have the no influence. Then, whatever influences the rest of the players have, we obtain the same W and Was (5). This implies that (3) does not hold.",
               "? Proof (Theorem 3) (a) Suppose that player 1 has the no influence and she has the lowest initial opinion. Let {2,..., m} be a set of players having the maximin influence, and suppose that the rest have the utilitarian influence. Then, we obtain W and Was follows, and hence  (b) Suppose, on the other hand, that player 1 has the no influence but player 2 has the lowest initial opinion. Or suppose that two or more players have the no influence. In both cases,  Proof (Corollary) In the above proofs, replace 1/n by arbitrary wy such that Ylj=i W U = 1 an ^ w u > 0-Also replace k in Definition 2 by & in Definition 5. Even then, we can use all the arguments so that (3) holds.",
               "?"
          ],
          "paper_id": "248113a0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "Unanimous opinions in social influence networks"
     }
]