[
     {
          "head": {
               "text": "Rank",
               "type": "introduction"
          },
          "paragraphs": [
               "Country The minimum salary (converted to PPP) for a Professor in New Zealand has grown by 18 percent since our last report in 2008, however, despite this double digit growth, it is still approximately 20 percent lower than the equivalent rank in Australia, and even lower than Canada and the USA. The gap between Australian and New Zealand average salaries (converted to PPP) is less obvious at the Associate Professor rank.",
               "Salaries in the USA have shown the least growth since our 2008 report, increasing by 3 to 4 percent in PPP terms across the ranks shown. Canada has experienced the largest growth with salaries (converted to PPP) at all ranks analysed increasing by in excess of 20 percent. 3 Australia has seen similar growth in all ranks across the board. In the UK academic salaries (converted to PPP) have increased more at the higher ranks.",
               "The gap between salaries in PPP terms in New Zealand and the UK is small -the only rank where New Zealand is higher than the UK is the Associate Professor rank.",
               "Non-salary benefits vary widely and are influenced by factors such as inter-country differences in responsibilities for healthcare and differences in legislative requirements. In general:",
               "? Australia, the UK and Canada have university superannuation schemes that provide for higher employer contribution levels (i.e. 17 percent, 16 percent and 8.5 -11+ percent respectively) than exist in New Zealand (i.e. 6.75 percent).",
               "? Use of salary loadings is continuing to occur in order to overcome competition (both private sector and university) for staff in a number of disciplines. Specific robust data on non-salary benefits and salary loadings at both aggregated and individual levels is not widely available."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0
     },
     {
          "head": {
               "n": "2.1.",
               "text": "Project Overview",
               "type": "introduction"
          },
          "paragraphs": [
               "In December 2005 UNZ and the Tertiary Education Union 5 engaged Deloitte to prepare a report on university salaries and resourcing. Deloitte was engaged in early 2008 to prepare a \"limited scope\" update to the academic salaries and remuneration section of our December 2005 report, and we have recently been engaged to complete a similar update as at April 2012.",
               "The data used in this report has been limited to publicly available information and no specific requests for data have been made to individual universities."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1
     },
     {
          "head": {
               "n": "2.2.",
               "text": "International Comparisons",
               "type": "introduction"
          },
          "paragraphs": [
               "The New Zealand universities data comprises separate data for all eight universities together with data for the overall New Zealand university sector.",
               "The international comparative data has been derived from four countries with whom New Zealand \"competes\" for academic staff, namely Australia, Canada, the United Kingdom (UK) and the United",
               "States of America (USA). In order to provide a focus for the comparisons, a subset of universities has been selected from the comparable countries. These are summarised in the tables below. In order to provide a meaningful update, the comparable countries and comparable universities are the same as those used in our May 2008 and December 2005 reports."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2
     },
     {
          "head": {
               "text": "AUSTRALIA",
               "type": "introduction"
          },
          "paragraphs": [
               "The sample of universities comprises the Group of Eight \"G8\" universities. The G8 is a coalition of the leading Australian universities, which are internationally recognised for their excellence in scholarship and research."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3
     },
     {
          "head": {
               "n": "2.3.",
               "text": "International Comparisons",
               "type": "introduction"
          },
          "paragraphs": [
               "A number of major issues exist in obtaining and analysing data from a variety of international sources. Whilst some of these issues relate to accessing the data, the more substantial issues relate to comparability. For example, differences in the definitions of staff categories, and obtaining data on salary loadings. Irrespective of these issues, it is considered that the data and analysis provided is sufficiently robust for the project terms of reference."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4
     },
     {
          "head": {
               "n": "2.4.",
               "text": "Disclaimer",
               "type": "introduction"
          },
          "paragraphs": [
               "This report has been prepared for the terms of reference outlined above. It is not to be reproduced or used for any other purpose without our prior permission. Deloitte does not assume any liability or responsibility for losses occasioned by Universities New Zealand or any other party as a result of the circulation, publication, reproduction or use of this report contrary to the provisions of this paragraph.",
               "We reserve the right to review all comments, analysis and calculations included or referred to in this report should any relevant information existing at the date of the report subsequently become known to us.",
               "While we have taken care in our examination and use of information and explanations obtained or provided to us, we do not accept any responsibility for errors or omissions contained therein. However, we have used our professional judgement in reviewing the reasonableness of all figures and information obtained / provided to us."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5
     },
     {
          "head": {
               "n": "3.1.",
               "text": "Overview",
               "type": "introduction"
          },
          "paragraphs": [
               "This section of the report provides data on university academic salaries and benefits in New Zealand.",
               "International comparisons are made with academic salaries and benefits in Australia, Canada, the UK and USA, particularly in the selected universities. It should be noted that in addition to New Zealand facing competition for academic staff who may be domiciled in those four countries, it also faces competition from those countries for recruiting academic staff who may be domiciled in other countries.",
               "Consistent with our May 2008 and December 2005 reports, salary data for each country and rank (i.e. Lecturer, Senior Lecturer, Associate Professor and Professor) has been converted to Purchasing Power Parity (PPP), expressed in US dollars, using an average of the Economist\"s Big Mac Index (BMI), the World Bank\"s PPP index and the OECD PPP. This enables accurate and meaningful intercountry comparisons to be made. The PPP used in this report is explained in further detail in Appendix 3.",
               "This conversion mechanism is similar to that adopted by the Association of Commonwealth Universities (ACU) where, in their recent study of academic staff salaries and benefits 6 , they utilised the WDI 2010 PPP and the BMI PPP for 2010 in converting amounts to a PPP."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6
     },
     {
          "head": {
               "n": "3.2.",
               "text": "ACU Academic Staff Salary Survey 2009 -2010",
               "type": "introduction"
          },
          "paragraphs": [
               "The  The key findings of the ACU 2009 -2010 study relating to salaries (as summarised in the ACU report) are:",
               "? Australian academics at all levels except Lecturer continue to be above those of the other participating countries. The overall midpoint average of the salary scales for Australia is 6.4 percent higher than South Africa"
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7
     },
     {
          "paragraphs": [
               ", who have gone from bottom ranked (in the 2006 -2007 survey) to second ranking.",
               "? Canada has been overtaken by South Africa in PPP terms, and the UK remains closely behind.",
               "The gap between Canada and the UK is less than 0.4 percent.",
               "? The pay differential between participating countries has narrowed since the survey. In the latest survey top ranked Australia has an overall average salary that is 6.4 percent, 9.2 percent and 9.6 percent higher than South Africa, Canada and the UK respectively. In the 2006 -2007 survey the Australian overall average was 26.4 percent higher than the Canadian overall average and 26.9 percent higher than the UK overall average.",
               "? New Zealand has dropped from fourth ranking to fifth, some 9.8 percent lower than the UK in fourth place. The gap between New Zealand and Australia has narrowed considerably from 44 percent in 2006 -2007 to 21.5 percent in this survey.",
               "The key findings of the ACU study relating to non-salary benefits (i.e. pension, leave entitlement, medical coverage and other rewards) are as follows:",
               "? Pensions are provided in 93 percent of the institutions included in the survey.",
               "? Most pension schemes are contributory (only South Africa offers non-contributory pension schemes).",
               "? Leave conditions vary, although the majority offer fixed annual leave and parental leave.",
               "? Standard annual leave arrangements tend to be four to six weeks, with a small number of institutions across the countries offering slightly more than this.",
               "? Parental leave tends to be around 52 weeks of combined paid and unpaid leave. The length of paid leave varies across the countries.",
               "? A large majority of institutions (85 percent) offer sabbatical leave, typically six months to a year, accrued after six to seven years\" service.",
               "? Medical insurance schemes are offered in the majority of Canadian and South African universities. Australia, New Zealand and the UK tend not to offer medical insurance, each of these countries have state-funded medical provision."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 8
     },
     {
          "head": {
               "text": "3.3.",
               "type": "introduction"
          },
          "paragraphs": [
               "Australia -Salaries and Benefits"
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9
     },
     {
          "head": {
               "n": "3.3.1.",
               "text": "Overview",
               "type": "introduction"
          },
          "paragraphs": [
               "The latest review of university salaries and benefits published by the ACU in 2011 12 establishes",
               "Australia as having the highest academic salaries 13 out of the four Commonwealth countries under comparison in this report.",
               "Australian universities use Enterprise Agreements 14 (EAs) (also known as Collective Agreements) to negotiate salary and benefits. An EA is a voluntary and negotiated agreement between employees (or their union representatives) and their employer. For the EA to come into effect it must be approved through a ballot process by a majority of the staff who cast a valid vote.",
               "EAs cannot override state laws which cover occupational health and safety, workers compensation, discrimination, child labour, equal employment opportunity and training arrangements. They are regulated by Australia\"s new national workplace relations system, Fair Work Australia, which commenced on 1 July 2009.",
               "In Australia, EAs are specific to a particular enterprise or employer, meanwhile awards provide similar standards for all workers in one industry. An EA can \"stand alone\" by defining all employment conditions or it may supplement an award. EAs often operate in conjunction with union membership.",
               "In Australian universities continue to adapt their remuneration arrangements to provide increased flexibility such as salary loadings for specific disciplines and individuals (according to merit, market pressures, or metropolitan cost of living). Salary Packaging, or Flexible Remuneration Packaging as it is also known, allows staff to change the structure of their remuneration package and take non-cash benefits (such as laptop computers, automobile leases, childcare and car parking) in lieu of taxable gross salary."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10
     },
     {
          "head": {
               "n": "3.3.2.",
               "text": "Academic Salaries",
               "type": "introduction"
          },
          "paragraphs": [
               "Information collected during this study for the G8 universities is summarised in the tables below.",
               "Measures of academic rank have been standardised throughout Australian universities to five levels: Due to differences in the timing and frequency of salary increases, the percentage increases between the 2008 and 2012 salary rates vary across the eight universities shown above. With the exception of ANU, the percentage increases for the remainder of the G8 Australian universities were consistent across all levels.",
               "The lowest percentage increase in academic salaries between 2008 and 2012 were at UWA, although in our May 2008 report UWA had the second largest percentage increase (18 percent) between the period under review . Similarly, the highest percentage increase in academic salaries between 2008 and 2012 were at UNSW, although in our May 2008 report UNSW had the second lowest percentage increase (10 percent) between the period under review .",
               "There is no consistency across the G8 universities in terms of frequency of pay increases -some are only once per annum, while others provide for increases more than once in a year, the majority being on a six monthly basis."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11
     },
     {
          "head": {
               "n": "3.3.3.",
               "text": "Academic Salary Loadings",
               "type": "introduction"
          },
          "paragraphs": [
               "All of the G8 universities use salary loadings to create more attractive and competitive employment conditions. Loadings are paid in addition to the salary scales shown above. This allows individual institutions and departments the flexibility to recruit/retain the most desirable staff. The conditions for these salary loadings are negotiated at each institution in their EA, or within individual employment arrangements.",
               "It is a widespread university practice to offer clinical loadings to attract and retain medical-dental staff, however, this practice has been widened to include other disciplines where there is greater market competition from other institutions or sectors. Salary loading practices are also applied to individual staff across a range of disciplines in recognition of their particular expertise and comparable market remuneration.",
               "The table below summarises some of the \"published\" primarily clinical loadings offered by the University of Sydney. The figures across the top of the table indicate incremental increases in salary loadings and the dates at which they have been, or will be, phased in."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12
     },
     {
          "head": {
               "text": "Loadings",
               "type": "introduction"
          },
          "paragraphs": [
               "Mar-09 Sep-09 Jan-10 Jul-10 Jan-11 Jul-11 Jan-12",
               "3.0% 2.0% 2.5% 2.5% 2.5% 2.5% As indicated above, it is reported that universities operate a range of salary loadings, only some of which are incorporated into published salary scales. The majority appear to form part of employment negotiations which are common across the majority of academic positions within a department and others are customised to individual positions and employees."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13
     },
     {
          "head": {
               "text": "Superannuation",
               "type": "introduction"
          },
          "paragraphs": [
               "In Australia university employers are legally required to pay superannuation on behalf of their employees. UniSuper is the largest of Australia\"s superannuation schemes although there are a number of older State schemes (not open for new membership). UniSuper is the industry super fund dedicated to all who work in Australia's higher education and research sector. All university staff are eligible to participate in the UniSuper superannuation programme.",
               "UniSuper offers two main styles of super -Defined Benefit Division (DBD) and Accumulation 2. Members are encouraged to make standard member contributions equal to 7 percent of their after-tax salary each pay period, although members are able to reduce the level of standard member contributions they make under UniSuper\"s contribution flexibility arrangements. The majority of universities provide employer contributions of up to 17 percent of an employee\"s salary."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14
     },
     {
          "head": {
               "text": "Salary Packaging",
               "type": "introduction"
          },
          "paragraphs": [
               "Salary Packaging or Flexible Remuneration Packaging as it is also known, represents another important component of salary and benefits in Australian universities. It is a voluntary scheme in which university employees may change the structure of their remuneration package and take noncash benefits in lieu of salary. Salary packaging has the benefit of allowing employees the flexibility to tailor their remuneration package to best suit their individual financial and personal needs, as well as taking advantage of legitimate taxation laws to maximise benefits.",
               "This practice of salary packaging is common throughout the G8 Universities."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15
     },
     {
          "head": {
               "text": "Other Non-Salary Benefits",
               "type": "introduction"
          },
          "paragraphs": [
               "In an endeavour to offer competitive remuneration and hence to attract and retain staff in areas of recruitment pressure, institutions include in their overall remuneration package items such as housing subsidies, research support, outside earnings, housing loans, reduced interest, personnel development opportunities and flexible work programmes.",
               "However, there appears to be no Australian data that provides comprehensive information on the frequency and extent of non-salary benefits outside of EAs. The employer contribution will depend on the specific contract type, the duration of the contract and/or the length of time The breakdown of data in the above table is limited by differences in classification and reporting across universities. However, the data above indicates that \"non-salary benefits\" for academic staff vary between 11% and 21% of salaries for the G8 universities. The average across all Australian universities is 14%. "
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16
     },
     {
          "head": {
               "n": "3.4.1.",
               "text": "Overview",
               "type": "introduction"
          },
          "paragraphs": [
               "The latest review of university salaries and benefits published by the ACU establishes Canada as having the second highest academic salaries , just ahead of the UK, out of the four Commonwealth countries under comparison in this report."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17
     },
     {
          "head": {
               "n": "3.4.2.",
               "text": "Academic Salaries",
               "type": "introduction"
          },
          "paragraphs": [
               "The pay scale for academic staff in Canada is determined at provincial rather than national government level. Each provincial government distributes Federal and Provincial education funding to their tertiary systems. Academic staff salaries and benefits are negotiated through the Canadian Association of University Teachers (CAUT), the largest nationwide union of academic faculty, as well as at provincial and institution levels. Salary structures at Canadian universities are the result of continuing negotiations between professors often represented by their union, and administrators acting on behalf of boards of governors ultimately responsible for the business of the university.",
               "The figures below are organised by the standardised academic ranks used throughout the Canadian university system, with average salaries shown in Canadian dollars. The first It has been suggested that while Canadian universities slid relatively unscathed through the 2008 economic recession, Canadian salaries are likely to come under pressure over the next few years as some provincial governments grapple with budget deficits, and students try to limit increases to tuition fees. "
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18
     },
     {
          "head": {
               "n": "3.4.3.",
               "text": "Academic Salary Loadings",
               "type": "introduction"
          },
          "paragraphs": [
               "Canadian Universities pay market differentials, also known as \"market supplements\" or \"market premiums\", in addition to the conventional salary scale. Such payments are discretionary and are made to attract new faculty members and retain those likely to leave. We do not have any specific data on the quantum of market supplements paid."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 19
     },
     {
          "head": {
               "n": "3.4.4.",
               "text": "Academic Staff -Non Salary Benefits",
               "type": "introduction"
          },
          "paragraphs": [
               "These six Canadian universities offer less diverse benefits than their counterparts in the Australian G8 universities. Pensions, insurance (life and health) and leave are the fundamental benefits around which the others are clustered.",
               "University pension plans are an integral component of the compensation packages that universities provide to their faculty. In Alberta, for example, the Universities of Alberta and Calgary offer the Universities Academic Pension Plan (UAPP), a contributory defined benefit pension plan specifically for academic staff. The final value of this plan does not depend solely on the amount contributed. The employer and employee each contribute at a percentage determined by the salary level. Pension at retirement is calculated according to the employee\"s highest average salary and years of credited service while a member of the plan.",
               "The employer and employee contributions to superannuation vary by province and institution. The table below summarises the contribution rates for four of the sample institutions. The basic categories of insurance offered by Canadian universities are life, medical, dental and disability insurance. Paid holidays, maternity and paternity leave, and sabbaticals make up the leave benefits. In addition, the remission of tuition fees for faculty members and in some cases their families, is an attractive benefit. Access to university health and fitness facilities, and university-based childcare, are also important components of academic benefits. The Australian concept of \"Salary Packaging\" has no real equivalent in Canada."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 20
     },
     {
          "head": {
               "n": "3.5.1.",
               "text": "Overview",
               "type": "introduction"
          },
          "paragraphs": [
               "The latest review of university salaries and benefits published by the ACU establishes UK universities as having the third highest salaries (after Australia and Canada) out of the four Commonwealth countries under comparison in this report. Consistent with the ACU\"s previous survey (relating to 2006 -2007 data), the gap between Canada and the UK is minimal (less than 0.4%).",
               "In the UK higher education salary arrangements are mapped to a national 51 point single pay spine.",
               "The national single pay spine is negotiated by the academic sub-committee of the Joint Negotiating Committee for Higher Education Staff (JNCHES).",
               "Currently, the amount of pay received by each salary scale point is reviewed annually through negotiations between the higher education institutions and staff trade unions (the largest of which is the University and College Union (UCU)). Each union negotiates on behalf of its own members. The Universities and Colleges Employers Association (UCEA) facilitates these talks, and mediates between employers and each union until a figure has been agreed.",
               "The main features of the national pay framework are that all staff are paid according to rates on a national pay spine and that academic staff are graded according to a national grading structure, which is supported by national role profiles setting out the nature of the roles within each grade. Staff can expect to progress up the spine one point at a time each year, subject to local banding arrangements, though this could be accelerated to reward special effort, skill or experience.",
               "Special provision is made for staff working in London, due to the higher cost of living. Each year unions negotiate a special London weighting figure. This is a lump sum given to all staff on a particular scale regardless of grading."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 21
     },
     {
          "paragraphs": [
               "It has been reported that changes in the tuition fees regime in the UK could heap pressure on staff wages and put national pay bargaining under \"huge strain\". 24 Recent below-inflation awards have occurred in higher education and the latest round of negotiating was noted as taking place against a complex and challenging economic and sector backdrop. "
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 22
     },
     {
          "head": {
               "n": "3.5.2.",
               "text": "Academic Salaries",
               "type": "introduction"
          },
          "paragraphs": [
               "A copy of the current Single Pay Spine is set out in Appendix 1.",
               "Despite the fact there is a nationally agreed pay spine, universities have an element of flexibility in that they can use their discretion to place academic posts on the pay spine. For the purpose of calculating an average salary for the UK by academic rank we have applied the grading structure to the national pay spine (excluding the London allowance) as utilised by University College London. There is no general national salary scale for professors and equivalent staff, rather they negotiate their salaries individually with their institutions. Some universities, such as Cambridge and Leeds, have improved pay-scale transparency and extended the pay spine scale. Leeds University has created a pay band for professors and senior management. The creation of the band for professors and senior management was unique in that it sets pay points for professors who previously only had a professorial minimum salary. The agreement reached at Leeds introduced a 60-point pay spine and provides a process whereby professorial and senior staff can also apply for a salary review as a reward for outstanding contributions or achievements. Cambridge University has set out the full range of its professorial salaries and has extended the scale to point 92."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 23
     },
     {
          "head": {
               "n": "3.5.3.",
               "text": "Academic Salary Loadings",
               "type": "introduction"
          },
          "paragraphs": [
               "Policy information regarding supplemental salary awards based on expertise and market demand is often difficult to obtain for individual UK universities. Guidelines appear to be present, but they are not always well defined. The University of Leeds has procedures in place relating to the award of discretionary increments, additional scale increments and one-off payments for staff. The procedures booklet notes that the aim is to provide a coherent and practical approach to recurrent and one-off payments made to staff to reward individual contribution within their role, and to ensure transparency, fairness and equality to all staff. "
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 24
     },
     {
          "head": {
               "n": "3.5.4.",
               "text": "Academic Staff Non Salary Benefits",
               "type": "introduction"
          },
          "paragraphs": [
               "Academic benefits in the UK lack the scope of their Australian counterparts, and because of the National Health Service there is less emphasis on medical insurance and disability benefits than in Canada or the United States. Pension and paid leave (annual, research, parental and family) are the primary benefits offered by most UK universities."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 25
     },
     {
          "head": {
               "text": "Pension",
               "type": "introduction"
          },
          "paragraphs": [
               "The Universities Superannuation Scheme (USS) is the principal pension scheme in the UK. the USS pension scheme from 6.35% to 7.5% of salary. The effect of this is mitigated to some degree as pension contributions attract tax relief. New members of the scheme (after 1/10/2011) will no longer be eligible to join the final salary section of the scheme. Instead, new members will join what has been termed the \"career re-valued benefits\" section or CRB as it will be known. Employee contribution is the CRB section will be 6.5%. The Today USS, which has approximately 395 participating institutions and approximately 260,000 members, is the second largest private sector pension scheme in the UK by fund size. The \"standard\" package of benefits under USS is a pension of 1/80th of your pensionable salary for every year (and part year) of your pensionable service, plus three times this annual pension as a tax-free cash lump sum. Life insurance, or \"death-in-service benefit\", is included in the USS pension plan;",
               "the sum is based on three years\" annual salary."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 26
     },
     {
          "head": {
               "text": "Health Care and Illness Benefits",
               "type": "introduction"
          },
          "paragraphs": [
               "Unless employees wish to purchase private insurance, their health care will be provided by the National Health Service. The Social Security Contributions and Benefits Act 1992 provides for up to 28 weeks of paid illness leave. This programme is called Statutory Sick Pay (SSP)."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 27
     },
     {
          "head": {
               "text": "Paid Leave",
               "type": "introduction"
          },
          "paragraphs": [
               "Workers in the UK, including the tertiary sector, are entitled by law to 28 days of paid annual leave, including eight bank holidays. Paid maternity leave of 39 weeks is a statutory right in the UK."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 28
     },
     {
          "paragraphs": [
               "Academics may also qualify for research leave after a number of years in service. Some UK universities offer long service leave although this is not the norm in UK universities.  "
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 29
     },
     {
          "head": {
               "n": "3.6.1.",
               "text": "Overview",
               "type": "introduction"
          },
          "paragraphs": [
               "Salary changes of faculty members in the USA continue to reflect their troubled economy. Historically, annual average faculty salaries increased three to four percent, however, as reported in the latest Faculty Salaries report this increase slowed to and .",
               "Although the recession is now technically over, analysis of faculty compensation and forecasts for state revenues undertaken by the American Association of University Professors (AAUP) in their 2010 -2011 Report on the Economic Status of the Profession indicated that the negative impact on higher education will continue for years in many states. The report made reference to the fact that many faculty members and other employees in higher education have endured salary freezes or involuntary unpaid furloughs in the last year, and their analysis revealed that for the second consecutive year, real salary levels fell, and for the fifth time in the last seven years, overall faculty salaries declined in purchasing power."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 30
     },
     {
          "paragraphs": [
               "The figures below are organised by the standardised academic ranks used throughout the USA university system, with average salaries shown in US dollars. "
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 31
     },
     {
          "head": {
               "text": "Percentage movement in National Average Salaries (USD) between 2006 -2007 and 2010 -2011",
               "type": "introduction"
          },
          "paragraphs": [
               "All full-time faculty members 10%",
               "Professors 11%",
               "Associate Professors 10%"
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 32
     },
     {
          "head": {
               "text": "Assistant Professors 10%",
               "type": "introduction"
          },
          "paragraphs": [
               "No Rank (mostly at community colleges) 9%",
               "Lecturers 11%",
               "Instructors 9%"
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 33
     },
     {
          "head": {
               "text": "The Rising Percentage of Contingent Faculty",
               "type": "introduction"
          },
          "paragraphs": [
               "We noted in our 2008 report that there was increasing concern and debate in the US about \"contingent faculty\". Contingent faculty includes postgraduate student teachers, part-time and full-time faculty on temporary contracts. The 2010 -2011 AAUP Report on the Status of the Profession reported that based on the most recent available data, the number of contingent appointments among all instructional staff continued to grow between 2007 and 2009 to the point where graduate student employees and faculty members serving in contingent appointments now make up more than 75 percent of the total instructional staff. The Report noted that in the 2007 to 2009 period there had been an overall 12 percent increase in higher education enrolment, yet in that same period tenured positions grew by only 2.4 percent."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 34
     },
     {
          "head": {
               "text": "Public and Independent Universities",
               "type": "introduction"
          },
          "paragraphs": [
               "There are no national academic or non-academic pay scales in the United States. At public universities, funding and resources for employees\" salary and benefits are determined by individual state governments. This budget is supplemented by federal funds, through student borrowing or as direct grants. Independent universities receive no direct state resources per FTE student; however, they do get state, federal and independent-sector research-based funding, plus they benefit from any students who may utilise federal student loans or the Higher Education Act.",
               "38 http://www.aaup.org/AAUP/comm/rep/Z/ecstatreport10-11/. It was noted that the pattern of increasing non-tenure-track appointments and decreasing tenure-track appointments was consistent across institutional types (e.g. doctoral universities, Master\"s, Baccalaureate and Associate\"s degree categories)."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 35
     },
     {
          "head": {
               "n": "3.6.2.",
               "text": "Academic Staff Salaries",
               "type": "introduction"
          },
          "paragraphs": [
               "The AAUP and the National Education Association (NEA) publish annual statistical analysis of USA academic salaries. In the USA, 87 percent of all full-time faculty members at 3,049 degree-granting institutions are on 9/10 month contracts. This salary can be spread over a 12 month period in most cases. Additional income may also be earned and the two most common sources of additional income for faculty members are summer school and consulting outside the university. It has been noted that different funders have slightly different rules about how much salary professors can take, but the basic rule of thumb is that they can take another two months\" worth of salary."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 36
     },
     {
          "paragraphs": [
               "Faculty members with collective-bargaining agreements averaged USD $2,882 more than their noncollective bargaining colleagues in 2010 -2011."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 37
     },
     {
          "paragraphs": [
               "The latest  The salary gap between average academic salaries paid by public and independent universities has remained at 13 percent.  The tables below summarise the average salaries at the US Reference Group universities, for each Most USA institutions, including all those in this Report\"s Reference Group, offer a summer semester of courses. Faculty may choose to earn additional income in the summer session. Rounded to the nearest hundred dollars."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 38
     },
     {
          "head": {
               "n": "3.6.3.",
               "text": "Academic Staff -Non Salary Benefits",
               "type": "introduction"
          },
          "paragraphs": [
               "Academic benefits offered by American universities are complex. This complexity has a great deal to do with the various types and levels of health insurance benefits. In addition to insurance, the variety of choices for pensions and retirement investments adds complexity to benefits in the USA tertiary sector. The AAUP has provided an analysis of academic staff benefits for public institutions (published in 2012). The AAUP defines \"benefits\" as the institution (or state) contribution on behalf of the individual faculty member (i.e. it does not include the employee contribution). In comparing the cost of benefits shown above, independent institutions spent an average of $3,108 more than public institutions on faculty benefits in 2010 -2011. This benefits gap is consistent with the salary gap between independent and public universities.  "
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 39
     },
     {
          "head": {
               "n": "3.7.2.",
               "text": "Academic Staff Salaries",
               "type": "introduction"
          },
          "paragraphs": [
               "In New Zealand collective agreements are currently negotiated separately at each of the eight universities. Whilst there have been discussions in recent years around the possibility of developing one national collective employment agreement for academic staff and another for general staff, there has been reluctance from university employers to consider a nationwide collective agreement. 51 Negotiations of collective agreements at New Zealand universities are carried out primarily by the Tertiary Education Union 52 (TEU), however, the Public Service Association (PSA) are also involved.",
               "With the exception of the University of Auckland, the current collective agreements in New Zealand are all due to expire in 2012, therefore formal negotiations in the next bargaining round will be commencing shortly. "
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 40
     },
     {
          "head": {
               "n": "3.7.3.",
               "text": "Academic Staff -Non Salary Benefits",
               "type": "introduction"
          },
          "paragraphs": [
               "New Zealand universities offer their longer-term and permanent employees standard benefits including superannuation and paid leave, with some travel, relocation expenses and professional development.",
               "The New Zealand Universities' Superannuation Scheme (NZUSS) was established on 1 March 1993 to provide employees of approved Universities and employees of approved companies and organisations associated with universities with retirement and other benefits. The NZUSS has over 6,670 members, making it one of the more significant employer-sponsored superannuation schemes in New Zealand. All of New Zealand\"s universities are members of the NZUSS with the exception of Auckland University of Technology (AUT). Academic staff may also elect to participate in KiwiSaver."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 41
     },
     {
          "paragraphs": [
               "Members of the NZUSS contribute multiples of 0.5 percent of their salary, subject to a minimum according to their category of membership. 55 There is no maximum level of contributions. \"Salary\" for the purposes of the scheme is the remuneration paid by the employer, but excludes overtime, bonuses, penal payments or any other allowances. Employers contribute to the Scheme at a rate of 1.35 times the contributions of Subsidised Members, up to a maximum of 6.75 percent of salary."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 42
     },
     {
          "paragraphs": [
               "The NZUSS is a defined contribution scheme. This means that contributions made by an employee and employer are credited to separate accounts maintained for the employee and have any investment returns allocated to them. The accounts in an employee\"s name, adjusted for investment returns, fund the lump sum benefit payable to the employee from the Scheme."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 43
     },
     {
          "paragraphs": [
               "Most New Zealand universities do not actively publicise their benefits packages as recruitment incentives and do not generally publish details of their benefits for general access on their web pages.",
               "New Zealand Universities offer between 20 -30 days\" annual leave, and seven of the eight universities offer sabbatical leave of between six months to one year, depending on length of service. Only two New Zealand universities provide long service leave. 58 53 https://secure.superfacts.com/public/NZUSS/article.tpz?contentId=7bcb7c50-e15f-414d-a0ee-7ce0fb354821 In such a case the employer will provide KiwiSaver benefits to the employee (including employer contributions) in accordance with its obligations under the KiwiSaver Act 2006 (as amended from time to time). Universities are considered an \"exempt employer\" so new employees will not be automatically enrolled in KiwiSaver. If employees want to join KiwiSaver, they can still opt in and the University will pay the compulsory employer contribution. The compulsory employer subsidy will not be payable to staff already receiving a subsidy in any other workplace scheme, such as NZUSS.  "
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 44
     },
     {
          "head": {
               "n": "4.1.",
               "text": "Comparison of Salaries and Benefits",
               "type": "introduction"
          },
          "paragraphs": [
               "The tables below and on the following page summarise the data presented in The above table indicates that across all academic ranks the New Zealand university salaries (expressed in US$ PPP) lag behind Australia, Canada and USA.",
               "Academic salaries in PPP terms in New Zealand are similar to those in the UK -the only rank where New Zealand salaries are higher than the UK is at the Associate Professor rank."
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 45
     },
     {
          "head": {
               "text": "University Staff Academic Salaries and Remuneration: A Comparison of New Zealand and Select International Data",
               "type": "introduction"
          },
          "paragraphs": [
               "The gap between academic salaries in PPP terms in New Zealand and neighbouring Australia is most obvious at the Lecturer and Professor levels, where New Zealand lags approximately 20 percent behind Australia. While New Zealand has gained ground on Australia since our last report in 2008, there is still a sizeable gap between the two countries. The differential (based on calculating an average PPP across all ranks) has reduced from 25 percent in 2008 to 15 percent in 2012.",
               "Given the academic workforce operates within a global labour market that is becoming increasingly competitive, 60 coupled with the fact it has been estimated that between now and 2020, New Zealand universities will need to consistently attract between 560 and 920 academic staff per annum, 61 it is anticipated that there will be considerable stress on New Zealand universities in maintaining their academic workforce.",
               "Comparisons of non-salary benefits are made difficult because of different arrangements across countries in terms of employer and employee responsibilities for healthcare and superannuation and because of different levels of disclosure of non-salary benefits. Specific data on non-salary benefits and salary loadings is neither easily available nor readily comparable. "
          ],
          "paper_id": "24824c20-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 46
     }
]