[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Overlapping community detection algorithm research is one of hot topics in current social network analysis. In this paper, we applied the idea of weighted label propagation to overlapping community detection algorithm design, and propose a weighted label propagation algorithm (WLPA). Moreover, in order to evaluate the performance results of various overlapping community detection algorithms, we put forward a series of evaluation criteria based on error distribution curve of overlapping vertices. The experiment results show that the algorithm has a faster speed and better community detection results, and the evaluation criteria is in line with the inherent characteristics of the social network overlapping community structure."
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "I. INTRODUCTION",
               "type": "introduction"
          },
          "paragraphs": [
               "etwork community structure is one of the most popular and important topological properties of networks. Typically a network can be modeled with a graph, which consists of nodes and edges. Non-overlapping community is defined as the dense connected components of a network. In a community, the nodes, which have same or similar attributes, are closely interconnected, while in different communities, nodes are sparsely interconnected . At the same time, a community that shares some nodes and edges, resulting in overlap, is called an overlapping community . Compared with non-overlapping community, overlapping community can better reflect the actual characteristics of the networks.",
               "Discovering the different community structures in a complex network can identify potential relationships between elements, thus contributing to understanding and developing networks. Therefore it has great social value. Overlapping community detection algorithm is designed to identify overlapping communities' inherent structure in the networks, which means nodes need to be divided into several groups in accordance with the link relations. And above all, the algorithm can also detect the communities' overlaps.",
               "The researchers have proposed several overlapping community detection algorithms. Palla et al. proposed CPM algorithm for finding the network overlapping community structure. Gregory put forward an algorithm named COPRA , which adopts the idea of label propagation. COPRA is an algorithm improved from RAK . RAK uses the label propagation to find the overlapping community structure. Xie also gave a method named SLPA algorithm , which is very similar with the COPRA algorithm. proposed an algorithm based on the game theory which is similar with SLPA too. Besides, there are some other label propagation algorithms .",
               "By analyzing the overlapping community detection, we can summarize the main problems of the current study as follows. 1) Existing overlapping community detection algorithms often cannot meet the requirements of less computing speed, high accuracy, not relying on the prior knowledge, and not being sensitive to parameters. 2) Overlapping community detection algorithm is often \"biased\". 3) Lack of effective evaluation criteria for overlapping community detection algorithm.",
               "In this paper, we applied weighted label propagation to overlapping community detection algorithm, and propose a weighted label propagation algorithm (WLPA). In order to evaluate the performance of various overlapping community detection algorithms, we propose a series of evaluation criteria based on error distribution curve of overlapping vertices. The experiments show it has a faster speed and better community detection results, and can avoid the above problems. "
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "B. Extends to Overlapping Community Detection",
               "type": "introduction"
          },
          "paragraphs": [
               "The above mentioned label propagation algorithms can only be used for non-overlapping community detection. We improve the LPA according to the label set proposed in COPRA. The main improvement is to make the node label keep many community identifiers. When the algorithm finishes after several iterations, if the node label contains multiple community identifiers, the node will belong to multiple communities at the same time. As for the above mentioned problems, we will also give the corresponding solutions."
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 2,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "1) Label set",
               "type": "introduction"
          },
          "paragraphs": [
               "The label of each node is a set whose element is c b , where c is the community ID; b is the attribution factor. And the sum of all attribution factors in the label of a node is equal to 1.",
               "Then in the iterative process, when the neighbor nodes' labels spread to the node, the elements in the label set of the node will change. However, if we just modify the algorithm as above, each node's label set will become bigger and bigger. And ultimately many nodes may belong to as many as N communities, where N is the total number of nodes in the network, and is also the initial total number of communities, because each node initially uses its own symbol as an independent community identifier.",
               "Clearly, we need a mechanism to limit the label set increasing infinitely and delete those elements with a small attribution factor. So we set a parameter v, which indicates the number of maximum communities that nodes can be attributed to. Because the sum of attribution factors in each node's label set is 1, we stipulate that: in each iteration, the elements with an attribution factor less than 1/ v will be deleted, while the elements with a high attribution factor will be kept. In actual operation the algorithm will run into the following situations:",
               "(1) If there is more than one element in label set whose attribution factor is greater than 1/ v , all of them were preserved.",
               "(2) If there is no element whose attribution factor is larger than 1/ v , the algorithm will keep the biggest attribution factor, and if there is more than one element with the biggest attribution factor, it will randomly choose one.",
               "After the deletion of label set, in order to meet the aforementioned requirement, the sum of all elements' attribution factors must be 1."
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 3,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "2) Label propagation",
               "type": "introduction"
          },
          "paragraphs": [
               "To clarify the label set specific propagation process, firstly we need to solve the problems of LPA above mentioned. Next we will focus on the following respects to explore the characteristics of label propagation algorithm, and to make trade-offs through experiments.",
               "(1) Synchronous and asynchronous update. So far, some algorithms use synchronous update, and some algorithms adopt asynchronous update. Overlapping community detection algorithms based on LPA mainly include COPRA and SLPA. The former uses synchronous update while the latter uses asynchronous update.",
               "(2) Node updating sequence. We need to update the labels of all nodes in a certain order. When using the synchronization update, the order does not matter; when using the asynchronous update, the spread of label will be affected. We have three options: the random order; the increases order of node degree (Ascending); and the decrease order of node degree (Descending).",
               "(3) The weight of label propagation. Most of existing algorithms based on LPA believe that the statuses of each node's label in the propagation process are equal. Taking the real network into account, the importance of different nodes in every community is different. The node with a relatively large degree tends to influence its neighbors more than the other nodes with a small degree. Firstly we assume the weight of node's label according to the average degree of all the nodes in the network. For example, we define node's label weight by the ratio of its degree to the average degree of the network. We find the above approach may be also not reasonable after studying the network structure. Because the actual community may be big or small, and the node's influence is mainly confined in a certain community or the adjoining area, moreover the weight of a node's label is directly affected by its neighbors. Based on the local influence, we initially consider the following scheme. Scheme 1: Before updating node labels, we calculate each neighbor node's label weights (weight = degree of neighbor nodes / the degree of node to be updated), and multiply the attribution factor of neighbor nodes by weight to strengthen (bigger than 1) or weaken (smaller than 1) it. Then we add the neighbor node's labels into the label set that will be updated. This scheme is referred to as \"Weight1\". Scheme 2: still based on local influence, but adopt \"one size fits all\" strategy, which means that whatever neighbor node's degree is bigger than the updating node, we enhance the label of the node to 1.1 times. As for the node whose degree is less than the updating node we weaken it to 0.9 times. 0.9 is tentative for the experiment just for convenience. This scheme is called \"Weight2\".",
               "All kinds of algorithms based on label propagation have a similar process. For instance, COPRA is a combination algorithm with \"Synchronous + Random + Unweighted\". If we let the parameter v= 2, and adopt the \"Synchronous + Random + Unweighted\" combination algorithm, the label propagation process are indicated into the following steps."
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "3) Terminating conditions",
               "type": "introduction"
          },
          "paragraphs": [
               "Now there are two main termination conditions that can be used to stop the overlapping community label propagation.",
               "(1) Artificially give the times of iterations, for example, SLPA algorithm thinks that it only need 20 times iterations to stabilize the result. The number 20 is independent of the network size and structure . We call this scheme \"Termination1\".",
               "(2) Referring to COPRA algorithm's termination conditions, Let the set of community identifiers in the t-th iteration be that it will definitely happen within a finite time, so the algorithm can certainly be terminated. Although we do not prove that we always can get the best results after the t-th iterations, but COPRA algorithm termination condition performs well in practice, and the calculation is very simple. We call this scheme \"Termination2\". "
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "III. EVALUATION CRITERIA",
               "type": "experiment"
          },
          "paragraphs": [
               "is the degree of node a . Nodes are divided into a certain community is mainly determined by two factors, namely the desire of nodes to join the community and the attractiveness of the community, just like the interaction force in physics. In real social networks, the establishment of the edges is often driven by these two factors. Based on practical considerations, we give the following definition. "
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 6,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "A. Degree of Contribution (Doc)",
               "type": "introduction"
          },
          "paragraphs": [
               ", but the number often DoC indicates the ratio of the number of edges assigned to a community by a node to its total number of edges, which measures the desire of the node to join the community.",
               "in out",
               "changes in successive iterations, so we cannot expect",
               "Our approach is to calculate the minimum number of nodes marked by each community identifier beginning with the reduction of the community identifier. The calculating formula is shown in (1).",
               "As shown in , compared with community A, there are more relationships of the node a in the community B. We think that a's contribution to the community B is more, so node a has more willing to join the community B. "
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "B. Degree of Attraction (DoA)",
               "type": "introduction"
          },
          "paragraphs": [
               "DoA describes a community's attraction for a node to join it, and it is decided by the density of original community and the node's connections in the original community. It is denoted as: where the set ' A A a = ? , that is the so-called original community. m a A is the number of the friends' friends of node a in community A . The second factor of is the size of the social circle of the node a 's friends. The lager it is, the more triadic closure of node a may form. Thus the node will connect more closely with the community. In (3), the former factor describes the close level of the connected part of the node, namely the degree of solidarity of the original community. The latter factor represents the importance and social connections of node's friends in the original community, which is to measure the position of the node's friend in the community.",
               "Termination2\". We have implemented the \"Synchronous + Unweighted + Random + Termination1\" label propagation algorithm. For the condition \"Termination1\", we set that the time of iterations is 20, 50 and 100, and v = 2. We did experiments on Power Grid network , which includes 4941 nodes, 6594 edges. It is an undirected and un-weighted network.",
               "The results are shown in average results which the algorithm runs 100 times."
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 8,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "C. Coefficient of Belonging (CoB)",
               "type": "introduction"
          },
          "paragraphs": [
               "CoB is the combination of DoC and DoA. It is denoted as:",
               ", where the parameteris the influence factor, balancing the weight of DoC and DoA. According to experiments, the criteria has the best performance when=0.5. Besides the criteria we propose above, we also choose the following criteria in the experiments."
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 9,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "E. Modularity Function",
               "type": "introduction"
          },
          "paragraphs": [
               "Network modularity evaluation function, also called Q function, was proposed by Newman . It is calculated as the following form:",
               "The \"comm\" in the table I denotes the sum of communities found by algorithm under a certain conditions. The \"iterations\" is the times of iteration of the label propagation. The \"overlap\" represents the degree of overlapping, i.e. the average number of communities which a node belongs to. The \"mod\" indicates the value of the modularity function, larger value indicates a better community structures. The \"time (ms)\" indicates the running time of algorithm, in milliseconds. From , we can know that 56.89 iterations are needed for \"Termination2\". And if we take modularity as evaluation, the results of \"Termination2\" are superior to that of \"Termination1\", Even taking 100 iterations under \"Termination1\", the results have not got large improvements.",
               "Power Grid is a real network data set. At the same time, we then use the method of generating artificial network which Lancichinetti proposed , to generate an artificial network where N = 1000, on = 50, om = 3, k = 20, maxk = 50, minc = 10, maxc = 50, mu = 0.1. The experiments repeat 100 times to get the results shown in , when we take the parameter v = 3. "
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "F. NMI (Normalized Mutual Information)",
               "type": "introduction"
          },
          "paragraphs": [
               "NMI is used to calculate the similarity of two communities. Its proposition has learned from the definition \"mutual information\" in information theory. For each partition result, the algorithm gives a value of \"mutual information\", and normalizes it to compare the similarity of two matrices. "
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "IV. EXPERIMENT",
               "type": "experiment"
          },
          "paragraphs": [
               "In this section, we performed experiments to choose the optional conditions in order to get the best performance for label propagation.",
               "What we can see from is that with the increase of number of iterations, \"Termination1\" cannot get the better results. The change of \"mod\" is not very obvious. However the increase of the number of iterations means the increase of running time.",
               "In summary, we have decided to use the \"Termination2\" as a required condition of our modified algorithm in the future, namely the termination conditions of COPRA. We can lower the number of iterations and get a better community detection as a result of \"Termination2\"."
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "A. Selection of Termination Condition",
               "type": "experiment"
          },
          "paragraphs": [
               "Referring to the COPRA algorithm, as analyzed above, it is a combination of \"Synchronous+ Unweighted+ Random +"
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "B. Determination of Propagation Conditions",
               "type": "experiment"
          },
          "paragraphs": [
               "Next we explore the propagation conditions, for instance, synchronous and asynchronous updates, ascending, descending, random, the weights of labels, and so on. According to the results of the previous study of the termination conditions, the experiments are under the condition of \"Termination2\". First, we adopt the Power Grid network and let v = 2. The results are shown in From , it is clear that the running time obviously decrease when we change the synchronous update to asynchronous update. We also know that the speed of algorithms have been accelerated and the quality of community detection have improved. So it is reasonable that the \"Asynchronous\" will be certainly selected. effects are good. Compared to the original running time of the COPRA, \"Synchronous + random + Unweighted\" reduces several times. By observing the experimental data, we can find that \"Asynchronous + Ascending + Weight2\" in general uses less iterations, and its running time is shorter. Although the difference is not very clear, we ultimately choose \"Asynchronous + Ascending + Weight2\" to use in our proposed label propagation algorithm. In order to confirm the above conclusions, we performed the experiments with an artificial network produced under the conditions with N = 1000, on = 50, om = 3, k = 20, maxk = 50, minc = 10, maxc = 50, mu = 0.1. The results are shown in . shows that asynchronous update has a huge positive effect on the running time of the algorithm. We also know that asynchronous update does not make the \"mod\" value decrease. Conversely, it makes the network community detection better. Because of generation theory of artificial network, we can clearly know that it has 50 communities. Based on the number of the community, \"Asynchronous + Descending + Weight1\" and \"Asynchronous + Descending + Weight2\" can find a little number of communities, even their \"mod\" values are high, they still are not good algorithms.",
               "Thus we use NMI to evaluate the results of the combinations of the algorithms again. Table IV further validates that performance of \"Asynchronous + Descending + Weight1\" and \"Asynchronous + Descending + Weight2\" are poor. Their community detection results are quite different from the expected results of artificial network.",
               "In summary, now we can select a better solution of the label propagation algorithm. NMI is the main evaluation criteria, so \"Asynchronous + Ascending + Unweighted\" and \"Asynchronous + Ascending + Weight2\" are good schemes. Furthermore, the \"mod\" value are both more than 0.8, so the Next, we discuss the scheme \"Weight2\". As mentioned above, if the neighbor node's degree is larger than that of present node, we will multiply the attribution factor of the element in the label by 1.1 to enlarge its affect; if the neighbor node's degree is less, we will multiply it by 0.9; if they are equal, it will not change. The change of the attribution factor is aiming at accelerating the speed of propagation. We call this scheme (1.1, 0.9). We did experiments under different weight. The results are shown in  From Table V, according to the running time, \"mod\" value and NMI, for different options of \"Weight2\", their effect on the community detection are very similar, and we cannot see a greater improvement. Therefore, we will continue to use the (1.1, 0.9) scheme as it is used in the previous experiment."
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "C. Comparison with Other Algorithms",
               "type": "experiment"
          },
          "paragraphs": [
               "After the above discussion and verification of the label propagation, we finally choose \"Asynchronous + Ascending + Weight2\" as the scheme of the overlapping community label propagation algorithm proposed in this paper, which is most different from other label propagation algorithm is that we add the weight to the label propagation process. So the algorithm can be called Weighted Label Propagation Algorithm (WLPA).",
               "Next, we did experiments with WLPA and other algorithms including COPRA, SLPA, GCE , OSLOM and other algorithms for comparison their performance. We use the NMI and the EDOV to evaluate the results. We use the LFR method to generate artificial network under N = 1000, om = 3, k = 20, maxk = 50, minc = 20, maxc = 50, mu = 0.2, a changing parameter on from 100 to 1000. The NMI values of different algorithms are shown in . The EDOV curves of different algorithms when on=200 are shown in . The EDOV curves of WLPA algorithm is plotted in alone."
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     },
     {
          "head": {
               "text": "V. CONCLUSION",
               "type": "conclusion"
          },
          "paragraphs": [
               "This paper focuses on the idea of label propagation and its actual operation process. Through theoretical analysis and a lot of comparative analysis of \"control variable\", we make a positive choice on the updating sequence of node, the updating way, the propagation weight and terminal condition. We finally choose the fastest, better effect scheme, \"Asynchronous + Ascending + Weight2\", as the core idea of our weighted label propagation algorithm (WLPA). Next, we propose a series of effective evaluation criteria based on error distribution curve of overlapping nodes. Finally, we compare and analyze WLPA with several mainstream overlapping community detection algorithms, which has the following advantages, the faster speed, better overlapping community detection result, not depending on the priori knowledge, and not being sensitive to parameters. Moreover, WLPA can also avoid the problems brought by biased objective function. First, we can see from , WLPA algorithm gets a good effect. The error rates of all overlapping nodes found by algorithm are less than 40%, and most of overlapping nodes' error rates is very small. So it can be believed that WLPA is precise to detect the overlapping community. As shown in , we compared the WLPA's EDOV curve with that of other several popular algorithms, and knew that WLPA behaves no worse than other mainstream algorithms."
          ],
          "paper_id": "24881880-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "IEEE ICC 2015 SAC -Social Networking Weighted Label Propagation Algorithm for Overlapping Community Detection"
     }
]