[
     {
          "head": {
               "n": "0",
               "text": "abstract",
               "type": "abstract"
          },
          "paragraphs": [
               "Stock price prediction is an important task for most investors and professional analysts. However, it is a tough problem because of the uncertainties involved in prices. This paper presents a four-layer fuzzy multiagent system (FMAS) architecture to develop a hybrid artificial intelligence model based on the coordination of intelligent agents performing data preprocessing and function approximation tasks for next-day stock price prediction. The first layer is dedicated to metadata creation. The second layer is aimed at data preprocessing using stepwise regression analysis and self-organizing map neural network clustering for modularizing prediction problems. The third layer is aimed at model building for each cluster using genetic fuzzy systems and evaluating built models to choose the best evolved fuzzy system for each cluster. Finally, the fourth layer provides model analysis and knowledge presentation. The capability of FMAS is evaluated by applying it on stock price data gathered from IT and airline sectors and comparing the outcomes with the results of other methods. The results show that FMAS outperforms all previous methods, so it can be considered as a suitable tool for stock price prediction problems. C 2012 Wiley Periodicals, Inc."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 0,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "1.",
               "text": "INTRODUCTION",
               "type": "introduction"
          },
          "paragraphs": [
               "Stock price time series prediction is a very important and challenging task in the financial studies.",
               "1 This problem is characterized by high complexity and a great number of interacting and highly interrelated economic, social, political, and even psychological components, and these factors interact with each other in a very complicated manner. In modeling such a complex system, difficulties have already appeared during the creation of a robust model and selection of its architecture. Nontraditional techniques from different domains can be effective in the case of complex systems, providing novel ways to generate decisions and find solutions. The multiagent approach is a suitable method that can help reduce the complexity of a system by creating independent components, which solve private subtasks that together achieve common goals. Multiagent systems are intelligent distributed approaches suited for applications that are modular, changeable, and complex. They have autonomy, integration, reactivity, and flexibility capabilities."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 1,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "paragraphs": [
               "Every agent utilizes the most effective method for solving the subtask and does not apply a general approach, which is often acceptable for the system on the whole, but not optimal for a concrete subtask. Because of these characteristics, multiagent based models are attracting significant attention in the study of financial markets. The distributed nature of the prediction problem means that subtasks in the prediction problem are independent, and each of them performs specific functions to achieve certain targets in a prediction problem. In other words, independence means that each subtask such as metadata creation, feature selection, knowledge discovery, and function approximation performs its own tasks and necessary processes are carried out without the interference of other elements or components. Therefore, in the prediction problem, the multiagent approach seems to be an appropriate method that can help reduce the complexity of the prediction problem and increase prediction accuracy by creating autonomous agents, which can model independent subtasks that together comprise the whole goal.",
               "In recent years, some research has been published in favor of using multiagent approaches in prediction problems. Lee and Liu introduced a weather forecasting system that used fuzzy-neuro-based intelligent agents for automatic weather information gathering and filtering for time series weather prediction. Jumadinova and Dasgupta proposed a multiagent based system for analyzing the effects of different information-related aspects on prediction markets. Meshkin et al. proposed an agent-based system for the prediction of relative solvent accessibility of proteins. The results were lower error rates when compared with the seven competing methods, reduced computational time, and optimized prediction quality.",
               "The main function of an intelligent agent, the artificial intelligence counterpart of multiagent systems with intelligent capabilities that include data mining, intelligent pattern recognition, and function approximation, is difficult to implement."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 2,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "paragraphs": [
               "For example, in a stock price prediction problem, the need for artificial intelligence capabilities can be found in modeling nonlinear trends of stock price time series or data preprocessing such as feature selection.",
               "There are few papers in the literature that use an intelligent multiagent approach for stock price prediction problems. Gamil et al. proposed a multiagent and fuzzy logic based decision support system that can help investors of the stock market make the correct buy/sell/hold decisions. Experimental simulation using actual price data from the NASDAQ index was carried out to demonstrate the power of their proposed model. They stated that the results were satisfactory and outperformed other models. Antonello and Silveira proposed a method to predict the movements of the Bovespa stock index through multiagent systems. Experimental results showed that predicting the direction of the populations of agents was more efficient than predicting the direction based only on data in the index time series.",
               "Data quality is a key issue in the prediction problem. To increase the accuracy of the predictions, we may perform data preprocessing techniques such as feature selection and data clustering. Atsalakis and Valavanis 12 pointed out that input data preprocessing may impact prediction performance. A choice of indicators as inputs through sensitivity analysis may help eliminate redundant inputs. In addition, one of the best ways to improve the accuracy of a model is using modular approaches. In modular models, a task or problem is decomposed into a number of subtasks and each module handles a subtask of the global task. There are different motivations for using modular approaches, which are to improve performance, reduce model complexity, make the problem simple, and to recombine sensory information.",
               "14 By using data clustering, the prediction problem can be modularized and accuracy of the model can be improved.",
               "The aim of this research is to develop a modularized stock price prediction model, which is capable of achieving the following advantages:",
               "? Using a multiagent approach as an appropriate method, which can help reduce the complexity of the prediction problem and increase prediction accuracy by creating autonomous agents, which models independent subtasks of the prediction problem.",
               "? Using data preprocessing agents such as feature selection for determining significant factors and clustering for reducing the complexity of the whole data space to something more homogeneous.",
               "? Using genetic fuzzy system predictor agents for automating the definition of the fuzzy rule based systems (FRBS).",
               "This paper proposes a four-layer fuzzy multiagent system (FMAS) architecture to develop a hybrid artificial intelligence model based on the coordination of intelligent agents performing data preprocessing and prediction tasks for next-day stock price prediction. The capability of the proposed multiagent system is tested by applying it on the stock price data of International Business Machines and Dell Corporation from the IT sector, and British airways and Ryanair from airline sectors that have been used in different studies as the case study.",
               "The remainder of the paper is organized as follows: A selective review of related literature is provided in Section 2. In Section 3, the architecture of the proposed multiagent system is presented. In Section 4, the experimental results and comparison of the proposed approach and other models in the literature are presented. The last section contains some concluding remarks."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "introduction"
          },
          "paragraphNo": 3,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "2.",
               "text": "BACKGROUND",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Stock market predictors focus on developing approaches to successfully predict index values or stock prices, aiming at high profits using well defined trading strategies. The central idea to successful stock market prediction is achieving the best results by using the minimum required input data and the least complex stock market model. Considering this idea, an obvious complexity of the problem paves the way for the importance of intelligent prediction paradigms.",
               "Artificial Intelligence techniques such as artificial neural networks (ANNs), fuzzy logic, and genetic algorithms (GAs) are popular research subjects, since they can deal with complex engineering problems, which are difficult to solve by classical methods. These techniques have been successfully used in place of the complex mathematical systems for the prediction of time series."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 4,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "text": "17?19",
               "type": "relatedwork"
          },
          "paragraphs": [
               "Artificial intelligence techniques can be combined together in various ways to form hybrid techniques. Hybrid models have more flexibility and can be used to estimate the nonlinear relationship, without the limits of traditional models such as time series models. Therefore, more and more researchers tend to use hybrid prediction models to deal with prediction problems. For example, proposed an integrated approach based on genetic fuzzy systems and artificial neural networks for constructing a stock price prediction expert system. Results showed that their proposed approach outperforms other methods such as ANN and ARIMA. Alizadeh et al. proposed an adaptive neuro-fuzzy inference system (ANFIS) for stock portfolio return prediction. They obtained that predicted portfolio returns can be improved by using ANFIS and taking as input a variety of technical and fundamental attributes about various indices of the stock market.",
               "Among intelligent models, FRBS and artificial neural network models have been popular techniques for the prediction of time series in the recent decade. Despite the advantages of ANNs, they have weaknesses, one of the most important of which is their requirement for large amount of data to yield accurate results. In addition, the training procedure of an ANN model is time consuming.",
               "22 Fuzzy prediction methods are suitable under incomplete data conditions and require fewer observations than other prediction models do. Considering the uncertainty and complexity in all stock markets, which is related to their short and long-term future states, fuzzy rule based models seem ideal candidates for stock market analysis and prediction."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 5,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "paragraphs": [
               "Fuzzy rule based models offer a better way to represent complicated situations in terms of simple natural language and have been applied very practically in many fields where classical models are difficult to implement for design and learning."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "relatedwork"
          },
          "paragraphNo": 6,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "text": "22,26",
               "type": "relatedwork"
          },
          "paragraphs": [
               "However, as the system complexity and nonlinearity increase, obtaining a reliable and accurate knowledge base (KB) for fuzzy systems used to describe the system behavior becomes difficult. In this more complex environment, hybridizing fuzzy logic systems and other intelligent models can be very promising. One of the most popular approaches is the hybridization between fuzzy logic and GAs leading to genetic fuzzy systems (GFSs). A GFS is basically a fuzzy system augmented by a learning process based on evolutionary computation, which includes genetic algorithms and other evolutionary algorithms (EAs)."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 7,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "paragraphs": [
               "In recent years, some researches are in favor of using GFS in prediction problems. They have all obtained satisfactory results and concluded that using GFSs is very promising for this area.",
               "Among artificial intelligence technologies, multiagent systems are an emerging subfield that is concerned with a society of agents interacting to solve a common problem. Wooldridge and Jennings 30 define a computer system with the following characteristics as an agent:",
               "1. Autonomy: It signifies that a computer system should have some control over its actions and should work without human intervention. 2. Social ability: It signifies that a computer system should be able to communicate with other agents and/or with human operators via some kinds of communicative languages. 3. Reactivity: It signifies that a computer system should be able to respond to its environmental changes. 4. Proactiveness: It signifies that a computer system should be able to take initiative actions based on the pre-specified goals.",
               "The communicative ability of agents makes it possible to work together and to solve complex and nonlinear problems that may not be dealt with by a single agent, this being the essence of multiagent systems."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "relatedwork"
          },
          "paragraphNo": 8,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "paragraphs": [
               "Considering the mentioned capabilities of multiagent systems and advantages of GFSs, this paper presents a four-layer FMAS architecture to develop a hybrid artificial intelligence model based on the coordination of intelligent agents performing data preprocessing and prediction tasks for next-day stock price prediction. In this work, the analysis and design of FMAS was made under Prometheus methodology through the Prometheus Design Tool. "
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "relatedwork"
          },
          "paragraphNo": 9,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "3.",
               "text": "ARCHITECTURE OF THE PROPOSED FUZZY MULTIAGENT SYSTEM",
               "type": "modelling"
          },
          "paragraphs": [
               "The architecture of FMAS consists of four layers: The first layer is dedicated to metadata creation (using expert knowledge to extract relevant data from external data sources and creating metadata). The results of the first layer (Metadata) are delivered to the second layer by the SendMD protocol. The second layer is aimed at data preprocessing (feature selection using stepwise regression analysis (SRA) and modularizing prediction problems using the self-organizing map (SOM) neural network clustering). The results of this layer (Clusters) are delivered to the third layer by the SendC protocol. The third layer is aimed at model building for each cluster using genetic fuzzy systems and evaluating built models to choose the best evolved fuzzy system for each cluster. The results of this layer (Evolved fuzzy system for each cluster) are delivered to the fourth layer by the SendEFS protocol. The fourth layer provides model analysis and knowledge presentation (sensitivity analysis of the model, prediction of stock price, and real-time generation of alternative scenarios for decision making in a what-if simulation process) by interaction with the user. The architecture of these layers is shown in ."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 10,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "3.1.",
               "text": "Goals of the System",
               "type": "modelling"
          },
          "paragraphs": [
               "The system design process starts with identification of general goals that are divided into subgoals. The final goal is knowledge presentation and creating relevant reports and is achieved as a result of three parallel goals: \"Make prediction,\" \"Model analysis,\" and \"What-if simulation.\" These three goals use parts of the same knowledge. They are based on models received as a result of \"Evolving Fuzzy Systems\" and \"Choosing best model\" goals. The \"Data preprocessing\" goal is the initial goal for model building that consists of \"Feature Selection\" and \"Data Clustering\" goals. The relation between the goals is shown in ."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 11,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "3.2.",
               "text": "Roles of System",
               "type": "modelling"
          },
          "paragraphs": [
               "Roles represent the agent's functions, responsibilities, and expectations. A role enables pooling together the goals of the system in accordance with different types of behavior that an agent assumes when archiving a goal or a series of goals. The distribution of roles for agents determines the agent's specialization and knowledge. One of the intentions for the system design was to assign one role to each agent or agent team. That requirement is met for the roles \"Data preprocessing\" where the teams of \"Data-preprocessing,\" \"SRA feature selection,\" and \"SOM-Clustering\" agents carry out these roles. Moreover, the \"Function approximation\" agent manages two roles: \"evolving fuzzy system\" and \"model evaluation.\" The agent-role coupling diagram is shown in ."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 12,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "3.3.",
               "text": "Description of the Agents",
               "type": "modelling"
          },
          "paragraphs": [
               "The agent teams coordinate and supervise task execution and utilization of resources. Agent teams synchronize the work of the system, execute plans in a concurrent mode, and strengthen the internal management by local decision making.",
               "2 There are three agent teams defined within the proposed architecture: \"Data preprocessing,\" \"Function approximation,\" and \"Knowledge presentation\" agent teams (shown in .). Details of each team agent are described in the following section. "
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 13,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "3.3.1.",
               "text": "Metadata Creation Agent",
               "type": "modelling"
          },
          "paragraphs": [
               "The Metadata creation agent must achieve the following goals:",
               "1. obtain information from the domain, 2. retrieve information from the found sources, and 3. fuse information and create metadata using experts knowledge.",
               "The most commonly used inputs for next-day stock price prediction in the literature are the stock index opening or closing price, as well as the daily highest and lowest values, supporting the statement that soft computing methods use quite simple input data to provide predictions. Considering these facts, the metadata creation agent retrieves information about stocks from resources and fuse obtained information to create metadata."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 14,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "3.3.2.",
               "text": "Data-Preprocessing Agent and Its Team",
               "type": "modelling"
          },
          "paragraphs": [
               "This agent aims to prepare the initial data for modeling. It manages a number of subordinate agents, which make up its team. Each subordinate agent specializes in different data preparation techniques such as SRA feature selection and SOMclustering agent. 3.3.2.1. SRA Feature Selection Agent. Feature selection is the process of selecting an optimum subset of input variables from the set of potentially useful variables, which may be available in a given problem. Different researchers have applied a variety of feature selection methods such as genetic algorithm, 33 principal component analysis, and stepwise regression analysis to select key factors in their prediction systems. Among them, in recent years, some researchers have used SRA for feature selection in the field of stock market prediction and they have obtained promising results. Thus, in this paper, stepwise regression is adopted to analyze and select features and as a consequence improve the prediction accuracy of the system.",
               "The stepwise regression method determines the set of independent factors that most closely determine the dependent variable. This task is carried out by means of the repetition of a variable selection. In each of these steps, a single variable is either entered or removed from the model. For each step, simple regression is performed using the previously included independent variables and one of the excluded variables. The criterion for adding or removing is determined by F -test statistic value and decreasing the sum of squared error. After the entrance of the first variable to the model, the variable number is increased step by step. Once it is removed from this model, it will never enter the model again. Before selecting the variables, the critical point, level of significance and the values of F e (F-to-enter) and F r (F -to-remove) have to be determined first. Then the partial F value of each step has to be calculated and compared to F e and F r . If F > F e , it is considered to add variables to the model; otherwise, if F < F r , the variables are removed from the model. In this paper, F e = 3.84 and F r = 2.71 are used."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 15,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "3.3.2.2.",
               "text": "SOM-Clustering Agent.",
               "type": "modelling"
          },
          "paragraphs": [
               "Clustering is a method for modularizing the problem solving by dividing the data into subpopulations and reducing the complexity of the whole data space to something more homogeneous. Clustering algorithms are classified into two groups: the hierarchical algorithms 39 such as the centroid and Ward methods and the nonhierarchical clustering, 39 such as K-means and SOM neural networks. Each of these algorithms has their own advantages and disadvantages. Depending on the application, a particular type of clustering method should be chosen. Among clustering algorithms, because of the stable and flexible architecture of SOM neural networks, it has been used in a wide range of applications. 40 made a comparison between the self-organizing map neural network clustering and the hierarchical clustering methods. A large number of data sets were used to test the performance of SOM and the hierarchical clustering methods. This research showed that SOM outperforms the hierarchical methods in clustering messy data and has better accuracy and robustness. There are also some researches in the field of prediction that have used SOM neural networks for clustering data, and they have obtained good results.",
               "22,36 Thus, in this paper, SOM neural networks are used for clustering datasets.",
               "A SOM is an unsupervised learning algorithm. This method was developed by Kohonen. The SOM network consists of M neurons arranged in a two-dimensional (2D) rectangular or hexagonal grid. Each neuron i is assigned a weight vector, w iR n (index i = (p, q) for a 2D map). At each training step t, training data x tR n are randomly drawn from the data set, which calculates the Euclidean distances between x t and all neurons. A winning neuron with a weight of w j can be found according to the minimum distance to x t :",
               "Then, the SOM adjusts the weight of the winner neuron and neighborhood neurons and moves closer to the input space according to",
               "wheret and h t ji are the learning rate and neighborhood kernel at time t, respectively. Botht and h t ji decrease monotonically with time and within 0 and 1. The neighborhood kernel h t ji is a function of time and distance between neighbor neuron i and the winning neuron. A widely applied neighborhood kernel can be written in terms of the Gaussian function,",
               "where r j and r i are the position of the winner neuron and neighborhood neuron on the map.t is kernel width and decreases with time. This process of weight updating will be performed for a specified number of iterations."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 16,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "3.3.3.",
               "text": "Function Approximation Agent and Its Team",
               "type": "modelling"
          },
          "paragraphs": [
               "This agent has a hierarchical team of subordinate agents, which serve to carry out two roles: evolving (Takagi-Sugeno-Kang) fuzzy systems for each cluster using a genetic algorithm and evaluation of fuzzy systems and setting their parameters. The function approximation agent has \"evolving fuzzy system\" and \"evaluation\" agents under its control."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 17,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "3.3.3.1.",
               "text": "Evolving Fuzzy System",
               "type": "modelling"
          },
          "paragraphs": [
               "Agent. Nowadays FRBS have been successfully applied to a wide range of real-world problems from different areas. To design an intelligent system of this kind for a concrete application, several tasks have to be performed. One of the most important and difficult ones is to derive an appropriate KB about the problem. The KB stores the available knowledge in the form of fuzzy linguistic IF-THEN rules. It is composed of the rule base (RB), constituted by a collection of rules in their symbolic forms, and the data base, which contains the linguistic term sets and the membership functions defining their meanings."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 18,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "paragraphs": [
               "GAs have been demonstrated to be a suitable tool for automating the definition of the KB, since adaptive control, learning, and self-organization may be considered in a number of cases as optimization or search processes. In particular, the application to the design, learning, and tuning of KBs has produced quite promising results. These approaches can be given the general name of genetic fuzzy systems."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "head": {
               "type": "modelling"
          },
          "paragraphNo": 19,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "43",
               "text": ".",
               "type": "modelling"
          },
          "paragraphs": [
               "The TSK-type FRBS is based on the format of fuzzy inference systems, where the final output is determined as a weighted mean of the outputs for individual rules. For a first-order TSK-type FRBS, a common rule is represented as follows:",
               "where x 1 , x 2 are linguistic variables and A 1 , A 2 are corresponding fuzzy sets and b 0 , b 1 , b 2 are linear parameters. An efficient genetic learning algorithm is used for designing a TSK-type FRBS based on a method proposed by Juang et al. This algorithm incorporates symbiotic evolution into the design of a fuzzy system and represents a single fuzzy rule by an individual (i.e., a chromosome). The final fuzzy system is then formed by combining randomly selected rules from the population, with the fitness assignment performed by symbiotic evolution. In the following, the steps of genetic learning that were used in this paper are described.",
               "Step 1: Coding fuzzy rules as chromosomes. A Gaussian membership function with variables m andrepresenting the center and width of the membership function are used, respectively, and the TSK-type fuzzy rule whose consequent part is a linear combination of the input variables plus a constant value. Coding of the i th fuzzy rule in a chromosome is shown in . to be values from {0.3k i , 0.4k i , 0.5k i , 0.6k i } that k i defines as k i = max i ? min i . Hence, the value ofji is integer coded, with its value being \"1,\" \"2,\"\"3,\" or \"4\" representing the actual normalized value of {0.3k i , 0.4k i , 0.5k i , and 0.6k i } respectively. In addition, w ij is randomly assigned in .",
               "Besides the population size, some other parameters need to be specified. These are the number of fuzzy systems to be formed and evaluated per generation, N f (N 1 fpopulation size), the number of fuzzy rules that constitute a fuzzy system, N r (N 1 r < N 1 f), and the probability of mutation, P m .",
               "Step 3: Evaluation step. The evaluation step is to evaluate each chromosome in a population. The fitness value of the kth fuzzy system is defined as follows:",
               "where",
               "where y i is the actual value and p i is the predicted value of the ith training data that was calculated by the kth fuzzy system (S 1 k) and N is the number of training data.",
               "The average fitness value obtained from the symbiotic evolution process represents",
               "Step 1. Randomly choose fuzzy rules from a population of rules, and form a fuzzy system from these rules.",
               "Step 2. Evaluate the performance of the combined fuzzy system to obtain a fitness value.",
               "Step 3. Divide the fitness value by and accumulate the divided fitness value to the fitness record of the selected rules with their fitness records set to zero initiall .",
               "Step 4. Repeat times of the above process until each rule has been selected for a sufficient number of times and record the number of fuzzy system which each individual has participated.",
               "Step 5. Divide the accumulated fitness value of each individual by the number of times it has been selected. the performance of a rule. The detailed steps for assigning the fitness value are shown in .",
               "Step 4: Reproduction. After the evaluation step, the chromosomes are sorted in the population according to decreasing fitness values. After sorting the chromosomes in the population, the top-half best-performing individuals in the population will advance to the next generation. The remaining half will be generated by performing crossover and mutation operations on individuals in the top half of the parent generation.",
               "Step 5: Genetic operators. To select the individuals for crossover, binary tournament selection is performed on the top-half best-performing individuals. The offspring are created by performing one-point crossover on the selected parents. After operation, the individuals with poor performance will be replaced by the newly produced offspring. In addition, uniform mutation will be used. Uniform mutation replaces a randomly selected gene with a value chosen from a uniform random distribution between the upper and lower domain bounds for the gene.",
               "Step 6: Stopping criteria. If the number of generations equals the maximum generation number, then stop; otherwise go to step 3."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 20,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "3.3.3.2.",
               "text": "Evaluation",
               "type": "experiment"
          },
          "paragraphs": [
               "Agent. This agent is used for evaluation of evolved fuzzy systems for each cluster received by the evolving fuzzy system agent using error comparison. Setting parameters of genetic fuzzy systems is carried out by this agent to gain minimum prediction error."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 21,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "3.3.4.",
               "text": "Knowledge Presentation Agent and Its Team",
               "type": "experiment"
          },
          "paragraphs": [
               "This agent interacts with the user and performs a set of tasks within the prediction, model analysis, what-if simulation and creating reports roles. Its subordinate agents are \"what-if simulation,\" \"prediction,\" \"model analyzer,\" and \"creating reports\" agents. Details of each agent are described in the following. "
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 22,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "3.4.",
               "text": "Overview of FMAS Architecture and Its Protocols",
               "type": "experiment"
          },
          "paragraphs": [
               "The architecture of FMAS is offered in . This view gives a sufficient understanding of the entire system design, and it provides a look on connections between agents with corresponding interactions and undertaken sets of actions. also details the \"send fuzzy system results\" interaction protocol for the prediction task.",
               "As it is observed, the interaction with the environment is carried out by the \"user\" actor (percepts are originated by an actor going to an agent, whereas actions go from an agent to an actor). Initially, the user actor sends \"Input Data P\" percept to \"Prediction\" agent, which contains the required information for predicting nextday stock prices. This agent sends the information perceived from the \"Knowledge presentation\" agent through the \"Input Data M\" message. To determine the cluster of perceived input data for prediction, the data are sent to the \"function approximation\" agent using the \"Input Data M\" message. After specifying the cluster of data (using \"Find Cluster of Data A\" action), it is sent by the function approximation agent to knowledge presentation agent using \"Cluster M\" message. The prediction of next-day stock prices is carried out by knowledge presentation agent using a fuzzy system of related clusters (\"Prediction using related FS A\" action) and is sent to the prediction agent using \"Prediction M\" message. Next, the prediction result is sent to the \"creating reports\" agent and is shown to the \"user\" by \"Show Prediction A\" action."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 23,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "4.",
               "text": "EXPERIMENTAL RESULTS",
               "type": "experiment"
          },
          "paragraphs": [
               "In this section, we implement FMAS using the daily stock price of IBM and Dell Corporation from the IT sector and British airways and Ryanair from the Airline sector collected from www.finance.yahoo.com.",
               "Four attributes: open, high, low, and close prices from the daily stock market are used to form the observation vector and to create metadata by the \"metadata creation\" agent. The target variable is the next day's closing price. Description of the variables is shown in , and details about the training and test dataset are given in . For the purpose of comparing the models, the same training and test data sets are used which have been used by Hassan and Nath, Hassan et al., and Hassan 47 as case studies."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 24,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "4.1.",
               "text": "Implementing FMAS Model for Stock Price Prediction",
               "type": "modelling"
          },
          "paragraphs": [
               "After creating metadata, the \"SRA feature selection\" agent eliminates low impact factors and chooses the most influential ones out of the mentioned factors received from the \"Data-preprocessing\" agent. The outcomes of this stage from IBM, British airways, and Ryanair are open and close prices and low and close prices for Dell Corporation. The SOM-clustering agent uses selected variables and generates different clusters for each case, where each cluster contains a portion of the training data. After examination of the different number of clusters such as 2 and 3, in our cases the suitable number of clusters (k) that provides minimum Open price The first price of a given stock in a daily trading Close price",
               "The price of the last transaction for a given stock at the end of a daily trading High price",
               "The highest price that was paid for a stock during a daily trading Low price",
               "The lowest price of a stock reached in a daily trading mean absolute percentage error (MAPE) values for the training data of IBM, British Airways, Ryanair, and Dell are obtained as 2, 3, 2, and 2 respectively. The stock price time series clustering results are shown in .",
               "The obtained clusters are sent to the function approximation agent and using the \"Evolving fuzzy system\" agent, the evolving fuzzy system for each cluster is carried out using related training data. Setting suitable parameters of fuzzy systems is carried out by the \"evaluation\" agent using error analysis. The suitable features of fuzzy systems for each cluster and each case are shown in .",
               "After evolving fuzzy systems, using the \"knowledge presentation\" agent team, the functions such as \"prediction,\" \"sensitivity analysis,\" \"what-if simulation,\" and \"creating reports\" can be carried out. For example, the results of prediction for test data are shown in .",
               "Results show that FMAS is able to cope with the fluctuations of stock market values and it also yields good prediction accuracy. The RB of IBM's related fuzzy system for cluster 1 and cluster 2 are shown in and , respectively. . Prediction results of FMAS for test data."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 25,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "4.2.",
               "text": "Performance Analysis of the Proposed Fuzzy Multiagent System",
               "type": "modelling"
          },
          "paragraphs": [
               "For the purpose of evaluating FMAS prediction accuracy, outputs of this model will be compared with other models that have been proposed for IT and airline sectors stock price prediction. This task is performed by a common evaluation  ",
               "where Y i is the actual value and P i is the predicted value of the ith test data obtained from FMAS and N is the number of test data. A summary of FMAS evaluations in comparison with the other models is shown in . To establish statistical significance, a paired t test is carried out to comparatively evaluate the prediction accuracy between the models used in this paper. To meet this purpose, the following hypotheses are proposed: H 0 : There is no difference among prediction accuracy of FMAS and other models H 1 : A difference exists among the prediction accuracy of the two models.",
               "Since data used for prediction in all models are the same, a paired t test (two samples for mean) is carried out on the prediction accuracy (MAPE) to test the hypothesis for all cases. The results of paired t tests are shown in .",
               "With regard to Table IV, FMAS has improved the prediction accuracy of stock prices in all cases. Namely, FMAS outperforms the rest of the models due to MAPE evaluation and regarding Table V our proposed model is significantly better than the other models so this shows that it can be considered as a promising alternative for stock price prediction problems."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 26,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "text": "Moreover, as Hassan",
               "type": "modelling"
          },
          "paragraphs": [
               "47 mentioned, models that have the lowest MAPE values gain much more profit. Therefore, it is expected that FMAS gains much more profit than other models."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 27,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     },
     {
          "head": {
               "n": "5.",
               "text": "CONCLUSIONS AND FUTURE WORK",
               "type": "conclusion"
          },
          "paragraphs": [
               "Considering the distributed nature of prediction problems, and autonomous subtasks such as data preprocessing and function approximation, this paper presents a four-layer FMAS architecture for next-day stock price prediction. FMAS has the following characteristics:",
               "? FMAS uses the multiagent approach as an appropriate method that can help to reduce the complexity of the prediction problem and increase prediction accuracy by creating autonomous agents, which model independent subtasks of the prediction problem.",
               "? FMAS uses SOM clustering to divide data into subpopulations and reduces the complexity of the whole data space to something more homogeneous.",
               "? GA has been demonstrated to be a suitable tool for automating the definition of the FRBS.",
               "FMAS uses a genetic learning algorithm for extracting the KB of predictor fuzzy systems.",
               "? The symbiotic evolution finds solutions in diverse populations and appears to be a faster and more efficient search scheme than the normal evolutionary approaches. FMAS uses symbiotic evolution for the fitness assignment in its 'evolving fuzzy system' agent.",
               "? Moreover, investors are capable of handling nonlinearity, complexity, as well as uncertainty that may exist in actual data sets with respect to stock market time series due to erratic responses originated from social and economic factors. FMAS will provide investors with improved prediction and decreased error in complex and uncertain environments.",
               "To evaluate the prediction accuracy of FMAS, it was applied on the stock price data of IBM and Dell Corporation from the IT sector British airways and Ryanair from the Airline sector, which had been used in different papers as the case study. Results showed that the prediction accuracy of FMAS outperforms the rest of the approaches regarding MAPE evaluation, and it is able to cope with the fluctuations of stock price values and also yields good prediction accuracy in short-term stock price prediction. Thus, FMAS can be used as a suitable prediction tool to deal with stock price prediction problems.",
               "Future research efforts will be devoted to (1) extensively evaluate the effectiveness of FMAS using other case studies from contexts involving social and economic systems and (2) focusing on combining predictor or committee methods by means of generating intelligent predictor team agents. The idea here is that a team may exhibit performances unobtainable by a single predictor agent, because the errors of the agents might cancel out when their outputs are combined."
          ],
          "paper_id": "24949ba0-97d4-11e8-9580-1f0eb29018a9",
          "paragraphNo": 28,
          "fromPaper": "A Hybrid Fuzzy Intelligent Agent-Based System for Stock Price Prediction"
     }
]